adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RESOLVED @Bit 1 : Write '1' to enable interrupt for event RESOLVED */
  #define AAR_INTENSET_RESOLVED_Pos (1UL)            /*!< Position of RESOLVED field.                                          */
  #define AAR_INTENSET_RESOLVED_Msk (0x1UL << AAR_INTENSET_RESOLVED_Pos) /*!< Bit mask of RESOLVED field.                      */
  #define AAR_INTENSET_RESOLVED_Min (0x0UL)          /*!< Min enumerator value of RESOLVED field.                              */
  #define AAR_INTENSET_RESOLVED_Max (0x1UL)          /*!< Max enumerator value of RESOLVED field.                              */
  #define AAR_INTENSET_RESOLVED_Set (0x1UL)          /*!< Enable                                                               */
  #define AAR_INTENSET_RESOLVED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define AAR_INTENSET_RESOLVED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* NOTRESOLVED @Bit 2 : Write '1' to enable interrupt for event NOTRESOLVED */
  #define AAR_INTENSET_NOTRESOLVED_Pos (2UL)         /*!< Position of NOTRESOLVED field.                                       */
  #define AAR_INTENSET_NOTRESOLVED_Msk (0x1UL << AAR_INTENSET_NOTRESOLVED_Pos) /*!< Bit mask of NOTRESOLVED field.             */
  #define AAR_INTENSET_NOTRESOLVED_Min (0x0UL)       /*!< Min enumerator value of NOTRESOLVED field.                           */
  #define AAR_INTENSET_NOTRESOLVED_Max (0x1UL)       /*!< Max enumerator value of NOTRESOLVED field.                           */
  #define AAR_INTENSET_NOTRESOLVED_Set (0x1UL)       /*!< Enable                                                               */
  #define AAR_INTENSET_NOTRESOLVED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define AAR_INTENSET_NOTRESOLVED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* AAR_INTENCLR: Disable interrupt */
  #define AAR_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* END @Bit 0 : Write '1' to disable interrupt for event END */
  #define AAR_INTENCLR_END_Pos (0UL)                 /*!< Position of END field.                                               */
  #define AAR_INTENCLR_END_Msk (0x1UL << AAR_INTENCLR_END_Pos) /*!< Bit mask of END field.                                     */
  #define AAR_INTENCLR_END_Min (0x0UL)               /*!< Min enumerator value of END field.                                   */
  #define AAR_INTENCLR_END_Max (0x1UL)               /*!< Max enumerator value of END field.                                   */
  #define AAR_INTENCLR_END_Clear (0x1UL)             /*!< Disable                                                              */
  #define AAR_INTENCLR_END_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define AAR_INTENCLR_END_Enabled (0x1UL)           /*!< Read: Enabled                                                        */

/* RESOLVED @Bit 1 : Write '1' to disable interrupt for event RESOLVED */
  #define AAR_INTENCLR_RESOLVED_Pos (1UL)            /*!< Position of RESOLVED field.                                          */
  #define AAR_INTENCLR_RESOLVED_Msk (0x1UL << AAR_INTENCLR_RESOLVED_Pos) /*!< Bit mask of RESOLVED field.                      */
  #define AAR_INTENCLR_RESOLVED_Min (0x0UL)          /*!< Min enumerator value of RESOLVED field.                              */
  #define AAR_INTENCLR_RESOLVED_Max (0x1UL)          /*!< Max enumerator value of RESOLVED field.                              */
  #define AAR_INTENCLR_RESOLVED_Clear (0x1UL)        /*!< Disable                                                              */
  #define AAR_INTENCLR_RESOLVED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define AAR_INTENCLR_RESOLVED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* NOTRESOLVED @Bit 2 : Write '1' to disable interrupt for event NOTRESOLVED */
  #define AAR_INTENCLR_NOTRESOLVED_Pos (2UL)         /*!< Position of NOTRESOLVED field.                                       */
  #define AAR_INTENCLR_NOTRESOLVED_Msk (0x1UL << AAR_INTENCLR_NOTRESOLVED_Pos) /*!< Bit mask of NOTRESOLVED field.             */
  #define AAR_INTENCLR_NOTRESOLVED_Min (0x0UL)       /*!< Min enumerator value of NOTRESOLVED field.                           */
  #define AAR_INTENCLR_NOTRESOLVED_Max (0x1UL)       /*!< Max enumerator value of NOTRESOLVED field.                           */
  #define AAR_INTENCLR_NOTRESOLVED_Clear (0x1UL)     /*!< Disable                                                              */
  #define AAR_INTENCLR_NOTRESOLVED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define AAR_INTENCLR_NOTRESOLVED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* AAR_ENABLE: Enable AAR */
  #define AAR_ENABLE_ResetValue (0x00000000UL)       /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bits 0..1 : Enable or disable AAR */
  #define AAR_ENABLE_ENABLE_Pos (0UL)                /*!< Position of ENABLE field.                                            */
  #define AAR_ENABLE_ENABLE_Msk (0x3UL << AAR_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                                */
  #define AAR_ENABLE_ENABLE_Min (0x0UL)              /*!< Min enumerator value of ENABLE field.                                */
  #define AAR_ENABLE_ENABLE_Max (0x3UL)              /*!< Max enumerator value of ENABLE field.                                */
  #define AAR_ENABLE_ENABLE_Disabled (0x0UL)         /*!< Disable                                                              */
  #define AAR_ENABLE_ENABLE_Enabled (0x3UL)          /*!< Enable                                                               */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            ABB                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct ABB_CONFIG ==================================================== */
/**
  * @brief CONFIG [ABB_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CTRL1;                             /*!< (@ 0x00000000) ABB control 1                                         */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  CTRL4;                             /*!< (@ 0x0000000C) ABB control 4                                         */
  __IOM uint32_t  VENDORCONFIG0;                     /*!< (@ 0x00000010) Vendor config 0                                       */
  __IOM uint32_t  VENDORCONFIG1;                     /*!< (@ 0x00000014) Vendor config 1                                       */
} NRF_ABB_CONFIG_Type;                               /*!< Size = 24 (0x018)                                                    */

