adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ABB_CONFIG_CTRL1: ABB control 1 */
  #define ABB_CONFIG_CTRL1_ResetValue (0x00809003UL) /*!< Reset value of CTRL1 register.                                       */

/* MODE @Bits 0..1 : ABB operation mode */
  #define ABB_CONFIG_CTRL1_MODE_Pos (0UL)            /*!< Position of MODE field.                                              */
  #define ABB_CONFIG_CTRL1_MODE_Msk (0x3UL << ABB_CONFIG_CTRL1_MODE_Pos) /*!< Bit mask of MODE field.                          */
  #define ABB_CONFIG_CTRL1_MODE_Min (0x0UL)          /*!< Min enumerator value of MODE field.                                  */
  #define ABB_CONFIG_CTRL1_MODE_Max (0x3UL)          /*!< Max enumerator value of MODE field.                                  */
  #define ABB_CONFIG_CTRL1_MODE_Auto (0x0UL)         /*!< Auto                                                                 */
  #define ABB_CONFIG_CTRL1_MODE_SinglePVTmonitor (0x1UL) /*!< Single PVT monitor readout (for test)                            */
  #define ABB_CONFIG_CTRL1_MODE_OpenLoop (0x2UL)     /*!< Open loop PWM charge pump drive (for test)                           */
  #define ABB_CONFIG_CTRL1_MODE_ZBB (0x3UL)          /*!< Zero bias charge pump mode. VNW and VPW tied to VSS                  */

/* TESTMODE @Bits 2..3 : Test mode */
  #define ABB_CONFIG_CTRL1_TESTMODE_Pos (2UL)        /*!< Position of TESTMODE field.                                          */
  #define ABB_CONFIG_CTRL1_TESTMODE_Msk (0x3UL << ABB_CONFIG_CTRL1_TESTMODE_Pos) /*!< Bit mask of TESTMODE field.              */
  #define ABB_CONFIG_CTRL1_TESTMODE_Min (0x0UL)      /*!< Min enumerator value of TESTMODE field.                              */
  #define ABB_CONFIG_CTRL1_TESTMODE_Max (0x2UL)      /*!< Max enumerator value of TESTMODE field.                              */
  #define ABB_CONFIG_CTRL1_TESTMODE_Normal (0x0UL)   /*!< Normal operation                                                     */
  #define ABB_CONFIG_CTRL1_TESTMODE_TestPvtMon (0x1UL) /*!< PVT monitor test, Testclock switched to internal ripple counter    */
  #define ABB_CONFIG_CTRL1_TESTMODE_CounterBist (0x2UL) /*!< Ripple counter bist mode                                          */

/* STATUSOUTSEL @Bits 4..5 : Status output select */
  #define ABB_CONFIG_CTRL1_STATUSOUTSEL_Pos (4UL)    /*!< Position of STATUSOUTSEL field.                                      */
  #define ABB_CONFIG_CTRL1_STATUSOUTSEL_Msk (0x3UL << ABB_CONFIG_CTRL1_STATUSOUTSEL_Pos) /*!< Bit mask of STATUSOUTSEL field.  */
  #define ABB_CONFIG_CTRL1_STATUSOUTSEL_Min (0x0UL)  /*!< Min enumerator value of STATUSOUTSEL field.                          */
  #define ABB_CONFIG_CTRL1_STATUSOUTSEL_Max (0x3UL)  /*!< Max enumerator value of STATUSOUTSEL field.                          */
  #define ABB_CONFIG_CTRL1_STATUSOUTSEL_Ringo (0x0UL) /*!< Ringo count value and calibration done flag                         */
  #define ABB_CONFIG_CTRL1_STATUSOUTSEL_Locked (0x1UL) /*!< Locked status information, preliminary feature debugging only      */
  #define ABB_CONFIG_CTRL1_STATUSOUTSEL_Filter (0x2UL) /*!< Filter status information, preliminary feature debugging only      */
  #define ABB_CONFIG_CTRL1_STATUSOUTSEL_Ring (0x3UL) /*!< Ring oscillator information, preliminary feature debugging only      */

/* CHARGEPUMPSELEN @Bits 8..9 : Additional charge pump slices and thereby define the drive strength of the body bias charge pump
                                */                                                                                                
                                                                                                                                  
  #define ABB_CONFIG_CTRL1_CHARGEPUMPSELEN_Pos (8UL) /*!< Position of CHARGEPUMPSELEN field.                                   */
  #define ABB_CONFIG_CTRL1_CHARGEPUMPSELEN_Msk (0x3UL << ABB_CONFIG_CTRL1_CHARGEPUMPSELEN_Pos) /*!< Bit mask of CHARGEPUMPSELEN
                                                                            field.*/                                              
  #define ABB_CONFIG_CTRL1_CHARGEPUMPSELEN_Min (0x0UL) /*!< Min enumerator value of CHARGEPUMPSELEN field.                     */
  #define ABB_CONFIG_CTRL1_CHARGEPUMPSELEN_Max (0x3UL) /*!< Max enumerator value of CHARGEPUMPSELEN field.                     */
  #define ABB_CONFIG_CTRL1_CHARGEPUMPSELEN_NoSlice (0x0UL) /*!< No addition slice enabled                                      */
  #define ABB_CONFIG_CTRL1_CHARGEPUMPSELEN_SecondSlice (0x1UL) /*!< Second slice enabled                                       */
  #define ABB_CONFIG_CTRL1_CHARGEPUMPSELEN_ThirdSlice (0x2UL) /*!< Third slice anabled                                         */
  #define ABB_CONFIG_CTRL1_CHARGEPUMPSELEN_BothSlices (0x3UL) /*!< Second and third slice enabled                              */

/* CHARGEPUMPSELLOCK @Bits 10..11 : Charge pump stages enabled during lock-in */
  #define ABB_CONFIG_CTRL1_CHARGEPUMPSELLOCK_Pos (10UL) /*!< Position of CHARGEPUMPSELLOCK field.                              */
  #define ABB_CONFIG_CTRL1_CHARGEPUMPSELLOCK_Msk (0x3UL << ABB_CONFIG_CTRL1_CHARGEPUMPSELLOCK_Pos) /*!< Bit mask of
                                                                            CHARGEPUMPSELLOCK field.*/                            
  #define ABB_CONFIG_CTRL1_CHARGEPUMPSELLOCK_Min (0x0UL) /*!< Min enumerator value of CHARGEPUMPSELLOCK field.                 */
  #define ABB_CONFIG_CTRL1_CHARGEPUMPSELLOCK_Max (0x3UL) /*!< Max enumerator value of CHARGEPUMPSELLOCK field.                 */
  #define ABB_CONFIG_CTRL1_CHARGEPUMPSELLOCK_NoSlice (0x0UL) /*!< No addition slice enabled                                    */
  #define ABB_CONFIG_CTRL1_CHARGEPUMPSELLOCK_SecondSlice (0x1UL) /*!< Second slice enabled                                     */
  #define ABB_CONFIG_CTRL1_CHARGEPUMPSELLOCK_ThirdSlice (0x2UL) /*!< Third slice anabled                                       */
  #define ABB_CONFIG_CTRL1_CHARGEPUMPSELLOCK_BothSlices (0x3UL) /*!< Second and third slice enabled                            */

/* TIMERCONFIGVAL @Bits 16..31 : Timer value that defines the length of one closed loop control cycle. */
  #define ABB_CONFIG_CTRL1_TIMERCONFIGVAL_Pos (16UL) /*!< Position of TIMERCONFIGVAL field.                                    */
  #define ABB_CONFIG_CTRL1_TIMERCONFIGVAL_Msk (0xFFFFUL << ABB_CONFIG_CTRL1_TIMERCONFIGVAL_Pos) /*!< Bit mask of TIMERCONFIGVAL
                                                                            field.*/                                              


