adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* OPPOINT @Bits 0..2 : The ABB operating point. */
  #define ABB_MODE_OPPOINT_Pos (0UL)                 /*!< Position of OPPOINT field.                                           */
  #define ABB_MODE_OPPOINT_Msk (0x7UL << ABB_MODE_OPPOINT_Pos) /*!< Bit mask of OPPOINT field.                                 */
  #define ABB_MODE_OPPOINT_Min (0x0UL)               /*!< Min enumerator value of OPPOINT field.                               */
  #define ABB_MODE_OPPOINT_Max (0x4UL)               /*!< Max enumerator value of OPPOINT field.                               */
  #define ABB_MODE_OPPOINT_Auto (0x0UL)              /*!< The peripheral controls the operating point automatically based on
                                                          request from the master ABB controller.*/                               
  #define ABB_MODE_OPPOINT_OpPoint0V4 (0x1UL)        /*!< Force the operating point to 0.4V                                    */
  #define ABB_MODE_OPPOINT_OpPoint0V5 (0x2UL)        /*!< Force the operating point to 0.5V                                    */
  #define ABB_MODE_OPPOINT_OpPoint0V6 (0x3UL)        /*!< Force the operating point to 0.6V                                    */
  #define ABB_MODE_OPPOINT_OpPoint0V8 (0x4UL)        /*!< Force the operating point to 0.8V                                    */

/* ABBEN @Bits 4..5 : Enable ABB. */
  #define ABB_MODE_ABBEN_Pos (4UL)                   /*!< Position of ABBEN field.                                             */
  #define ABB_MODE_ABBEN_Msk (0x3UL << ABB_MODE_ABBEN_Pos) /*!< Bit mask of ABBEN field.                                       */
  #define ABB_MODE_ABBEN_Min (0x0UL)                 /*!< Min enumerator value of ABBEN field.                                 */
  #define ABB_MODE_ABBEN_Max (0x2UL)                 /*!< Max enumerator value of ABBEN field.                                 */
  #define ABB_MODE_ABBEN_Auto (0x0UL)                /*!< The peripheral controls the ABB enable automatically based on
                                                          request.*/                                                              
  #define ABB_MODE_ABBEN_Enable (0x1UL)              /*!< Force enable ABB                                                     */
  #define ABB_MODE_ABBEN_Disable (0x2UL)             /*!< Force disable ABB                                                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          ANTSWC                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct ANTSWC_ERRORSTATUS ================================================ */
/**
  * @brief ERRORSTATUS [ANTSWC_ERRORSTATUS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TX;                                /*!< (@ 0x00000000) Concurrent TX error condition                         */
  __IOM uint32_t  TXRX;                              /*!< (@ 0x00000004) Concurrent TX-RX error condition                      */
  __IOM uint32_t  ERRORPORT;                         /*!< (@ 0x00000008) Indicates which ports are in error                    */
} NRF_ANTSWC_ERRORSTATUS_Type;                       /*!< Size = 12 (0x00C)                                                    */

/* ANTSWC_ERRORSTATUS_TX: Concurrent TX error condition */
  #define ANTSWC_ERRORSTATUS_TX_ResetValue (0x00000000UL) /*!< Reset value of TX register.                                     */

/* COUNT @Bits 0..3 : Count of concurrent TX error conditions detected */
  #define ANTSWC_ERRORSTATUS_TX_COUNT_Pos (0UL)      /*!< Position of COUNT field.                                             */
  #define ANTSWC_ERRORSTATUS_TX_COUNT_Msk (0xFUL << ANTSWC_ERRORSTATUS_TX_COUNT_Pos) /*!< Bit mask of COUNT field.             */

/* ERRORACTIVE @Bit 31 : Concurrent TX error condition is active */
  #define ANTSWC_ERRORSTATUS_TX_ERRORACTIVE_Pos (31UL) /*!< Position of ERRORACTIVE field.                                     */
  #define ANTSWC_ERRORSTATUS_TX_ERRORACTIVE_Msk (0x1UL << ANTSWC_ERRORSTATUS_TX_ERRORACTIVE_Pos) /*!< Bit mask of ERRORACTIVE
                                                                            field.*/                                              


/* ANTSWC_ERRORSTATUS_TXRX: Concurrent TX-RX error condition */
  #define ANTSWC_ERRORSTATUS_TXRX_ResetValue (0x00000000UL) /*!< Reset value of TXRX register.                                 */

/* COUNT @Bits 0..3 : Count of concurrent TX-RX error conditions detected */
  #define ANTSWC_ERRORSTATUS_TXRX_COUNT_Pos (0UL)    /*!< Position of COUNT field.                                             */
  #define ANTSWC_ERRORSTATUS_TXRX_COUNT_Msk (0xFUL << ANTSWC_ERRORSTATUS_TXRX_COUNT_Pos) /*!< Bit mask of COUNT field.         */

/* ERRORACTIVE @Bit 31 : Concurrent TX-RX error condition is active */
  #define ANTSWC_ERRORSTATUS_TXRX_ERRORACTIVE_Pos (31UL) /*!< Position of ERRORACTIVE field.                                   */
  #define ANTSWC_ERRORSTATUS_TXRX_ERRORACTIVE_Msk (0x1UL << ANTSWC_ERRORSTATUS_TXRX_ERRORACTIVE_Pos) /*!< Bit mask of
                                                                            ERRORACTIVE field.*/                                  


/* ANTSWC_ERRORSTATUS_ERRORPORT: Indicates which ports are in error */
  #define ANTSWC_ERRORSTATUS_ERRORPORT_ResetValue (0x00000000UL) /*!< Reset value of ERRORPORT register.                       */

/* ERRORPORT @Bits 0..7 : Bitfield indicating the ports in error during the last error condition. */
  #define ANTSWC_ERRORSTATUS_ERRORPORT_ERRORPORT_Pos (0UL) /*!< Position of ERRORPORT field.                                   */
  #define ANTSWC_ERRORSTATUS_ERRORPORT_ERRORPORT_Msk (0xFFUL << ANTSWC_ERRORSTATUS_ERRORPORT_ERRORPORT_Pos) /*!< Bit mask of
                                                                            ERRORPORT field.*/                                    



/* ================================================= Struct ANTSWC_OVERRIDE ================================================== */
/**
  * @brief OVERRIDE [ANTSWC_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ANTEN;                             /*!< (@ 0x00000000) Override antenna switch (AntEn) output signals        */
  __IOM uint32_t  PAEN;                              /*!< (@ 0x00000004) Override power amplifier enable (PaEn) output signals */
  __IOM uint32_t  LNASW;                             /*!< (@ 0x00000008) Override shared LNA switch (LnaSw) output signals     */
} NRF_ANTSWC_OVERRIDE_Type;                          /*!< Size = 12 (0x00C)                                                    */

/* ANTSWC_OVERRIDE_ANTEN: Override antenna switch (AntEn) output signals */
  #define ANTSWC_OVERRIDE_ANTEN_ResetValue (0x00000000UL) /*!< Reset value of ANTEN register.                                  */

/* VAL0 @Bit 0 : Override value for AntEn[i]. Note only one bit should be set. Where multiple bits are set the AntSw signal
                 value is set to 0 */                                                                                             
                                                                                                                                  
