adamkondraciuk/nrfx/mdk/nrf7140_types.h
  #define ANTSWC_OVERRIDE_ANTEN_VAL0_Pos (0UL)       /*!< Position of VAL0 field.                                              */
  #define ANTSWC_OVERRIDE_ANTEN_VAL0_Msk (0x1UL << ANTSWC_OVERRIDE_ANTEN_VAL0_Pos) /*!< Bit mask of VAL0 field.                */
  #define ANTSWC_OVERRIDE_ANTEN_VAL0_Min (0x0UL)     /*!< Min enumerator value of VAL0 field.                                  */
  #define ANTSWC_OVERRIDE_ANTEN_VAL0_Max (0x1UL)     /*!< Max enumerator value of VAL0 field.                                  */
  #define ANTSWC_OVERRIDE_ANTEN_VAL0_Clear (0x0UL)   /*!< Clear the corresponding bit in AntEn                                 */
  #define ANTSWC_OVERRIDE_ANTEN_VAL0_Set (0x1UL)     /*!< Assert the corresponding bit in AntEn                                */

/* VAL1 @Bit 1 : Override value for AntEn[i]. Note only one bit should be set. Where multiple bits are set the AntSw signal
                 value is set to 0 */                                                                                             
                                                                                                                                  
  #define ANTSWC_OVERRIDE_ANTEN_VAL1_Pos (1UL)       /*!< Position of VAL1 field.                                              */
  #define ANTSWC_OVERRIDE_ANTEN_VAL1_Msk (0x1UL << ANTSWC_OVERRIDE_ANTEN_VAL1_Pos) /*!< Bit mask of VAL1 field.                */
  #define ANTSWC_OVERRIDE_ANTEN_VAL1_Min (0x0UL)     /*!< Min enumerator value of VAL1 field.                                  */
  #define ANTSWC_OVERRIDE_ANTEN_VAL1_Max (0x1UL)     /*!< Max enumerator value of VAL1 field.                                  */
  #define ANTSWC_OVERRIDE_ANTEN_VAL1_Clear (0x0UL)   /*!< Clear the corresponding bit in AntEn                                 */
  #define ANTSWC_OVERRIDE_ANTEN_VAL1_Set (0x1UL)     /*!< Assert the corresponding bit in AntEn                                */

/* VAL2 @Bit 2 : Override value for AntEn[i]. Note only one bit should be set. Where multiple bits are set the AntSw signal
                 value is set to 0 */                                                                                             
                                                                                                                                  
  #define ANTSWC_OVERRIDE_ANTEN_VAL2_Pos (2UL)       /*!< Position of VAL2 field.                                              */
  #define ANTSWC_OVERRIDE_ANTEN_VAL2_Msk (0x1UL << ANTSWC_OVERRIDE_ANTEN_VAL2_Pos) /*!< Bit mask of VAL2 field.                */
  #define ANTSWC_OVERRIDE_ANTEN_VAL2_Min (0x0UL)     /*!< Min enumerator value of VAL2 field.                                  */
  #define ANTSWC_OVERRIDE_ANTEN_VAL2_Max (0x1UL)     /*!< Max enumerator value of VAL2 field.                                  */
  #define ANTSWC_OVERRIDE_ANTEN_VAL2_Clear (0x0UL)   /*!< Clear the corresponding bit in AntEn                                 */
  #define ANTSWC_OVERRIDE_ANTEN_VAL2_Set (0x1UL)     /*!< Assert the corresponding bit in AntEn                                */

/* VAL3 @Bit 3 : Override value for AntEn[i]. Note only one bit should be set. Where multiple bits are set the AntSw signal
                 value is set to 0 */                                                                                             
                                                                                                                                  
  #define ANTSWC_OVERRIDE_ANTEN_VAL3_Pos (3UL)       /*!< Position of VAL3 field.                                              */
  #define ANTSWC_OVERRIDE_ANTEN_VAL3_Msk (0x1UL << ANTSWC_OVERRIDE_ANTEN_VAL3_Pos) /*!< Bit mask of VAL3 field.                */
  #define ANTSWC_OVERRIDE_ANTEN_VAL3_Min (0x0UL)     /*!< Min enumerator value of VAL3 field.                                  */
  #define ANTSWC_OVERRIDE_ANTEN_VAL3_Max (0x1UL)     /*!< Max enumerator value of VAL3 field.                                  */
  #define ANTSWC_OVERRIDE_ANTEN_VAL3_Clear (0x0UL)   /*!< Clear the corresponding bit in AntEn                                 */
  #define ANTSWC_OVERRIDE_ANTEN_VAL3_Set (0x1UL)     /*!< Assert the corresponding bit in AntEn                                */

/* VAL4 @Bit 4 : Override value for AntEn[i]. Note only one bit should be set. Where multiple bits are set the AntSw signal
                 value is set to 0 */                                                                                             
                                                                                                                                  
  #define ANTSWC_OVERRIDE_ANTEN_VAL4_Pos (4UL)       /*!< Position of VAL4 field.                                              */
  #define ANTSWC_OVERRIDE_ANTEN_VAL4_Msk (0x1UL << ANTSWC_OVERRIDE_ANTEN_VAL4_Pos) /*!< Bit mask of VAL4 field.                */
  #define ANTSWC_OVERRIDE_ANTEN_VAL4_Min (0x0UL)     /*!< Min enumerator value of VAL4 field.                                  */
  #define ANTSWC_OVERRIDE_ANTEN_VAL4_Max (0x1UL)     /*!< Max enumerator value of VAL4 field.                                  */
  #define ANTSWC_OVERRIDE_ANTEN_VAL4_Clear (0x0UL)   /*!< Clear the corresponding bit in AntEn                                 */
  #define ANTSWC_OVERRIDE_ANTEN_VAL4_Set (0x1UL)     /*!< Assert the corresponding bit in AntEn                                */

/* VAL5 @Bit 5 : Override value for AntEn[i]. Note only one bit should be set. Where multiple bits are set the AntSw signal
                 value is set to 0 */                                                                                             
                                                                                                                                  
  #define ANTSWC_OVERRIDE_ANTEN_VAL5_Pos (5UL)       /*!< Position of VAL5 field.                                              */
  #define ANTSWC_OVERRIDE_ANTEN_VAL5_Msk (0x1UL << ANTSWC_OVERRIDE_ANTEN_VAL5_Pos) /*!< Bit mask of VAL5 field.                */
  #define ANTSWC_OVERRIDE_ANTEN_VAL5_Min (0x0UL)     /*!< Min enumerator value of VAL5 field.                                  */
  #define ANTSWC_OVERRIDE_ANTEN_VAL5_Max (0x1UL)     /*!< Max enumerator value of VAL5 field.                                  */
  #define ANTSWC_OVERRIDE_ANTEN_VAL5_Clear (0x0UL)   /*!< Clear the corresponding bit in AntEn                                 */
  #define ANTSWC_OVERRIDE_ANTEN_VAL5_Set (0x1UL)     /*!< Assert the corresponding bit in AntEn                                */

/* VAL6 @Bit 6 : Override value for AntEn[i]. Note only one bit should be set. Where multiple bits are set the AntSw signal
                 value is set to 0 */                                                                                             
                                                                                                                                  
  #define ANTSWC_OVERRIDE_ANTEN_VAL6_Pos (6UL)       /*!< Position of VAL6 field.                                              */
  #define ANTSWC_OVERRIDE_ANTEN_VAL6_Msk (0x1UL << ANTSWC_OVERRIDE_ANTEN_VAL6_Pos) /*!< Bit mask of VAL6 field.                */
  #define ANTSWC_OVERRIDE_ANTEN_VAL6_Min (0x0UL)     /*!< Min enumerator value of VAL6 field.                                  */
  #define ANTSWC_OVERRIDE_ANTEN_VAL6_Max (0x1UL)     /*!< Max enumerator value of VAL6 field.                                  */
  #define ANTSWC_OVERRIDE_ANTEN_VAL6_Clear (0x0UL)   /*!< Clear the corresponding bit in AntEn                                 */
  #define ANTSWC_OVERRIDE_ANTEN_VAL6_Set (0x1UL)     /*!< Assert the corresponding bit in AntEn                                */

/* VAL7 @Bit 7 : Override value for AntEn[i]. Note only one bit should be set. Where multiple bits are set the AntSw signal
                 value is set to 0 */                                                                                             
                                                                                                                                  
