adamkondraciuk/nrfx/mdk/nrf7140_types.h
  #define ANTSWC_OVERRIDE_ANTEN_VAL7_Pos (7UL)       /*!< Position of VAL7 field.                                              */
  #define ANTSWC_OVERRIDE_ANTEN_VAL7_Msk (0x1UL << ANTSWC_OVERRIDE_ANTEN_VAL7_Pos) /*!< Bit mask of VAL7 field.                */
  #define ANTSWC_OVERRIDE_ANTEN_VAL7_Min (0x0UL)     /*!< Min enumerator value of VAL7 field.                                  */
  #define ANTSWC_OVERRIDE_ANTEN_VAL7_Max (0x1UL)     /*!< Max enumerator value of VAL7 field.                                  */
  #define ANTSWC_OVERRIDE_ANTEN_VAL7_Clear (0x0UL)   /*!< Clear the corresponding bit in AntEn                                 */
  #define ANTSWC_OVERRIDE_ANTEN_VAL7_Set (0x1UL)     /*!< Assert the corresponding bit in AntEn                                */

/* EN @Bit 31 : (unspecified) */
  #define ANTSWC_OVERRIDE_ANTEN_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define ANTSWC_OVERRIDE_ANTEN_EN_Msk (0x1UL << ANTSWC_OVERRIDE_ANTEN_EN_Pos) /*!< Bit mask of EN field.                      */
  #define ANTSWC_OVERRIDE_ANTEN_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define ANTSWC_OVERRIDE_ANTEN_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define ANTSWC_OVERRIDE_ANTEN_EN_Disable (0x0UL)   /*!< Override is disabled                                                 */
  #define ANTSWC_OVERRIDE_ANTEN_EN_Enable (0x1UL)    /*!< Override is enabled                                                  */


/* ANTSWC_OVERRIDE_PAEN: Override power amplifier enable (PaEn) output signals */
  #define ANTSWC_OVERRIDE_PAEN_ResetValue (0x00000000UL) /*!< Reset value of PAEN register.                                    */

/* VAL0 @Bit 0 : Override value for the signal PAEn[i] */
  #define ANTSWC_OVERRIDE_PAEN_VAL0_Pos (0UL)        /*!< Position of VAL0 field.                                              */
  #define ANTSWC_OVERRIDE_PAEN_VAL0_Msk (0x1UL << ANTSWC_OVERRIDE_PAEN_VAL0_Pos) /*!< Bit mask of VAL0 field.                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL0_Min (0x0UL)      /*!< Min enumerator value of VAL0 field.                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL0_Max (0x1UL)      /*!< Max enumerator value of VAL0 field.                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL0_Clear (0x0UL)    /*!< Clear the corresponding bit in PAEn                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL0_Set (0x1UL)      /*!< Assert the corresponding bit in PAEn                                 */

/* VAL1 @Bit 1 : Override value for the signal PAEn[i] */
  #define ANTSWC_OVERRIDE_PAEN_VAL1_Pos (1UL)        /*!< Position of VAL1 field.                                              */
  #define ANTSWC_OVERRIDE_PAEN_VAL1_Msk (0x1UL << ANTSWC_OVERRIDE_PAEN_VAL1_Pos) /*!< Bit mask of VAL1 field.                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL1_Min (0x0UL)      /*!< Min enumerator value of VAL1 field.                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL1_Max (0x1UL)      /*!< Max enumerator value of VAL1 field.                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL1_Clear (0x0UL)    /*!< Clear the corresponding bit in PAEn                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL1_Set (0x1UL)      /*!< Assert the corresponding bit in PAEn                                 */

/* VAL2 @Bit 2 : Override value for the signal PAEn[i] */
  #define ANTSWC_OVERRIDE_PAEN_VAL2_Pos (2UL)        /*!< Position of VAL2 field.                                              */
  #define ANTSWC_OVERRIDE_PAEN_VAL2_Msk (0x1UL << ANTSWC_OVERRIDE_PAEN_VAL2_Pos) /*!< Bit mask of VAL2 field.                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL2_Min (0x0UL)      /*!< Min enumerator value of VAL2 field.                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL2_Max (0x1UL)      /*!< Max enumerator value of VAL2 field.                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL2_Clear (0x0UL)    /*!< Clear the corresponding bit in PAEn                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL2_Set (0x1UL)      /*!< Assert the corresponding bit in PAEn                                 */

/* VAL3 @Bit 3 : Override value for the signal PAEn[i] */
  #define ANTSWC_OVERRIDE_PAEN_VAL3_Pos (3UL)        /*!< Position of VAL3 field.                                              */
  #define ANTSWC_OVERRIDE_PAEN_VAL3_Msk (0x1UL << ANTSWC_OVERRIDE_PAEN_VAL3_Pos) /*!< Bit mask of VAL3 field.                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL3_Min (0x0UL)      /*!< Min enumerator value of VAL3 field.                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL3_Max (0x1UL)      /*!< Max enumerator value of VAL3 field.                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL3_Clear (0x0UL)    /*!< Clear the corresponding bit in PAEn                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL3_Set (0x1UL)      /*!< Assert the corresponding bit in PAEn                                 */

/* VAL4 @Bit 4 : Override value for the signal PAEn[i] */
  #define ANTSWC_OVERRIDE_PAEN_VAL4_Pos (4UL)        /*!< Position of VAL4 field.                                              */
  #define ANTSWC_OVERRIDE_PAEN_VAL4_Msk (0x1UL << ANTSWC_OVERRIDE_PAEN_VAL4_Pos) /*!< Bit mask of VAL4 field.                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL4_Min (0x0UL)      /*!< Min enumerator value of VAL4 field.                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL4_Max (0x1UL)      /*!< Max enumerator value of VAL4 field.                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL4_Clear (0x0UL)    /*!< Clear the corresponding bit in PAEn                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL4_Set (0x1UL)      /*!< Assert the corresponding bit in PAEn                                 */

/* VAL5 @Bit 5 : Override value for the signal PAEn[i] */
  #define ANTSWC_OVERRIDE_PAEN_VAL5_Pos (5UL)        /*!< Position of VAL5 field.                                              */
  #define ANTSWC_OVERRIDE_PAEN_VAL5_Msk (0x1UL << ANTSWC_OVERRIDE_PAEN_VAL5_Pos) /*!< Bit mask of VAL5 field.                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL5_Min (0x0UL)      /*!< Min enumerator value of VAL5 field.                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL5_Max (0x1UL)      /*!< Max enumerator value of VAL5 field.                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL5_Clear (0x0UL)    /*!< Clear the corresponding bit in PAEn                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL5_Set (0x1UL)      /*!< Assert the corresponding bit in PAEn                                 */

/* VAL6 @Bit 6 : Override value for the signal PAEn[i] */
  #define ANTSWC_OVERRIDE_PAEN_VAL6_Pos (6UL)        /*!< Position of VAL6 field.                                              */
  #define ANTSWC_OVERRIDE_PAEN_VAL6_Msk (0x1UL << ANTSWC_OVERRIDE_PAEN_VAL6_Pos) /*!< Bit mask of VAL6 field.                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL6_Min (0x0UL)      /*!< Min enumerator value of VAL6 field.                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL6_Max (0x1UL)      /*!< Max enumerator value of VAL6 field.                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL6_Clear (0x0UL)    /*!< Clear the corresponding bit in PAEn                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL6_Set (0x1UL)      /*!< Assert the corresponding bit in PAEn                                 */

/* VAL7 @Bit 7 : Override value for the signal PAEn[i] */
  #define ANTSWC_OVERRIDE_PAEN_VAL7_Pos (7UL)        /*!< Position of VAL7 field.                                              */
  #define ANTSWC_OVERRIDE_PAEN_VAL7_Msk (0x1UL << ANTSWC_OVERRIDE_PAEN_VAL7_Pos) /*!< Bit mask of VAL7 field.                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL7_Min (0x0UL)      /*!< Min enumerator value of VAL7 field.                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL7_Max (0x1UL)      /*!< Max enumerator value of VAL7 field.                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL7_Clear (0x0UL)    /*!< Clear the corresponding bit in PAEn                                  */
  #define ANTSWC_OVERRIDE_PAEN_VAL7_Set (0x1UL)      /*!< Assert the corresponding bit in PAEn                                 */

/* EN @Bit 31 : (unspecified) */
  #define ANTSWC_OVERRIDE_PAEN_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define ANTSWC_OVERRIDE_PAEN_EN_Msk (0x1UL << ANTSWC_OVERRIDE_PAEN_EN_Pos) /*!< Bit mask of EN field.                        */
  #define ANTSWC_OVERRIDE_PAEN_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define ANTSWC_OVERRIDE_PAEN_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define ANTSWC_OVERRIDE_PAEN_EN_Disable (0x0UL)    /*!< Override is disabled                                                 */
  #define ANTSWC_OVERRIDE_PAEN_EN_Enable (0x1UL)     /*!< Override is enabled                                                  */


/* ANTSWC_OVERRIDE_LNASW: Override shared LNA switch (LnaSw) output signals */
  #define ANTSWC_OVERRIDE_LNASW_ResetValue (0x00000000UL) /*!< Reset value of LNASW register.                                  */

/* VAL0 @Bit 0 : Override value for the signal LnaSw[i] */
  #define ANTSWC_OVERRIDE_LNASW_VAL0_Pos (0UL)       /*!< Position of VAL0 field.                                              */
  #define ANTSWC_OVERRIDE_LNASW_VAL0_Msk (0x1UL << ANTSWC_OVERRIDE_LNASW_VAL0_Pos) /*!< Bit mask of VAL0 field.                */
  #define ANTSWC_OVERRIDE_LNASW_VAL0_Min (0x0UL)     /*!< Min enumerator value of VAL0 field.                                  */
  #define ANTSWC_OVERRIDE_LNASW_VAL0_Max (0x1UL)     /*!< Max enumerator value of VAL0 field.                                  */
  #define ANTSWC_OVERRIDE_LNASW_VAL0_Clear (0x0UL)   /*!< Clear the corresponding bit in LnaSw                                 */
  #define ANTSWC_OVERRIDE_LNASW_VAL0_Set (0x1UL)     /*!< Assert the corresponding bit in LnaSw                                */

/* VAL1 @Bit 1 : Override value for the signal LnaSw[i] */
  #define ANTSWC_OVERRIDE_LNASW_VAL1_Pos (1UL)       /*!< Position of VAL1 field.                                              */
  #define ANTSWC_OVERRIDE_LNASW_VAL1_Msk (0x1UL << ANTSWC_OVERRIDE_LNASW_VAL1_Pos) /*!< Bit mask of VAL1 field.                */
  #define ANTSWC_OVERRIDE_LNASW_VAL1_Min (0x0UL)     /*!< Min enumerator value of VAL1 field.                                  */
  #define ANTSWC_OVERRIDE_LNASW_VAL1_Max (0x1UL)     /*!< Max enumerator value of VAL1 field.                                  */
  #define ANTSWC_OVERRIDE_LNASW_VAL1_Clear (0x0UL)   /*!< Clear the corresponding bit in LnaSw                                 */
  #define ANTSWC_OVERRIDE_LNASW_VAL1_Set (0x1UL)     /*!< Assert the corresponding bit in LnaSw                                */

