adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VAL2 @Bit 2 : Override value for the signal LnaSw[i] */
  #define ANTSWC_OVERRIDE_LNASW_VAL2_Pos (2UL)       /*!< Position of VAL2 field.                                              */
  #define ANTSWC_OVERRIDE_LNASW_VAL2_Msk (0x1UL << ANTSWC_OVERRIDE_LNASW_VAL2_Pos) /*!< Bit mask of VAL2 field.                */
  #define ANTSWC_OVERRIDE_LNASW_VAL2_Min (0x0UL)     /*!< Min enumerator value of VAL2 field.                                  */
  #define ANTSWC_OVERRIDE_LNASW_VAL2_Max (0x1UL)     /*!< Max enumerator value of VAL2 field.                                  */
  #define ANTSWC_OVERRIDE_LNASW_VAL2_Clear (0x0UL)   /*!< Clear the corresponding bit in LnaSw                                 */
  #define ANTSWC_OVERRIDE_LNASW_VAL2_Set (0x1UL)     /*!< Assert the corresponding bit in LnaSw                                */

/* VAL3 @Bit 3 : Override value for the signal LnaSw[i] */
  #define ANTSWC_OVERRIDE_LNASW_VAL3_Pos (3UL)       /*!< Position of VAL3 field.                                              */
  #define ANTSWC_OVERRIDE_LNASW_VAL3_Msk (0x1UL << ANTSWC_OVERRIDE_LNASW_VAL3_Pos) /*!< Bit mask of VAL3 field.                */
  #define ANTSWC_OVERRIDE_LNASW_VAL3_Min (0x0UL)     /*!< Min enumerator value of VAL3 field.                                  */
  #define ANTSWC_OVERRIDE_LNASW_VAL3_Max (0x1UL)     /*!< Max enumerator value of VAL3 field.                                  */
  #define ANTSWC_OVERRIDE_LNASW_VAL3_Clear (0x0UL)   /*!< Clear the corresponding bit in LnaSw                                 */
  #define ANTSWC_OVERRIDE_LNASW_VAL3_Set (0x1UL)     /*!< Assert the corresponding bit in LnaSw                                */

/* VAL4 @Bit 4 : Override value for the signal LnaSw[i] */
  #define ANTSWC_OVERRIDE_LNASW_VAL4_Pos (4UL)       /*!< Position of VAL4 field.                                              */
  #define ANTSWC_OVERRIDE_LNASW_VAL4_Msk (0x1UL << ANTSWC_OVERRIDE_LNASW_VAL4_Pos) /*!< Bit mask of VAL4 field.                */
  #define ANTSWC_OVERRIDE_LNASW_VAL4_Min (0x0UL)     /*!< Min enumerator value of VAL4 field.                                  */
  #define ANTSWC_OVERRIDE_LNASW_VAL4_Max (0x1UL)     /*!< Max enumerator value of VAL4 field.                                  */
  #define ANTSWC_OVERRIDE_LNASW_VAL4_Clear (0x0UL)   /*!< Clear the corresponding bit in LnaSw                                 */
  #define ANTSWC_OVERRIDE_LNASW_VAL4_Set (0x1UL)     /*!< Assert the corresponding bit in LnaSw                                */

/* VAL5 @Bit 5 : Override value for the signal LnaSw[i] */
  #define ANTSWC_OVERRIDE_LNASW_VAL5_Pos (5UL)       /*!< Position of VAL5 field.                                              */
  #define ANTSWC_OVERRIDE_LNASW_VAL5_Msk (0x1UL << ANTSWC_OVERRIDE_LNASW_VAL5_Pos) /*!< Bit mask of VAL5 field.                */
  #define ANTSWC_OVERRIDE_LNASW_VAL5_Min (0x0UL)     /*!< Min enumerator value of VAL5 field.                                  */
  #define ANTSWC_OVERRIDE_LNASW_VAL5_Max (0x1UL)     /*!< Max enumerator value of VAL5 field.                                  */
  #define ANTSWC_OVERRIDE_LNASW_VAL5_Clear (0x0UL)   /*!< Clear the corresponding bit in LnaSw                                 */
  #define ANTSWC_OVERRIDE_LNASW_VAL5_Set (0x1UL)     /*!< Assert the corresponding bit in LnaSw                                */

/* VAL6 @Bit 6 : Override value for the signal LnaSw[i] */
  #define ANTSWC_OVERRIDE_LNASW_VAL6_Pos (6UL)       /*!< Position of VAL6 field.                                              */
  #define ANTSWC_OVERRIDE_LNASW_VAL6_Msk (0x1UL << ANTSWC_OVERRIDE_LNASW_VAL6_Pos) /*!< Bit mask of VAL6 field.                */
  #define ANTSWC_OVERRIDE_LNASW_VAL6_Min (0x0UL)     /*!< Min enumerator value of VAL6 field.                                  */
  #define ANTSWC_OVERRIDE_LNASW_VAL6_Max (0x1UL)     /*!< Max enumerator value of VAL6 field.                                  */
  #define ANTSWC_OVERRIDE_LNASW_VAL6_Clear (0x0UL)   /*!< Clear the corresponding bit in LnaSw                                 */
  #define ANTSWC_OVERRIDE_LNASW_VAL6_Set (0x1UL)     /*!< Assert the corresponding bit in LnaSw                                */

/* VAL7 @Bit 7 : Override value for the signal LnaSw[i] */
  #define ANTSWC_OVERRIDE_LNASW_VAL7_Pos (7UL)       /*!< Position of VAL7 field.                                              */
  #define ANTSWC_OVERRIDE_LNASW_VAL7_Msk (0x1UL << ANTSWC_OVERRIDE_LNASW_VAL7_Pos) /*!< Bit mask of VAL7 field.                */
  #define ANTSWC_OVERRIDE_LNASW_VAL7_Min (0x0UL)     /*!< Min enumerator value of VAL7 field.                                  */
  #define ANTSWC_OVERRIDE_LNASW_VAL7_Max (0x1UL)     /*!< Max enumerator value of VAL7 field.                                  */
  #define ANTSWC_OVERRIDE_LNASW_VAL7_Clear (0x0UL)   /*!< Clear the corresponding bit in LnaSw                                 */
  #define ANTSWC_OVERRIDE_LNASW_VAL7_Set (0x1UL)     /*!< Assert the corresponding bit in LnaSw                                */

/* EN @Bit 31 : (unspecified) */
  #define ANTSWC_OVERRIDE_LNASW_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define ANTSWC_OVERRIDE_LNASW_EN_Msk (0x1UL << ANTSWC_OVERRIDE_LNASW_EN_Pos) /*!< Bit mask of EN field.                      */
  #define ANTSWC_OVERRIDE_LNASW_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define ANTSWC_OVERRIDE_LNASW_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define ANTSWC_OVERRIDE_LNASW_EN_Disable (0x0UL)   /*!< Override is disabled                                                 */
  #define ANTSWC_OVERRIDE_LNASW_EN_Enable (0x1UL)    /*!< Override is enabled                                                  */



/* ================================================= Struct ANTSWC_PCGCSLAVE ================================================= */
/**
  * @brief PCGCSLAVE [ANTSWC_PCGCSLAVE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PENALTY[2];                        /*!< (@ 0x00000000) Penalty level for power/clock pair n                  */
  __IM  uint32_t  RESERVED[30];
  __IOM uint32_t  FORCEOVERRIDE[2];                  /*!< (@ 0x00000080) Force override of power/clock pair n                  */
} NRF_ANTSWC_PCGCSLAVE_Type;                         /*!< Size = 136 (0x088)                                                   */

