adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ANTSWC_PCGCSLAVE_PENALTY: Penalty level for power/clock pair n */
  #define ANTSWC_PCGCSLAVE_PENALTY_MaxCount (2UL)    /*!< Max size of PENALTY[2] array.                                        */
  #define ANTSWC_PCGCSLAVE_PENALTY_ResetValue (0x00000000UL) /*!< Reset value of PENALTY[2] register.                          */

/* PENALTY @Bits 0..7 : Penalty level */
  #define ANTSWC_PCGCSLAVE_PENALTY_PENALTY_Pos (0UL) /*!< Position of PENALTY field.                                           */
  #define ANTSWC_PCGCSLAVE_PENALTY_PENALTY_Msk (0xFFUL << ANTSWC_PCGCSLAVE_PENALTY_PENALTY_Pos) /*!< Bit mask of PENALTY field.*/


/* ANTSWC_PCGCSLAVE_FORCEOVERRIDE: Force override of power/clock pair n */
  #define ANTSWC_PCGCSLAVE_FORCEOVERRIDE_MaxCount (2UL) /*!< Max size of FORCEOVERRIDE[2] array.                               */
  #define ANTSWC_PCGCSLAVE_FORCEOVERRIDE_ResetValue (0x00000000UL) /*!< Reset value of FORCEOVERRIDE[2] register.              */

/* CLOCKFORCINGPRE @Bits 0..3 : CLOCKFORCINGPRE */
  #define ANTSWC_PCGCSLAVE_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos (0UL) /*!< Position of CLOCKFORCINGPRE field.                     */
  #define ANTSWC_PCGCSLAVE_FORCEOVERRIDE_CLOCKFORCINGPRE_Msk (0xFUL << ANTSWC_PCGCSLAVE_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos) /*!<
                                                                            Bit mask of CLOCKFORCINGPRE field.*/                  

/* DOFORCECLOCKPRE @Bit 7 : DOFORCECLOCKPRE */
  #define ANTSWC_PCGCSLAVE_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos (7UL) /*!< Position of DOFORCECLOCKPRE field.                     */
  #define ANTSWC_PCGCSLAVE_FORCEOVERRIDE_DOFORCECLOCKPRE_Msk (0x1UL << ANTSWC_PCGCSLAVE_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos) /*!<
                                                                            Bit mask of DOFORCECLOCKPRE field.*/                  

/* POWERFORCINGPRE @Bits 8..9 : POWERFORCINGPRE */
  #define ANTSWC_PCGCSLAVE_FORCEOVERRIDE_POWERFORCINGPRE_Pos (8UL) /*!< Position of POWERFORCINGPRE field.                     */
  #define ANTSWC_PCGCSLAVE_FORCEOVERRIDE_POWERFORCINGPRE_Msk (0x3UL << ANTSWC_PCGCSLAVE_FORCEOVERRIDE_POWERFORCINGPRE_Pos) /*!<
                                                                            Bit mask of POWERFORCINGPRE field.*/                  

/* DOFORCEPOWERPRE @Bit 15 : DOFORCEPOWERPRE */
  #define ANTSWC_PCGCSLAVE_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos (15UL) /*!< Position of DOFORCEPOWERPRE field.                    */
  #define ANTSWC_PCGCSLAVE_FORCEOVERRIDE_DOFORCEPOWERPRE_Msk (0x1UL << ANTSWC_PCGCSLAVE_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos) /*!<
                                                                            Bit mask of DOFORCEPOWERPRE field.*/                  


/* ====================================================== Struct ANTSWC ====================================================== */
/**
  * @brief Antenna switch controller
  */
  typedef struct {                                   /*!< ANTSWC Structure                                                     */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_TXERROR;                   /*!< (@ 0x00000100) Event indicating that a concurrent TX error condition
                                                                         has occurred*/                                           
    __IOM uint32_t EVENTS_TXRXERROR;                 /*!< (@ 0x00000104) Event indicating that a concurrent TX-RX error
                                                                         condition has occurred*/                                 
    __IOM uint32_t EVENTS_ANTSWCHANGED;              /*!< (@ 0x00000108) Event indicating that the AntSw signal has changed    */
    __IOM uint32_t EVENTS_LNASWCHANGED;              /*!< (@ 0x0000010C) Event indicating that the LnaSw signal has changed    */
    __IM uint32_t RESERVED1[28];
    __IOM uint32_t PUBLISH_TXERROR;                  /*!< (@ 0x00000180) Publish configuration for event TXERROR               */
    __IOM uint32_t PUBLISH_TXRXERROR;                /*!< (@ 0x00000184) Publish configuration for event TXRXERROR             */
    __IOM uint32_t PUBLISH_ANTSWCHANGED;             /*!< (@ 0x00000188) Publish configuration for event ANTSWCHANGED          */
    __IOM uint32_t PUBLISH_LNASWCHANGED;             /*!< (@ 0x0000018C) Publish configuration for event LNASWCHANGED          */
    __IM uint32_t RESERVED2[156];
    __IOM NRF_ANTSWC_ERRORSTATUS_Type ERRORSTATUS;   /*!< (@ 0x00000400) (unspecified)                                         */
    __IM uint32_t RESERVED3;
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000410) Antenna switch controller enable / software reset     */
    __IOM uint32_t INHIBIT;                          /*!< (@ 0x00000414) Inhibit register                                      */
    __IM uint32_t RESERVED4[58];
    __IOM NRF_ANTSWC_OVERRIDE_Type OVERRIDE;         /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED5[637];
    __IOM NRF_ANTSWC_PCGCSLAVE_Type PCGCSLAVE;       /*!< (@ 0x00000F00) (unspecified)                                         */
  } NRF_ANTSWC_Type;                                 /*!< Size = 3976 (0xF88)                                                  */

/* ANTSWC_EVENTS_TXERROR: Event indicating that a concurrent TX error condition has occurred */
  #define ANTSWC_EVENTS_TXERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXERROR register.                         */

/* EVENTS_TXERROR @Bit 0 : Event indicating that a concurrent TX error condition has occurred */
  #define ANTSWC_EVENTS_TXERROR_EVENTS_TXERROR_Pos (0UL) /*!< Position of EVENTS_TXERROR field.                                */
  #define ANTSWC_EVENTS_TXERROR_EVENTS_TXERROR_Msk (0x1UL << ANTSWC_EVENTS_TXERROR_EVENTS_TXERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_TXERROR field.*/                               
  #define ANTSWC_EVENTS_TXERROR_EVENTS_TXERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXERROR field.                  */
  #define ANTSWC_EVENTS_TXERROR_EVENTS_TXERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXERROR field.                  */
  #define ANTSWC_EVENTS_TXERROR_EVENTS_TXERROR_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define ANTSWC_EVENTS_TXERROR_EVENTS_TXERROR_Generated (0x1UL) /*!< Event generated                                          */


/* ANTSWC_EVENTS_TXRXERROR: Event indicating that a concurrent TX-RX error condition has occurred */
  #define ANTSWC_EVENTS_TXRXERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXRXERROR register.                     */

/* EVENTS_TXRXERROR @Bit 0 : Event indicating that a concurrent TX-RX error condition has occurred */
  #define ANTSWC_EVENTS_TXRXERROR_EVENTS_TXRXERROR_Pos (0UL) /*!< Position of EVENTS_TXRXERROR field.                          */
  #define ANTSWC_EVENTS_TXRXERROR_EVENTS_TXRXERROR_Msk (0x1UL << ANTSWC_EVENTS_TXRXERROR_EVENTS_TXRXERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_TXRXERROR field.*/                             
  #define ANTSWC_EVENTS_TXRXERROR_EVENTS_TXRXERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXRXERROR field.            */
  #define ANTSWC_EVENTS_TXRXERROR_EVENTS_TXRXERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXRXERROR field.            */
  #define ANTSWC_EVENTS_TXRXERROR_EVENTS_TXRXERROR_NotGenerated (0x0UL) /*!< Event not generated                               */
  #define ANTSWC_EVENTS_TXRXERROR_EVENTS_TXRXERROR_Generated (0x1UL) /*!< Event generated                                      */


/* ANTSWC_EVENTS_ANTSWCHANGED: Event indicating that the AntSw signal has changed */
  #define ANTSWC_EVENTS_ANTSWCHANGED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ANTSWCHANGED register.               */

/* EVENTS_ANTSWCHANGED @Bit 0 : Event indicating that the AntSw signal has changed */
  #define ANTSWC_EVENTS_ANTSWCHANGED_EVENTS_ANTSWCHANGED_Pos (0UL) /*!< Position of EVENTS_ANTSWCHANGED field.                 */
  #define ANTSWC_EVENTS_ANTSWCHANGED_EVENTS_ANTSWCHANGED_Msk (0x1UL << ANTSWC_EVENTS_ANTSWCHANGED_EVENTS_ANTSWCHANGED_Pos) /*!<
                                                                            Bit mask of EVENTS_ANTSWCHANGED field.*/              
  #define ANTSWC_EVENTS_ANTSWCHANGED_EVENTS_ANTSWCHANGED_Min (0x0UL) /*!< Min enumerator value of EVENTS_ANTSWCHANGED field.   */
  #define ANTSWC_EVENTS_ANTSWCHANGED_EVENTS_ANTSWCHANGED_Max (0x1UL) /*!< Max enumerator value of EVENTS_ANTSWCHANGED field.   */
  #define ANTSWC_EVENTS_ANTSWCHANGED_EVENTS_ANTSWCHANGED_NotGenerated (0x0UL) /*!< Event not generated                         */
  #define ANTSWC_EVENTS_ANTSWCHANGED_EVENTS_ANTSWCHANGED_Generated (0x1UL) /*!< Event generated                                */


/* ANTSWC_EVENTS_LNASWCHANGED: Event indicating that the LnaSw signal has changed */
  #define ANTSWC_EVENTS_LNASWCHANGED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_LNASWCHANGED register.               */

/* EVENTS_LNASWCHANGED @Bit 0 : Event indicating that the LnaSw signal has changed */
  #define ANTSWC_EVENTS_LNASWCHANGED_EVENTS_LNASWCHANGED_Pos (0UL) /*!< Position of EVENTS_LNASWCHANGED field.                 */
  #define ANTSWC_EVENTS_LNASWCHANGED_EVENTS_LNASWCHANGED_Msk (0x1UL << ANTSWC_EVENTS_LNASWCHANGED_EVENTS_LNASWCHANGED_Pos) /*!<
                                                                            Bit mask of EVENTS_LNASWCHANGED field.*/              
  #define ANTSWC_EVENTS_LNASWCHANGED_EVENTS_LNASWCHANGED_Min (0x0UL) /*!< Min enumerator value of EVENTS_LNASWCHANGED field.   */
  #define ANTSWC_EVENTS_LNASWCHANGED_EVENTS_LNASWCHANGED_Max (0x1UL) /*!< Max enumerator value of EVENTS_LNASWCHANGED field.   */
  #define ANTSWC_EVENTS_LNASWCHANGED_EVENTS_LNASWCHANGED_NotGenerated (0x0UL) /*!< Event not generated                         */
  #define ANTSWC_EVENTS_LNASWCHANGED_EVENTS_LNASWCHANGED_Generated (0x1UL) /*!< Event generated                                */


/* ANTSWC_PUBLISH_TXERROR: Publish configuration for event TXERROR */
  #define ANTSWC_PUBLISH_TXERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXERROR register.                       */

/* CHIDX @Bits 0..7 : DPPI channel that event TXERROR will publish to */
  #define ANTSWC_PUBLISH_TXERROR_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define ANTSWC_PUBLISH_TXERROR_CHIDX_Msk (0xFFUL << ANTSWC_PUBLISH_TXERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define ANTSWC_PUBLISH_TXERROR_CHIDX_Min (0x0UL)   /*!< Min value of CHIDX field.                                            */
  #define ANTSWC_PUBLISH_TXERROR_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define ANTSWC_PUBLISH_TXERROR_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define ANTSWC_PUBLISH_TXERROR_EN_Msk (0x1UL << ANTSWC_PUBLISH_TXERROR_EN_Pos) /*!< Bit mask of EN field.                    */
  #define ANTSWC_PUBLISH_TXERROR_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define ANTSWC_PUBLISH_TXERROR_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define ANTSWC_PUBLISH_TXERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define ANTSWC_PUBLISH_TXERROR_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


