adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ANTSWC_PUBLISH_TXRXERROR: Publish configuration for event TXRXERROR */
  #define ANTSWC_PUBLISH_TXRXERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXRXERROR register.                   */

/* CHIDX @Bits 0..7 : DPPI channel that event TXRXERROR will publish to */
  #define ANTSWC_PUBLISH_TXRXERROR_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define ANTSWC_PUBLISH_TXRXERROR_CHIDX_Msk (0xFFUL << ANTSWC_PUBLISH_TXRXERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define ANTSWC_PUBLISH_TXRXERROR_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                            */
  #define ANTSWC_PUBLISH_TXRXERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define ANTSWC_PUBLISH_TXRXERROR_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define ANTSWC_PUBLISH_TXRXERROR_EN_Msk (0x1UL << ANTSWC_PUBLISH_TXRXERROR_EN_Pos) /*!< Bit mask of EN field.                */
  #define ANTSWC_PUBLISH_TXRXERROR_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define ANTSWC_PUBLISH_TXRXERROR_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define ANTSWC_PUBLISH_TXRXERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define ANTSWC_PUBLISH_TXRXERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* ANTSWC_PUBLISH_ANTSWCHANGED: Publish configuration for event ANTSWCHANGED */
  #define ANTSWC_PUBLISH_ANTSWCHANGED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ANTSWCHANGED register.             */

/* CHIDX @Bits 0..7 : DPPI channel that event ANTSWCHANGED will publish to */
  #define ANTSWC_PUBLISH_ANTSWCHANGED_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define ANTSWC_PUBLISH_ANTSWCHANGED_CHIDX_Msk (0xFFUL << ANTSWC_PUBLISH_ANTSWCHANGED_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define ANTSWC_PUBLISH_ANTSWCHANGED_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                         */
  #define ANTSWC_PUBLISH_ANTSWCHANGED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define ANTSWC_PUBLISH_ANTSWCHANGED_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define ANTSWC_PUBLISH_ANTSWCHANGED_EN_Msk (0x1UL << ANTSWC_PUBLISH_ANTSWCHANGED_EN_Pos) /*!< Bit mask of EN field.          */
  #define ANTSWC_PUBLISH_ANTSWCHANGED_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define ANTSWC_PUBLISH_ANTSWCHANGED_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define ANTSWC_PUBLISH_ANTSWCHANGED_EN_Disabled (0x0UL) /*!< Disable publishing                                              */
  #define ANTSWC_PUBLISH_ANTSWCHANGED_EN_Enabled (0x1UL) /*!< Enable publishing                                                */


/* ANTSWC_PUBLISH_LNASWCHANGED: Publish configuration for event LNASWCHANGED */
  #define ANTSWC_PUBLISH_LNASWCHANGED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_LNASWCHANGED register.             */

/* CHIDX @Bits 0..7 : DPPI channel that event LNASWCHANGED will publish to */
  #define ANTSWC_PUBLISH_LNASWCHANGED_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define ANTSWC_PUBLISH_LNASWCHANGED_CHIDX_Msk (0xFFUL << ANTSWC_PUBLISH_LNASWCHANGED_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define ANTSWC_PUBLISH_LNASWCHANGED_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                         */
  #define ANTSWC_PUBLISH_LNASWCHANGED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define ANTSWC_PUBLISH_LNASWCHANGED_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define ANTSWC_PUBLISH_LNASWCHANGED_EN_Msk (0x1UL << ANTSWC_PUBLISH_LNASWCHANGED_EN_Pos) /*!< Bit mask of EN field.          */
  #define ANTSWC_PUBLISH_LNASWCHANGED_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define ANTSWC_PUBLISH_LNASWCHANGED_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define ANTSWC_PUBLISH_LNASWCHANGED_EN_Disabled (0x0UL) /*!< Disable publishing                                              */
  #define ANTSWC_PUBLISH_LNASWCHANGED_EN_Enabled (0x1UL) /*!< Enable publishing                                                */


/* ANTSWC_CONFIG: Antenna switch controller enable / software reset */
  #define ANTSWC_CONFIG_ResetValue (0x00000000UL)    /*!< Reset value of CONFIG register.                                      */

/* ENABLEPKTACTIVE0 @Bit 0 : Bitfield indicating whether ANTSWC listens to PktActive on radio port i. */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE0_Pos (0UL)   /*!< Position of ENABLEPKTACTIVE0 field.                                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE0_Msk (0x1UL << ANTSWC_CONFIG_ENABLEPKTACTIVE0_Pos) /*!< Bit mask of ENABLEPKTACTIVE0
                                                                            field.*/                                              
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE0_Min (0x0UL) /*!< Min enumerator value of ENABLEPKTACTIVE0 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE0_Max (0x1UL) /*!< Max enumerator value of ENABLEPKTACTIVE0 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE0_Ignore (0x0UL) /*!< Ignore PktActive on the corresponding radio port                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE0_Respect (0x1UL) /*!< Use PktActive on the corresponding radio port for antenna switch
                                                              selection*/                                                         

/* ENABLEPKTACTIVE1 @Bit 1 : Bitfield indicating whether ANTSWC listens to PktActive on radio port i. */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE1_Pos (1UL)   /*!< Position of ENABLEPKTACTIVE1 field.                                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE1_Msk (0x1UL << ANTSWC_CONFIG_ENABLEPKTACTIVE1_Pos) /*!< Bit mask of ENABLEPKTACTIVE1
                                                                            field.*/                                              
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE1_Min (0x0UL) /*!< Min enumerator value of ENABLEPKTACTIVE1 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE1_Max (0x1UL) /*!< Max enumerator value of ENABLEPKTACTIVE1 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE1_Ignore (0x0UL) /*!< Ignore PktActive on the corresponding radio port                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE1_Respect (0x1UL) /*!< Use PktActive on the corresponding radio port for antenna switch
                                                              selection*/                                                         

/* ENABLEPKTACTIVE2 @Bit 2 : Bitfield indicating whether ANTSWC listens to PktActive on radio port i. */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE2_Pos (2UL)   /*!< Position of ENABLEPKTACTIVE2 field.                                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE2_Msk (0x1UL << ANTSWC_CONFIG_ENABLEPKTACTIVE2_Pos) /*!< Bit mask of ENABLEPKTACTIVE2
                                                                            field.*/                                              
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE2_Min (0x0UL) /*!< Min enumerator value of ENABLEPKTACTIVE2 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE2_Max (0x1UL) /*!< Max enumerator value of ENABLEPKTACTIVE2 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE2_Ignore (0x0UL) /*!< Ignore PktActive on the corresponding radio port                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE2_Respect (0x1UL) /*!< Use PktActive on the corresponding radio port for antenna switch
                                                              selection*/                                                         

/* ENABLEPKTACTIVE3 @Bit 3 : Bitfield indicating whether ANTSWC listens to PktActive on radio port i. */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE3_Pos (3UL)   /*!< Position of ENABLEPKTACTIVE3 field.                                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE3_Msk (0x1UL << ANTSWC_CONFIG_ENABLEPKTACTIVE3_Pos) /*!< Bit mask of ENABLEPKTACTIVE3
                                                                            field.*/                                              
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE3_Min (0x0UL) /*!< Min enumerator value of ENABLEPKTACTIVE3 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE3_Max (0x1UL) /*!< Max enumerator value of ENABLEPKTACTIVE3 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE3_Ignore (0x0UL) /*!< Ignore PktActive on the corresponding radio port                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE3_Respect (0x1UL) /*!< Use PktActive on the corresponding radio port for antenna switch
                                                              selection*/                                                         

/* ENABLEPKTACTIVE4 @Bit 4 : Bitfield indicating whether ANTSWC listens to PktActive on radio port i. */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE4_Pos (4UL)   /*!< Position of ENABLEPKTACTIVE4 field.                                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE4_Msk (0x1UL << ANTSWC_CONFIG_ENABLEPKTACTIVE4_Pos) /*!< Bit mask of ENABLEPKTACTIVE4
                                                                            field.*/                                              
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE4_Min (0x0UL) /*!< Min enumerator value of ENABLEPKTACTIVE4 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE4_Max (0x1UL) /*!< Max enumerator value of ENABLEPKTACTIVE4 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE4_Ignore (0x0UL) /*!< Ignore PktActive on the corresponding radio port                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE4_Respect (0x1UL) /*!< Use PktActive on the corresponding radio port for antenna switch
                                                              selection*/                                                         

