adamkondraciuk/nrfx/mdk/nrf7140_types.h
  #define ANTSWC_INHIBIT_INHIBIT4_Pos (4UL)          /*!< Position of INHIBIT4 field.                                          */
  #define ANTSWC_INHIBIT_INHIBIT4_Msk (0x1UL << ANTSWC_INHIBIT_INHIBIT4_Pos) /*!< Bit mask of INHIBIT4 field.                  */
  #define ANTSWC_INHIBIT_INHIBIT4_Min (0x0UL)        /*!< Min enumerator value of INHIBIT4 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT4_Max (0x1UL)        /*!< Max enumerator value of INHIBIT4 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT4_Inhibit (0x0UL)    /*!< Inhibit connection of antenna to the corresponding radio             */
  #define ANTSWC_INHIBIT_INHIBIT4_Enable (0x1UL)     /*!< Enable antenna to be connected to the corresponding radio            */

/* INHIBIT5 @Bit 5 : Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is
                     enabled or inhibited. */                                                                                     
                                                                                                                                  
  #define ANTSWC_INHIBIT_INHIBIT5_Pos (5UL)          /*!< Position of INHIBIT5 field.                                          */
  #define ANTSWC_INHIBIT_INHIBIT5_Msk (0x1UL << ANTSWC_INHIBIT_INHIBIT5_Pos) /*!< Bit mask of INHIBIT5 field.                  */
  #define ANTSWC_INHIBIT_INHIBIT5_Min (0x0UL)        /*!< Min enumerator value of INHIBIT5 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT5_Max (0x1UL)        /*!< Max enumerator value of INHIBIT5 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT5_Inhibit (0x0UL)    /*!< Inhibit connection of antenna to the corresponding radio             */
  #define ANTSWC_INHIBIT_INHIBIT5_Enable (0x1UL)     /*!< Enable antenna to be connected to the corresponding radio            */

/* INHIBIT6 @Bit 6 : Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is
                     enabled or inhibited. */                                                                                     
                                                                                                                                  
  #define ANTSWC_INHIBIT_INHIBIT6_Pos (6UL)          /*!< Position of INHIBIT6 field.                                          */
  #define ANTSWC_INHIBIT_INHIBIT6_Msk (0x1UL << ANTSWC_INHIBIT_INHIBIT6_Pos) /*!< Bit mask of INHIBIT6 field.                  */
  #define ANTSWC_INHIBIT_INHIBIT6_Min (0x0UL)        /*!< Min enumerator value of INHIBIT6 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT6_Max (0x1UL)        /*!< Max enumerator value of INHIBIT6 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT6_Inhibit (0x0UL)    /*!< Inhibit connection of antenna to the corresponding radio             */
  #define ANTSWC_INHIBIT_INHIBIT6_Enable (0x1UL)     /*!< Enable antenna to be connected to the corresponding radio            */

/* INHIBIT7 @Bit 7 : Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is
                     enabled or inhibited. */                                                                                     
                                                                                                                                  
  #define ANTSWC_INHIBIT_INHIBIT7_Pos (7UL)          /*!< Position of INHIBIT7 field.                                          */
  #define ANTSWC_INHIBIT_INHIBIT7_Msk (0x1UL << ANTSWC_INHIBIT_INHIBIT7_Pos) /*!< Bit mask of INHIBIT7 field.                  */
  #define ANTSWC_INHIBIT_INHIBIT7_Min (0x0UL)        /*!< Min enumerator value of INHIBIT7 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT7_Max (0x1UL)        /*!< Max enumerator value of INHIBIT7 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT7_Inhibit (0x0UL)    /*!< Inhibit connection of antenna to the corresponding radio             */
  #define ANTSWC_INHIBIT_INHIBIT7_Enable (0x1UL)     /*!< Enable antenna to be connected to the corresponding radio            */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         ATBFUNNEL                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ==================================================== Struct ATBFUNNEL ===================================================== */
/**
  * @brief ATB funnel module
  */
  typedef struct {                                   /*!< ATBFUNNEL Structure                                                  */
    __IOM uint32_t CTRLREG;                          /*!< (@ 0x00000000) The IDFILTER0 register enables the programming of ID
                                                                         filtering for master port 0.*/                           
    __IOM uint32_t PRIORITYCTRLREG;                  /*!< (@ 0x00000004) The Priority_Ctrl_Reg register defines the order in
                                                                         which inputs are selected. Each 3-bit field is a
                                                                         priority for each particular slave interface.*/          
    __IM uint32_t RESERVED[953];
    __IOM uint32_t ITATBDATA0;                       /*!< (@ 0x00000EEC) The ITATBDATA0 register performs different functions
                                                                         depending on whether the access is a read or a write.*/  
    __IOM uint32_t ITATBCTR2;                        /*!< (@ 0x00000EF0) The ITATBCTR2 register performs different functions
                                                                         depending on whether the access is a read or a write.*/  
    __IOM uint32_t ITATBCTR1;                        /*!< (@ 0x00000EF4) The ITATBCTR1 register performs different functions
                                                                         depending on whether the access is a read or a write.*/  
    __IOM uint32_t ITATBCTR0;                        /*!< (@ 0x00000EF8) The ITATBCTR0 register performs different functions
                                                                         depending on whether the access is a read or a write.*/  
    __IM uint32_t RESERVED1;
    __IOM uint32_t ITCTRL;                           /*!< (@ 0x00000F00) The ITCTRL register enables the component to switch
                                                                         from a functional mode, which is the default behavior,
                                                                         to integration mode where the inputs and outputs of the
                                                                         component can be directly controlled for the purposes
                                                                         of integration testing and topology detection.*/         
    __IM uint32_t RESERVED2[39];
    __IOM uint32_t CLAIMSET;                         /*!< (@ 0x00000FA0) Software can use the claim tag to coordinate
                                                                         application and debugger access to trace unit
                                                                         functionality. The claim tags have no effect on the
                                                                         operation of the component. The CLAIMSET register sets
                                                                         bits in the claim tag, and determines the number of
                                                                         claim bits implemented.*/                                
    __IOM uint32_t CLAIMCLR;                         /*!< (@ 0x00000FA4) Software can use the claim tag to coordinate
                                                                         application and debugger access to trace unit
                                                                         functionality. The claim tags have no effect on the
                                                                         operation of the component. The CLAIMCLR register sets
                                                                         the bits in the claim tag to 0 and determines the
                                                                         current value of the claim tag.*/                        
    __IM uint32_t RESERVED3[2];
    __IOM uint32_t LAR;                              /*!< (@ 0x00000FB0) This is used to enable write access to device
                                                                         registers.*/                                             
    __IOM uint32_t LSR;                              /*!< (@ 0x00000FB4) This indicates the status of the lock control
                                                                         mechanism. This lock prevents accidental writes by code
                                                                         under debug. Accesses to the extended stimulus port
                                                                         registers are not affected by the lock mechanism. This
                                                                         register must always be present although there might
                                                                         not be any lock access control mechanism. The lock
                                                                         mechanism, where present and locked, must block write
                                                                         accesses to any control register, except the Lock
                                                                         Access Register. For most components this covers all
                                                                         registers except for the Lock Access Register.*/         
    __IOM uint32_t AUTHSTATUS;                       /*!< (@ 0x00000FB8) Indicates the current level of tracing permitted by the
                                                                         system*/                                                 
    __IM uint32_t RESERVED4[3];
    __IM uint32_t DEVID;                             /*!< (@ 0x00000FC8) Indicates the capabilities of the component.          */
    __IM uint32_t DEVTYPE;                           /*!< (@ 0x00000FCC) The DEVTYPE register provides a debugger with
                                                                         information about the component when the Part Number
                                                                         field is not recognized. The debugger can then report
                                                                         this information.*/                                      
    __IOM uint32_t PIDR4;                            /*!< (@ 0x00000FD0) Coresight peripheral identification registers.        */
    __IM uint32_t RESERVED5[3];
    __IOM uint32_t PIDR0;                            /*!< (@ 0x00000FE0) Coresight peripheral identification registers.        */
    __IOM uint32_t PIDR1;                            /*!< (@ 0x00000FE4) Coresight peripheral identification registers.        */
    __IOM uint32_t PIDR2;                            /*!< (@ 0x00000FE8) Coresight peripheral identification registers.        */
    __IOM uint32_t PIDR3;                            /*!< (@ 0x00000FEC) Coresight peripheral identification registers.        */
    __IOM uint32_t CIDR0;                            /*!< (@ 0x00000FF0) Coresight component identification registers.         */
    __IOM uint32_t CIDR1;                            /*!< (@ 0x00000FF4) Coresight component identification registers.         */
    __IOM uint32_t CIDR2;                            /*!< (@ 0x00000FF8) Coresight component identification registers.         */
    __IOM uint32_t CIDR3;                            /*!< (@ 0x00000FFC) Coresight component identification registers.         */
  } NRF_ATBFUNNEL_Type;                              /*!< Size = 4096 (0x1000)                                                 */

/* ATBFUNNEL_CTRLREG: The IDFILTER0 register enables the programming of ID filtering for master port 0. */
  #define ATBFUNNEL_CTRLREG_ResetValue (0x00000000UL) /*!< Reset value of CTRLREG register.                                    */

/* ENS0 @Bit 0 : Enable slave port 0. */
  #define ATBFUNNEL_CTRLREG_ENS0_Pos (0UL)           /*!< Position of ENS0 field.                                              */
  #define ATBFUNNEL_CTRLREG_ENS0_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS0_Pos) /*!< Bit mask of ENS0 field.                        */
  #define ATBFUNNEL_CTRLREG_ENS0_Min (0x0UL)         /*!< Min enumerator value of ENS0 field.                                  */
  #define ATBFUNNEL_CTRLREG_ENS0_Max (0x1UL)         /*!< Max enumerator value of ENS0 field.                                  */
  #define ATBFUNNEL_CTRLREG_ENS0_Disabled (0x0UL)    /*!< Slave port disabled. This excludes the port from the priority
                                                          selection scheme.*/                                                     
  #define ATBFUNNEL_CTRLREG_ENS0_Enabled (0x1UL)     /*!< Slave port enabled.                                                  */

/* ENS1 @Bit 1 : Enable slave port 1. */
  #define ATBFUNNEL_CTRLREG_ENS1_Pos (1UL)           /*!< Position of ENS1 field.                                              */
  #define ATBFUNNEL_CTRLREG_ENS1_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS1_Pos) /*!< Bit mask of ENS1 field.                        */
  #define ATBFUNNEL_CTRLREG_ENS1_Min (0x0UL)         /*!< Min enumerator value of ENS1 field.                                  */
  #define ATBFUNNEL_CTRLREG_ENS1_Max (0x1UL)         /*!< Max enumerator value of ENS1 field.                                  */
  #define ATBFUNNEL_CTRLREG_ENS1_Disabled (0x0UL)    /*!< Slave port disabled. This excludes the port from the priority
                                                          selection scheme.*/                                                     
  #define ATBFUNNEL_CTRLREG_ENS1_Enabled (0x1UL)     /*!< Slave port enabled.                                                  */

