adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ATDATA2 @Bit 2 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */                                                             
                                                                                                                                  
  #define ATBFUNNEL_ITATBDATA0_ATDATA2_Pos (2UL)     /*!< Position of ATDATA2 field.                                           */
  #define ATBFUNNEL_ITATBDATA0_ATDATA2_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA2_Pos) /*!< Bit mask of ATDATA2 field.         */
  #define ATBFUNNEL_ITATBDATA0_ATDATA2_Min (0x0UL)   /*!< Min enumerator value of ATDATA2 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA2_Max (0x1UL)   /*!< Max enumerator value of ATDATA2 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA2_Low (0x0UL)   /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA2_High (0x1UL)  /*!< Pin is logic 1.                                                      */

/* ATDATA3 @Bit 3 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */                                                             
                                                                                                                                  
  #define ATBFUNNEL_ITATBDATA0_ATDATA3_Pos (3UL)     /*!< Position of ATDATA3 field.                                           */
  #define ATBFUNNEL_ITATBDATA0_ATDATA3_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA3_Pos) /*!< Bit mask of ATDATA3 field.         */
  #define ATBFUNNEL_ITATBDATA0_ATDATA3_Min (0x0UL)   /*!< Min enumerator value of ATDATA3 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA3_Max (0x1UL)   /*!< Max enumerator value of ATDATA3 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA3_Low (0x0UL)   /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA3_High (0x1UL)  /*!< Pin is logic 1.                                                      */

/* ATDATA4 @Bit 4 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */                                                             
                                                                                                                                  
  #define ATBFUNNEL_ITATBDATA0_ATDATA4_Pos (4UL)     /*!< Position of ATDATA4 field.                                           */
  #define ATBFUNNEL_ITATBDATA0_ATDATA4_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA4_Pos) /*!< Bit mask of ATDATA4 field.         */
  #define ATBFUNNEL_ITATBDATA0_ATDATA4_Min (0x0UL)   /*!< Min enumerator value of ATDATA4 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA4_Max (0x1UL)   /*!< Max enumerator value of ATDATA4 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA4_Low (0x0UL)   /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA4_High (0x1UL)  /*!< Pin is logic 1.                                                      */

/* ATDATA5 @Bit 5 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */                                                             
                                                                                                                                  
  #define ATBFUNNEL_ITATBDATA0_ATDATA5_Pos (5UL)     /*!< Position of ATDATA5 field.                                           */
  #define ATBFUNNEL_ITATBDATA0_ATDATA5_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA5_Pos) /*!< Bit mask of ATDATA5 field.         */
  #define ATBFUNNEL_ITATBDATA0_ATDATA5_Min (0x0UL)   /*!< Min enumerator value of ATDATA5 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA5_Max (0x1UL)   /*!< Max enumerator value of ATDATA5 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA5_Low (0x0UL)   /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA5_High (0x1UL)  /*!< Pin is logic 1.                                                      */

/* ATDATA6 @Bit 6 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */                                                             
                                                                                                                                  
  #define ATBFUNNEL_ITATBDATA0_ATDATA6_Pos (6UL)     /*!< Position of ATDATA6 field.                                           */
  #define ATBFUNNEL_ITATBDATA0_ATDATA6_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA6_Pos) /*!< Bit mask of ATDATA6 field.         */
  #define ATBFUNNEL_ITATBDATA0_ATDATA6_Min (0x0UL)   /*!< Min enumerator value of ATDATA6 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA6_Max (0x1UL)   /*!< Max enumerator value of ATDATA6 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA6_Low (0x0UL)   /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA6_High (0x1UL)  /*!< Pin is logic 1.                                                      */

/* ATDATA7 @Bit 7 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */                                                             
                                                                                                                                  
  #define ATBFUNNEL_ITATBDATA0_ATDATA7_Pos (7UL)     /*!< Position of ATDATA7 field.                                           */
  #define ATBFUNNEL_ITATBDATA0_ATDATA7_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA7_Pos) /*!< Bit mask of ATDATA7 field.         */
  #define ATBFUNNEL_ITATBDATA0_ATDATA7_Min (0x0UL)   /*!< Min enumerator value of ATDATA7 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA7_Max (0x1UL)   /*!< Max enumerator value of ATDATA7 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA7_Low (0x0UL)   /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA7_High (0x1UL)  /*!< Pin is logic 1.                                                      */

/* ATDATA8 @Bit 8 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */                                                             
                                                                                                                                  
  #define ATBFUNNEL_ITATBDATA0_ATDATA8_Pos (8UL)     /*!< Position of ATDATA8 field.                                           */
  #define ATBFUNNEL_ITATBDATA0_ATDATA8_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA8_Pos) /*!< Bit mask of ATDATA8 field.         */
  #define ATBFUNNEL_ITATBDATA0_ATDATA8_Min (0x0UL)   /*!< Min enumerator value of ATDATA8 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA8_Max (0x1UL)   /*!< Max enumerator value of ATDATA8 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA8_Low (0x0UL)   /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA8_High (0x1UL)  /*!< Pin is logic 1.                                                      */

/* ATDATA9 @Bit 9 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */                                                             
                                                                                                                                  
  #define ATBFUNNEL_ITATBDATA0_ATDATA9_Pos (9UL)     /*!< Position of ATDATA9 field.                                           */
  #define ATBFUNNEL_ITATBDATA0_ATDATA9_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA9_Pos) /*!< Bit mask of ATDATA9 field.         */
  #define ATBFUNNEL_ITATBDATA0_ATDATA9_Min (0x0UL)   /*!< Min enumerator value of ATDATA9 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA9_Max (0x1UL)   /*!< Max enumerator value of ATDATA9 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA9_Low (0x0UL)   /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA9_High (0x1UL)  /*!< Pin is logic 1.                                                      */

/* ATDATA10 @Bit 10 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                      corresponding atdatam pin of the enabled port. */                                                           
                                                                                                                                  
  #define ATBFUNNEL_ITATBDATA0_ATDATA10_Pos (10UL)   /*!< Position of ATDATA10 field.                                          */
  #define ATBFUNNEL_ITATBDATA0_ATDATA10_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA10_Pos) /*!< Bit mask of ATDATA10 field.      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA10_Min (0x0UL)  /*!< Min enumerator value of ATDATA10 field.                              */
  #define ATBFUNNEL_ITATBDATA0_ATDATA10_Max (0x1UL)  /*!< Max enumerator value of ATDATA10 field.                              */
  #define ATBFUNNEL_ITATBDATA0_ATDATA10_Low (0x0UL)  /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA10_High (0x1UL) /*!< Pin is logic 1.                                                      */

