adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ATREADY @Bit 0 : A read access returns the value of atreadym. A write access outputs the data to afvalids[n], where the value
                    of the CTRLREG at 0x000 defines n. */                                                                         
                                                                                                                                  
  #define ATBFUNNEL_ITATBCTR2_ATREADY_Pos (0UL)      /*!< Position of ATREADY field.                                           */
  #define ATBFUNNEL_ITATBCTR2_ATREADY_Msk (0x1UL << ATBFUNNEL_ITATBCTR2_ATREADY_Pos) /*!< Bit mask of ATREADY field.           */
  #define ATBFUNNEL_ITATBCTR2_ATREADY_Min (0x0UL)    /*!< Min enumerator value of ATREADY field.                               */
  #define ATBFUNNEL_ITATBCTR2_ATREADY_Max (0x1UL)    /*!< Max enumerator value of ATREADY field.                               */
  #define ATBFUNNEL_ITATBCTR2_ATREADY_Low (0x0UL)    /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBCTR2_ATREADY_High (0x1UL)   /*!< Pin is logic 1.                                                      */

/* AFVALID @Bit 1 : A read access returns the value of afvalidm. A write access outputs the data to atreadys[n], where the value
                    of the CTRLREG at 0x000 defines n. */                                                                         
                                                                                                                                  
  #define ATBFUNNEL_ITATBCTR2_AFVALID_Pos (1UL)      /*!< Position of AFVALID field.                                           */
  #define ATBFUNNEL_ITATBCTR2_AFVALID_Msk (0x1UL << ATBFUNNEL_ITATBCTR2_AFVALID_Pos) /*!< Bit mask of AFVALID field.           */
  #define ATBFUNNEL_ITATBCTR2_AFVALID_Min (0x0UL)    /*!< Min enumerator value of AFVALID field.                               */
  #define ATBFUNNEL_ITATBCTR2_AFVALID_Max (0x1UL)    /*!< Max enumerator value of AFVALID field.                               */
  #define ATBFUNNEL_ITATBCTR2_AFVALID_Low (0x0UL)    /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBCTR2_AFVALID_High (0x1UL)   /*!< Pin is logic 1.                                                      */


/* ATBFUNNEL_ITATBCTR1: The ITATBCTR1 register performs different functions depending on whether the access is a read or a
                         write. */                                                                                                
                                                                                                                                  
  #define ATBFUNNEL_ITATBCTR1_ResetValue (0x00000000UL) /*!< Reset value of ITATBCTR1 register.                                */

/* ATVALIDM0 @Bits 0..6 : A read returns the value of the atids[n] signals, where the value of the Control Register at 0x000
                          defines n. A write outputs the value to the atidm port. */                                              
                                                                                                                                  
  #define ATBFUNNEL_ITATBCTR1_ATVALIDM0_Pos (0UL)    /*!< Position of ATVALIDM0 field.                                         */
  #define ATBFUNNEL_ITATBCTR1_ATVALIDM0_Msk (0x7FUL << ATBFUNNEL_ITATBCTR1_ATVALIDM0_Pos) /*!< Bit mask of ATVALIDM0 field.    */
  #define ATBFUNNEL_ITATBCTR1_ATVALIDM0_Min (0x0UL)  /*!< Min enumerator value of ATVALIDM0 field.                             */
  #define ATBFUNNEL_ITATBCTR1_ATVALIDM0_Max (0x1UL)  /*!< Max enumerator value of ATVALIDM0 field.                             */
  #define ATBFUNNEL_ITATBCTR1_ATVALIDM0_Low (0x00UL) /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBCTR1_ATVALIDM0_High (0x01UL) /*!< Pin is logic 1.                                                     */


/* ATBFUNNEL_ITATBCTR0: The ITATBCTR0 register performs different functions depending on whether the access is a read or a
                         write. */                                                                                                
                                                                                                                                  
  #define ATBFUNNEL_ITATBCTR0_ResetValue (0x00000000UL) /*!< Reset value of ITATBCTR0 register.                                */

/* ATVALID @Bit 0 : A read returns the value of the atvalids[n] signal, where the value of the CTRLREG at 0x000 defines n. A
                    write outputs the value to atvalidm. */                                                                       
                                                                                                                                  
  #define ATBFUNNEL_ITATBCTR0_ATVALID_Pos (0UL)      /*!< Position of ATVALID field.                                           */
  #define ATBFUNNEL_ITATBCTR0_ATVALID_Msk (0x1UL << ATBFUNNEL_ITATBCTR0_ATVALID_Pos) /*!< Bit mask of ATVALID field.           */
  #define ATBFUNNEL_ITATBCTR0_ATVALID_Min (0x0UL)    /*!< Min enumerator value of ATVALID field.                               */
  #define ATBFUNNEL_ITATBCTR0_ATVALID_Max (0x1UL)    /*!< Max enumerator value of ATVALID field.                               */
  #define ATBFUNNEL_ITATBCTR0_ATVALID_Low (0x0UL)    /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBCTR0_ATVALID_High (0x1UL)   /*!< Pin is logic 1.                                                      */

/* AFREADY @Bit 2 : A read returns the value of the afreadys[n] signal, where the value of the Ctrl_Reg at 0x000 defines n. A
                    write outputs the value to afreadym. */                                                                       
                                                                                                                                  
