adamkondraciuk/nrfx/mdk/nrf7140_types.h
  #define ATBFUNNEL_ITATBCTR0_AFREADY_Pos (2UL)      /*!< Position of AFREADY field.                                           */
  #define ATBFUNNEL_ITATBCTR0_AFREADY_Msk (0x1UL << ATBFUNNEL_ITATBCTR0_AFREADY_Pos) /*!< Bit mask of AFREADY field.           */
  #define ATBFUNNEL_ITATBCTR0_AFREADY_Min (0x0UL)    /*!< Min enumerator value of AFREADY field.                               */
  #define ATBFUNNEL_ITATBCTR0_AFREADY_Max (0x1UL)    /*!< Max enumerator value of AFREADY field.                               */
  #define ATBFUNNEL_ITATBCTR0_AFREADY_Low (0x0UL)    /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBCTR0_AFREADY_High (0x1UL)   /*!< Pin is logic 1.                                                      */

/* ATBYTES @Bits 8..9 : A read returns the value of the atbytess[n] signal, where the value of the Ctrl_Reg at 0x000 defines n.
                        A write outputs the value to atbytesm. */                                                                 
                                                                                                                                  
  #define ATBFUNNEL_ITATBCTR0_ATBYTES_Pos (8UL)      /*!< Position of ATBYTES field.                                           */
  #define ATBFUNNEL_ITATBCTR0_ATBYTES_Msk (0x3UL << ATBFUNNEL_ITATBCTR0_ATBYTES_Pos) /*!< Bit mask of ATBYTES field.           */
  #define ATBFUNNEL_ITATBCTR0_ATBYTES_Min (0x0UL)    /*!< Min enumerator value of ATBYTES field.                               */
  #define ATBFUNNEL_ITATBCTR0_ATBYTES_Max (0x1UL)    /*!< Max enumerator value of ATBYTES field.                               */
  #define ATBFUNNEL_ITATBCTR0_ATBYTES_Low (0x0UL)    /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBCTR0_ATBYTES_High (0x1UL)   /*!< Pin is logic 1.                                                      */


/* ATBFUNNEL_ITCTRL: The ITCTRL register enables the component to switch from a functional mode, which is the default behavior,
                      to integration mode where the inputs and outputs of the component can be directly controlled for the
                      purposes of integration testing and topology detection. */                                                  
                                                                                                                                  
  #define ATBFUNNEL_ITCTRL_ResetValue (0x00000000UL) /*!< Reset value of ITCTRL register.                                      */

/* IME @Bit 0 : Integration Mode Enable. */
  #define ATBFUNNEL_ITCTRL_IME_Pos (0UL)             /*!< Position of IME field.                                               */
  #define ATBFUNNEL_ITCTRL_IME_Msk (0x1UL << ATBFUNNEL_ITCTRL_IME_Pos) /*!< Bit mask of IME field.                             */
  #define ATBFUNNEL_ITCTRL_IME_Min (0x0UL)           /*!< Min enumerator value of IME field.                                   */
  #define ATBFUNNEL_ITCTRL_IME_Max (0x1UL)           /*!< Max enumerator value of IME field.                                   */
  #define ATBFUNNEL_ITCTRL_IME_Disabled (0x0UL)      /*!< Integration mode disabled.                                           */
  #define ATBFUNNEL_ITCTRL_IME_Enabled (0x1UL)       /*!< Integration mode enabled.                                            */


/* ATBFUNNEL_CLAIMSET: Software can use the claim tag to coordinate application and debugger access to trace unit functionality.
                        The claim tags have no effect on the operation of the component. The CLAIMSET register sets bits in the
                        claim tag, and determines the number of claim bits implemented. */                                        
                                                                                                                                  
  #define ATBFUNNEL_CLAIMSET_ResetValue (0x00000000UL) /*!< Reset value of CLAIMSET register.                                  */

/* BIT0 @Bit 0 : Set claim bit 0 and check if bit is implemented or not. */
  #define ATBFUNNEL_CLAIMSET_BIT0_Pos (0UL)          /*!< Position of BIT0 field.                                              */
  #define ATBFUNNEL_CLAIMSET_BIT0_Msk (0x1UL << ATBFUNNEL_CLAIMSET_BIT0_Pos) /*!< Bit mask of BIT0 field.                      */
  #define ATBFUNNEL_CLAIMSET_BIT0_Min (0x0UL)        /*!< Min enumerator value of BIT0 field.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT0_Max (0x1UL)        /*!< Max enumerator value of BIT0 field.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT0_NotImplemented (0x0UL) /*!< Claim bit 0 is not implemented.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT0_Implemented (0x1UL) /*!< Claim bit 0 is implemented.                                         */
  #define ATBFUNNEL_CLAIMSET_BIT0_Set (0x1UL)        /*!< Set claim bit 0.                                                     */

/* BIT1 @Bit 1 : Set claim bit 1 and check if bit is implemented or not. */
  #define ATBFUNNEL_CLAIMSET_BIT1_Pos (1UL)          /*!< Position of BIT1 field.                                              */
  #define ATBFUNNEL_CLAIMSET_BIT1_Msk (0x1UL << ATBFUNNEL_CLAIMSET_BIT1_Pos) /*!< Bit mask of BIT1 field.                      */
  #define ATBFUNNEL_CLAIMSET_BIT1_Min (0x0UL)        /*!< Min enumerator value of BIT1 field.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT1_Max (0x1UL)        /*!< Max enumerator value of BIT1 field.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT1_NotImplemented (0x0UL) /*!< Claim bit 1 is not implemented.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT1_Implemented (0x1UL) /*!< Claim bit 1 is implemented.                                         */
  #define ATBFUNNEL_CLAIMSET_BIT1_Set (0x1UL)        /*!< Set claim bit 1.                                                     */

/* BIT2 @Bit 2 : Set claim bit 2 and check if bit is implemented or not. */
  #define ATBFUNNEL_CLAIMSET_BIT2_Pos (2UL)          /*!< Position of BIT2 field.                                              */
  #define ATBFUNNEL_CLAIMSET_BIT2_Msk (0x1UL << ATBFUNNEL_CLAIMSET_BIT2_Pos) /*!< Bit mask of BIT2 field.                      */
  #define ATBFUNNEL_CLAIMSET_BIT2_Min (0x0UL)        /*!< Min enumerator value of BIT2 field.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT2_Max (0x1UL)        /*!< Max enumerator value of BIT2 field.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT2_NotImplemented (0x0UL) /*!< Claim bit 2 is not implemented.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT2_Implemented (0x1UL) /*!< Claim bit 2 is implemented.                                         */
  #define ATBFUNNEL_CLAIMSET_BIT2_Set (0x1UL)        /*!< Set claim bit 2.                                                     */

