adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ATBREPLICATOR_DEVID: Indicates the capabilities of the component. */
  #define ATBREPLICATOR_DEVID_ResetValue (0x00000000UL) /*!< Reset value of DEVID register.                                    */

/* PORTNUM @Bits 0..3 : Indicates the number of master ports implemented. */
  #define ATBREPLICATOR_DEVID_PORTNUM_Pos (0UL)      /*!< Position of PORTNUM field.                                           */
  #define ATBREPLICATOR_DEVID_PORTNUM_Msk (0xFUL << ATBREPLICATOR_DEVID_PORTNUM_Pos) /*!< Bit mask of PORTNUM field.           */
  #define ATBREPLICATOR_DEVID_PORTNUM_Min (0x0UL)    /*!< Min value of PORTNUM field.                                          */
  #define ATBREPLICATOR_DEVID_PORTNUM_Max (0xFUL)    /*!< Max size of PORTNUM field.                                           */


/* ATBREPLICATOR_DEVTYPE: The DEVTYPE register provides a debugger with information about the component when the Part Number
                           field is not recognized. The debugger can then report this information. */                             
                                                                                                                                  
  #define ATBREPLICATOR_DEVTYPE_ResetValue (0x00000000UL) /*!< Reset value of DEVTYPE register.                                */

/* MAJOR @Bits 0..3 : The main type of the component */
  #define ATBREPLICATOR_DEVTYPE_MAJOR_Pos (0UL)      /*!< Position of MAJOR field.                                             */
  #define ATBREPLICATOR_DEVTYPE_MAJOR_Msk (0xFUL << ATBREPLICATOR_DEVTYPE_MAJOR_Pos) /*!< Bit mask of MAJOR field.             */
  #define ATBREPLICATOR_DEVTYPE_MAJOR_Min (0x2UL)    /*!< Min enumerator value of MAJOR field.                                 */
  #define ATBREPLICATOR_DEVTYPE_MAJOR_Max (0x2UL)    /*!< Max enumerator value of MAJOR field.                                 */
  #define ATBREPLICATOR_DEVTYPE_MAJOR_InputOutputDevice (0x2UL) /*!< Indicates that this component has ATB inputs and outputs. */

/* SUB @Bits 4..7 : The sub-type of the component */
  #define ATBREPLICATOR_DEVTYPE_SUB_Pos (4UL)        /*!< Position of SUB field.                                               */
  #define ATBREPLICATOR_DEVTYPE_SUB_Msk (0xFUL << ATBREPLICATOR_DEVTYPE_SUB_Pos) /*!< Bit mask of SUB field.                   */
  #define ATBREPLICATOR_DEVTYPE_SUB_Min (0x2UL)      /*!< Min enumerator value of SUB field.                                   */
  #define ATBREPLICATOR_DEVTYPE_SUB_Max (0x2UL)      /*!< Max enumerator value of SUB field.                                   */
  #define ATBREPLICATOR_DEVTYPE_SUB_Replicator (0x2UL) /*!< Indicates that this component replicates trace from a single source
                                                            to multiple targets.*/                                                


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          AUXPLL                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct AUXPLL_CONFIG =================================================== */
/**
  * @brief CONFIG [AUXPLL_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFGSTATIC;                         /*!< (@ 0x00000000) AUXPLL configuration                                  */
} NRF_AUXPLL_CONFIG_Type;                            /*!< Size = 4 (0x004)                                                     */

/* AUXPLL_CONFIG_CFGSTATIC: AUXPLL configuration */
  #define AUXPLL_CONFIG_CFGSTATIC_ResetValue (0x00000224UL) /*!< Reset value of CFGSTATIC register.                            */

/* OUTDRIVE @Bits 0..1 : Output buffer drive strength selection */
  #define AUXPLL_CONFIG_CFGSTATIC_OUTDRIVE_Pos (0UL) /*!< Position of OUTDRIVE field.                                          */
  #define AUXPLL_CONFIG_CFGSTATIC_OUTDRIVE_Msk (0x3UL << AUXPLL_CONFIG_CFGSTATIC_OUTDRIVE_Pos) /*!< Bit mask of OUTDRIVE field.*/
  #define AUXPLL_CONFIG_CFGSTATIC_OUTDRIVE_Min (0x0UL) /*!< Lowest drive strength                                              */
  #define AUXPLL_CONFIG_CFGSTATIC_OUTDRIVE_Max (0x3UL) /*!< Highest drive strength                                             */

/* SELCONSTANTI @Bits 2..6 : Constant current tune for ring oscillator */
  #define AUXPLL_CONFIG_CFGSTATIC_SELCONSTANTI_Pos (2UL) /*!< Position of SELCONSTANTI field.                                  */
  #define AUXPLL_CONFIG_CFGSTATIC_SELCONSTANTI_Msk (0x1FUL << AUXPLL_CONFIG_CFGSTATIC_SELCONSTANTI_Pos) /*!< Bit mask of
                                                                            SELCONSTANTI field.*/                                 
  #define AUXPLL_CONFIG_CFGSTATIC_SELCONSTANTI_Min (0x00UL) /*!< Minimum current                                               */
  #define AUXPLL_CONFIG_CFGSTATIC_SELCONSTANTI_Default (0x09UL) /*!< Default current for audio and USB                         */
  #define AUXPLL_CONFIG_CFGSTATIC_SELCONSTANTI_Max (0x0FUL) /*!< Maximum current                                               */

/* SDMOFF @Bit 7 : Turn off sigma delta modulation */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMOFF_Pos (7UL)   /*!< Position of SDMOFF field.                                            */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMOFF_Msk (0x1UL << AUXPLL_CONFIG_CFGSTATIC_SDMOFF_Pos) /*!< Bit mask of SDMOFF field.      */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMOFF_Min (0x0UL) /*!< Min enumerator value of SDMOFF field.                                */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMOFF_Max (0x1UL) /*!< Max enumerator value of SDMOFF field.                                */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMOFF_SDMOn (0x0UL) /*!< Sigma Delta Modulator enabled                                      */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMOFF_SDMOff (0x1UL) /*!< Sigma Delta Modulator disabled                                    */

/* SDMDITHEROFF @Bit 8 : Turn off dither in sigma delta modulator */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_Pos (8UL) /*!< Position of SDMDITHEROFF field.                                  */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_Msk (0x1UL << AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_Pos) /*!< Bit mask of
                                                                            SDMDITHEROFF field.*/                                 
  #define AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_Min (0x0UL) /*!< Min enumerator value of SDMDITHEROFF field.                    */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_Max (0x1UL) /*!< Max enumerator value of SDMDITHEROFF field.                    */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_DitherOn (0x0UL) /*!< Dither enabled                                            */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_DitherOff (0x1UL) /*!< Dither disabled                                          */

/* AUXPLLRANGE @Bits 9..10 : Loop divider base settings */
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Pos (9UL) /*!< Position of AUXPLLRANGE field.                                    */
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Msk (0x3UL << AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Pos) /*!< Bit mask of
                                                                            AUXPLLRANGE field.*/                                  
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Min (0x0UL) /*!< Min enumerator value of AUXPLLRANGE field.                      */
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Max (0x3UL) /*!< Max enumerator value of AUXPLLRANGE field.                      */
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Low (0x0UL) /*!< Low range divider setting                                       */
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Mid (0x1UL) /*!< Mid range divider setting                                       */
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_High (0x2UL) /*!< High range divider setting                                     */
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_StaticHigh (0x3UL) /*!< Maximum static divider setting                           */



/* =================================================== Struct AUXPLL_TRIM ==================================================== */
/**
  * @brief TRIM [AUXPLL_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CTUNE;                             /*!< (@ 0x00000000) Ring oscillator core process corner tuning            */
} NRF_AUXPLL_TRIM_Type;                              /*!< Size = 4 (0x004)                                                     */

/* AUXPLL_TRIM_CTUNE: Ring oscillator core process corner tuning */
  #define AUXPLL_TRIM_CTUNE_ResetValue (0x0000000DUL) /*!< Reset value of CTUNE register.                                      */

