adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* AUXPLL_OVERRIDE_FREQ: Override the FREQUENCY signal to the analog module */
  #define AUXPLL_OVERRIDE_FREQ_ResetValue (0x00000000UL) /*!< Reset value of FREQ register.                                    */

/* VAL @Bits 0..15 : Override value for the signal */
  #define AUXPLL_OVERRIDE_FREQ_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define AUXPLL_OVERRIDE_FREQ_VAL_Msk (0xFFFFUL << AUXPLL_OVERRIDE_FREQ_VAL_Pos) /*!< Bit mask of VAL field.                  */

/* EN @Bit 31 : Enable the override */
  #define AUXPLL_OVERRIDE_FREQ_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define AUXPLL_OVERRIDE_FREQ_EN_Msk (0x1UL << AUXPLL_OVERRIDE_FREQ_EN_Pos) /*!< Bit mask of EN field.                        */
  #define AUXPLL_OVERRIDE_FREQ_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_FREQ_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_FREQ_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define AUXPLL_OVERRIDE_FREQ_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


/* AUXPLL_OVERRIDE_FREQVALID: Override the FREQVALID signal to the analog module */
  #define AUXPLL_OVERRIDE_FREQVALID_ResetValue (0x00000000UL) /*!< Reset value of FREQVALID register.                          */

/* VAL @Bit 0 : Override value for the signal */
  #define AUXPLL_OVERRIDE_FREQVALID_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define AUXPLL_OVERRIDE_FREQVALID_VAL_Msk (0x1UL << AUXPLL_OVERRIDE_FREQVALID_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define AUXPLL_OVERRIDE_FREQVALID_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define AUXPLL_OVERRIDE_FREQVALID_EN_Msk (0x1UL << AUXPLL_OVERRIDE_FREQVALID_EN_Pos) /*!< Bit mask of EN field.              */
  #define AUXPLL_OVERRIDE_FREQVALID_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_FREQVALID_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_FREQVALID_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define AUXPLL_OVERRIDE_FREQVALID_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* AUXPLL_OVERRIDE_BYPASS: Override the BYPASS signal to the analog module */
  #define AUXPLL_OVERRIDE_BYPASS_ResetValue (0x00000000UL) /*!< Reset value of BYPASS register.                                */

/* VAL @Bit 0 : Override value for the signal */
  #define AUXPLL_OVERRIDE_BYPASS_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define AUXPLL_OVERRIDE_BYPASS_VAL_Msk (0x1UL << AUXPLL_OVERRIDE_BYPASS_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define AUXPLL_OVERRIDE_BYPASS_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define AUXPLL_OVERRIDE_BYPASS_EN_Msk (0x1UL << AUXPLL_OVERRIDE_BYPASS_EN_Pos) /*!< Bit mask of EN field.                    */
  #define AUXPLL_OVERRIDE_BYPASS_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_BYPASS_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_BYPASS_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define AUXPLL_OVERRIDE_BYPASS_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */


/* AUXPLL_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define AUXPLL_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                                */

/* VAL @Bit 0 : Override value for the signal */
  #define AUXPLL_OVERRIDE_RETAIN_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define AUXPLL_OVERRIDE_RETAIN_VAL_Msk (0x1UL << AUXPLL_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define AUXPLL_OVERRIDE_RETAIN_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define AUXPLL_OVERRIDE_RETAIN_EN_Msk (0x1UL << AUXPLL_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.                    */
  #define AUXPLL_OVERRIDE_RETAIN_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_RETAIN_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_RETAIN_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define AUXPLL_OVERRIDE_RETAIN_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */


/* AUXPLL_OVERRIDE_FAKEMODE: Broadcast specific mode regardless of actual mode */
  #define AUXPLL_OVERRIDE_FAKEMODE_ResetValue (0x00000000UL) /*!< Reset value of FAKEMODE register.                            */

/* VAL @Bit 0 : Override value for the signal */
  #define AUXPLL_OVERRIDE_FAKEMODE_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define AUXPLL_OVERRIDE_FAKEMODE_VAL_Msk (0x1UL << AUXPLL_OVERRIDE_FAKEMODE_VAL_Pos) /*!< Bit mask of VAL field.             */
  #define AUXPLL_OVERRIDE_FAKEMODE_VAL_Min (0x0UL)   /*!< Min enumerator value of VAL field.                                   */
  #define AUXPLL_OVERRIDE_FAKEMODE_VAL_Max (0x1UL)   /*!< Max enumerator value of VAL field.                                   */
  #define AUXPLL_OVERRIDE_FAKEMODE_VAL_Freerun (0x0UL) /*!< Broadcast freerunning mode                                         */
  #define AUXPLL_OVERRIDE_FAKEMODE_VAL_Locked (0x1UL) /*!< Broadcast locked mode                                               */

/* EN @Bit 31 : Enable the override */
  #define AUXPLL_OVERRIDE_FAKEMODE_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define AUXPLL_OVERRIDE_FAKEMODE_EN_Msk (0x1UL << AUXPLL_OVERRIDE_FAKEMODE_EN_Pos) /*!< Bit mask of EN field.                */
  #define AUXPLL_OVERRIDE_FAKEMODE_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_FAKEMODE_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_FAKEMODE_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define AUXPLL_OVERRIDE_FAKEMODE_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* AUXPLL_OVERRIDE_MUTE: Override MUTE */
  #define AUXPLL_OVERRIDE_MUTE_ResetValue (0x00000000UL) /*!< Reset value of MUTE register.                                    */

/* VAL @Bit 0 : Override value for the signal */
  #define AUXPLL_OVERRIDE_MUTE_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define AUXPLL_OVERRIDE_MUTE_VAL_Msk (0x1UL << AUXPLL_OVERRIDE_MUTE_VAL_Pos) /*!< Bit mask of VAL field.                     */
  #define AUXPLL_OVERRIDE_MUTE_VAL_Min (0x0UL)       /*!< Min enumerator value of VAL field.                                   */
  #define AUXPLL_OVERRIDE_MUTE_VAL_Max (0x1UL)       /*!< Max enumerator value of VAL field.                                   */
  #define AUXPLL_OVERRIDE_MUTE_VAL_DisableMute (0x0UL) /*!< MUTE disabled.                                                     */
  #define AUXPLL_OVERRIDE_MUTE_VAL_EnableMute (0x1UL) /*!< MUTE enabled.                                                       */

/* EN @Bit 31 : Enable the override */
  #define AUXPLL_OVERRIDE_MUTE_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define AUXPLL_OVERRIDE_MUTE_EN_Msk (0x1UL << AUXPLL_OVERRIDE_MUTE_EN_Pos) /*!< Bit mask of EN field.                        */
  #define AUXPLL_OVERRIDE_MUTE_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_MUTE_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define AUXPLL_OVERRIDE_MUTE_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define AUXPLL_OVERRIDE_MUTE_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */



