adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* AUXPM_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define AUXPM_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                              */

/* EN @Bit 31 : (unspecified) */
  #define AUXPM_DFT_ATB1CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define AUXPM_DFT_ATB1CONFIG_EN_Msk (0x1UL << AUXPM_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define AUXPM_DFT_ATB1CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define AUXPM_DFT_ATB1CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define AUXPM_DFT_ATB1CONFIG_EN_Disabled (0x0UL)   /*!< Analog test bus is disabled                                          */
  #define AUXPM_DFT_ATB1CONFIG_EN_Enabled (0x1UL)    /*!< Analog test bus is enabled                                           */


/* ====================================================== Struct AUXPM ======================================================= */
/**
  * @brief AUXPM
  */
  typedef struct {                                   /*!< AUXPM Structure                                                      */
    __IM uint32_t RESERVED[8];
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000020) Request power up                                      */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000024) Stop requesting power up                              */
    __IM uint32_t RESERVED1[58];
    __IOM uint32_t EVENTS_SETTLED;                   /*!< (@ 0x00000110) LDO settled                                           */
    __IM uint32_t RESERVED2[123];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED3[62];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000408) Status of AuxPm                                       */
    __IM uint32_t RESERVED4[5];
    __IOM NRF_AUXPM_CONFIG_Type CONFIG;              /*!< (@ 0x00000420) (unspecified)                                         */
    __IM uint32_t RESERVED5[8];
    __IOM NRF_AUXPM_TRIM_Type TRIM;                  /*!< (@ 0x00000450) (unspecified)                                         */
    __IM uint32_t RESERVED6[39];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x000004F0) Enable LOCK for mirrored registers                    */
    __IM uint32_t RESERVED7[35];
    __IOM NRF_AUXPM_OVERRIDE_Type OVERRIDE;          /*!< (@ 0x00000580) (unspecified)                                         */
    __IM uint32_t RESERVED8[58];
    __IOM NRF_AUXPM_DFT_Type DFT;                    /*!< (@ 0x00000680) (unspecified)                                         */
  } NRF_AUXPM_Type;                                  /*!< Size = 1672 (0x688)                                                  */

/* AUXPM_TASKS_START: Request power up */
  #define AUXPM_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                */

/* TASKS_START @Bit 0 : Request power up */
  #define AUXPM_TASKS_START_TASKS_START_Pos (0UL)    /*!< Position of TASKS_START field.                                       */
  #define AUXPM_TASKS_START_TASKS_START_Msk (0x1UL << AUXPM_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.   */
  #define AUXPM_TASKS_START_TASKS_START_Min (0x1UL)  /*!< Min enumerator value of TASKS_START field.                           */
  #define AUXPM_TASKS_START_TASKS_START_Max (0x1UL)  /*!< Max enumerator value of TASKS_START field.                           */
  #define AUXPM_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* AUXPM_TASKS_STOP: Stop requesting power up */
  #define AUXPM_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop requesting power up */
  #define AUXPM_TASKS_STOP_TASKS_STOP_Pos (0UL)      /*!< Position of TASKS_STOP field.                                        */
  #define AUXPM_TASKS_STOP_TASKS_STOP_Msk (0x1UL << AUXPM_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.        */
  #define AUXPM_TASKS_STOP_TASKS_STOP_Min (0x1UL)    /*!< Min enumerator value of TASKS_STOP field.                            */
  #define AUXPM_TASKS_STOP_TASKS_STOP_Max (0x1UL)    /*!< Max enumerator value of TASKS_STOP field.                            */
  #define AUXPM_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* AUXPM_EVENTS_SETTLED: LDO settled */
  #define AUXPM_EVENTS_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SETTLED register.                          */

/* EVENTS_SETTLED @Bit 0 : LDO settled */
  #define AUXPM_EVENTS_SETTLED_EVENTS_SETTLED_Pos (0UL) /*!< Position of EVENTS_SETTLED field.                                 */
  #define AUXPM_EVENTS_SETTLED_EVENTS_SETTLED_Msk (0x1UL << AUXPM_EVENTS_SETTLED_EVENTS_SETTLED_Pos) /*!< Bit mask of
                                                                            EVENTS_SETTLED field.*/                               
  #define AUXPM_EVENTS_SETTLED_EVENTS_SETTLED_Min (0x0UL) /*!< Min enumerator value of EVENTS_SETTLED field.                   */
  #define AUXPM_EVENTS_SETTLED_EVENTS_SETTLED_Max (0x1UL) /*!< Max enumerator value of EVENTS_SETTLED field.                   */
  #define AUXPM_EVENTS_SETTLED_EVENTS_SETTLED_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define AUXPM_EVENTS_SETTLED_EVENTS_SETTLED_Generated (0x1UL) /*!< Event generated                                           */


/* AUXPM_INTEN: Enable or disable interrupt */
  #define AUXPM_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

