adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SETTLED @Bit 4 : Enable or disable interrupt for event SETTLED */
  #define AUXPM_INTEN_SETTLED_Pos (4UL)              /*!< Position of SETTLED field.                                           */
  #define AUXPM_INTEN_SETTLED_Msk (0x1UL << AUXPM_INTEN_SETTLED_Pos) /*!< Bit mask of SETTLED field.                           */
  #define AUXPM_INTEN_SETTLED_Min (0x0UL)            /*!< Min enumerator value of SETTLED field.                               */
  #define AUXPM_INTEN_SETTLED_Max (0x1UL)            /*!< Max enumerator value of SETTLED field.                               */
  #define AUXPM_INTEN_SETTLED_Disabled (0x0UL)       /*!< Disable                                                              */
  #define AUXPM_INTEN_SETTLED_Enabled (0x1UL)        /*!< Enable                                                               */


/* AUXPM_INTENSET: Enable interrupt */
  #define AUXPM_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* SETTLED @Bit 4 : Write '1' to enable interrupt for event SETTLED */
  #define AUXPM_INTENSET_SETTLED_Pos (4UL)           /*!< Position of SETTLED field.                                           */
  #define AUXPM_INTENSET_SETTLED_Msk (0x1UL << AUXPM_INTENSET_SETTLED_Pos) /*!< Bit mask of SETTLED field.                     */
  #define AUXPM_INTENSET_SETTLED_Min (0x0UL)         /*!< Min enumerator value of SETTLED field.                               */
  #define AUXPM_INTENSET_SETTLED_Max (0x1UL)         /*!< Max enumerator value of SETTLED field.                               */
  #define AUXPM_INTENSET_SETTLED_Set (0x1UL)         /*!< Enable                                                               */
  #define AUXPM_INTENSET_SETTLED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define AUXPM_INTENSET_SETTLED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* AUXPM_INTENCLR: Disable interrupt */
  #define AUXPM_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* SETTLED @Bit 4 : Write '1' to disable interrupt for event SETTLED */
  #define AUXPM_INTENCLR_SETTLED_Pos (4UL)           /*!< Position of SETTLED field.                                           */
  #define AUXPM_INTENCLR_SETTLED_Msk (0x1UL << AUXPM_INTENCLR_SETTLED_Pos) /*!< Bit mask of SETTLED field.                     */
  #define AUXPM_INTENCLR_SETTLED_Min (0x0UL)         /*!< Min enumerator value of SETTLED field.                               */
  #define AUXPM_INTENCLR_SETTLED_Max (0x1UL)         /*!< Max enumerator value of SETTLED field.                               */
  #define AUXPM_INTENCLR_SETTLED_Clear (0x1UL)       /*!< Disable                                                              */
  #define AUXPM_INTENCLR_SETTLED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define AUXPM_INTENCLR_SETTLED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* AUXPM_INTPEND: Pending interrupts */
  #define AUXPM_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* SETTLED @Bit 4 : Read pending status of interrupt for event SETTLED */
  #define AUXPM_INTPEND_SETTLED_Pos (4UL)            /*!< Position of SETTLED field.                                           */
  #define AUXPM_INTPEND_SETTLED_Msk (0x1UL << AUXPM_INTPEND_SETTLED_Pos) /*!< Bit mask of SETTLED field.                       */
  #define AUXPM_INTPEND_SETTLED_Min (0x0UL)          /*!< Min enumerator value of SETTLED field.                               */
  #define AUXPM_INTPEND_SETTLED_Max (0x1UL)          /*!< Max enumerator value of SETTLED field.                               */
  #define AUXPM_INTPEND_SETTLED_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define AUXPM_INTPEND_SETTLED_Pending (0x1UL)      /*!< Read: Pending                                                        */


/* AUXPM_STATUS: Status of AuxPm */
  #define AUXPM_STATUS_ResetValue (0x00000000UL)     /*!< Reset value of STATUS register.                                      */

/* READY @Bit 0 : AuxPm powered up */
  #define AUXPM_STATUS_READY_Pos (0UL)               /*!< Position of READY field.                                             */
  #define AUXPM_STATUS_READY_Msk (0x1UL << AUXPM_STATUS_READY_Pos) /*!< Bit mask of READY field.                               */
  #define AUXPM_STATUS_READY_Min (0x0UL)             /*!< Min enumerator value of READY field.                                 */
  #define AUXPM_STATUS_READY_Max (0x1UL)             /*!< Max enumerator value of READY field.                                 */
  #define AUXPM_STATUS_READY_PowerDown (0x0UL)       /*!< AuxPm powered down                                                   */
  #define AUXPM_STATUS_READY_Powered (0x1UL)         /*!< AuxPm powered up                                                     */

/* BYPASS @Bit 1 : Bypassing vref filter for startup boost */
  #define AUXPM_STATUS_BYPASS_Pos (1UL)              /*!< Position of BYPASS field.                                            */
  #define AUXPM_STATUS_BYPASS_Msk (0x1UL << AUXPM_STATUS_BYPASS_Pos) /*!< Bit mask of BYPASS field.                            */
  #define AUXPM_STATUS_BYPASS_Min (0x0UL)            /*!< Min enumerator value of BYPASS field.                                */
  #define AUXPM_STATUS_BYPASS_Max (0x1UL)            /*!< Max enumerator value of BYPASS field.                                */
  #define AUXPM_STATUS_BYPASS_NotBypass (0x0UL)      /*!< VrefFilt not bypassed                                                */
  #define AUXPM_STATUS_BYPASS_Bypass (0x1UL)         /*!< VrefFilt bypassed                                                    */

/* SETTLED @Bit 2 : LDO settled */
  #define AUXPM_STATUS_SETTLED_Pos (2UL)             /*!< Position of SETTLED field.                                           */
  #define AUXPM_STATUS_SETTLED_Msk (0x1UL << AUXPM_STATUS_SETTLED_Pos) /*!< Bit mask of SETTLED field.                         */
  #define AUXPM_STATUS_SETTLED_Min (0x0UL)           /*!< Min enumerator value of SETTLED field.                               */
  #define AUXPM_STATUS_SETTLED_Max (0x1UL)           /*!< Max enumerator value of SETTLED field.                               */
  #define AUXPM_STATUS_SETTLED_NotSettled (0x0UL)    /*!< AuxPm not settled                                                    */
  #define AUXPM_STATUS_SETTLED_Settled (0x1UL)       /*!< AuxPm settled                                                        */


/* AUXPM_MIRROR: Enable LOCK for mirrored registers */
  #define AUXPM_MIRROR_ResetValue (0x00000000UL)     /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define AUXPM_MIRROR_LOCK_Pos (0UL)                /*!< Position of LOCK field.                                              */
  #define AUXPM_MIRROR_LOCK_Msk (0x1UL << AUXPM_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                                  */
  #define AUXPM_MIRROR_LOCK_Min (0x0UL)              /*!< Min enumerator value of LOCK field.                                  */
  #define AUXPM_MIRROR_LOCK_Max (0x1UL)              /*!< Max enumerator value of LOCK field.                                  */
  #define AUXPM_MIRROR_LOCK_Disabled (0x0UL)         /*!< Lock disabled                                                        */
  #define AUXPM_MIRROR_LOCK_Enabled (0x1UL)          /*!< Lock enabled                                                         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         BELLBOARD                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ==================================================== Struct BELLBOARD ===================================================== */
/**
  * @brief BELLBOARD APB registers
  */
  typedef struct {                                   /*!< BELLBOARD Structure                                                  */
    __OM uint32_t TASKS_TRIGGER[32];                 /*!< (@ 0x00000000) Task TRIGGER[n]                                       */
    __IM uint32_t RESERVED[32];
    __IOM uint32_t EVENTS_TRIGGERED[32];             /*!< (@ 0x00000100) Event TRIGGERED[n]                                    */
    __IM uint32_t RESERVED1[96];
    __IOM uint32_t INTEN0;                           /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET0;                        /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR0;                        /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND0;                          /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IOM uint32_t INTEN1;                           /*!< (@ 0x00000310) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET1;                        /*!< (@ 0x00000314) Enable interrupt                                      */
    __IOM uint32_t INTENCLR1;                        /*!< (@ 0x00000318) Disable interrupt                                     */
    __IM uint32_t INTPEND1;                          /*!< (@ 0x0000031C) Pending interrupts                                    */
    __IOM uint32_t INTEN2;                           /*!< (@ 0x00000320) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET2;                        /*!< (@ 0x00000324) Enable interrupt                                      */
    __IOM uint32_t INTENCLR2;                        /*!< (@ 0x00000328) Disable interrupt                                     */
    __IM uint32_t INTPEND2;                          /*!< (@ 0x0000032C) Pending interrupts                                    */
    __IOM uint32_t INTEN3;                           /*!< (@ 0x00000330) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET3;                        /*!< (@ 0x00000334) Enable interrupt                                      */
    __IOM uint32_t INTENCLR3;                        /*!< (@ 0x00000338) Disable interrupt                                     */
    __IM uint32_t INTPEND3;                          /*!< (@ 0x0000033C) Pending interrupts                                    */
  } NRF_BELLBOARD_Type;                              /*!< Size = 832 (0x340)                                                   */

/* BELLBOARD_TASKS_TRIGGER: Task TRIGGER[n] */
  #define BELLBOARD_TASKS_TRIGGER_MaxCount (32UL)    /*!< Max size of TASKS_TRIGGER[32] array.                                 */
  #define BELLBOARD_TASKS_TRIGGER_ResetValue (0x00000000UL) /*!< Reset value of TASKS_TRIGGER[32] register.                    */

/* TASKS_TRIGGER @Bit 0 : Task TRIGGER[n] */
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Pos (0UL) /*!< Position of TASKS_TRIGGER field.                                */
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Msk (0x1UL << BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Pos) /*!< Bit mask of
                                                                            TASKS_TRIGGER field.*/                                
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Min (0x1UL) /*!< Min enumerator value of TASKS_TRIGGER field.                  */
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Max (0x1UL) /*!< Max enumerator value of TASKS_TRIGGER field.                  */
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Trigger (0x1UL) /*!< Trigger task                                              */


