adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TRIGGERED27 @Bit 27 : Write '1' to enable interrupt for event TRIGGERED[27] */
  #define BELLBOARD_INTENSET0_TRIGGERED27_Pos (27UL) /*!< Position of TRIGGERED27 field.                                       */
  #define BELLBOARD_INTENSET0_TRIGGERED27_Msk (0x1UL << BELLBOARD_INTENSET0_TRIGGERED27_Pos) /*!< Bit mask of TRIGGERED27
                                                                            field.*/                                              
  #define BELLBOARD_INTENSET0_TRIGGERED27_Min (0x0UL) /*!< Min enumerator value of TRIGGERED27 field.                          */
  #define BELLBOARD_INTENSET0_TRIGGERED27_Max (0x1UL) /*!< Max enumerator value of TRIGGERED27 field.                          */
  #define BELLBOARD_INTENSET0_TRIGGERED27_Set (0x1UL) /*!< Enable                                                              */
  #define BELLBOARD_INTENSET0_TRIGGERED27_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENSET0_TRIGGERED27_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED28 @Bit 28 : Write '1' to enable interrupt for event TRIGGERED[28] */
  #define BELLBOARD_INTENSET0_TRIGGERED28_Pos (28UL) /*!< Position of TRIGGERED28 field.                                       */
  #define BELLBOARD_INTENSET0_TRIGGERED28_Msk (0x1UL << BELLBOARD_INTENSET0_TRIGGERED28_Pos) /*!< Bit mask of TRIGGERED28
                                                                            field.*/                                              
  #define BELLBOARD_INTENSET0_TRIGGERED28_Min (0x0UL) /*!< Min enumerator value of TRIGGERED28 field.                          */
  #define BELLBOARD_INTENSET0_TRIGGERED28_Max (0x1UL) /*!< Max enumerator value of TRIGGERED28 field.                          */
  #define BELLBOARD_INTENSET0_TRIGGERED28_Set (0x1UL) /*!< Enable                                                              */
  #define BELLBOARD_INTENSET0_TRIGGERED28_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENSET0_TRIGGERED28_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED29 @Bit 29 : Write '1' to enable interrupt for event TRIGGERED[29] */
  #define BELLBOARD_INTENSET0_TRIGGERED29_Pos (29UL) /*!< Position of TRIGGERED29 field.                                       */
  #define BELLBOARD_INTENSET0_TRIGGERED29_Msk (0x1UL << BELLBOARD_INTENSET0_TRIGGERED29_Pos) /*!< Bit mask of TRIGGERED29
                                                                            field.*/                                              
  #define BELLBOARD_INTENSET0_TRIGGERED29_Min (0x0UL) /*!< Min enumerator value of TRIGGERED29 field.                          */
  #define BELLBOARD_INTENSET0_TRIGGERED29_Max (0x1UL) /*!< Max enumerator value of TRIGGERED29 field.                          */
  #define BELLBOARD_INTENSET0_TRIGGERED29_Set (0x1UL) /*!< Enable                                                              */
  #define BELLBOARD_INTENSET0_TRIGGERED29_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENSET0_TRIGGERED29_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED30 @Bit 30 : Write '1' to enable interrupt for event TRIGGERED[30] */
  #define BELLBOARD_INTENSET0_TRIGGERED30_Pos (30UL) /*!< Position of TRIGGERED30 field.                                       */
  #define BELLBOARD_INTENSET0_TRIGGERED30_Msk (0x1UL << BELLBOARD_INTENSET0_TRIGGERED30_Pos) /*!< Bit mask of TRIGGERED30
                                                                            field.*/                                              
  #define BELLBOARD_INTENSET0_TRIGGERED30_Min (0x0UL) /*!< Min enumerator value of TRIGGERED30 field.                          */
  #define BELLBOARD_INTENSET0_TRIGGERED30_Max (0x1UL) /*!< Max enumerator value of TRIGGERED30 field.                          */
  #define BELLBOARD_INTENSET0_TRIGGERED30_Set (0x1UL) /*!< Enable                                                              */
  #define BELLBOARD_INTENSET0_TRIGGERED30_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENSET0_TRIGGERED30_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED31 @Bit 31 : Write '1' to enable interrupt for event TRIGGERED[31] */
  #define BELLBOARD_INTENSET0_TRIGGERED31_Pos (31UL) /*!< Position of TRIGGERED31 field.                                       */
  #define BELLBOARD_INTENSET0_TRIGGERED31_Msk (0x1UL << BELLBOARD_INTENSET0_TRIGGERED31_Pos) /*!< Bit mask of TRIGGERED31
                                                                            field.*/                                              
  #define BELLBOARD_INTENSET0_TRIGGERED31_Min (0x0UL) /*!< Min enumerator value of TRIGGERED31 field.                          */
  #define BELLBOARD_INTENSET0_TRIGGERED31_Max (0x1UL) /*!< Max enumerator value of TRIGGERED31 field.                          */
  #define BELLBOARD_INTENSET0_TRIGGERED31_Set (0x1UL) /*!< Enable                                                              */
  #define BELLBOARD_INTENSET0_TRIGGERED31_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENSET0_TRIGGERED31_Enabled (0x1UL) /*!< Read: Enabled                                                   */


/* BELLBOARD_INTENCLR0: Disable interrupt */
  #define BELLBOARD_INTENCLR0_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR0 register.                                */

/* TRIGGERED0 @Bit 0 : Write '1' to disable interrupt for event TRIGGERED[0] */
  #define BELLBOARD_INTENCLR0_TRIGGERED0_Pos (0UL)   /*!< Position of TRIGGERED0 field.                                        */
  #define BELLBOARD_INTENCLR0_TRIGGERED0_Msk (0x1UL << BELLBOARD_INTENCLR0_TRIGGERED0_Pos) /*!< Bit mask of TRIGGERED0 field.  */
  #define BELLBOARD_INTENCLR0_TRIGGERED0_Min (0x0UL) /*!< Min enumerator value of TRIGGERED0 field.                            */
  #define BELLBOARD_INTENCLR0_TRIGGERED0_Max (0x1UL) /*!< Max enumerator value of TRIGGERED0 field.                            */
  #define BELLBOARD_INTENCLR0_TRIGGERED0_Clear (0x1UL) /*!< Disable                                                            */
  #define BELLBOARD_INTENCLR0_TRIGGERED0_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENCLR0_TRIGGERED0_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED1 @Bit 1 : Write '1' to disable interrupt for event TRIGGERED[1] */
  #define BELLBOARD_INTENCLR0_TRIGGERED1_Pos (1UL)   /*!< Position of TRIGGERED1 field.                                        */
  #define BELLBOARD_INTENCLR0_TRIGGERED1_Msk (0x1UL << BELLBOARD_INTENCLR0_TRIGGERED1_Pos) /*!< Bit mask of TRIGGERED1 field.  */
  #define BELLBOARD_INTENCLR0_TRIGGERED1_Min (0x0UL) /*!< Min enumerator value of TRIGGERED1 field.                            */
  #define BELLBOARD_INTENCLR0_TRIGGERED1_Max (0x1UL) /*!< Max enumerator value of TRIGGERED1 field.                            */
  #define BELLBOARD_INTENCLR0_TRIGGERED1_Clear (0x1UL) /*!< Disable                                                            */
  #define BELLBOARD_INTENCLR0_TRIGGERED1_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENCLR0_TRIGGERED1_Enabled (0x1UL) /*!< Read: Enabled                                                    */

