adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TRIGGERED4 @Bit 4 : Read pending status of interrupt for event TRIGGERED[4] */
  #define BELLBOARD_INTPEND0_TRIGGERED4_Pos (4UL)    /*!< Position of TRIGGERED4 field.                                        */
  #define BELLBOARD_INTPEND0_TRIGGERED4_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED4_Pos) /*!< Bit mask of TRIGGERED4 field.    */
  #define BELLBOARD_INTPEND0_TRIGGERED4_Min (0x0UL)  /*!< Min enumerator value of TRIGGERED4 field.                            */
  #define BELLBOARD_INTPEND0_TRIGGERED4_Max (0x1UL)  /*!< Max enumerator value of TRIGGERED4 field.                            */
  #define BELLBOARD_INTPEND0_TRIGGERED4_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define BELLBOARD_INTPEND0_TRIGGERED4_Pending (0x1UL) /*!< Read: Pending                                                     */

/* TRIGGERED5 @Bit 5 : Read pending status of interrupt for event TRIGGERED[5] */
  #define BELLBOARD_INTPEND0_TRIGGERED5_Pos (5UL)    /*!< Position of TRIGGERED5 field.                                        */
  #define BELLBOARD_INTPEND0_TRIGGERED5_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED5_Pos) /*!< Bit mask of TRIGGERED5 field.    */
  #define BELLBOARD_INTPEND0_TRIGGERED5_Min (0x0UL)  /*!< Min enumerator value of TRIGGERED5 field.                            */
  #define BELLBOARD_INTPEND0_TRIGGERED5_Max (0x1UL)  /*!< Max enumerator value of TRIGGERED5 field.                            */
  #define BELLBOARD_INTPEND0_TRIGGERED5_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define BELLBOARD_INTPEND0_TRIGGERED5_Pending (0x1UL) /*!< Read: Pending                                                     */

/* TRIGGERED6 @Bit 6 : Read pending status of interrupt for event TRIGGERED[6] */
  #define BELLBOARD_INTPEND0_TRIGGERED6_Pos (6UL)    /*!< Position of TRIGGERED6 field.                                        */
  #define BELLBOARD_INTPEND0_TRIGGERED6_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED6_Pos) /*!< Bit mask of TRIGGERED6 field.    */
  #define BELLBOARD_INTPEND0_TRIGGERED6_Min (0x0UL)  /*!< Min enumerator value of TRIGGERED6 field.                            */
  #define BELLBOARD_INTPEND0_TRIGGERED6_Max (0x1UL)  /*!< Max enumerator value of TRIGGERED6 field.                            */
  #define BELLBOARD_INTPEND0_TRIGGERED6_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define BELLBOARD_INTPEND0_TRIGGERED6_Pending (0x1UL) /*!< Read: Pending                                                     */

/* TRIGGERED7 @Bit 7 : Read pending status of interrupt for event TRIGGERED[7] */
  #define BELLBOARD_INTPEND0_TRIGGERED7_Pos (7UL)    /*!< Position of TRIGGERED7 field.                                        */
  #define BELLBOARD_INTPEND0_TRIGGERED7_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED7_Pos) /*!< Bit mask of TRIGGERED7 field.    */
  #define BELLBOARD_INTPEND0_TRIGGERED7_Min (0x0UL)  /*!< Min enumerator value of TRIGGERED7 field.                            */
  #define BELLBOARD_INTPEND0_TRIGGERED7_Max (0x1UL)  /*!< Max enumerator value of TRIGGERED7 field.                            */
  #define BELLBOARD_INTPEND0_TRIGGERED7_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define BELLBOARD_INTPEND0_TRIGGERED7_Pending (0x1UL) /*!< Read: Pending                                                     */

/* TRIGGERED8 @Bit 8 : Read pending status of interrupt for event TRIGGERED[8] */
  #define BELLBOARD_INTPEND0_TRIGGERED8_Pos (8UL)    /*!< Position of TRIGGERED8 field.                                        */
  #define BELLBOARD_INTPEND0_TRIGGERED8_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED8_Pos) /*!< Bit mask of TRIGGERED8 field.    */
  #define BELLBOARD_INTPEND0_TRIGGERED8_Min (0x0UL)  /*!< Min enumerator value of TRIGGERED8 field.                            */
  #define BELLBOARD_INTPEND0_TRIGGERED8_Max (0x1UL)  /*!< Max enumerator value of TRIGGERED8 field.                            */
  #define BELLBOARD_INTPEND0_TRIGGERED8_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define BELLBOARD_INTPEND0_TRIGGERED8_Pending (0x1UL) /*!< Read: Pending                                                     */

/* TRIGGERED9 @Bit 9 : Read pending status of interrupt for event TRIGGERED[9] */
  #define BELLBOARD_INTPEND0_TRIGGERED9_Pos (9UL)    /*!< Position of TRIGGERED9 field.                                        */
  #define BELLBOARD_INTPEND0_TRIGGERED9_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED9_Pos) /*!< Bit mask of TRIGGERED9 field.    */
  #define BELLBOARD_INTPEND0_TRIGGERED9_Min (0x0UL)  /*!< Min enumerator value of TRIGGERED9 field.                            */
  #define BELLBOARD_INTPEND0_TRIGGERED9_Max (0x1UL)  /*!< Max enumerator value of TRIGGERED9 field.                            */
  #define BELLBOARD_INTPEND0_TRIGGERED9_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define BELLBOARD_INTPEND0_TRIGGERED9_Pending (0x1UL) /*!< Read: Pending                                                     */

/* TRIGGERED10 @Bit 10 : Read pending status of interrupt for event TRIGGERED[10] */
  #define BELLBOARD_INTPEND0_TRIGGERED10_Pos (10UL)  /*!< Position of TRIGGERED10 field.                                       */
  #define BELLBOARD_INTPEND0_TRIGGERED10_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED10_Pos) /*!< Bit mask of TRIGGERED10 field. */
  #define BELLBOARD_INTPEND0_TRIGGERED10_Min (0x0UL) /*!< Min enumerator value of TRIGGERED10 field.                           */
  #define BELLBOARD_INTPEND0_TRIGGERED10_Max (0x1UL) /*!< Max enumerator value of TRIGGERED10 field.                           */
  #define BELLBOARD_INTPEND0_TRIGGERED10_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND0_TRIGGERED10_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED11 @Bit 11 : Read pending status of interrupt for event TRIGGERED[11] */
  #define BELLBOARD_INTPEND0_TRIGGERED11_Pos (11UL)  /*!< Position of TRIGGERED11 field.                                       */
  #define BELLBOARD_INTPEND0_TRIGGERED11_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED11_Pos) /*!< Bit mask of TRIGGERED11 field. */
  #define BELLBOARD_INTPEND0_TRIGGERED11_Min (0x0UL) /*!< Min enumerator value of TRIGGERED11 field.                           */
  #define BELLBOARD_INTPEND0_TRIGGERED11_Max (0x1UL) /*!< Max enumerator value of TRIGGERED11 field.                           */
  #define BELLBOARD_INTPEND0_TRIGGERED11_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND0_TRIGGERED11_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED12 @Bit 12 : Read pending status of interrupt for event TRIGGERED[12] */
  #define BELLBOARD_INTPEND0_TRIGGERED12_Pos (12UL)  /*!< Position of TRIGGERED12 field.                                       */
  #define BELLBOARD_INTPEND0_TRIGGERED12_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED12_Pos) /*!< Bit mask of TRIGGERED12 field. */
  #define BELLBOARD_INTPEND0_TRIGGERED12_Min (0x0UL) /*!< Min enumerator value of TRIGGERED12 field.                           */
  #define BELLBOARD_INTPEND0_TRIGGERED12_Max (0x1UL) /*!< Max enumerator value of TRIGGERED12 field.                           */
  #define BELLBOARD_INTPEND0_TRIGGERED12_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND0_TRIGGERED12_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED13 @Bit 13 : Read pending status of interrupt for event TRIGGERED[13] */
  #define BELLBOARD_INTPEND0_TRIGGERED13_Pos (13UL)  /*!< Position of TRIGGERED13 field.                                       */
  #define BELLBOARD_INTPEND0_TRIGGERED13_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED13_Pos) /*!< Bit mask of TRIGGERED13 field. */
  #define BELLBOARD_INTPEND0_TRIGGERED13_Min (0x0UL) /*!< Min enumerator value of TRIGGERED13 field.                           */
  #define BELLBOARD_INTPEND0_TRIGGERED13_Max (0x1UL) /*!< Max enumerator value of TRIGGERED13 field.                           */
  #define BELLBOARD_INTPEND0_TRIGGERED13_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND0_TRIGGERED13_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED14 @Bit 14 : Read pending status of interrupt for event TRIGGERED[14] */
  #define BELLBOARD_INTPEND0_TRIGGERED14_Pos (14UL)  /*!< Position of TRIGGERED14 field.                                       */
  #define BELLBOARD_INTPEND0_TRIGGERED14_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED14_Pos) /*!< Bit mask of TRIGGERED14 field. */
  #define BELLBOARD_INTPEND0_TRIGGERED14_Min (0x0UL) /*!< Min enumerator value of TRIGGERED14 field.                           */
  #define BELLBOARD_INTPEND0_TRIGGERED14_Max (0x1UL) /*!< Max enumerator value of TRIGGERED14 field.                           */
  #define BELLBOARD_INTPEND0_TRIGGERED14_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND0_TRIGGERED14_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED15 @Bit 15 : Read pending status of interrupt for event TRIGGERED[15] */
  #define BELLBOARD_INTPEND0_TRIGGERED15_Pos (15UL)  /*!< Position of TRIGGERED15 field.                                       */
  #define BELLBOARD_INTPEND0_TRIGGERED15_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED15_Pos) /*!< Bit mask of TRIGGERED15 field. */
  #define BELLBOARD_INTPEND0_TRIGGERED15_Min (0x0UL) /*!< Min enumerator value of TRIGGERED15 field.                           */
  #define BELLBOARD_INTPEND0_TRIGGERED15_Max (0x1UL) /*!< Max enumerator value of TRIGGERED15 field.                           */
  #define BELLBOARD_INTPEND0_TRIGGERED15_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND0_TRIGGERED15_Pending (0x1UL) /*!< Read: Pending                                                    */

