adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TRIGGERED24 @Bit 24 : Read pending status of interrupt for event TRIGGERED[24] */
  #define BELLBOARD_INTPEND3_TRIGGERED24_Pos (24UL)  /*!< Position of TRIGGERED24 field.                                       */
  #define BELLBOARD_INTPEND3_TRIGGERED24_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED24_Pos) /*!< Bit mask of TRIGGERED24 field. */
  #define BELLBOARD_INTPEND3_TRIGGERED24_Min (0x0UL) /*!< Min enumerator value of TRIGGERED24 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED24_Max (0x1UL) /*!< Max enumerator value of TRIGGERED24 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED24_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND3_TRIGGERED24_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED25 @Bit 25 : Read pending status of interrupt for event TRIGGERED[25] */
  #define BELLBOARD_INTPEND3_TRIGGERED25_Pos (25UL)  /*!< Position of TRIGGERED25 field.                                       */
  #define BELLBOARD_INTPEND3_TRIGGERED25_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED25_Pos) /*!< Bit mask of TRIGGERED25 field. */
  #define BELLBOARD_INTPEND3_TRIGGERED25_Min (0x0UL) /*!< Min enumerator value of TRIGGERED25 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED25_Max (0x1UL) /*!< Max enumerator value of TRIGGERED25 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED25_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND3_TRIGGERED25_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED26 @Bit 26 : Read pending status of interrupt for event TRIGGERED[26] */
  #define BELLBOARD_INTPEND3_TRIGGERED26_Pos (26UL)  /*!< Position of TRIGGERED26 field.                                       */
  #define BELLBOARD_INTPEND3_TRIGGERED26_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED26_Pos) /*!< Bit mask of TRIGGERED26 field. */
  #define BELLBOARD_INTPEND3_TRIGGERED26_Min (0x0UL) /*!< Min enumerator value of TRIGGERED26 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED26_Max (0x1UL) /*!< Max enumerator value of TRIGGERED26 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED26_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND3_TRIGGERED26_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED27 @Bit 27 : Read pending status of interrupt for event TRIGGERED[27] */
  #define BELLBOARD_INTPEND3_TRIGGERED27_Pos (27UL)  /*!< Position of TRIGGERED27 field.                                       */
  #define BELLBOARD_INTPEND3_TRIGGERED27_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED27_Pos) /*!< Bit mask of TRIGGERED27 field. */
  #define BELLBOARD_INTPEND3_TRIGGERED27_Min (0x0UL) /*!< Min enumerator value of TRIGGERED27 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED27_Max (0x1UL) /*!< Max enumerator value of TRIGGERED27 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED27_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND3_TRIGGERED27_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED28 @Bit 28 : Read pending status of interrupt for event TRIGGERED[28] */
  #define BELLBOARD_INTPEND3_TRIGGERED28_Pos (28UL)  /*!< Position of TRIGGERED28 field.                                       */
  #define BELLBOARD_INTPEND3_TRIGGERED28_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED28_Pos) /*!< Bit mask of TRIGGERED28 field. */
  #define BELLBOARD_INTPEND3_TRIGGERED28_Min (0x0UL) /*!< Min enumerator value of TRIGGERED28 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED28_Max (0x1UL) /*!< Max enumerator value of TRIGGERED28 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED28_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND3_TRIGGERED28_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED29 @Bit 29 : Read pending status of interrupt for event TRIGGERED[29] */
  #define BELLBOARD_INTPEND3_TRIGGERED29_Pos (29UL)  /*!< Position of TRIGGERED29 field.                                       */
  #define BELLBOARD_INTPEND3_TRIGGERED29_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED29_Pos) /*!< Bit mask of TRIGGERED29 field. */
  #define BELLBOARD_INTPEND3_TRIGGERED29_Min (0x0UL) /*!< Min enumerator value of TRIGGERED29 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED29_Max (0x1UL) /*!< Max enumerator value of TRIGGERED29 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED29_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND3_TRIGGERED29_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED30 @Bit 30 : Read pending status of interrupt for event TRIGGERED[30] */
  #define BELLBOARD_INTPEND3_TRIGGERED30_Pos (30UL)  /*!< Position of TRIGGERED30 field.                                       */
  #define BELLBOARD_INTPEND3_TRIGGERED30_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED30_Pos) /*!< Bit mask of TRIGGERED30 field. */
  #define BELLBOARD_INTPEND3_TRIGGERED30_Min (0x0UL) /*!< Min enumerator value of TRIGGERED30 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED30_Max (0x1UL) /*!< Max enumerator value of TRIGGERED30 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED30_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND3_TRIGGERED30_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED31 @Bit 31 : Read pending status of interrupt for event TRIGGERED[31] */
  #define BELLBOARD_INTPEND3_TRIGGERED31_Pos (31UL)  /*!< Position of TRIGGERED31 field.                                       */
  #define BELLBOARD_INTPEND3_TRIGGERED31_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED31_Pos) /*!< Bit mask of TRIGGERED31 field. */
  #define BELLBOARD_INTPEND3_TRIGGERED31_Min (0x0UL) /*!< Min enumerator value of TRIGGERED31 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED31_Max (0x1UL) /*!< Max enumerator value of TRIGGERED31 field.                           */
  #define BELLBOARD_INTPEND3_TRIGGERED31_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND3_TRIGGERED31_Pending (0x1UL) /*!< Read: Pending                                                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           BICR                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct BICR_POWER ==================================================== */
/**
  * @brief POWER [BICR_POWER] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) Power configuration of power rails.                   */
  __IOM uint32_t  IOPORT;                            /*!< (@ 0x00000004) Power configuration of IO ports.                      */
  __IOM uint32_t  MISPROT[2];                        /*!< (@ 0x00000008) Misconfiguration protection for power configuration.
                                                                         Whenever chaning any register in the POWER group, these
                                                                         registers MUST be written to 0xFFFFFFFF to indicate the
                                                                         system to perform the misconfiguration protection
                                                                         sequence.*/                                              
  __IM  uint32_t  RESERVED;
} NRF_BICR_POWER_Type;                               /*!< Size = 20 (0x014)                                                    */

/* BICR_POWER_CONFIG: Power configuration of power rails. */
  #define BICR_POWER_CONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONFIG register.                                     */

