adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VDDAO1V8 @Bits 0..3 : VDD_AO_1V8 power configuration. */
  #define BICR_POWER_CONFIG_VDDAO1V8_Pos (0UL)       /*!< Position of VDDAO1V8 field.                                          */
  #define BICR_POWER_CONFIG_VDDAO1V8_Msk (0xFUL << BICR_POWER_CONFIG_VDDAO1V8_Pos) /*!< Bit mask of VDDAO1V8 field.            */
  #define BICR_POWER_CONFIG_VDDAO1V8_Min (0x0UL)     /*!< Min enumerator value of VDDAO1V8 field.                              */
  #define BICR_POWER_CONFIG_VDDAO1V8_Max (0xFUL)     /*!< Max enumerator value of VDDAO1V8 field.                              */
  #define BICR_POWER_CONFIG_VDDAO1V8_Unconfigured (0xFUL) /*!< Power rail is unconfigured.                                     */
  #define BICR_POWER_CONFIG_VDDAO1V8_Internal (0x0UL) /*!< Power rail is configured to use the internal regulator.             */
  #define BICR_POWER_CONFIG_VDDAO1V8_External (0x1UL) /*!< Power rail is configured to be externally powered.                  */

/* VDD1V0 @Bits 4..7 : VDD_1V0 power configuration. */
  #define BICR_POWER_CONFIG_VDD1V0_Pos (4UL)         /*!< Position of VDD1V0 field.                                            */
  #define BICR_POWER_CONFIG_VDD1V0_Msk (0xFUL << BICR_POWER_CONFIG_VDD1V0_Pos) /*!< Bit mask of VDD1V0 field.                  */
  #define BICR_POWER_CONFIG_VDD1V0_Min (0x0UL)       /*!< Min enumerator value of VDD1V0 field.                                */
  #define BICR_POWER_CONFIG_VDD1V0_Max (0xFUL)       /*!< Max enumerator value of VDD1V0 field.                                */
  #define BICR_POWER_CONFIG_VDD1V0_Unconfigured (0xFUL) /*!< Power rail is unconfigured.                                       */
  #define BICR_POWER_CONFIG_VDD1V0_Internal (0x0UL)  /*!< Power rail is configured to use the internal regulator.              */
  #define BICR_POWER_CONFIG_VDD1V0_External (0x1UL)  /*!< Power rail is configured to be externally powered.                   */

/* VDDRF1V0 @Bits 8..11 : VDD_RF_1V0 power configuration. */
  #define BICR_POWER_CONFIG_VDDRF1V0_Pos (8UL)       /*!< Position of VDDRF1V0 field.                                          */
  #define BICR_POWER_CONFIG_VDDRF1V0_Msk (0xFUL << BICR_POWER_CONFIG_VDDRF1V0_Pos) /*!< Bit mask of VDDRF1V0 field.            */
  #define BICR_POWER_CONFIG_VDDRF1V0_Min (0x1UL)     /*!< Min enumerator value of VDDRF1V0 field.                              */
  #define BICR_POWER_CONFIG_VDDRF1V0_Max (0xFUL)     /*!< Max enumerator value of VDDRF1V0 field.                              */
  #define BICR_POWER_CONFIG_VDDRF1V0_Unconfigured (0xFUL) /*!< Power rail is unconfigured.                                     */
  #define BICR_POWER_CONFIG_VDDRF1V0_External (0x1UL) /*!< Power rail is configured to be externally powered.                  */
  #define BICR_POWER_CONFIG_VDDRF1V0_Shorted (0x2UL) /*!< Power rail is shorted to VDD_1V0.                                    */

/* VDDAO0V8 @Bits 12..15 : VDD_AO_0V8 power configuration. */
  #define BICR_POWER_CONFIG_VDDAO0V8_Pos (12UL)      /*!< Position of VDDAO0V8 field.                                          */
  #define BICR_POWER_CONFIG_VDDAO0V8_Msk (0xFUL << BICR_POWER_CONFIG_VDDAO0V8_Pos) /*!< Bit mask of VDDAO0V8 field.            */
  #define BICR_POWER_CONFIG_VDDAO0V8_Min (0x0UL)     /*!< Min enumerator value of VDDAO0V8 field.                              */
  #define BICR_POWER_CONFIG_VDDAO0V8_Max (0xFUL)     /*!< Max enumerator value of VDDAO0V8 field.                              */
  #define BICR_POWER_CONFIG_VDDAO0V8_Unconfigured (0xFUL) /*!< Power rail is unconfigured.                                     */
  #define BICR_POWER_CONFIG_VDDAO0V8_Internal (0x0UL) /*!< Power rail is configured to use the internal regulator.             */
  #define BICR_POWER_CONFIG_VDDAO0V8_External (0x1UL) /*!< Power rail is configured to be externally powered.                  */

/* VDDVS0V8 @Bits 16..19 : VDD_VS_0V8 power configuration. */
  #define BICR_POWER_CONFIG_VDDVS0V8_Pos (16UL)      /*!< Position of VDDVS0V8 field.                                          */
  #define BICR_POWER_CONFIG_VDDVS0V8_Msk (0xFUL << BICR_POWER_CONFIG_VDDVS0V8_Pos) /*!< Bit mask of VDDVS0V8 field.            */
  #define BICR_POWER_CONFIG_VDDVS0V8_Min (0x0UL)     /*!< Min enumerator value of VDDVS0V8 field.                              */
  #define BICR_POWER_CONFIG_VDDVS0V8_Max (0xFUL)     /*!< Max enumerator value of VDDVS0V8 field.                              */
  #define BICR_POWER_CONFIG_VDDVS0V8_Unconfigured (0xFUL) /*!< Power rail is unconfigured.                                     */
  #define BICR_POWER_CONFIG_VDDVS0V8_Internal (0x0UL) /*!< Power rail is configured to use the internal regulator.             */
  #define BICR_POWER_CONFIG_VDDVS0V8_External (0x1UL) /*!< Power rail is configured to be externally powered.                  */

/* INDUCTOR @Bit 31 : DC/DC inductor presence. */
  #define BICR_POWER_CONFIG_INDUCTOR_Pos (31UL)      /*!< Position of INDUCTOR field.                                          */
  #define BICR_POWER_CONFIG_INDUCTOR_Msk (0x1UL << BICR_POWER_CONFIG_INDUCTOR_Pos) /*!< Bit mask of INDUCTOR field.            */
  #define BICR_POWER_CONFIG_INDUCTOR_Min (0x0UL)     /*!< Min enumerator value of INDUCTOR field.                              */
  #define BICR_POWER_CONFIG_INDUCTOR_Max (0x1UL)     /*!< Max enumerator value of INDUCTOR field.                              */
  #define BICR_POWER_CONFIG_INDUCTOR_NotPresent (0x1UL) /*!< DC/DC inductor is not present.                                    */
  #define BICR_POWER_CONFIG_INDUCTOR_Present (0x0UL) /*!< DC/DC inductor is present.                                           */


/* BICR_POWER_IOPORT: Power configuration of IO ports. */
  #define BICR_POWER_IOPORT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of IOPORT register.                                     */

/* P0 @Bits 0..1 : P0 power configuration. */
  #define BICR_POWER_IOPORT_P0_Pos (0UL)             /*!< Position of P0 field.                                                */
  #define BICR_POWER_IOPORT_P0_Msk (0x3UL << BICR_POWER_IOPORT_P0_Pos) /*!< Bit mask of P0 field.                              */
  #define BICR_POWER_IOPORT_P0_Min (0x0UL)           /*!< Min enumerator value of P0 field.                                    */
  #define BICR_POWER_IOPORT_P0_Max (0x3UL)           /*!< Max enumerator value of P0 field.                                    */
  #define BICR_POWER_IOPORT_P0_Unconfigured (0x3UL)  /*!< Port supply is unconfigured.                                         */
  #define BICR_POWER_IOPORT_P0_Disconnected (0x0UL)  /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_POWER_IOPORT_P0_External (0x1UL)      /*!< Port supply is provided externally.                                  */
  #define BICR_POWER_IOPORT_P0_Shorted (0x2UL)       /*!< Port supply is shorted to VDD_AO_1V8.                                */

/* P1 @Bits 2..3 : P1 power configuration. */
  #define BICR_POWER_IOPORT_P1_Pos (2UL)             /*!< Position of P1 field.                                                */
  #define BICR_POWER_IOPORT_P1_Msk (0x3UL << BICR_POWER_IOPORT_P1_Pos) /*!< Bit mask of P1 field.                              */
  #define BICR_POWER_IOPORT_P1_Min (0x0UL)           /*!< Min enumerator value of P1 field.                                    */
  #define BICR_POWER_IOPORT_P1_Max (0x3UL)           /*!< Max enumerator value of P1 field.                                    */
  #define BICR_POWER_IOPORT_P1_Unconfigured (0x3UL)  /*!< Port supply is unconfigured.                                         */
  #define BICR_POWER_IOPORT_P1_Disconnected (0x0UL)  /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_POWER_IOPORT_P1_External (0x1UL)      /*!< Port supply is provided externally.                                  */
  #define BICR_POWER_IOPORT_P1_Shorted (0x2UL)       /*!< Port supply is shorted to VDD_AO_1V8.                                */

