adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* P2 @Bits 4..5 : P2 power configuration. */
  #define BICR_POWER_IOPORT_P2_Pos (4UL)             /*!< Position of P2 field.                                                */
  #define BICR_POWER_IOPORT_P2_Msk (0x3UL << BICR_POWER_IOPORT_P2_Pos) /*!< Bit mask of P2 field.                              */
  #define BICR_POWER_IOPORT_P2_Min (0x0UL)           /*!< Min enumerator value of P2 field.                                    */
  #define BICR_POWER_IOPORT_P2_Max (0x3UL)           /*!< Max enumerator value of P2 field.                                    */
  #define BICR_POWER_IOPORT_P2_Unconfigured (0x3UL)  /*!< Port supply is unconfigured.                                         */
  #define BICR_POWER_IOPORT_P2_Disconnected (0x0UL)  /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_POWER_IOPORT_P2_External (0x1UL)      /*!< Port supply is provided externally.                                  */
  #define BICR_POWER_IOPORT_P2_Shorted (0x2UL)       /*!< Port supply is shorted to VDD_AO_1V8.                                */

/* P3 @Bits 6..7 : P3 power configuration. */
  #define BICR_POWER_IOPORT_P3_Pos (6UL)             /*!< Position of P3 field.                                                */
  #define BICR_POWER_IOPORT_P3_Msk (0x3UL << BICR_POWER_IOPORT_P3_Pos) /*!< Bit mask of P3 field.                              */
  #define BICR_POWER_IOPORT_P3_Min (0x0UL)           /*!< Min enumerator value of P3 field.                                    */
  #define BICR_POWER_IOPORT_P3_Max (0x3UL)           /*!< Max enumerator value of P3 field.                                    */
  #define BICR_POWER_IOPORT_P3_Unconfigured (0x3UL)  /*!< Port supply is unconfigured.                                         */
  #define BICR_POWER_IOPORT_P3_Disconnected (0x0UL)  /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_POWER_IOPORT_P3_External (0x1UL)      /*!< Port supply is provided externally.                                  */
  #define BICR_POWER_IOPORT_P3_Shorted (0x2UL)       /*!< Port supply is shorted to VDD_AO_1V8.                                */

/* P4 @Bits 8..9 : P4 power configuration. */
  #define BICR_POWER_IOPORT_P4_Pos (8UL)             /*!< Position of P4 field.                                                */
  #define BICR_POWER_IOPORT_P4_Msk (0x3UL << BICR_POWER_IOPORT_P4_Pos) /*!< Bit mask of P4 field.                              */
  #define BICR_POWER_IOPORT_P4_Min (0x0UL)           /*!< Min enumerator value of P4 field.                                    */
  #define BICR_POWER_IOPORT_P4_Max (0x3UL)           /*!< Max enumerator value of P4 field.                                    */
  #define BICR_POWER_IOPORT_P4_Unconfigured (0x3UL)  /*!< Port supply is unconfigured.                                         */
  #define BICR_POWER_IOPORT_P4_Disconnected (0x0UL)  /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_POWER_IOPORT_P4_External (0x1UL)      /*!< Port supply is provided externally.                                  */
  #define BICR_POWER_IOPORT_P4_Shorted (0x2UL)       /*!< Port supply is shorted to VDD_AO_1V8.                                */

/* P5 @Bits 10..11 : P5 power configuration. */
  #define BICR_POWER_IOPORT_P5_Pos (10UL)            /*!< Position of P5 field.                                                */
  #define BICR_POWER_IOPORT_P5_Msk (0x3UL << BICR_POWER_IOPORT_P5_Pos) /*!< Bit mask of P5 field.                              */
  #define BICR_POWER_IOPORT_P5_Min (0x0UL)           /*!< Min enumerator value of P5 field.                                    */
  #define BICR_POWER_IOPORT_P5_Max (0x3UL)           /*!< Max enumerator value of P5 field.                                    */
  #define BICR_POWER_IOPORT_P5_Unconfigured (0x3UL)  /*!< Port supply is unconfigured.                                         */
  #define BICR_POWER_IOPORT_P5_Disconnected (0x0UL)  /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_POWER_IOPORT_P5_External (0x1UL)      /*!< Port supply is provided externally.                                  */
  #define BICR_POWER_IOPORT_P5_Shorted (0x2UL)       /*!< Port supply is shorted to VDD_AO_1V8.                                */

/* P6 @Bits 12..13 : P6 power configuration. */
  #define BICR_POWER_IOPORT_P6_Pos (12UL)            /*!< Position of P6 field.                                                */
  #define BICR_POWER_IOPORT_P6_Msk (0x3UL << BICR_POWER_IOPORT_P6_Pos) /*!< Bit mask of P6 field.                              */
  #define BICR_POWER_IOPORT_P6_Min (0x0UL)           /*!< Min enumerator value of P6 field.                                    */
  #define BICR_POWER_IOPORT_P6_Max (0x3UL)           /*!< Max enumerator value of P6 field.                                    */
  #define BICR_POWER_IOPORT_P6_Unconfigured (0x3UL)  /*!< Port supply is unconfigured.                                         */
  #define BICR_POWER_IOPORT_P6_Disconnected (0x0UL)  /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_POWER_IOPORT_P6_External (0x1UL)      /*!< Port supply is provided externally.                                  */
  #define BICR_POWER_IOPORT_P6_Shorted (0x2UL)       /*!< Port supply is shorted to VDD_AO_1V8.                                */

/* P7 @Bits 14..15 : P7 power configuration. */
  #define BICR_POWER_IOPORT_P7_Pos (14UL)            /*!< Position of P7 field.                                                */
  #define BICR_POWER_IOPORT_P7_Msk (0x3UL << BICR_POWER_IOPORT_P7_Pos) /*!< Bit mask of P7 field.                              */
  #define BICR_POWER_IOPORT_P7_Min (0x0UL)           /*!< Min enumerator value of P7 field.                                    */
  #define BICR_POWER_IOPORT_P7_Max (0x3UL)           /*!< Max enumerator value of P7 field.                                    */
  #define BICR_POWER_IOPORT_P7_Unconfigured (0x3UL)  /*!< Port supply is unconfigured.                                         */
  #define BICR_POWER_IOPORT_P7_Disconnected (0x0UL)  /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_POWER_IOPORT_P7_External (0x1UL)      /*!< Port supply is provided externally.                                  */
  #define BICR_POWER_IOPORT_P7_Shorted (0x2UL)       /*!< Port supply is shorted to VDD_AO_1V8.                                */

/* P8 @Bits 16..17 : P8 power configuration. */
  #define BICR_POWER_IOPORT_P8_Pos (16UL)            /*!< Position of P8 field.                                                */
  #define BICR_POWER_IOPORT_P8_Msk (0x3UL << BICR_POWER_IOPORT_P8_Pos) /*!< Bit mask of P8 field.                              */
  #define BICR_POWER_IOPORT_P8_Min (0x0UL)           /*!< Min enumerator value of P8 field.                                    */
  #define BICR_POWER_IOPORT_P8_Max (0x3UL)           /*!< Max enumerator value of P8 field.                                    */
  #define BICR_POWER_IOPORT_P8_Unconfigured (0x3UL)  /*!< Port supply is unconfigured.                                         */
  #define BICR_POWER_IOPORT_P8_Disconnected (0x0UL)  /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_POWER_IOPORT_P8_External (0x1UL)      /*!< Port supply is provided externally.                                  */
  #define BICR_POWER_IOPORT_P8_Shorted (0x2UL)       /*!< Port supply is shorted to VDD_AO_1V8.                                */

