adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* P9 @Bits 18..19 : P9 power configuration. */
  #define BICR_POWER_IOPORT_P9_Pos (18UL)            /*!< Position of P9 field.                                                */
  #define BICR_POWER_IOPORT_P9_Msk (0x3UL << BICR_POWER_IOPORT_P9_Pos) /*!< Bit mask of P9 field.                              */
  #define BICR_POWER_IOPORT_P9_Min (0x0UL)           /*!< Min enumerator value of P9 field.                                    */
  #define BICR_POWER_IOPORT_P9_Max (0x3UL)           /*!< Max enumerator value of P9 field.                                    */
  #define BICR_POWER_IOPORT_P9_Unconfigured (0x3UL)  /*!< Port supply is unconfigured.                                         */
  #define BICR_POWER_IOPORT_P9_Disconnected (0x0UL)  /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_POWER_IOPORT_P9_External (0x1UL)      /*!< Port supply is provided externally.                                  */
  #define BICR_POWER_IOPORT_P9_Shorted (0x2UL)       /*!< Port supply is shorted to VDD_AO_1V8.                                */

/* P10 @Bits 20..21 : P10 power configuration. */
  #define BICR_POWER_IOPORT_P10_Pos (20UL)           /*!< Position of P10 field.                                               */
  #define BICR_POWER_IOPORT_P10_Msk (0x3UL << BICR_POWER_IOPORT_P10_Pos) /*!< Bit mask of P10 field.                           */
  #define BICR_POWER_IOPORT_P10_Min (0x0UL)          /*!< Min enumerator value of P10 field.                                   */
  #define BICR_POWER_IOPORT_P10_Max (0x3UL)          /*!< Max enumerator value of P10 field.                                   */
  #define BICR_POWER_IOPORT_P10_Unconfigured (0x3UL) /*!< Port supply is unconfigured.                                         */
  #define BICR_POWER_IOPORT_P10_Disconnected (0x0UL) /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_POWER_IOPORT_P10_External (0x1UL)     /*!< Port supply is provided externally.                                  */
  #define BICR_POWER_IOPORT_P10_Shorted (0x2UL)      /*!< Port supply is shorted to VDD_AO_1V8.                                */

/* P11 @Bits 22..23 : P11 power configuration. */
  #define BICR_POWER_IOPORT_P11_Pos (22UL)           /*!< Position of P11 field.                                               */
  #define BICR_POWER_IOPORT_P11_Msk (0x3UL << BICR_POWER_IOPORT_P11_Pos) /*!< Bit mask of P11 field.                           */
  #define BICR_POWER_IOPORT_P11_Min (0x0UL)          /*!< Min enumerator value of P11 field.                                   */
  #define BICR_POWER_IOPORT_P11_Max (0x3UL)          /*!< Max enumerator value of P11 field.                                   */
  #define BICR_POWER_IOPORT_P11_Unconfigured (0x3UL) /*!< Port supply is unconfigured.                                         */
  #define BICR_POWER_IOPORT_P11_Disconnected (0x0UL) /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_POWER_IOPORT_P11_External (0x1UL)     /*!< Port supply is provided externally.                                  */
  #define BICR_POWER_IOPORT_P11_Shorted (0x2UL)      /*!< Port supply is shorted to VDD_AO_1V8.                                */

/* P12 @Bits 24..25 : P12 power configuration. */
  #define BICR_POWER_IOPORT_P12_Pos (24UL)           /*!< Position of P12 field.                                               */
  #define BICR_POWER_IOPORT_P12_Msk (0x3UL << BICR_POWER_IOPORT_P12_Pos) /*!< Bit mask of P12 field.                           */
  #define BICR_POWER_IOPORT_P12_Min (0x0UL)          /*!< Min enumerator value of P12 field.                                   */
  #define BICR_POWER_IOPORT_P12_Max (0x3UL)          /*!< Max enumerator value of P12 field.                                   */
  #define BICR_POWER_IOPORT_P12_Unconfigured (0x3UL) /*!< Port supply is unconfigured.                                         */
  #define BICR_POWER_IOPORT_P12_Disconnected (0x0UL) /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_POWER_IOPORT_P12_External (0x1UL)     /*!< Port supply is provided externally.                                  */
  #define BICR_POWER_IOPORT_P12_Shorted (0x2UL)      /*!< Port supply is shorted to VDD_AO_1V8.                                */

/* P13 @Bits 26..27 : P13 power configuration. */
  #define BICR_POWER_IOPORT_P13_Pos (26UL)           /*!< Position of P13 field.                                               */
  #define BICR_POWER_IOPORT_P13_Msk (0x3UL << BICR_POWER_IOPORT_P13_Pos) /*!< Bit mask of P13 field.                           */
  #define BICR_POWER_IOPORT_P13_Min (0x0UL)          /*!< Min enumerator value of P13 field.                                   */
  #define BICR_POWER_IOPORT_P13_Max (0x3UL)          /*!< Max enumerator value of P13 field.                                   */
  #define BICR_POWER_IOPORT_P13_Unconfigured (0x3UL) /*!< Port supply is unconfigured.                                         */
  #define BICR_POWER_IOPORT_P13_Disconnected (0x0UL) /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_POWER_IOPORT_P13_External (0x1UL)     /*!< Port supply is provided externally.                                  */
  #define BICR_POWER_IOPORT_P13_Shorted (0x2UL)      /*!< Port supply is shorted to VDD_AO_1V8.                                */

/* P14 @Bits 28..29 : P14 power configuration. */
  #define BICR_POWER_IOPORT_P14_Pos (28UL)           /*!< Position of P14 field.                                               */
  #define BICR_POWER_IOPORT_P14_Msk (0x3UL << BICR_POWER_IOPORT_P14_Pos) /*!< Bit mask of P14 field.                           */
  #define BICR_POWER_IOPORT_P14_Min (0x0UL)          /*!< Min enumerator value of P14 field.                                   */
  #define BICR_POWER_IOPORT_P14_Max (0x3UL)          /*!< Max enumerator value of P14 field.                                   */
  #define BICR_POWER_IOPORT_P14_Unconfigured (0x3UL) /*!< Port supply is unconfigured.                                         */
  #define BICR_POWER_IOPORT_P14_Disconnected (0x0UL) /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_POWER_IOPORT_P14_External (0x1UL)     /*!< Port supply is provided externally.                                  */
  #define BICR_POWER_IOPORT_P14_Shorted (0x2UL)      /*!< Port supply is shorted to VDD_AO_1V8.                                */

/* P15 @Bits 30..31 : P15 power configuration. */
  #define BICR_POWER_IOPORT_P15_Pos (30UL)           /*!< Position of P15 field.                                               */
  #define BICR_POWER_IOPORT_P15_Msk (0x3UL << BICR_POWER_IOPORT_P15_Pos) /*!< Bit mask of P15 field.                           */
  #define BICR_POWER_IOPORT_P15_Min (0x0UL)          /*!< Min enumerator value of P15 field.                                   */
  #define BICR_POWER_IOPORT_P15_Max (0x3UL)          /*!< Max enumerator value of P15 field.                                   */
  #define BICR_POWER_IOPORT_P15_Unconfigured (0x3UL) /*!< Port supply is unconfigured.                                         */
  #define BICR_POWER_IOPORT_P15_Disconnected (0x0UL) /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_POWER_IOPORT_P15_External (0x1UL)     /*!< Port supply is provided externally.                                  */
  #define BICR_POWER_IOPORT_P15_Shorted (0x2UL)      /*!< Port supply is shorted to VDD_AO_1V8.                                */


