adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* BICR_POWER_MISPROT: Misconfiguration protection for power configuration. Whenever chaning any register in the POWER group,
                        these registers MUST be written to 0xFFFFFFFF to indicate the system to perform the misconfiguration
                        protection sequence. */                                                                                   
                                                                                                                                  
  #define BICR_POWER_MISPROT_MaxCount (2UL)          /*!< Max size of MISPROT[2] array.                                        */
  #define BICR_POWER_MISPROT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of MISPROT[2] register.                                */

/* MISPROT @Bits 0..31 : (unspecified) */
  #define BICR_POWER_MISPROT_MISPROT_Pos (0UL)       /*!< Position of MISPROT field.                                           */
  #define BICR_POWER_MISPROT_MISPROT_Msk (0xFFFFFFFFUL << BICR_POWER_MISPROT_MISPROT_Pos) /*!< Bit mask of MISPROT field.      */
  #define BICR_POWER_MISPROT_MISPROT_Min (0x471B4B2AUL) /*!< Min enumerator value of MISPROT field.                            */
  #define BICR_POWER_MISPROT_MISPROT_Max (0xFFFFFFFFUL) /*!< Max enumerator value of MISPROT field.                            */
  #define BICR_POWER_MISPROT_MISPROT_Modified (0xFFFFFFFFUL) /*!< Power configuration has been modified.                       */
  #define BICR_POWER_MISPROT_MISPROT_Evaluated (0x471B4B2AUL) /*!< Power configuration has been evaluated.                     */



/* ==================================================== Struct BICR_LFXO ===================================================== */
/**
  * @brief LFXO [BICR_LFXO] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) LFXO configuration.                                   */
  __IOM uint32_t  CALIBRATION;                       /*!< (@ 0x00000004) LFXO calibration needed. Must be written to 0xFFFFFFFF
                                                                         after any modification of the LFXO board circuit, load
                                                                         capacitance, or crystal swap.*/                          
  __IOM uint32_t  STARTUPTIME;                       /*!< (@ 0x00000008) LFXO startup time in us.                              */
} NRF_BICR_LFXO_Type;                                /*!< Size = 12 (0x00C)                                                    */

/* BICR_LFXO_CONFIG: LFXO configuration. */
  #define BICR_LFXO_CONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONFIG register.                                      */

/* PRESENCE @Bit 0 : LFXO crystal or external signal presence. */
  #define BICR_LFXO_CONFIG_PRESENCE_Pos (0UL)        /*!< Position of PRESENCE field.                                          */
  #define BICR_LFXO_CONFIG_PRESENCE_Msk (0x1UL << BICR_LFXO_CONFIG_PRESENCE_Pos) /*!< Bit mask of PRESENCE field.              */
  #define BICR_LFXO_CONFIG_PRESENCE_Min (0x0UL)      /*!< Min enumerator value of PRESENCE field.                              */
  #define BICR_LFXO_CONFIG_PRESENCE_Max (0x1UL)      /*!< Max enumerator value of PRESENCE field.                              */
  #define BICR_LFXO_CONFIG_PRESENCE_NotPresent (0x1UL) /*!< LFXO crystal or external signal is not present.                    */
  #define BICR_LFXO_CONFIG_PRESENCE_Present (0x0UL)  /*!< LFXO crystal or external signal is present.                          */

/* ACCURACY @Bits 4..7 : LFXO crystal or external signal accuracy. */
  #define BICR_LFXO_CONFIG_ACCURACY_Pos (4UL)        /*!< Position of ACCURACY field.                                          */
  #define BICR_LFXO_CONFIG_ACCURACY_Msk (0xFUL << BICR_LFXO_CONFIG_ACCURACY_Pos) /*!< Bit mask of ACCURACY field.              */
  #define BICR_LFXO_CONFIG_ACCURACY_Min (0x0UL)      /*!< Min enumerator value of ACCURACY field.                              */
  #define BICR_LFXO_CONFIG_ACCURACY_Max (0xFUL)      /*!< Max enumerator value of ACCURACY field.                              */
  #define BICR_LFXO_CONFIG_ACCURACY_Unconfigured (0xFUL) /*!< The accuracy is unconfigured.                                    */
  #define BICR_LFXO_CONFIG_ACCURACY_500ppm (0x0UL)   /*!< LFXO crystal or external signal has an accuracy of 500 ppm.          */
  #define BICR_LFXO_CONFIG_ACCURACY_250ppm (0x1UL)   /*!< LFXO crystal or external signal has an accuracy of 250 ppm.          */
  #define BICR_LFXO_CONFIG_ACCURACY_150ppm (0x2UL)   /*!< LFXO crystal or external signal has an accuracy of 150 ppm.          */
  #define BICR_LFXO_CONFIG_ACCURACY_100ppm (0x3UL)   /*!< LFXO crystal or external signal has an accuracy of 100 ppm.          */
  #define BICR_LFXO_CONFIG_ACCURACY_75ppm (0x4UL)    /*!< LFXO crystal or external signal has an accuracy of 75 ppm.           */
  #define BICR_LFXO_CONFIG_ACCURACY_50ppm (0x5UL)    /*!< LFXO crystal or external signal has an accuracy of 50 ppm.           */
  #define BICR_LFXO_CONFIG_ACCURACY_30ppm (0x6UL)    /*!< LFXO crystal or external signal has an accuracy of 30 ppm.           */
  #define BICR_LFXO_CONFIG_ACCURACY_20ppm (0x7UL)    /*!< LFXO crystal or external signal has an accuracy of 20 ppm.           */

/* MODE @Bits 8..10 : LFXO mode. */
  #define BICR_LFXO_CONFIG_MODE_Pos (8UL)            /*!< Position of MODE field.                                              */
  #define BICR_LFXO_CONFIG_MODE_Msk (0x7UL << BICR_LFXO_CONFIG_MODE_Pos) /*!< Bit mask of MODE field.                          */
  #define BICR_LFXO_CONFIG_MODE_Min (0x0UL)          /*!< Min enumerator value of MODE field.                                  */
  #define BICR_LFXO_CONFIG_MODE_Max (0x7UL)          /*!< Max enumerator value of MODE field.                                  */
  #define BICR_LFXO_CONFIG_MODE_Unconfigured (0x7UL) /*!< The mode is unconfigured.                                            */
  #define BICR_LFXO_CONFIG_MODE_Pierce (0x0UL)       /*!< LFXO Pierce mode.                                                    */
  #define BICR_LFXO_CONFIG_MODE_PIXO (0x1UL)         /*!< LFXO PIXO mode.                                                      */
  #define BICR_LFXO_CONFIG_MODE_ExtSine (0x2UL)      /*!< LFXO in external sine wave mode.                                     */
  #define BICR_LFXO_CONFIG_MODE_ExtSquare (0x3UL)    /*!< LFXO in external square wave mode.                                   */

/* LOADCAP @Bits 12..19 : Built-in load capacitors selection in 1 pF steps. Max. value 25 pF. */
  #define BICR_LFXO_CONFIG_LOADCAP_Pos (12UL)        /*!< Position of LOADCAP field.                                           */
  #define BICR_LFXO_CONFIG_LOADCAP_Msk (0xFFUL << BICR_LFXO_CONFIG_LOADCAP_Pos) /*!< Bit mask of LOADCAP field.                */
  #define BICR_LFXO_CONFIG_LOADCAP_Min (0x0UL)       /*!< Min enumerator value of LOADCAP field.                               */
  #define BICR_LFXO_CONFIG_LOADCAP_Max (0xFFUL)      /*!< Max enumerator value of LOADCAP field.                               */
  #define BICR_LFXO_CONFIG_LOADCAP_Unconfigured (0xFFUL) /*!< The built-in load capacitors is unconfigured. LFXO will not start
                                                              unless LOADCAP is configured.*/                                     
  #define BICR_LFXO_CONFIG_LOADCAP_External (0x00UL) /*!< Do not use the built-in load capacitors, only external capacitors will
                                                          be used.*/                                                              


/* BICR_LFXO_CALIBRATION: LFXO calibration needed. Must be written to 0xFFFFFFFF after any modification of the LFXO board
                           circuit, load capacitance, or crystal swap. */                                                         
                                                                                                                                  
  #define BICR_LFXO_CALIBRATION_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CALIBRATION register.                            */

