adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CALIBRATION @Bits 0..31 : LFXO calibration needed. Must be written to 0xFFFFFFFF after any modification of the LFXO board
                             circuit, load capacitance, or crystal swap. */                                                       
                                                                                                                                  
  #define BICR_LFXO_CALIBRATION_CALIBRATION_Pos (0UL) /*!< Position of CALIBRATION field.                                      */
  #define BICR_LFXO_CALIBRATION_CALIBRATION_Msk (0xFFFFFFFFUL << BICR_LFXO_CALIBRATION_CALIBRATION_Pos) /*!< Bit mask of
                                                                            CALIBRATION field.*/                                  
  #define BICR_LFXO_CALIBRATION_CALIBRATION_Min (0xFFFFFFFFUL) /*!< Min enumerator value of CALIBRATION field.                 */
  #define BICR_LFXO_CALIBRATION_CALIBRATION_Max (0xFFFFFFFFUL) /*!< Max enumerator value of CALIBRATION field.                 */
  #define BICR_LFXO_CALIBRATION_CALIBRATION_Calibrate (0xFFFFFFFFUL) /*!< Calibrate the LFXO at startup.                       */


/* BICR_LFXO_STARTUPTIME: LFXO startup time in us. */
  #define BICR_LFXO_STARTUPTIME_ResetValue (0xFFFFFFFFUL) /*!< Reset value of STARTUPTIME register.                            */

/* TIME @Bits 0..31 : LFXO startup time in us. */
  #define BICR_LFXO_STARTUPTIME_TIME_Pos (0UL)       /*!< Position of TIME field.                                              */
  #define BICR_LFXO_STARTUPTIME_TIME_Msk (0xFFFFFFFFUL << BICR_LFXO_STARTUPTIME_TIME_Pos) /*!< Bit mask of TIME field.         */
  #define BICR_LFXO_STARTUPTIME_TIME_Min (0xFFFFFFFFUL) /*!< Min enumerator value of TIME field.                               */
  #define BICR_LFXO_STARTUPTIME_TIME_Max (0xFFFFFFFFUL) /*!< Max enumerator value of TIME field.                               */
  #define BICR_LFXO_STARTUPTIME_TIME_Unconfigured (0xFFFFFFFFUL) /*!< Startup time has not been configured.                    */



/* ==================================================== Struct BICR_LFRC ===================================================== */
/**
  * @brief LFRC [BICR_LFRC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  AUTOCALCONFIG;                     /*!< (@ 0x00000000) LFRC autocalibration configuration.                   */
} NRF_BICR_LFRC_Type;                                /*!< Size = 4 (0x004)                                                     */

/* BICR_LFRC_AUTOCALCONFIG: LFRC autocalibration configuration. */
  #define BICR_LFRC_AUTOCALCONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of AUTOCALCONFIG register.                        */

/* TEMPINTERVAL @Bits 0..6 : Temperature measurement interval in 0.25 s steps. */
  #define BICR_LFRC_AUTOCALCONFIG_TEMPINTERVAL_Pos (0UL) /*!< Position of TEMPINTERVAL field.                                  */
  #define BICR_LFRC_AUTOCALCONFIG_TEMPINTERVAL_Msk (0x7FUL << BICR_LFRC_AUTOCALCONFIG_TEMPINTERVAL_Pos) /*!< Bit mask of
                                                                            TEMPINTERVAL field.*/                                 

/* TEMPDELTA @Bits 8..13 : Temperature delta that should trigger a calibration in 0.25 degrees steps. */
  #define BICR_LFRC_AUTOCALCONFIG_TEMPDELTA_Pos (8UL) /*!< Position of TEMPDELTA field.                                        */
  #define BICR_LFRC_AUTOCALCONFIG_TEMPDELTA_Msk (0x3FUL << BICR_LFRC_AUTOCALCONFIG_TEMPDELTA_Pos) /*!< Bit mask of TEMPDELTA
                                                                            field.*/                                              

/* INTERVALMAXNO @Bits 16..20 : Maximum number of TEMPINTERVAL periods in between calibrations, independent of temperature
                                changes. */                                                                                       
                                                                                                                                  
  #define BICR_LFRC_AUTOCALCONFIG_INTERVALMAXNO_Pos (16UL) /*!< Position of INTERVALMAXNO field.                               */
  #define BICR_LFRC_AUTOCALCONFIG_INTERVALMAXNO_Msk (0x1FUL << BICR_LFRC_AUTOCALCONFIG_INTERVALMAXNO_Pos) /*!< Bit mask of
                                                                            INTERVALMAXNO field.*/                                

/* ENABLE @Bit 31 : LFRC.AUTOCALCONFIG register enable. */
  #define BICR_LFRC_AUTOCALCONFIG_ENABLE_Pos (31UL)  /*!< Position of ENABLE field.                                            */
  #define BICR_LFRC_AUTOCALCONFIG_ENABLE_Msk (0x1UL << BICR_LFRC_AUTOCALCONFIG_ENABLE_Pos) /*!< Bit mask of ENABLE field.      */
  #define BICR_LFRC_AUTOCALCONFIG_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                                */
  #define BICR_LFRC_AUTOCALCONFIG_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                                */
  #define BICR_LFRC_AUTOCALCONFIG_ENABLE_Enabled (0x0UL) /*!< LFRC.AUTOCALCONFIG register has been configured and can be used. */
  #define BICR_LFRC_AUTOCALCONFIG_ENABLE_Disabled (0x1UL) /*!< LFRC.AUTOCALCONFIG register has not been configured and cannot be
                                                               used.*/                                                            



/* =================================================== Struct BICR_HFXO64M =================================================== */
/**
  * @brief HFXO64M [BICR_HFXO64M] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) HFXO64M configuration.                                */
  __IOM uint32_t  STARTUPTIME;                       /*!< (@ 0x00000004) HFXO64M startup time in us.                           */
} NRF_BICR_HFXO64M_Type;                             /*!< Size = 8 (0x008)                                                     */

