adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* BICR_HFXO64M_CONFIG: HFXO64M configuration. */
  #define BICR_HFXO64M_CONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONFIG register.                                   */

/* MODE @Bits 0..2 : HFXO64M mode. */
  #define BICR_HFXO64M_CONFIG_MODE_Pos (0UL)         /*!< Position of MODE field.                                              */
  #define BICR_HFXO64M_CONFIG_MODE_Msk (0x7UL << BICR_HFXO64M_CONFIG_MODE_Pos) /*!< Bit mask of MODE field.                    */
  #define BICR_HFXO64M_CONFIG_MODE_Min (0x0UL)       /*!< Min enumerator value of MODE field.                                  */
  #define BICR_HFXO64M_CONFIG_MODE_Max (0x7UL)       /*!< Max enumerator value of MODE field.                                  */
  #define BICR_HFXO64M_CONFIG_MODE_Unconfigured (0x7UL) /*!< The mode is unconfigured.                                         */
  #define BICR_HFXO64M_CONFIG_MODE_Normal (0x0UL)    /*!< Normal operating mode.                                               */
  #define BICR_HFXO64M_CONFIG_MODE_TCXO (0x1UL)      /*!< TCXO/bypass mode                                                     */
  #define BICR_HFXO64M_CONFIG_MODE_Crystal2 (0x2UL)  /*!< Reserved value                                                       */
  #define BICR_HFXO64M_CONFIG_MODE_Crystal3 (0x3UL)  /*!< Reserved value                                                       */
  #define BICR_HFXO64M_CONFIG_MODE_Crystal4 (0x4UL)  /*!< Reserved value                                                       */
  #define BICR_HFXO64M_CONFIG_MODE_Crystal5 (0x5UL)  /*!< Reserved value                                                       */
  #define BICR_HFXO64M_CONFIG_MODE_Crystal6 (0x6UL)  /*!< Reserved value                                                       */


/* BICR_HFXO64M_STARTUPTIME: HFXO64M startup time in us. */
  #define BICR_HFXO64M_STARTUPTIME_ResetValue (0xFFFFFFFFUL) /*!< Reset value of STARTUPTIME register.                         */

/* TIME @Bits 0..31 : HFXO64M startup time in us. */
  #define BICR_HFXO64M_STARTUPTIME_TIME_Pos (0UL)    /*!< Position of TIME field.                                              */
  #define BICR_HFXO64M_STARTUPTIME_TIME_Msk (0xFFFFFFFFUL << BICR_HFXO64M_STARTUPTIME_TIME_Pos) /*!< Bit mask of TIME field.   */
  #define BICR_HFXO64M_STARTUPTIME_TIME_Min (0xFFFFFFFFUL) /*!< Min enumerator value of TIME field.                            */
  #define BICR_HFXO64M_STARTUPTIME_TIME_Max (0xFFFFFFFFUL) /*!< Max enumerator value of TIME field.                            */
  #define BICR_HFXO64M_STARTUPTIME_TIME_Unconfigured (0xFFFFFFFFUL) /*!< Startup time has not been configured.                 */



/* ==================================================== Struct BICR_TAMPC ==================================================== */
/**
  * @brief TAMPC [BICR_TAMPC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TAMPERSWITCH;                      /*!< (@ 0x00000000) Configuration for external tamper switch detector.    */
  __IOM uint32_t  ACTIVESHIELD;                      /*!< (@ 0x00000004) Configuration for active shield channels.             */
  __IM  uint32_t  RESERVED;
} NRF_BICR_TAMPC_Type;                               /*!< Size = 12 (0x00C)                                                    */

/* BICR_TAMPC_TAMPERSWITCH: Configuration for external tamper switch detector. */
  #define BICR_TAMPC_TAMPERSWITCH_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TAMPERSWITCH register.                         */

/* TAMPERSWITCH @Bits 0..3 : Tamper switch enable. */
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Pos (0UL) /*!< Position of TAMPERSWITCH field.                                  */
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Msk (0xFUL << BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Pos) /*!< Bit mask of
                                                                            TAMPERSWITCH field.*/                                 
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Min (0x0UL) /*!< Min enumerator value of TAMPERSWITCH field.                    */
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Max (0xFUL) /*!< Max enumerator value of TAMPERSWITCH field.                    */
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Disabled (0xFUL) /*!< Tamper switch is disabled.                                */
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Enabled (0x0UL) /*!< Tamper switch is enabled. Any value but 0xF is to be
                                                                    considered Enabled.*/                                         


/* BICR_TAMPC_ACTIVESHIELD: Configuration for active shield channels. */
  #define BICR_TAMPC_ACTIVESHIELD_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ACTIVESHIELD register.                         */

/* CHEN0 @Bits 0..3 : Active shield enable for channel 0. */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Pos (0UL)    /*!< Position of CHEN0 field.                                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Msk (0xFUL << BICR_TAMPC_ACTIVESHIELD_CHEN0_Pos) /*!< Bit mask of CHEN0 field.         */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Min (0x0UL)  /*!< Min enumerator value of CHEN0 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Max (0xFUL)  /*!< Max enumerator value of CHEN0 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Disabled (0xFUL) /*!< Active shield channel 0 is disabled.                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Enabled (0x0UL) /*!< Active shield channel 0 is enabled. Any value but 0xF is to be
                                                             considered Enabled. If any channel is Enabled, the feature should
                                                             be Enabled.*/                                                        

/* CHEN1 @Bits 4..7 : Active shield enable for channel 1. */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Pos (4UL)    /*!< Position of CHEN1 field.                                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Msk (0xFUL << BICR_TAMPC_ACTIVESHIELD_CHEN1_Pos) /*!< Bit mask of CHEN1 field.         */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Min (0x0UL)  /*!< Min enumerator value of CHEN1 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Max (0xFUL)  /*!< Max enumerator value of CHEN1 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Disabled (0xFUL) /*!< Active shield channel 1 is disabled.                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Enabled (0x0UL) /*!< Active shield channel 1 is enabled. Any value but 0xF is to be
                                                             considered Enabled. If any channel is Enabled, the feature should
                                                             be Enabled.*/                                                        

/* CHEN2 @Bits 8..11 : Active shield enable for channel 2. */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Pos (8UL)    /*!< Position of CHEN2 field.                                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Msk (0xFUL << BICR_TAMPC_ACTIVESHIELD_CHEN2_Pos) /*!< Bit mask of CHEN2 field.         */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Min (0x0UL)  /*!< Min enumerator value of CHEN2 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Max (0xFUL)  /*!< Max enumerator value of CHEN2 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Disabled (0xFUL) /*!< Active shield channel 2 is disabled.                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Enabled (0x0UL) /*!< Active shield channel 2 is enabled. Any value but 0xF is to be
                                                             considered Enabled. If any channel is Enabled, the feature should
                                                             be Enabled.*/                                                        

/* CHEN3 @Bits 12..15 : Active shield enable for channel 3. */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Pos (12UL)   /*!< Position of CHEN3 field.                                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Msk (0xFUL << BICR_TAMPC_ACTIVESHIELD_CHEN3_Pos) /*!< Bit mask of CHEN3 field.         */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Min (0x0UL)  /*!< Min enumerator value of CHEN3 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Max (0xFUL)  /*!< Max enumerator value of CHEN3 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Disabled (0xFUL) /*!< Active shield channel 3 is disabled.                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Enabled (0x0UL) /*!< Active shield channel 3 is enabled. Any value but 0xF is to be
                                                             considered Enabled. If any channel is Enabled, the feature should
                                                             be Enabled.*/                                                        


