adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ======================================================= Struct BICR ======================================================= */
/**
  * @brief Board information configuration registers
  */
  typedef struct {                                   /*!< BICR Structure                                                       */
    __IOM NRF_BICR_POWER_Type POWER;                 /*!< (@ 0x00000000) (unspecified)                                         */
    __IOM NRF_BICR_LFXO_Type LFXO;                   /*!< (@ 0x00000014) (unspecified)                                         */
    __IOM NRF_BICR_LFRC_Type LFRC;                   /*!< (@ 0x00000020) (unspecified)                                         */
    __IM uint32_t RESERVED[3];
    __IOM NRF_BICR_HFXO64M_Type HFXO64M;             /*!< (@ 0x00000030) (unspecified)                                         */
    __IOM NRF_BICR_TAMPC_Type TAMPC;                 /*!< (@ 0x00000038) (unspecified)                                         */
  } NRF_BICR_Type;                                   /*!< Size = 68 (0x044)                                                    */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           BILS                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct BILS_CONFIG ==================================================== */
/**
  * @brief CONFIG [BILS_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000000) BILS configuration                                    */
  __IOM uint32_t  MODE;                              /*!< (@ 0x00000004) Mode selection                                        */
} NRF_BILS_CONFIG_Type;                              /*!< Size = 8 (0x008)                                                     */

/* BILS_CONFIG_CFG: BILS configuration */
  #define BILS_CONFIG_CFG_ResetValue (0x00000000UL)  /*!< Reset value of CFG register.                                         */

/* PWRUP @Bit 0 : Power up BILS */
  #define BILS_CONFIG_CFG_PWRUP_Pos (0UL)            /*!< Position of PWRUP field.                                             */
  #define BILS_CONFIG_CFG_PWRUP_Msk (0x1UL << BILS_CONFIG_CFG_PWRUP_Pos) /*!< Bit mask of PWRUP field.                         */
  #define BILS_CONFIG_CFG_PWRUP_Min (0x0UL)          /*!< Min enumerator value of PWRUP field.                                 */
  #define BILS_CONFIG_CFG_PWRUP_Max (0x1UL)          /*!< Max enumerator value of PWRUP field.                                 */
  #define BILS_CONFIG_CFG_PWRUP_PwrOff (0x0UL)       /*!< BILS is powered down and REQ_SWOFF_AO_0V8=0                          */
  #define BILS_CONFIG_CFG_PWRUP_PwrOn (0x1UL)        /*!< BILS is powered up                                                   */

/* ENABLE @Bit 1 : BILS enable */
  #define BILS_CONFIG_CFG_ENABLE_Pos (1UL)           /*!< Position of ENABLE field.                                            */
  #define BILS_CONFIG_CFG_ENABLE_Msk (0x1UL << BILS_CONFIG_CFG_ENABLE_Pos) /*!< Bit mask of ENABLE field.                      */
  #define BILS_CONFIG_CFG_ENABLE_Min (0x0UL)         /*!< Min enumerator value of ENABLE field.                                */
  #define BILS_CONFIG_CFG_ENABLE_Max (0x1UL)         /*!< Max enumerator value of ENABLE field.                                */
  #define BILS_CONFIG_CFG_ENABLE_BilsDisable (0x0UL) /*!< Disable BILS, REQ_SWOFF_AO_0V8 = 0                                   */
  #define BILS_CONFIG_CFG_ENABLE_BilsEnable (0x1UL)  /*!< Enable BILS, REQ_SWOFF_AO_0V8 is controlled by BILS                  */

/* PWRSWDISABLE @Bit 2 : Disable power switch. */
  #define BILS_CONFIG_CFG_PWRSWDISABLE_Pos (2UL)     /*!< Position of PWRSWDISABLE field.                                      */
  #define BILS_CONFIG_CFG_PWRSWDISABLE_Msk (0x1UL << BILS_CONFIG_CFG_PWRSWDISABLE_Pos) /*!< Bit mask of PWRSWDISABLE field.    */
  #define BILS_CONFIG_CFG_PWRSWDISABLE_Min (0x0UL)   /*!< Min enumerator value of PWRSWDISABLE field.                          */
  #define BILS_CONFIG_CFG_PWRSWDISABLE_Max (0x1UL)   /*!< Max enumerator value of PWRSWDISABLE field.                          */
  #define BILS_CONFIG_CFG_PWRSWDISABLE_PwrSwNormalMode (0x0UL) /*!< Normal control of the power switch.                        */
  #define BILS_CONFIG_CFG_PWRSWDISABLE_PwrSwDisabledMode (0x1UL) /*!< Power switch is turned off.                              */


/* BILS_CONFIG_MODE: Mode selection */
  #define BILS_CONFIG_MODE_ResetValue (0x00000000UL) /*!< Reset value of MODE register.                                        */

/* OUTMODE @Bit 0 : Output mode selection */
  #define BILS_CONFIG_MODE_OUTMODE_Pos (0UL)         /*!< Position of OUTMODE field.                                           */
  #define BILS_CONFIG_MODE_OUTMODE_Msk (0x1UL << BILS_CONFIG_MODE_OUTMODE_Pos) /*!< Bit mask of OUTMODE field.                 */
  #define BILS_CONFIG_MODE_OUTMODE_Min (0x0UL)       /*!< Min enumerator value of OUTMODE field.                               */
  #define BILS_CONFIG_MODE_OUTMODE_Max (0x1UL)       /*!< Max enumerator value of OUTMODE field.                               */
  #define BILS_CONFIG_MODE_OUTMODE_Duty50Mode (0x0UL) /*!< 50:50 duty cycle output selected to FOUT_AO_0V8 pin                 */
  #define BILS_CONFIG_MODE_OUTMODE_CompMode (0x1UL)  /*!< Comparator output selected to FOUT_AO_0V8 pin                        */

/* MEASMODE @Bit 1 : Measurement mode selection */
  #define BILS_CONFIG_MODE_MEASMODE_Pos (1UL)        /*!< Position of MEASMODE field.                                          */
  #define BILS_CONFIG_MODE_MEASMODE_Msk (0x1UL << BILS_CONFIG_MODE_MEASMODE_Pos) /*!< Bit mask of MEASMODE field.              */
  #define BILS_CONFIG_MODE_MEASMODE_Min (0x0UL)      /*!< Min enumerator value of MEASMODE field.                              */
  #define BILS_CONFIG_MODE_MEASMODE_Max (0x1UL)      /*!< Max enumerator value of MEASMODE field.                              */
  #define BILS_CONFIG_MODE_MEASMODE_MeasDisMode (0x0UL) /*!< Measure discharge rate                                            */
  #define BILS_CONFIG_MODE_MEASMODE_MeasPwMode (0x1UL) /*!< Measure power switch chain propagation delay                       */



/* ================================================== Struct BILS_OVERRIDE =================================================== */
/**
  * @brief OVERRIDE [BILS_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ACK;                               /*!< (@ 0x00000000) Override the ACL_SWOFF_0V8 signal                     */
} NRF_BILS_OVERRIDE_Type;                            /*!< Size = 4 (0x004)                                                     */

/* BILS_OVERRIDE_ACK: Override the ACL_SWOFF_0V8 signal */
  #define BILS_OVERRIDE_ACK_ResetValue (0x00000000UL) /*!< Reset value of ACK register.                                        */

/* VAL @Bit 0 : Override value */
  #define BILS_OVERRIDE_ACK_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define BILS_OVERRIDE_ACK_VAL_Msk (0x1UL << BILS_OVERRIDE_ACK_VAL_Pos) /*!< Bit mask of VAL field.                           */

/* EN @Bit 31 : Override enable */
  #define BILS_OVERRIDE_ACK_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define BILS_OVERRIDE_ACK_EN_Msk (0x1UL << BILS_OVERRIDE_ACK_EN_Pos) /*!< Bit mask of EN field.                              */
  #define BILS_OVERRIDE_ACK_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define BILS_OVERRIDE_ACK_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define BILS_OVERRIDE_ACK_EN_Disabled (0x0UL)      /*!< Override disabled                                                    */
  #define BILS_OVERRIDE_ACK_EN_Enabled (0x1UL)       /*!< Override is enabled                                                  */



/* ===================================================== Struct BILS_DFT ===================================================== */
/**
  * @brief DFT [BILS_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTBCONFIG;                         /*!< (@ 0x00000010) Digital Test Bus configuration                        */
} NRF_BILS_DFT_Type;                                 /*!< Size = 20 (0x014)                                                    */

/* BILS_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define BILS_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                               */

/* SELMUX @Bit 0 : Select multiplexer for ATB0 */
  #define BILS_DFT_ATB0CONFIG_SELMUX_Pos (0UL)       /*!< Position of SELMUX field.                                            */
  #define BILS_DFT_ATB0CONFIG_SELMUX_Msk (0x1UL << BILS_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.              */
  #define BILS_DFT_ATB0CONFIG_SELMUX_Min (0x0UL)     /*!< Min enumerator value of SELMUX field.                                */
  #define BILS_DFT_ATB0CONFIG_SELMUX_Max (0x1UL)     /*!< Max enumerator value of SELMUX field.                                */
  #define BILS_DFT_ATB0CONFIG_SELMUX_None (0x0UL)    /*!< None selected                                                        */
  #define BILS_DFT_ATB0CONFIG_SELMUX_Connect (0x1UL) /*!< Voltage on ATB0 used as threshold voltage                            */

