adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EN @Bit 31 : Enable the analog test bus */
  #define BILS_DFT_ATB0CONFIG_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define BILS_DFT_ATB0CONFIG_EN_Msk (0x1UL << BILS_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                          */
  #define BILS_DFT_ATB0CONFIG_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define BILS_DFT_ATB0CONFIG_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define BILS_DFT_ATB0CONFIG_EN_Disabled (0x0UL)    /*!< Analog test bus is disabled                                          */
  #define BILS_DFT_ATB0CONFIG_EN_Enabled (0x1UL)     /*!< Analog test bus is enabled                                           */


/* BILS_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define BILS_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                               */

/* SELMUX @Bit 0 : Select multiplexer for ATB1 */
  #define BILS_DFT_ATB1CONFIG_SELMUX_Pos (0UL)       /*!< Position of SELMUX field.                                            */
  #define BILS_DFT_ATB1CONFIG_SELMUX_Msk (0x1UL << BILS_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.              */
  #define BILS_DFT_ATB1CONFIG_SELMUX_Min (0x0UL)     /*!< Min enumerator value of SELMUX field.                                */
  #define BILS_DFT_ATB1CONFIG_SELMUX_Max (0x1UL)     /*!< Max enumerator value of SELMUX field.                                */
  #define BILS_DFT_ATB1CONFIG_SELMUX_None (0x0UL)    /*!< None selected                                                        */
  #define BILS_DFT_ATB1CONFIG_SELMUX_ConnectDVDD (0x1UL) /*!< ATB1 connected to DVDD_0V8_SW                                    */

/* EN @Bit 31 : Enable the analog test bus */
  #define BILS_DFT_ATB1CONFIG_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define BILS_DFT_ATB1CONFIG_EN_Msk (0x1UL << BILS_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                          */
  #define BILS_DFT_ATB1CONFIG_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define BILS_DFT_ATB1CONFIG_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define BILS_DFT_ATB1CONFIG_EN_Disabled (0x0UL)    /*!< Analog test bus is disabled                                          */
  #define BILS_DFT_ATB1CONFIG_EN_Enabled (0x1UL)     /*!< Analog test bus is enabled                                           */


/* BILS_DFT_DTBCONFIG: Digital Test Bus configuration */
  #define BILS_DFT_DTBCONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTBCONFIG register.                                 */

/* SELMUX @Bit 0 : Select multiplexer for DTB0 */
  #define BILS_DFT_DTBCONFIG_SELMUX_Pos (0UL)        /*!< Position of SELMUX field.                                            */
  #define BILS_DFT_DTBCONFIG_SELMUX_Msk (0x1UL << BILS_DFT_DTBCONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.                */
  #define BILS_DFT_DTBCONFIG_SELMUX_Min (0x0UL)      /*!< Min enumerator value of SELMUX field.                                */
  #define BILS_DFT_DTBCONFIG_SELMUX_Max (0x1UL)      /*!< Max enumerator value of SELMUX field.                                */
  #define BILS_DFT_DTBCONFIG_SELMUX_None (0x0UL)     /*!< None selected                                                        */
  #define BILS_DFT_DTBCONFIG_SELMUX_Connect (0x1UL)  /*!< FOUT_AO_0V8 is connected to DTB0, REQ_SWOFF_AO_0V8 is connected to
                                                          DTB1*/                                                                  

/* ENABLEDTB0 @Bit 28 : Enable the digital test bus */
  #define BILS_DFT_DTBCONFIG_ENABLEDTB0_Pos (28UL)   /*!< Position of ENABLEDTB0 field.                                        */
  #define BILS_DFT_DTBCONFIG_ENABLEDTB0_Msk (0x1UL << BILS_DFT_DTBCONFIG_ENABLEDTB0_Pos) /*!< Bit mask of ENABLEDTB0 field.    */
  #define BILS_DFT_DTBCONFIG_ENABLEDTB0_Min (0x0UL)  /*!< Min enumerator value of ENABLEDTB0 field.                            */
  #define BILS_DFT_DTBCONFIG_ENABLEDTB0_Max (0x1UL)  /*!< Max enumerator value of ENABLEDTB0 field.                            */
  #define BILS_DFT_DTBCONFIG_ENABLEDTB0_Disabled (0x0UL) /*!< Digital test bus is disabled                                     */
  #define BILS_DFT_DTBCONFIG_ENABLEDTB0_Enabled (0x1UL) /*!< Digital test bus is enabled                                       */

/* ENABLEDTB1 @Bit 29 : Enable the digital test bus */
  #define BILS_DFT_DTBCONFIG_ENABLEDTB1_Pos (29UL)   /*!< Position of ENABLEDTB1 field.                                        */
  #define BILS_DFT_DTBCONFIG_ENABLEDTB1_Msk (0x1UL << BILS_DFT_DTBCONFIG_ENABLEDTB1_Pos) /*!< Bit mask of ENABLEDTB1 field.    */
  #define BILS_DFT_DTBCONFIG_ENABLEDTB1_Min (0x0UL)  /*!< Min enumerator value of ENABLEDTB1 field.                            */
  #define BILS_DFT_DTBCONFIG_ENABLEDTB1_Max (0x1UL)  /*!< Max enumerator value of ENABLEDTB1 field.                            */
  #define BILS_DFT_DTBCONFIG_ENABLEDTB1_Disabled (0x0UL) /*!< Digital test bus is disabled                                     */
  #define BILS_DFT_DTBCONFIG_ENABLEDTB1_Enabled (0x1UL) /*!< Digital test bus is enabled                                       */


/* ======================================================= Struct BILS ======================================================= */
/**
  * @brief The Built-in Leakage Sensor (BILS) module.
  */
  typedef struct {                                   /*!< BILS Structure                                                       */
    __IM uint32_t RESERVED[256];
    __IOM NRF_BILS_CONFIG_Type CONFIG;               /*!< (@ 0x00000400) (unspecified)                                         */
    __IM uint32_t RESERVED1[62];
    __IOM NRF_BILS_OVERRIDE_Type OVERRIDE;           /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED2[63];
    __IOM NRF_BILS_DFT_Type DFT;                     /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_BILS_Type;                                   /*!< Size = 1556 (0x614)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           CACHE                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct CACHE_PROFILING ================================================== */
/**
  * @brief PROFILING [CACHE_PROFILING] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ENABLE;                            /*!< (@ 0x00000000) Enable the profiling counters.                        */
  __OM  uint32_t  CLEAR;                             /*!< (@ 0x00000004) Clear the profiling counters.                         */
  __IM  uint32_t  HIT;                               /*!< (@ 0x00000008) The cache hit counter for cache region.               */
  __IM  uint32_t  MISS;                              /*!< (@ 0x0000000C) The cache miss counter for cache region.              */
  __IM  uint32_t  LMISS;                             /*!< (@ 0x00000010) The cache line miss counter for cache region.         */
  __IM  uint32_t  READS;                             /*!< (@ 0x00000014) Number of reads for cache region.                     */
  __IM  uint32_t  WRITES;                            /*!< (@ 0x00000018) Number of writes for cache region.                    */
} NRF_CACHE_PROFILING_Type;                          /*!< Size = 28 (0x01C)                                                    */

/* CACHE_PROFILING_ENABLE: Enable the profiling counters. */
  #define CACHE_PROFILING_ENABLE_ResetValue (0x00000000UL) /*!< Reset value of ENABLE register.                                */

