adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* READY @Bit 0 : Ready status. */
  #define CACHE_STATUS_READY_Pos (0UL)               /*!< Position of READY field.                                             */
  #define CACHE_STATUS_READY_Msk (0x1UL << CACHE_STATUS_READY_Pos) /*!< Bit mask of READY field.                               */
  #define CACHE_STATUS_READY_Min (0x0UL)             /*!< Min enumerator value of READY field.                                 */
  #define CACHE_STATUS_READY_Max (0x1UL)             /*!< Max enumerator value of READY field.                                 */
  #define CACHE_STATUS_READY_Ready (0x0UL)           /*!< Activity is done and ready for the next activity.                    */
  #define CACHE_STATUS_READY_Busy (0x1UL)            /*!< Activity is in progress.                                             */


/* CACHE_ENABLE: Enable cache. */
  #define CACHE_ENABLE_ResetValue (0x00000000UL)     /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : Enable cache */
  #define CACHE_ENABLE_ENABLE_Pos (0UL)              /*!< Position of ENABLE field.                                            */
  #define CACHE_ENABLE_ENABLE_Msk (0x1UL << CACHE_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                            */
  #define CACHE_ENABLE_ENABLE_Min (0x0UL)            /*!< Min enumerator value of ENABLE field.                                */
  #define CACHE_ENABLE_ENABLE_Max (0x1UL)            /*!< Max enumerator value of ENABLE field.                                */
  #define CACHE_ENABLE_ENABLE_Disabled (0x0UL)       /*!< Disable cache                                                        */
  #define CACHE_ENABLE_ENABLE_Enabled (0x1UL)        /*!< Enable cache                                                         */


/* CACHE_MODE: Cache mode. */
  #define CACHE_MODE_ResetValue (0x00000000UL)       /*!< Reset value of MODE register.                                        */

/* MODE @Bit 0 : Cache mode */
  #define CACHE_MODE_MODE_Pos (0UL)                  /*!< Position of MODE field.                                              */
  #define CACHE_MODE_MODE_Msk (0x1UL << CACHE_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                      */
  #define CACHE_MODE_MODE_Min (0x0UL)                /*!< Min enumerator value of MODE field.                                  */
  #define CACHE_MODE_MODE_Max (0x1UL)                /*!< Max enumerator value of MODE field.                                  */
  #define CACHE_MODE_MODE_Cache (0x0UL)              /*!< Cache mode                                                           */
  #define CACHE_MODE_MODE_Ram (0x1UL)                /*!< RAM mode                                                             */

/* NONCACHEABLE @Bit 1 : Enable non-cacheable cache miss feature */
  #define CACHE_MODE_NONCACHEABLE_Pos (1UL)          /*!< Position of NONCACHEABLE field.                                      */
  #define CACHE_MODE_NONCACHEABLE_Msk (0x1UL << CACHE_MODE_NONCACHEABLE_Pos) /*!< Bit mask of NONCACHEABLE field.              */
  #define CACHE_MODE_NONCACHEABLE_Min (0x0UL)        /*!< Min enumerator value of NONCACHEABLE field.                          */
  #define CACHE_MODE_NONCACHEABLE_Max (0x1UL)        /*!< Max enumerator value of NONCACHEABLE field.                          */
  #define CACHE_MODE_NONCACHEABLE_Disabled (0x0UL)   /*!< Non-cacheable cache miss feature is disabled                         */
  #define CACHE_MODE_NONCACHEABLE_Enabled (0x1UL)    /*!< Non-cacheable cache miss feature is enabled                          */

/* RAMSIZE @Bits 4..5 : RAM size */
  #define CACHE_MODE_RAMSIZE_Pos (4UL)               /*!< Position of RAMSIZE field.                                           */
  #define CACHE_MODE_RAMSIZE_Msk (0x3UL << CACHE_MODE_RAMSIZE_Pos) /*!< Bit mask of RAMSIZE field.                             */
  #define CACHE_MODE_RAMSIZE_Min (0x0UL)             /*!< Min enumerator value of RAMSIZE field.                               */
  #define CACHE_MODE_RAMSIZE_Max (0x3UL)             /*!< Max enumerator value of RAMSIZE field.                               */
  #define CACHE_MODE_RAMSIZE_All (0x0UL)             /*!< All RAM is used for cache memory                                     */
  #define CACHE_MODE_RAMSIZE_Half (0x1UL)            /*!< Half of the RAM is used for cache memory                             */
  #define CACHE_MODE_RAMSIZE_Quarter (0x2UL)         /*!< Quarter of the RAM is used for cache memory                          */
  #define CACHE_MODE_RAMSIZE_None (0x3UL)            /*!< None of the RAM is used for cache memory                             */

/* VCACHENUM @Bits 8..9 : Number of virtual cache regions. */
  #define CACHE_MODE_VCACHENUM_Pos (8UL)             /*!< Position of VCACHENUM field.                                         */
  #define CACHE_MODE_VCACHENUM_Msk (0x3UL << CACHE_MODE_VCACHENUM_Pos) /*!< Bit mask of VCACHENUM field.                       */
  #define CACHE_MODE_VCACHENUM_Min (0x0UL)           /*!< Min enumerator value of VCACHENUM field.                             */
  #define CACHE_MODE_VCACHENUM_Max (0x3UL)           /*!< Max enumerator value of VCACHENUM field.                             */
  #define CACHE_MODE_VCACHENUM_One (0x0UL)           /*!< Whole cache is one region.                                           */
  #define CACHE_MODE_VCACHENUM_Two (0x1UL)           /*!< Whole cache is divided into two equal virtual regions.               */
  #define CACHE_MODE_VCACHENUM_Four (0x2UL)          /*!< Whole cache is divided into four equal virtual regions.              */
  #define CACHE_MODE_VCACHENUM_Eight (0x3UL)         /*!< Whole cache is divided into eight equal virtual regions.             */


/* CACHE_VCACHESEL: Select virtual cache region for profiling and maintenance. */
  #define CACHE_VCACHESEL_ResetValue (0x00000000UL)  /*!< Reset value of VCACHESEL register.                                   */

/* REGION @Bits 0..2 : Virtual region select. */
  #define CACHE_VCACHESEL_REGION_Pos (0UL)           /*!< Position of REGION field.                                            */
  #define CACHE_VCACHESEL_REGION_Msk (0x7UL << CACHE_VCACHESEL_REGION_Pos) /*!< Bit mask of REGION field.                      */


/* CACHE_LINEADDR: Memory address covered by the line to be maintained. */
  #define CACHE_LINEADDR_ResetValue (0x00000000UL)   /*!< Reset value of LINEADDR register.                                    */

/* ADDR @Bits 0..31 : Address. */
  #define CACHE_LINEADDR_ADDR_Pos (0UL)              /*!< Position of ADDR field.                                              */
  #define CACHE_LINEADDR_ADDR_Msk (0xFFFFFFFFUL << CACHE_LINEADDR_ADDR_Pos) /*!< Bit mask of ADDR field.                       */


