adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CAN_TASKS_STOPREQ: Request to stop the CAN peripheral */
  #define CAN_TASKS_STOPREQ_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOPREQ register.                              */

/* TASKS_STOPREQ @Bit 0 : Request to stop the CAN peripheral */
  #define CAN_TASKS_STOPREQ_TASKS_STOPREQ_Pos (0UL)  /*!< Position of TASKS_STOPREQ field.                                     */
  #define CAN_TASKS_STOPREQ_TASKS_STOPREQ_Msk (0x1UL << CAN_TASKS_STOPREQ_TASKS_STOPREQ_Pos) /*!< Bit mask of TASKS_STOPREQ
                                                                            field.*/                                              
  #define CAN_TASKS_STOPREQ_TASKS_STOPREQ_Min (0x1UL) /*!< Min enumerator value of TASKS_STOPREQ field.                        */
  #define CAN_TASKS_STOPREQ_TASKS_STOPREQ_Max (0x1UL) /*!< Max enumerator value of TASKS_STOPREQ field.                        */
  #define CAN_TASKS_STOPREQ_TASKS_STOPREQ_Trigger (0x1UL) /*!< Trigger task                                                    */


/* CAN_TASKS_STOP: Stop the CAN peripheral */
  #define CAN_TASKS_STOP_ResetValue (0x00000000UL)   /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop the CAN peripheral */
  #define CAN_TASKS_STOP_TASKS_STOP_Pos (0UL)        /*!< Position of TASKS_STOP field.                                        */
  #define CAN_TASKS_STOP_TASKS_STOP_Msk (0x1UL << CAN_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.            */
  #define CAN_TASKS_STOP_TASKS_STOP_Min (0x1UL)      /*!< Min enumerator value of TASKS_STOP field.                            */
  #define CAN_TASKS_STOP_TASKS_STOP_Max (0x1UL)      /*!< Max enumerator value of TASKS_STOP field.                            */
  #define CAN_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)  /*!< Trigger task                                                         */


/* CAN_EVENTS_CORE0: Event indicating that interrupt 0 triggered at CAN core */
  #define CAN_EVENTS_CORE0_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CORE0 register.                                */

/* EVENTS_CORE0 @Bit 0 : Event indicating that interrupt 0 triggered at CAN core */
  #define CAN_EVENTS_CORE0_EVENTS_CORE0_Pos (0UL)    /*!< Position of EVENTS_CORE0 field.                                      */
  #define CAN_EVENTS_CORE0_EVENTS_CORE0_Msk (0x1UL << CAN_EVENTS_CORE0_EVENTS_CORE0_Pos) /*!< Bit mask of EVENTS_CORE0 field.  */
  #define CAN_EVENTS_CORE0_EVENTS_CORE0_Min (0x0UL)  /*!< Min enumerator value of EVENTS_CORE0 field.                          */
  #define CAN_EVENTS_CORE0_EVENTS_CORE0_Max (0x1UL)  /*!< Max enumerator value of EVENTS_CORE0 field.                          */
  #define CAN_EVENTS_CORE0_EVENTS_CORE0_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define CAN_EVENTS_CORE0_EVENTS_CORE0_Generated (0x1UL) /*!< Event generated                                                 */


/* CAN_EVENTS_CORE1: Event indicating that interrupt 1 triggered at CAN core */
  #define CAN_EVENTS_CORE1_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CORE1 register.                                */

/* EVENTS_CORE1 @Bit 0 : Event indicating that interrupt 1 triggered at CAN core */
  #define CAN_EVENTS_CORE1_EVENTS_CORE1_Pos (0UL)    /*!< Position of EVENTS_CORE1 field.                                      */
  #define CAN_EVENTS_CORE1_EVENTS_CORE1_Msk (0x1UL << CAN_EVENTS_CORE1_EVENTS_CORE1_Pos) /*!< Bit mask of EVENTS_CORE1 field.  */
  #define CAN_EVENTS_CORE1_EVENTS_CORE1_Min (0x0UL)  /*!< Min enumerator value of EVENTS_CORE1 field.                          */
  #define CAN_EVENTS_CORE1_EVENTS_CORE1_Max (0x1UL)  /*!< Max enumerator value of EVENTS_CORE1 field.                          */
  #define CAN_EVENTS_CORE1_EVENTS_CORE1_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define CAN_EVENTS_CORE1_EVENTS_CORE1_Generated (0x1UL) /*!< Event generated                                                 */


/* CAN_EVENTS_DMU: Event indicating that interrupt triggered at CAN DMU */
  #define CAN_EVENTS_DMU_ResetValue (0x00000000UL)   /*!< Reset value of EVENTS_DMU register.                                  */

/* EVENTS_DMU @Bit 0 : Event indicating that interrupt triggered at CAN DMU */
  #define CAN_EVENTS_DMU_EVENTS_DMU_Pos (0UL)        /*!< Position of EVENTS_DMU field.                                        */
  #define CAN_EVENTS_DMU_EVENTS_DMU_Msk (0x1UL << CAN_EVENTS_DMU_EVENTS_DMU_Pos) /*!< Bit mask of EVENTS_DMU field.            */
  #define CAN_EVENTS_DMU_EVENTS_DMU_Min (0x0UL)      /*!< Min enumerator value of EVENTS_DMU field.                            */
  #define CAN_EVENTS_DMU_EVENTS_DMU_Max (0x1UL)      /*!< Max enumerator value of EVENTS_DMU field.                            */
  #define CAN_EVENTS_DMU_EVENTS_DMU_NotGenerated (0x0UL) /*!< Event not generated                                              */
  #define CAN_EVENTS_DMU_EVENTS_DMU_Generated (0x1UL) /*!< Event generated                                                     */


/* CAN_EVENTS_DMA: Event indicating that interrupt triggered at CAN DMA */
  #define CAN_EVENTS_DMA_ResetValue (0x00000000UL)   /*!< Reset value of EVENTS_DMA register.                                  */

/* EVENTS_DMA @Bit 0 : Event indicating that interrupt triggered at CAN DMA */
  #define CAN_EVENTS_DMA_EVENTS_DMA_Pos (0UL)        /*!< Position of EVENTS_DMA field.                                        */
  #define CAN_EVENTS_DMA_EVENTS_DMA_Msk (0x1UL << CAN_EVENTS_DMA_EVENTS_DMA_Pos) /*!< Bit mask of EVENTS_DMA field.            */
  #define CAN_EVENTS_DMA_EVENTS_DMA_Min (0x0UL)      /*!< Min enumerator value of EVENTS_DMA field.                            */
  #define CAN_EVENTS_DMA_EVENTS_DMA_Max (0x1UL)      /*!< Max enumerator value of EVENTS_DMA field.                            */
  #define CAN_EVENTS_DMA_EVENTS_DMA_NotGenerated (0x0UL) /*!< Event not generated                                              */
  #define CAN_EVENTS_DMA_EVENTS_DMA_Generated (0x1UL) /*!< Event generated                                                     */


/* CAN_EVENTS_READYFORSTOP: Event indicating that the CAN is ready to be stopped */
  #define CAN_EVENTS_READYFORSTOP_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READYFORSTOP register.                  */

/* EVENTS_READYFORSTOP @Bit 0 : Event indicating that the CAN is ready to be stopped */
  #define CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_Pos (0UL) /*!< Position of EVENTS_READYFORSTOP field.                    */
  #define CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_Msk (0x1UL << CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_Pos) /*!< Bit
                                                                            mask of EVENTS_READYFORSTOP field.*/                  
  #define CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_Min (0x0UL) /*!< Min enumerator value of EVENTS_READYFORSTOP field.      */
  #define CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_Max (0x1UL) /*!< Max enumerator value of EVENTS_READYFORSTOP field.      */
  #define CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_Generated (0x1UL) /*!< Event generated                                   */


