adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* READYFORSTOP @Bit 4 : Write '1' to disable interrupt for event READYFORSTOP */
  #define CAN_INTENCLR_READYFORSTOP_Pos (4UL)        /*!< Position of READYFORSTOP field.                                      */
  #define CAN_INTENCLR_READYFORSTOP_Msk (0x1UL << CAN_INTENCLR_READYFORSTOP_Pos) /*!< Bit mask of READYFORSTOP field.          */
  #define CAN_INTENCLR_READYFORSTOP_Min (0x0UL)      /*!< Min enumerator value of READYFORSTOP field.                          */
  #define CAN_INTENCLR_READYFORSTOP_Max (0x1UL)      /*!< Max enumerator value of READYFORSTOP field.                          */
  #define CAN_INTENCLR_READYFORSTOP_Clear (0x1UL)    /*!< Disable                                                              */
  #define CAN_INTENCLR_READYFORSTOP_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define CAN_INTENCLR_READYFORSTOP_Enabled (0x1UL)  /*!< Read: Enabled                                                        */


/* CAN_INTPEND: Pending interrupts */
  #define CAN_INTPEND_ResetValue (0x00000000UL)      /*!< Reset value of INTPEND register.                                     */

/* CORE0 @Bit 0 : Read pending status of interrupt for event CORE0 */
  #define CAN_INTPEND_CORE0_Pos (0UL)                /*!< Position of CORE0 field.                                             */
  #define CAN_INTPEND_CORE0_Msk (0x1UL << CAN_INTPEND_CORE0_Pos) /*!< Bit mask of CORE0 field.                                 */
  #define CAN_INTPEND_CORE0_Min (0x0UL)              /*!< Min enumerator value of CORE0 field.                                 */
  #define CAN_INTPEND_CORE0_Max (0x1UL)              /*!< Max enumerator value of CORE0 field.                                 */
  #define CAN_INTPEND_CORE0_NotPending (0x0UL)       /*!< Read: Not pending                                                    */
  #define CAN_INTPEND_CORE0_Pending (0x1UL)          /*!< Read: Pending                                                        */

/* CORE1 @Bit 1 : Read pending status of interrupt for event CORE1 */
  #define CAN_INTPEND_CORE1_Pos (1UL)                /*!< Position of CORE1 field.                                             */
  #define CAN_INTPEND_CORE1_Msk (0x1UL << CAN_INTPEND_CORE1_Pos) /*!< Bit mask of CORE1 field.                                 */
  #define CAN_INTPEND_CORE1_Min (0x0UL)              /*!< Min enumerator value of CORE1 field.                                 */
  #define CAN_INTPEND_CORE1_Max (0x1UL)              /*!< Max enumerator value of CORE1 field.                                 */
  #define CAN_INTPEND_CORE1_NotPending (0x0UL)       /*!< Read: Not pending                                                    */
  #define CAN_INTPEND_CORE1_Pending (0x1UL)          /*!< Read: Pending                                                        */

/* DMU @Bit 2 : Read pending status of interrupt for event DMU */
  #define CAN_INTPEND_DMU_Pos (2UL)                  /*!< Position of DMU field.                                               */
  #define CAN_INTPEND_DMU_Msk (0x1UL << CAN_INTPEND_DMU_Pos) /*!< Bit mask of DMU field.                                       */
  #define CAN_INTPEND_DMU_Min (0x0UL)                /*!< Min enumerator value of DMU field.                                   */
  #define CAN_INTPEND_DMU_Max (0x1UL)                /*!< Max enumerator value of DMU field.                                   */
  #define CAN_INTPEND_DMU_NotPending (0x0UL)         /*!< Read: Not pending                                                    */
  #define CAN_INTPEND_DMU_Pending (0x1UL)            /*!< Read: Pending                                                        */

/* DMA @Bit 3 : Read pending status of interrupt for event DMA */
  #define CAN_INTPEND_DMA_Pos (3UL)                  /*!< Position of DMA field.                                               */
  #define CAN_INTPEND_DMA_Msk (0x1UL << CAN_INTPEND_DMA_Pos) /*!< Bit mask of DMA field.                                       */
  #define CAN_INTPEND_DMA_Min (0x0UL)                /*!< Min enumerator value of DMA field.                                   */
  #define CAN_INTPEND_DMA_Max (0x1UL)                /*!< Max enumerator value of DMA field.                                   */
  #define CAN_INTPEND_DMA_NotPending (0x0UL)         /*!< Read: Not pending                                                    */
  #define CAN_INTPEND_DMA_Pending (0x1UL)            /*!< Read: Pending                                                        */

/* READYFORSTOP @Bit 4 : Read pending status of interrupt for event READYFORSTOP */
  #define CAN_INTPEND_READYFORSTOP_Pos (4UL)         /*!< Position of READYFORSTOP field.                                      */
  #define CAN_INTPEND_READYFORSTOP_Msk (0x1UL << CAN_INTPEND_READYFORSTOP_Pos) /*!< Bit mask of READYFORSTOP field.            */
  #define CAN_INTPEND_READYFORSTOP_Min (0x0UL)       /*!< Min enumerator value of READYFORSTOP field.                          */
  #define CAN_INTPEND_READYFORSTOP_Max (0x1UL)       /*!< Max enumerator value of READYFORSTOP field.                          */
  #define CAN_INTPEND_READYFORSTOP_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define CAN_INTPEND_READYFORSTOP_Pending (0x1UL)   /*!< Read: Pending                                                        */


/* CAN_MISC: Register for controlling miscellanious functions and features of the M_CAN. */
  #define CAN_MISC_ResetValue (0x00000000UL)         /*!< Reset value of MISC register.                                        */

/* DISMORD @Bit 0 : Disable modification on read */
  #define CAN_MISC_DISMORD_Pos (0UL)                 /*!< Position of DISMORD field.                                           */
  #define CAN_MISC_DISMORD_Msk (0x1UL << CAN_MISC_DISMORD_Pos) /*!< Bit mask of DISMORD field.                                 */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            CCM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

