adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CCM_EVENTS_ERROR: CCM error event */
  #define CCM_EVENTS_ERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERROR register.                                */

/* EVENTS_ERROR @Bit 0 : CCM error event */
  #define CCM_EVENTS_ERROR_EVENTS_ERROR_Pos (0UL)    /*!< Position of EVENTS_ERROR field.                                      */
  #define CCM_EVENTS_ERROR_EVENTS_ERROR_Msk (0x1UL << CCM_EVENTS_ERROR_EVENTS_ERROR_Pos) /*!< Bit mask of EVENTS_ERROR field.  */
  #define CCM_EVENTS_ERROR_EVENTS_ERROR_Min (0x0UL)  /*!< Min enumerator value of EVENTS_ERROR field.                          */
  #define CCM_EVENTS_ERROR_EVENTS_ERROR_Max (0x1UL)  /*!< Max enumerator value of EVENTS_ERROR field.                          */
  #define CCM_EVENTS_ERROR_EVENTS_ERROR_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define CCM_EVENTS_ERROR_EVENTS_ERROR_Generated (0x1UL) /*!< Event generated                                                 */


/* CCM_PUBLISH_ENDCONFIG: Publish configuration for event ENDCONFIG */
  #define CCM_PUBLISH_ENDCONFIG_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ENDCONFIG register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that event ENDCONFIG will publish to */
  #define CCM_PUBLISH_ENDCONFIG_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define CCM_PUBLISH_ENDCONFIG_CHIDX_Msk (0xFFUL << CCM_PUBLISH_ENDCONFIG_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define CCM_PUBLISH_ENDCONFIG_CHIDX_Min (0x0UL)    /*!< Min value of CHIDX field.                                            */
  #define CCM_PUBLISH_ENDCONFIG_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define CCM_PUBLISH_ENDCONFIG_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define CCM_PUBLISH_ENDCONFIG_EN_Msk (0x1UL << CCM_PUBLISH_ENDCONFIG_EN_Pos) /*!< Bit mask of EN field.                      */
  #define CCM_PUBLISH_ENDCONFIG_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define CCM_PUBLISH_ENDCONFIG_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define CCM_PUBLISH_ENDCONFIG_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define CCM_PUBLISH_ENDCONFIG_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* CCM_PUBLISH_END: Publish configuration for event END */
  #define CCM_PUBLISH_END_ResetValue (0x00000000UL)  /*!< Reset value of PUBLISH_END register.                                 */

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define CCM_PUBLISH_END_CHIDX_Pos (0UL)            /*!< Position of CHIDX field.                                             */
  #define CCM_PUBLISH_END_CHIDX_Msk (0xFFUL << CCM_PUBLISH_END_CHIDX_Pos) /*!< Bit mask of CHIDX field.                        */
  #define CCM_PUBLISH_END_CHIDX_Min (0x0UL)          /*!< Min value of CHIDX field.                                            */
  #define CCM_PUBLISH_END_CHIDX_Max (0xFFUL)         /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define CCM_PUBLISH_END_EN_Pos (31UL)              /*!< Position of EN field.                                                */
  #define CCM_PUBLISH_END_EN_Msk (0x1UL << CCM_PUBLISH_END_EN_Pos) /*!< Bit mask of EN field.                                  */
  #define CCM_PUBLISH_END_EN_Min (0x0UL)             /*!< Min enumerator value of EN field.                                    */
  #define CCM_PUBLISH_END_EN_Max (0x1UL)             /*!< Max enumerator value of EN field.                                    */
  #define CCM_PUBLISH_END_EN_Disabled (0x0UL)        /*!< Disable publishing                                                   */
  #define CCM_PUBLISH_END_EN_Enabled (0x1UL)         /*!< Enable publishing                                                    */


/* CCM_PUBLISH_ERROR: Publish configuration for event ERROR */
  #define CCM_PUBLISH_ERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ERROR register.                              */

/* CHIDX @Bits 0..7 : DPPI channel that event ERROR will publish to */
  #define CCM_PUBLISH_ERROR_CHIDX_Pos (0UL)          /*!< Position of CHIDX field.                                             */
  #define CCM_PUBLISH_ERROR_CHIDX_Msk (0xFFUL << CCM_PUBLISH_ERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.                    */
  #define CCM_PUBLISH_ERROR_CHIDX_Min (0x0UL)        /*!< Min value of CHIDX field.                                            */
  #define CCM_PUBLISH_ERROR_CHIDX_Max (0xFFUL)       /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define CCM_PUBLISH_ERROR_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define CCM_PUBLISH_ERROR_EN_Msk (0x1UL << CCM_PUBLISH_ERROR_EN_Pos) /*!< Bit mask of EN field.                              */
  #define CCM_PUBLISH_ERROR_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define CCM_PUBLISH_ERROR_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define CCM_PUBLISH_ERROR_EN_Disabled (0x0UL)      /*!< Disable publishing                                                   */
  #define CCM_PUBLISH_ERROR_EN_Enabled (0x1UL)       /*!< Enable publishing                                                    */


/* CCM_INTENSET: Enable interrupt */
  #define CCM_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* ENDCONFIG @Bit 0 : Write '1' to enable interrupt for event ENDCONFIG */
  #define CCM_INTENSET_ENDCONFIG_Pos (0UL)           /*!< Position of ENDCONFIG field.                                         */
  #define CCM_INTENSET_ENDCONFIG_Msk (0x1UL << CCM_INTENSET_ENDCONFIG_Pos) /*!< Bit mask of ENDCONFIG field.                   */
  #define CCM_INTENSET_ENDCONFIG_Min (0x0UL)         /*!< Min enumerator value of ENDCONFIG field.                             */
  #define CCM_INTENSET_ENDCONFIG_Max (0x1UL)         /*!< Max enumerator value of ENDCONFIG field.                             */
  #define CCM_INTENSET_ENDCONFIG_Set (0x1UL)         /*!< Enable                                                               */
  #define CCM_INTENSET_ENDCONFIG_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define CCM_INTENSET_ENDCONFIG_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* END @Bit 1 : Write '1' to enable interrupt for event END */
  #define CCM_INTENSET_END_Pos (1UL)                 /*!< Position of END field.                                               */
  #define CCM_INTENSET_END_Msk (0x1UL << CCM_INTENSET_END_Pos) /*!< Bit mask of END field.                                     */
  #define CCM_INTENSET_END_Min (0x0UL)               /*!< Min enumerator value of END field.                                   */
  #define CCM_INTENSET_END_Max (0x1UL)               /*!< Max enumerator value of END field.                                   */
  #define CCM_INTENSET_END_Set (0x1UL)               /*!< Enable                                                               */
  #define CCM_INTENSET_END_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define CCM_INTENSET_END_Enabled (0x1UL)           /*!< Read: Enabled                                                        */

/* ERROR @Bit 2 : Write '1' to enable interrupt for event ERROR */
  #define CCM_INTENSET_ERROR_Pos (2UL)               /*!< Position of ERROR field.                                             */
  #define CCM_INTENSET_ERROR_Msk (0x1UL << CCM_INTENSET_ERROR_Pos) /*!< Bit mask of ERROR field.                               */
  #define CCM_INTENSET_ERROR_Min (0x0UL)             /*!< Min enumerator value of ERROR field.                                 */
  #define CCM_INTENSET_ERROR_Max (0x1UL)             /*!< Max enumerator value of ERROR field.                                 */
  #define CCM_INTENSET_ERROR_Set (0x1UL)             /*!< Enable                                                               */
  #define CCM_INTENSET_ERROR_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define CCM_INTENSET_ERROR_Enabled (0x1UL)         /*!< Read: Enabled                                                        */


/* CCM_INTENCLR: Disable interrupt */
  #define CCM_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

