adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ================================================= Struct CLOCK_LFCLKSTAT ================================================== */
/**
  * @brief LFCLKSTAT [CLOCK_LFCLKSTAT] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RUN;                               /*!< (@ 0x00000000) Status indicating that TASKS_START task has been
                                                                         triggered for LF clock.*/                                
  __IM  uint32_t  SRC;                               /*!< (@ 0x00000004) Status indicating which clock source is running for LF
                                                                         clock*/                                                  
} NRF_CLOCK_LFCLKSTAT_Type;                          /*!< Size = 8 (0x008)                                                     */

/* CLOCK_LFCLKSTAT_RUN: Status indicating that TASKS_START task has been triggered for LF clock. */
  #define CLOCK_LFCLKSTAT_RUN_ResetValue (0x00000000UL) /*!< Reset value of RUN register.                                      */

/* STATUS @Bit 0 : Clock start task triggered or not */
  #define CLOCK_LFCLKSTAT_RUN_STATUS_Pos (0UL)       /*!< Position of STATUS field.                                            */
  #define CLOCK_LFCLKSTAT_RUN_STATUS_Msk (0x1UL << CLOCK_LFCLKSTAT_RUN_STATUS_Pos) /*!< Bit mask of STATUS field.              */
  #define CLOCK_LFCLKSTAT_RUN_STATUS_Min (0x0UL)     /*!< Min enumerator value of STATUS field.                                */
  #define CLOCK_LFCLKSTAT_RUN_STATUS_Max (0x1UL)     /*!< Max enumerator value of STATUS field.                                */
  #define CLOCK_LFCLKSTAT_RUN_STATUS_NotTriggered (0x0UL) /*!< Task not triggered                                              */
  #define CLOCK_LFCLKSTAT_RUN_STATUS_Triggered (0x1UL) /*!< Task triggered                                                     */


/* CLOCK_LFCLKSTAT_SRC: Status indicating which clock source is running for LF clock */
  #define CLOCK_LFCLKSTAT_SRC_ResetValue (0x00000000UL) /*!< Reset value of SRC register.                                      */

/* LFLPRC @Bit 0 : LFLPRC clock status */
  #define CLOCK_LFCLKSTAT_SRC_LFLPRC_Pos (0UL)       /*!< Position of LFLPRC field.                                            */
  #define CLOCK_LFCLKSTAT_SRC_LFLPRC_Msk (0x1UL << CLOCK_LFCLKSTAT_SRC_LFLPRC_Pos) /*!< Bit mask of LFLPRC field.              */
  #define CLOCK_LFCLKSTAT_SRC_LFLPRC_Min (0x0UL)     /*!< Min enumerator value of LFLPRC field.                                */
  #define CLOCK_LFCLKSTAT_SRC_LFLPRC_Max (0x1UL)     /*!< Max enumerator value of LFLPRC field.                                */
  #define CLOCK_LFCLKSTAT_SRC_LFLPRC_NotActive (0x0UL) /*!< LFLPRC is not active                                               */
  #define CLOCK_LFCLKSTAT_SRC_LFLPRC_Active (0x1UL)  /*!< LFLPRC is active                                                     */

/* LFRC @Bit 1 : LFRC clock status */
  #define CLOCK_LFCLKSTAT_SRC_LFRC_Pos (1UL)         /*!< Position of LFRC field.                                              */
  #define CLOCK_LFCLKSTAT_SRC_LFRC_Msk (0x1UL << CLOCK_LFCLKSTAT_SRC_LFRC_Pos) /*!< Bit mask of LFRC field.                    */
  #define CLOCK_LFCLKSTAT_SRC_LFRC_Min (0x0UL)       /*!< Min enumerator value of LFRC field.                                  */
  #define CLOCK_LFCLKSTAT_SRC_LFRC_Max (0x1UL)       /*!< Max enumerator value of LFRC field.                                  */
  #define CLOCK_LFCLKSTAT_SRC_LFRC_NotActive (0x0UL) /*!< LFRC is not active                                                   */
  #define CLOCK_LFCLKSTAT_SRC_LFRC_Active (0x1UL)    /*!< LFRC is active                                                       */

/* LFXO @Bit 2 : LFXO clock status */
  #define CLOCK_LFCLKSTAT_SRC_LFXO_Pos (2UL)         /*!< Position of LFXO field.                                              */
  #define CLOCK_LFCLKSTAT_SRC_LFXO_Msk (0x1UL << CLOCK_LFCLKSTAT_SRC_LFXO_Pos) /*!< Bit mask of LFXO field.                    */
  #define CLOCK_LFCLKSTAT_SRC_LFXO_Min (0x0UL)       /*!< Min enumerator value of LFXO field.                                  */
  #define CLOCK_LFCLKSTAT_SRC_LFXO_Max (0x1UL)       /*!< Max enumerator value of LFXO field.                                  */
  #define CLOCK_LFCLKSTAT_SRC_LFXO_NotActive (0x0UL) /*!< LFXO is not active                                                   */
  #define CLOCK_LFCLKSTAT_SRC_LFXO_Active (0x1UL)    /*!< LFXO is active                                                       */

/* SYNTH @Bit 3 : Synthesized LF clock status */
  #define CLOCK_LFCLKSTAT_SRC_SYNTH_Pos (3UL)        /*!< Position of SYNTH field.                                             */
  #define CLOCK_LFCLKSTAT_SRC_SYNTH_Msk (0x1UL << CLOCK_LFCLKSTAT_SRC_SYNTH_Pos) /*!< Bit mask of SYNTH field.                 */
  #define CLOCK_LFCLKSTAT_SRC_SYNTH_Min (0x0UL)      /*!< Min enumerator value of SYNTH field.                                 */
  #define CLOCK_LFCLKSTAT_SRC_SYNTH_Max (0x1UL)      /*!< Max enumerator value of SYNTH field.                                 */
  #define CLOCK_LFCLKSTAT_SRC_SYNTH_NotActive (0x0UL) /*!< SYNTH is not active                                                 */
  #define CLOCK_LFCLKSTAT_SRC_SYNTH_Active (0x1UL)   /*!< SYNTH is active                                                      */



/* ================================================= Struct CLOCK_LFCLKCTRL ================================================== */
/**
  * @brief LFCLKCTRL [CLOCK_LFCLKCTRL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ALWAYSRUN;                         /*!< (@ 0x00000000) Force the LF clock source and tree running always     */
  __IOM uint32_t  SRC;                               /*!< (@ 0x00000004) Select the clock source for LF clock                  */
} NRF_CLOCK_LFCLKCTRL_Type;                          /*!< Size = 8 (0x008)                                                     */

/* CLOCK_LFCLKCTRL_ALWAYSRUN: Force the LF clock source and tree running always */
  #define CLOCK_LFCLKCTRL_ALWAYSRUN_ResetValue (0x00000001UL) /*!< Reset value of ALWAYSRUN register.                          */

