adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CLOCK_CONFIG_THRESHOLD: Threshold limit while clock switching */
  #define CLOCK_CONFIG_THRESHOLD_ResetValue (0x00043B14UL) /*!< Reset value of THRESHOLD register.                             */

/* LOW @Bits 0..7 : Threshold low limit while clock switching */
  #define CLOCK_CONFIG_THRESHOLD_LOW_Pos (0UL)       /*!< Position of LOW field.                                               */
  #define CLOCK_CONFIG_THRESHOLD_LOW_Msk (0xFFUL << CLOCK_CONFIG_THRESHOLD_LOW_Pos) /*!< Bit mask of LOW field.                */
  #define CLOCK_CONFIG_THRESHOLD_LOW_Min (0x0UL)     /*!< Min value of LOW field.                                              */
  #define CLOCK_CONFIG_THRESHOLD_LOW_Max (0xFFUL)    /*!< Max size of LOW field.                                               */

/* HIGH @Bits 8..15 : Threshold high limit while clock switching */
  #define CLOCK_CONFIG_THRESHOLD_HIGH_Pos (8UL)      /*!< Position of HIGH field.                                              */
  #define CLOCK_CONFIG_THRESHOLD_HIGH_Msk (0xFFUL << CLOCK_CONFIG_THRESHOLD_HIGH_Pos) /*!< Bit mask of HIGH field.             */
  #define CLOCK_CONFIG_THRESHOLD_HIGH_Min (0x0UL)    /*!< Min value of HIGH field.                                             */
  #define CLOCK_CONFIG_THRESHOLD_HIGH_Max (0xFFUL)   /*!< Max size of HIGH field.                                              */

/* DIFF @Bits 16..23 : Threshold difference while clock switching */
  #define CLOCK_CONFIG_THRESHOLD_DIFF_Pos (16UL)     /*!< Position of DIFF field.                                              */
  #define CLOCK_CONFIG_THRESHOLD_DIFF_Msk (0xFFUL << CLOCK_CONFIG_THRESHOLD_DIFF_Pos) /*!< Bit mask of DIFF field.             */
  #define CLOCK_CONFIG_THRESHOLD_DIFF_Min (0x0UL)    /*!< Min value of DIFF field.                                             */
  #define CLOCK_CONFIG_THRESHOLD_DIFF_Max (0xFFUL)   /*!< Max size of DIFF field.                                              */


/* ====================================================== Struct CLOCK ======================================================= */
/**
  * @brief CLOCK
  */
  typedef struct {                                   /*!< CLOCK Structure                                                      */
    __OM uint32_t TASKS_LFCLKSTART;                  /*!< (@ 0x00000000) Start the LF clock source                             */
    __OM uint32_t TASKS_LFCLKSTOP;                   /*!< (@ 0x00000004) Clear the TASKS_CLKSTART request                      */
    __IM uint32_t RESERVED[62];
    __IOM uint32_t EVENTS_LFCLKSTARTED;              /*!< (@ 0x00000100) LF clock started                                      */
    __IOM uint32_t EVENTS_LFCLKSRCCHANGED;           /*!< (@ 0x00000104) LF clock source changed                               */
    __IM uint32_t RESERVED1[126];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IOM NRF_CLOCK_LFCLKSTAT_Type LFCLKSTAT;        /*!< (@ 0x00000400) (unspecified)                                         */
    __IM uint32_t RESERVED3[14];
    __IOM NRF_CLOCK_LFCLKCTRL_Type LFCLKCTRL;        /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED4[2];
    __IOM NRF_CLOCK_CONFIG_Type CONFIG;              /*!< (@ 0x00000450) (unspecified)                                         */
  } NRF_CLOCK_Type;                                  /*!< Size = 1112 (0x458)                                                  */

/* CLOCK_TASKS_LFCLKSTART: Start the LF clock source */
  #define CLOCK_TASKS_LFCLKSTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_LFCLKSTART register.                      */

/* TASKS_LFCLKSTART @Bit 0 : Start the LF clock source */
  #define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Pos (0UL) /*!< Position of TASKS_LFCLKSTART field.                           */
  #define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Msk (0x1UL << CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Pos) /*!< Bit mask of
                                                                            TASKS_LFCLKSTART field.*/                             
  #define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Min (0x1UL) /*!< Min enumerator value of TASKS_LFCLKSTART field.             */
  #define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Max (0x1UL) /*!< Max enumerator value of TASKS_LFCLKSTART field.             */
  #define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Trigger (0x1UL) /*!< Trigger task                                            */


/* CLOCK_TASKS_LFCLKSTOP: Clear the TASKS_CLKSTART request */
  #define CLOCK_TASKS_LFCLKSTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_LFCLKSTOP register.                        */

/* TASKS_LFCLKSTOP @Bit 0 : Clear the TASKS_CLKSTART request */
  #define CLOCK_TASKS_LFCLKSTOP_TASKS_LFCLKSTOP_Pos (0UL) /*!< Position of TASKS_LFCLKSTOP field.                              */
  #define CLOCK_TASKS_LFCLKSTOP_TASKS_LFCLKSTOP_Msk (0x1UL << CLOCK_TASKS_LFCLKSTOP_TASKS_LFCLKSTOP_Pos) /*!< Bit mask of
                                                                            TASKS_LFCLKSTOP field.*/                              
  #define CLOCK_TASKS_LFCLKSTOP_TASKS_LFCLKSTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_LFCLKSTOP field.                */
  #define CLOCK_TASKS_LFCLKSTOP_TASKS_LFCLKSTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_LFCLKSTOP field.                */
  #define CLOCK_TASKS_LFCLKSTOP_TASKS_LFCLKSTOP_Trigger (0x1UL) /*!< Trigger task                                              */


/* CLOCK_EVENTS_LFCLKSTARTED: LF clock started */
  #define CLOCK_EVENTS_LFCLKSTARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_LFCLKSTARTED register.                */

