adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EVENTS_LFCLKSTARTED @Bit 0 : LF clock started */
  #define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Pos (0UL) /*!< Position of EVENTS_LFCLKSTARTED field.                  */
  #define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Msk (0x1UL << CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Pos) /*!<
                                                                            Bit mask of EVENTS_LFCLKSTARTED field.*/              
  #define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_LFCLKSTARTED field.    */
  #define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_LFCLKSTARTED field.    */
  #define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Generated (0x1UL) /*!< Event generated                                 */


/* CLOCK_EVENTS_LFCLKSRCCHANGED: LF clock source changed */
  #define CLOCK_EVENTS_LFCLKSRCCHANGED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_LFCLKSRCCHANGED register.          */

/* EVENTS_LFCLKSRCCHANGED @Bit 0 : LF clock source changed */
  #define CLOCK_EVENTS_LFCLKSRCCHANGED_EVENTS_LFCLKSRCCHANGED_Pos (0UL) /*!< Position of EVENTS_LFCLKSRCCHANGED field.         */
  #define CLOCK_EVENTS_LFCLKSRCCHANGED_EVENTS_LFCLKSRCCHANGED_Msk (0x1UL << CLOCK_EVENTS_LFCLKSRCCHANGED_EVENTS_LFCLKSRCCHANGED_Pos)
                                                                            /*!< Bit mask of EVENTS_LFCLKSRCCHANGED field.*/      
  #define CLOCK_EVENTS_LFCLKSRCCHANGED_EVENTS_LFCLKSRCCHANGED_Min (0x0UL) /*!< Min enumerator value of EVENTS_LFCLKSRCCHANGED
                                                                            field.*/                                              
  #define CLOCK_EVENTS_LFCLKSRCCHANGED_EVENTS_LFCLKSRCCHANGED_Max (0x1UL) /*!< Max enumerator value of EVENTS_LFCLKSRCCHANGED
                                                                            field.*/                                              
  #define CLOCK_EVENTS_LFCLKSRCCHANGED_EVENTS_LFCLKSRCCHANGED_NotGenerated (0x0UL) /*!< Event not generated                    */
  #define CLOCK_EVENTS_LFCLKSRCCHANGED_EVENTS_LFCLKSRCCHANGED_Generated (0x1UL) /*!< Event generated                           */


/* CLOCK_INTEN: Enable or disable interrupt */
  #define CLOCK_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* LFCLKSTARTED @Bit 0 : Enable or disable interrupt for event LFCLKSTARTED */
  #define CLOCK_INTEN_LFCLKSTARTED_Pos (0UL)         /*!< Position of LFCLKSTARTED field.                                      */
  #define CLOCK_INTEN_LFCLKSTARTED_Msk (0x1UL << CLOCK_INTEN_LFCLKSTARTED_Pos) /*!< Bit mask of LFCLKSTARTED field.            */
  #define CLOCK_INTEN_LFCLKSTARTED_Min (0x0UL)       /*!< Min enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTEN_LFCLKSTARTED_Max (0x1UL)       /*!< Max enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTEN_LFCLKSTARTED_Disabled (0x0UL)  /*!< Disable                                                              */
  #define CLOCK_INTEN_LFCLKSTARTED_Enabled (0x1UL)   /*!< Enable                                                               */

/* LFCLKSRCCHANGED @Bit 1 : Enable or disable interrupt for event LFCLKSRCCHANGED */
  #define CLOCK_INTEN_LFCLKSRCCHANGED_Pos (1UL)      /*!< Position of LFCLKSRCCHANGED field.                                   */
  #define CLOCK_INTEN_LFCLKSRCCHANGED_Msk (0x1UL << CLOCK_INTEN_LFCLKSRCCHANGED_Pos) /*!< Bit mask of LFCLKSRCCHANGED field.   */
  #define CLOCK_INTEN_LFCLKSRCCHANGED_Min (0x0UL)    /*!< Min enumerator value of LFCLKSRCCHANGED field.                       */
  #define CLOCK_INTEN_LFCLKSRCCHANGED_Max (0x1UL)    /*!< Max enumerator value of LFCLKSRCCHANGED field.                       */
  #define CLOCK_INTEN_LFCLKSRCCHANGED_Disabled (0x0UL) /*!< Disable                                                            */
  #define CLOCK_INTEN_LFCLKSRCCHANGED_Enabled (0x1UL) /*!< Enable                                                              */


/* CLOCK_INTENSET: Enable interrupt */
  #define CLOCK_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* LFCLKSTARTED @Bit 0 : Write '1' to enable interrupt for event LFCLKSTARTED */
  #define CLOCK_INTENSET_LFCLKSTARTED_Pos (0UL)      /*!< Position of LFCLKSTARTED field.                                      */
  #define CLOCK_INTENSET_LFCLKSTARTED_Msk (0x1UL << CLOCK_INTENSET_LFCLKSTARTED_Pos) /*!< Bit mask of LFCLKSTARTED field.      */
  #define CLOCK_INTENSET_LFCLKSTARTED_Min (0x0UL)    /*!< Min enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTENSET_LFCLKSTARTED_Max (0x1UL)    /*!< Max enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTENSET_LFCLKSTARTED_Set (0x1UL)    /*!< Enable                                                               */
  #define CLOCK_INTENSET_LFCLKSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define CLOCK_INTENSET_LFCLKSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* LFCLKSRCCHANGED @Bit 1 : Write '1' to enable interrupt for event LFCLKSRCCHANGED */
  #define CLOCK_INTENSET_LFCLKSRCCHANGED_Pos (1UL)   /*!< Position of LFCLKSRCCHANGED field.                                   */
  #define CLOCK_INTENSET_LFCLKSRCCHANGED_Msk (0x1UL << CLOCK_INTENSET_LFCLKSRCCHANGED_Pos) /*!< Bit mask of LFCLKSRCCHANGED
                                                                            field.*/                                              
  #define CLOCK_INTENSET_LFCLKSRCCHANGED_Min (0x0UL) /*!< Min enumerator value of LFCLKSRCCHANGED field.                       */
  #define CLOCK_INTENSET_LFCLKSRCCHANGED_Max (0x1UL) /*!< Max enumerator value of LFCLKSRCCHANGED field.                       */
  #define CLOCK_INTENSET_LFCLKSRCCHANGED_Set (0x1UL) /*!< Enable                                                               */
  #define CLOCK_INTENSET_LFCLKSRCCHANGED_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define CLOCK_INTENSET_LFCLKSRCCHANGED_Enabled (0x1UL) /*!< Read: Enabled                                                    */


