adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CLOCK_INTENCLR: Disable interrupt */
  #define CLOCK_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* LFCLKSTARTED @Bit 0 : Write '1' to disable interrupt for event LFCLKSTARTED */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Pos (0UL)      /*!< Position of LFCLKSTARTED field.                                      */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Msk (0x1UL << CLOCK_INTENCLR_LFCLKSTARTED_Pos) /*!< Bit mask of LFCLKSTARTED field.      */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Min (0x0UL)    /*!< Min enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Max (0x1UL)    /*!< Max enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Clear (0x1UL)  /*!< Disable                                                              */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* LFCLKSRCCHANGED @Bit 1 : Write '1' to disable interrupt for event LFCLKSRCCHANGED */
  #define CLOCK_INTENCLR_LFCLKSRCCHANGED_Pos (1UL)   /*!< Position of LFCLKSRCCHANGED field.                                   */
  #define CLOCK_INTENCLR_LFCLKSRCCHANGED_Msk (0x1UL << CLOCK_INTENCLR_LFCLKSRCCHANGED_Pos) /*!< Bit mask of LFCLKSRCCHANGED
                                                                            field.*/                                              
  #define CLOCK_INTENCLR_LFCLKSRCCHANGED_Min (0x0UL) /*!< Min enumerator value of LFCLKSRCCHANGED field.                       */
  #define CLOCK_INTENCLR_LFCLKSRCCHANGED_Max (0x1UL) /*!< Max enumerator value of LFCLKSRCCHANGED field.                       */
  #define CLOCK_INTENCLR_LFCLKSRCCHANGED_Clear (0x1UL) /*!< Disable                                                            */
  #define CLOCK_INTENCLR_LFCLKSRCCHANGED_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define CLOCK_INTENCLR_LFCLKSRCCHANGED_Enabled (0x1UL) /*!< Read: Enabled                                                    */


/* CLOCK_INTPEND: Pending interrupts */
  #define CLOCK_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* LFCLKSTARTED @Bit 0 : Read pending status of interrupt for event LFCLKSTARTED */
  #define CLOCK_INTPEND_LFCLKSTARTED_Pos (0UL)       /*!< Position of LFCLKSTARTED field.                                      */
  #define CLOCK_INTPEND_LFCLKSTARTED_Msk (0x1UL << CLOCK_INTPEND_LFCLKSTARTED_Pos) /*!< Bit mask of LFCLKSTARTED field.        */
  #define CLOCK_INTPEND_LFCLKSTARTED_Min (0x0UL)     /*!< Min enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTPEND_LFCLKSTARTED_Max (0x1UL)     /*!< Max enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTPEND_LFCLKSTARTED_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define CLOCK_INTPEND_LFCLKSTARTED_Pending (0x1UL) /*!< Read: Pending                                                        */

/* LFCLKSRCCHANGED @Bit 1 : Read pending status of interrupt for event LFCLKSRCCHANGED */
  #define CLOCK_INTPEND_LFCLKSRCCHANGED_Pos (1UL)    /*!< Position of LFCLKSRCCHANGED field.                                   */
  #define CLOCK_INTPEND_LFCLKSRCCHANGED_Msk (0x1UL << CLOCK_INTPEND_LFCLKSRCCHANGED_Pos) /*!< Bit mask of LFCLKSRCCHANGED
                                                                            field.*/                                              
  #define CLOCK_INTPEND_LFCLKSRCCHANGED_Min (0x0UL)  /*!< Min enumerator value of LFCLKSRCCHANGED field.                       */
  #define CLOCK_INTPEND_LFCLKSRCCHANGED_Max (0x1UL)  /*!< Max enumerator value of LFCLKSRCCHANGED field.                       */
  #define CLOCK_INTPEND_LFCLKSRCCHANGED_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define CLOCK_INTPEND_LFCLKSRCCHANGED_Pending (0x1UL) /*!< Read: Pending                                                     */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          CM33SS                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct CM33SS ====================================================== */
/**
  * @brief CM33 SubSystem
  */
  typedef struct {                                   /*!< CM33SS Structure                                                     */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_FPUIOC;                    /*!< (@ 0x00000100) An invalid operation exception has occurred in the
                                                                         FPU.*/                                                   
    __IOM uint32_t EVENTS_FPUDZC;                    /*!< (@ 0x00000104) A floating-point divide-by-zero exception has occurred
                                                                         in the FPU.*/                                            
    __IOM uint32_t EVENTS_FPUOFC;                    /*!< (@ 0x00000108) A floating-point overflow exception has occurred in the
                                                                         FPU.*/                                                   
    __IOM uint32_t EVENTS_FPUUFC;                    /*!< (@ 0x0000010C) A floating-point underflow exception has occurred in
                                                                         the FPU.*/                                               
    __IOM uint32_t EVENTS_FPUIXC;                    /*!< (@ 0x00000110) A floating-point inexact exception has occurred in the
                                                                         FPU.*/                                                   
    __IOM uint32_t EVENTS_FPUIDC;                    /*!< (@ 0x00000114) A floating-point input denormal exception has occurred
                                                                         in the FPU.*/                                            
    __IM uint32_t RESERVED1[250];
    __IOM uint32_t LOCK;                             /*!< (@ 0x00000500) Register to lock the certain parts of the CPU from
                                                                         being modified.*/                                        
    __IM uint32_t CPUID;                             /*!< (@ 0x00000504) The identifier for the CPU in this subsystem.         */
  } NRF_CM33SS_Type;                                 /*!< Size = 1288 (0x508)                                                  */

/* CM33SS_EVENTS_FPUIOC: An invalid operation exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUIOC_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FPUIOC register.                           */

/* EVENTS_FPUIOC @Bit 0 : An invalid operation exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUIOC_EVENTS_FPUIOC_Pos (0UL) /*!< Position of EVENTS_FPUIOC field.                                   */
  #define CM33SS_EVENTS_FPUIOC_EVENTS_FPUIOC_Msk (0x1UL << CM33SS_EVENTS_FPUIOC_EVENTS_FPUIOC_Pos) /*!< Bit mask of
                                                                            EVENTS_FPUIOC field.*/                                
  #define CM33SS_EVENTS_FPUIOC_EVENTS_FPUIOC_Min (0x0UL) /*!< Min enumerator value of EVENTS_FPUIOC field.                     */
  #define CM33SS_EVENTS_FPUIOC_EVENTS_FPUIOC_Max (0x1UL) /*!< Max enumerator value of EVENTS_FPUIOC field.                     */
  #define CM33SS_EVENTS_FPUIOC_EVENTS_FPUIOC_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define CM33SS_EVENTS_FPUIOC_EVENTS_FPUIOC_Generated (0x1UL) /*!< Event generated                                            */


