adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CM33SS_EVENTS_FPUDZC: A floating-point divide-by-zero exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUDZC_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FPUDZC register.                           */

/* EVENTS_FPUDZC @Bit 0 : A floating-point divide-by-zero exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUDZC_EVENTS_FPUDZC_Pos (0UL) /*!< Position of EVENTS_FPUDZC field.                                   */
  #define CM33SS_EVENTS_FPUDZC_EVENTS_FPUDZC_Msk (0x1UL << CM33SS_EVENTS_FPUDZC_EVENTS_FPUDZC_Pos) /*!< Bit mask of
                                                                            EVENTS_FPUDZC field.*/                                
  #define CM33SS_EVENTS_FPUDZC_EVENTS_FPUDZC_Min (0x0UL) /*!< Min enumerator value of EVENTS_FPUDZC field.                     */
  #define CM33SS_EVENTS_FPUDZC_EVENTS_FPUDZC_Max (0x1UL) /*!< Max enumerator value of EVENTS_FPUDZC field.                     */
  #define CM33SS_EVENTS_FPUDZC_EVENTS_FPUDZC_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define CM33SS_EVENTS_FPUDZC_EVENTS_FPUDZC_Generated (0x1UL) /*!< Event generated                                            */


/* CM33SS_EVENTS_FPUOFC: A floating-point overflow exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUOFC_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FPUOFC register.                           */

/* EVENTS_FPUOFC @Bit 0 : A floating-point overflow exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUOFC_EVENTS_FPUOFC_Pos (0UL) /*!< Position of EVENTS_FPUOFC field.                                   */
  #define CM33SS_EVENTS_FPUOFC_EVENTS_FPUOFC_Msk (0x1UL << CM33SS_EVENTS_FPUOFC_EVENTS_FPUOFC_Pos) /*!< Bit mask of
                                                                            EVENTS_FPUOFC field.*/                                
  #define CM33SS_EVENTS_FPUOFC_EVENTS_FPUOFC_Min (0x0UL) /*!< Min enumerator value of EVENTS_FPUOFC field.                     */
  #define CM33SS_EVENTS_FPUOFC_EVENTS_FPUOFC_Max (0x1UL) /*!< Max enumerator value of EVENTS_FPUOFC field.                     */
  #define CM33SS_EVENTS_FPUOFC_EVENTS_FPUOFC_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define CM33SS_EVENTS_FPUOFC_EVENTS_FPUOFC_Generated (0x1UL) /*!< Event generated                                            */


/* CM33SS_EVENTS_FPUUFC: A floating-point underflow exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUUFC_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FPUUFC register.                           */

/* EVENTS_FPUUFC @Bit 0 : A floating-point underflow exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUUFC_EVENTS_FPUUFC_Pos (0UL) /*!< Position of EVENTS_FPUUFC field.                                   */
  #define CM33SS_EVENTS_FPUUFC_EVENTS_FPUUFC_Msk (0x1UL << CM33SS_EVENTS_FPUUFC_EVENTS_FPUUFC_Pos) /*!< Bit mask of
                                                                            EVENTS_FPUUFC field.*/                                
  #define CM33SS_EVENTS_FPUUFC_EVENTS_FPUUFC_Min (0x0UL) /*!< Min enumerator value of EVENTS_FPUUFC field.                     */
  #define CM33SS_EVENTS_FPUUFC_EVENTS_FPUUFC_Max (0x1UL) /*!< Max enumerator value of EVENTS_FPUUFC field.                     */
  #define CM33SS_EVENTS_FPUUFC_EVENTS_FPUUFC_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define CM33SS_EVENTS_FPUUFC_EVENTS_FPUUFC_Generated (0x1UL) /*!< Event generated                                            */


/* CM33SS_EVENTS_FPUIXC: A floating-point inexact exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUIXC_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FPUIXC register.                           */

/* EVENTS_FPUIXC @Bit 0 : A floating-point inexact exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUIXC_EVENTS_FPUIXC_Pos (0UL) /*!< Position of EVENTS_FPUIXC field.                                   */
  #define CM33SS_EVENTS_FPUIXC_EVENTS_FPUIXC_Msk (0x1UL << CM33SS_EVENTS_FPUIXC_EVENTS_FPUIXC_Pos) /*!< Bit mask of
                                                                            EVENTS_FPUIXC field.*/                                
  #define CM33SS_EVENTS_FPUIXC_EVENTS_FPUIXC_Min (0x0UL) /*!< Min enumerator value of EVENTS_FPUIXC field.                     */
  #define CM33SS_EVENTS_FPUIXC_EVENTS_FPUIXC_Max (0x1UL) /*!< Max enumerator value of EVENTS_FPUIXC field.                     */
  #define CM33SS_EVENTS_FPUIXC_EVENTS_FPUIXC_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define CM33SS_EVENTS_FPUIXC_EVENTS_FPUIXC_Generated (0x1UL) /*!< Event generated                                            */


/* CM33SS_EVENTS_FPUIDC: A floating-point input denormal exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUIDC_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FPUIDC register.                           */

/* EVENTS_FPUIDC @Bit 0 : A floating-point input denormal exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUIDC_EVENTS_FPUIDC_Pos (0UL) /*!< Position of EVENTS_FPUIDC field.                                   */
  #define CM33SS_EVENTS_FPUIDC_EVENTS_FPUIDC_Msk (0x1UL << CM33SS_EVENTS_FPUIDC_EVENTS_FPUIDC_Pos) /*!< Bit mask of
                                                                            EVENTS_FPUIDC field.*/                                
  #define CM33SS_EVENTS_FPUIDC_EVENTS_FPUIDC_Min (0x0UL) /*!< Min enumerator value of EVENTS_FPUIDC field.                     */
  #define CM33SS_EVENTS_FPUIDC_EVENTS_FPUIDC_Max (0x1UL) /*!< Max enumerator value of EVENTS_FPUIDC field.                     */
  #define CM33SS_EVENTS_FPUIDC_EVENTS_FPUIDC_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define CM33SS_EVENTS_FPUIDC_EVENTS_FPUIDC_Generated (0x1UL) /*!< Event generated                                            */


/* CM33SS_LOCK: Register to lock the certain parts of the CPU from being modified. */
  #define CM33SS_LOCK_ResetValue (0x00000000UL)      /*!< Reset value of LOCK register.                                        */

/* LOCKVTORAIRCRS @Bit 0 : Locks both the Vector table Offset Register (VTOR) and Application Interrupt and Reset Control
                           Register (AIRCR) for secure mode. */                                                                   
                                                                                                                                  
  #define CM33SS_LOCK_LOCKVTORAIRCRS_Pos (0UL)       /*!< Position of LOCKVTORAIRCRS field.                                    */
  #define CM33SS_LOCK_LOCKVTORAIRCRS_Msk (0x1UL << CM33SS_LOCK_LOCKVTORAIRCRS_Pos) /*!< Bit mask of LOCKVTORAIRCRS field.      */
  #define CM33SS_LOCK_LOCKVTORAIRCRS_Min (0x0UL)     /*!< Min enumerator value of LOCKVTORAIRCRS field.                        */
  #define CM33SS_LOCK_LOCKVTORAIRCRS_Max (0x1UL)     /*!< Max enumerator value of LOCKVTORAIRCRS field.                        */
  #define CM33SS_LOCK_LOCKVTORAIRCRS_NotLocked (0x0UL) /*!< Both VTOR and AIRCR can be changed.                                */
  #define CM33SS_LOCK_LOCKVTORAIRCRS_Locked (0x1UL)  /*!< Prevents changes to both VTOR and AIRCR.                             */

/* LOCKVTORNS @Bit 1 : Locks the Vector table Offset Register (VTOR) for non-secure mode. */
  #define CM33SS_LOCK_LOCKVTORNS_Pos (1UL)           /*!< Position of LOCKVTORNS field.                                        */
  #define CM33SS_LOCK_LOCKVTORNS_Msk (0x1UL << CM33SS_LOCK_LOCKVTORNS_Pos) /*!< Bit mask of LOCKVTORNS field.                  */
  #define CM33SS_LOCK_LOCKVTORNS_Min (0x0UL)         /*!< Min enumerator value of LOCKVTORNS field.                            */
  #define CM33SS_LOCK_LOCKVTORNS_Max (0x1UL)         /*!< Max enumerator value of LOCKVTORNS field.                            */
  #define CM33SS_LOCK_LOCKVTORNS_NotLocked (0x0UL)   /*!< VTOR can be changed.                                                 */
  #define CM33SS_LOCK_LOCKVTORNS_Locked (0x1UL)      /*!< Prevents changes to VTOR.                                            */

