adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LOCKMPUS @Bit 2 : Locks the Memory Protection Unit (MPU) for secure mode. */
  #define CM33SS_LOCK_LOCKMPUS_Pos (2UL)             /*!< Position of LOCKMPUS field.                                          */
  #define CM33SS_LOCK_LOCKMPUS_Msk (0x1UL << CM33SS_LOCK_LOCKMPUS_Pos) /*!< Bit mask of LOCKMPUS field.                        */
  #define CM33SS_LOCK_LOCKMPUS_Min (0x0UL)           /*!< Min enumerator value of LOCKMPUS field.                              */
  #define CM33SS_LOCK_LOCKMPUS_Max (0x1UL)           /*!< Max enumerator value of LOCKMPUS field.                              */
  #define CM33SS_LOCK_LOCKMPUS_NotLocked (0x0UL)     /*!< MPU registers can be changed.                                        */
  #define CM33SS_LOCK_LOCKMPUS_Locked (0x1UL)        /*!< Prevents changes to MPU registers.                                   */

/* LOCKMPUNS @Bit 3 : Locks the Memory Protection Unit (MPU) for non secure mode. */
  #define CM33SS_LOCK_LOCKMPUNS_Pos (3UL)            /*!< Position of LOCKMPUNS field.                                         */
  #define CM33SS_LOCK_LOCKMPUNS_Msk (0x1UL << CM33SS_LOCK_LOCKMPUNS_Pos) /*!< Bit mask of LOCKMPUNS field.                     */
  #define CM33SS_LOCK_LOCKMPUNS_Min (0x0UL)          /*!< Min enumerator value of LOCKMPUNS field.                             */
  #define CM33SS_LOCK_LOCKMPUNS_Max (0x1UL)          /*!< Max enumerator value of LOCKMPUNS field.                             */
  #define CM33SS_LOCK_LOCKMPUNS_NotLocked (0x0UL)    /*!< MPU registers can be changed.                                        */
  #define CM33SS_LOCK_LOCKMPUNS_Locked (0x1UL)       /*!< Prevents changes to MPU registers.                                   */

/* LOCKSAU @Bit 4 : Locks the Security Attribution Unit (SAU) */
  #define CM33SS_LOCK_LOCKSAU_Pos (4UL)              /*!< Position of LOCKSAU field.                                           */
  #define CM33SS_LOCK_LOCKSAU_Msk (0x1UL << CM33SS_LOCK_LOCKSAU_Pos) /*!< Bit mask of LOCKSAU field.                           */
  #define CM33SS_LOCK_LOCKSAU_Min (0x0UL)            /*!< Min enumerator value of LOCKSAU field.                               */
  #define CM33SS_LOCK_LOCKSAU_Max (0x1UL)            /*!< Max enumerator value of LOCKSAU field.                               */
  #define CM33SS_LOCK_LOCKSAU_NotLocked (0x0UL)      /*!< SAU registers can be changed.                                        */
  #define CM33SS_LOCK_LOCKSAU_Locked (0x1UL)         /*!< Prevents changes to SAU registers.                                   */


/* CM33SS_CPUID: The identifier for the CPU in this subsystem. */
  #define CM33SS_CPUID_ResetValue (0x00000000UL)     /*!< Reset value of CPUID register.                                       */

/* CPUID @Bits 0..31 : The CPU identifier. */
  #define CM33SS_CPUID_CPUID_Pos (0UL)               /*!< Position of CPUID field.                                             */
  #define CM33SS_CPUID_CPUID_Msk (0xFFFFFFFFUL << CM33SS_CPUID_CPUID_Pos) /*!< Bit mask of CPUID field.                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           COEXC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct COEXC_CCMALLOW ================================================== */
/**
  * @brief CCMALLOW [COEXC_CCMALLOW] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MODE[8];                           /*!< (@ 0x00000000) Coexistence client mode allow configuration for mode
                                                                         [o] in client [n]*/                                      
} NRF_COEXC_CCMALLOW_Type;                           /*!< Size = 32 (0x020)                                                    */
  #define COEXC_CCMALLOW_MaxCount (16UL)             /*!< Max size of CCMALLOW[16] array.                                      */

/* COEXC_CCMALLOW_MODE: Coexistence client mode allow configuration for mode [o] in client [n] */
  #define COEXC_CCMALLOW_MODE_MaxCount (8UL)         /*!< Max size of MODE[8] array.                                           */
  #define COEXC_CCMALLOW_MODE_ResetValue (0x00000000UL) /*!< Reset value of MODE[8] register.                                  */

/* Field group CLIENT0 : (unspecified) */
/* MODE0 @Bit 0 : Coexistence allowed configuration for mode [0] in client [0] */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE0_Pos (0UL) /*!< Position of MODE0 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT0_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE1 @Bit 1 : Coexistence allowed configuration for mode [1] in client [0] */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE1_Pos (1UL) /*!< Position of MODE1 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT0_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* End field group CLIENT0. */

