adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* Field group CLIENT1 : (unspecified) */
/* MODE0 @Bit 2 : Coexistence allowed configuration for mode [0] in client [1] */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE0_Pos (2UL) /*!< Position of MODE0 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT1_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE1 @Bit 3 : Coexistence allowed configuration for mode [1] in client [1] */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE1_Pos (3UL) /*!< Position of MODE1 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT1_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT1_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* End field group CLIENT1. */

/* Field group CLIENT2 : (unspecified) */
/* MODE0 @Bit 4 : Coexistence allowed configuration for mode [0] in client [2] */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE0_Pos (4UL) /*!< Position of MODE0 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT2_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE1 @Bit 5 : Coexistence allowed configuration for mode [1] in client [2] */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE1_Pos (5UL) /*!< Position of MODE1 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT2_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT2_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* End field group CLIENT2. */

/* Field group CLIENT3 : (unspecified) */
/* MODE0 @Bit 6 : Coexistence allowed configuration for mode [0] in client [3] */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE0_Pos (6UL) /*!< Position of MODE0 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT3_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE1 @Bit 7 : Coexistence allowed configuration for mode [1] in client [3] */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE1_Pos (7UL) /*!< Position of MODE1 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT3_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT3_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* End field group CLIENT3. */

/* Field group CLIENT4 : (unspecified) */
/* MODE0 @Bit 8 : Coexistence allowed configuration for mode [0] in client [4] */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE0_Pos (8UL) /*!< Position of MODE0 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT4_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE1 @Bit 9 : Coexistence allowed configuration for mode [1] in client [4] */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE1_Pos (9UL) /*!< Position of MODE1 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT4_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT4_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* End field group CLIENT4. */

/* Field group CLIENT5 : (unspecified) */
/* MODE0 @Bit 10 : Coexistence allowed configuration for mode [0] in client [5] */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE0_Pos (10UL) /*!< Position of MODE0 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT5_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE1 @Bit 11 : Coexistence allowed configuration for mode [1] in client [5] */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE1_Pos (11UL) /*!< Position of MODE1 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT5_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* End field group CLIENT5. */

/* Field group CLIENT6 : (unspecified) */
/* MODE0 @Bit 12 : Coexistence allowed configuration for mode [0] in client [6] */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE0_Pos (12UL) /*!< Position of MODE0 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT6_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE1 @Bit 13 : Coexistence allowed configuration for mode [1] in client [6] */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE1_Pos (13UL) /*!< Position of MODE1 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT6_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* End field group CLIENT6. */

/* Field group CLIENT7 : (unspecified) */
/* MODE0 @Bit 14 : Coexistence allowed configuration for mode [0] in client [7] */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE0_Pos (14UL) /*!< Position of MODE0 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT7_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE1 @Bit 15 : Coexistence allowed configuration for mode [1] in client [7] */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE1_Pos (15UL) /*!< Position of MODE1 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT7_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* End field group CLIENT7. */

