adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* Field group CLIENT8 : (unspecified) */
/* MODE0 @Bit 16 : Coexistence allowed configuration for mode [0] in client [8] */
    #define COEXC_CCMALLOW_MODE_CLIENT8_MODE0_Pos (16UL) /*!< Position of MODE0 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT8_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT8_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT8_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT8_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT8_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT8_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE1 @Bit 17 : Coexistence allowed configuration for mode [1] in client [8] */
    #define COEXC_CCMALLOW_MODE_CLIENT8_MODE1_Pos (17UL) /*!< Position of MODE1 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT8_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT8_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT8_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT8_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT8_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT8_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* End field group CLIENT8. */

/* Field group CLIENT9 : (unspecified) */
/* MODE0 @Bit 18 : Coexistence allowed configuration for mode [0] in client [9] */
    #define COEXC_CCMALLOW_MODE_CLIENT9_MODE0_Pos (18UL) /*!< Position of MODE0 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT9_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT9_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT9_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT9_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT9_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT9_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE1 @Bit 19 : Coexistence allowed configuration for mode [1] in client [9] */
    #define COEXC_CCMALLOW_MODE_CLIENT9_MODE1_Pos (19UL) /*!< Position of MODE1 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT9_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT9_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT9_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT9_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT9_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT9_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* End field group CLIENT9. */

/* Field group CLIENT10 : (unspecified) */
/* MODE0 @Bit 20 : Coexistence allowed configuration for mode [0] in client [10] */
    #define COEXC_CCMALLOW_MODE_CLIENT10_MODE0_Pos (20UL) /*!< Position of MODE0 field.                                        */
    #define COEXC_CCMALLOW_MODE_CLIENT10_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT10_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT10_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT10_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT10_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                 */
    #define COEXC_CCMALLOW_MODE_CLIENT10_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                          */

/* MODE1 @Bit 21 : Coexistence allowed configuration for mode [1] in client [10] */
    #define COEXC_CCMALLOW_MODE_CLIENT10_MODE1_Pos (21UL) /*!< Position of MODE1 field.                                        */
    #define COEXC_CCMALLOW_MODE_CLIENT10_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT10_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT10_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT10_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT10_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                 */
    #define COEXC_CCMALLOW_MODE_CLIENT10_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                          */

/* End field group CLIENT10. */

/* Field group CLIENT11 : (unspecified) */
/* MODE0 @Bit 22 : Coexistence allowed configuration for mode [0] in client [11] */
    #define COEXC_CCMALLOW_MODE_CLIENT11_MODE0_Pos (22UL) /*!< Position of MODE0 field.                                        */
    #define COEXC_CCMALLOW_MODE_CLIENT11_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT11_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT11_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT11_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT11_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                 */
    #define COEXC_CCMALLOW_MODE_CLIENT11_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                          */

