adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* MODE1 @Bit 23 : Coexistence allowed configuration for mode [1] in client [11] */
    #define COEXC_CCMALLOW_MODE_CLIENT11_MODE1_Pos (23UL) /*!< Position of MODE1 field.                                        */
    #define COEXC_CCMALLOW_MODE_CLIENT11_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT11_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT11_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT11_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT11_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                 */
    #define COEXC_CCMALLOW_MODE_CLIENT11_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                          */

/* End field group CLIENT11. */

/* Field group CLIENT12 : (unspecified) */
/* MODE0 @Bit 24 : Coexistence allowed configuration for mode [0] in client [12] */
    #define COEXC_CCMALLOW_MODE_CLIENT12_MODE0_Pos (24UL) /*!< Position of MODE0 field.                                        */
    #define COEXC_CCMALLOW_MODE_CLIENT12_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT12_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT12_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT12_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT12_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                 */
    #define COEXC_CCMALLOW_MODE_CLIENT12_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                          */

/* MODE1 @Bit 25 : Coexistence allowed configuration for mode [1] in client [12] */
    #define COEXC_CCMALLOW_MODE_CLIENT12_MODE1_Pos (25UL) /*!< Position of MODE1 field.                                        */
    #define COEXC_CCMALLOW_MODE_CLIENT12_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT12_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT12_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT12_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT12_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                 */
    #define COEXC_CCMALLOW_MODE_CLIENT12_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                          */

/* End field group CLIENT12. */

/* Field group CLIENT13 : (unspecified) */
/* MODE0 @Bit 26 : Coexistence allowed configuration for mode [0] in client [13] */
    #define COEXC_CCMALLOW_MODE_CLIENT13_MODE0_Pos (26UL) /*!< Position of MODE0 field.                                        */
    #define COEXC_CCMALLOW_MODE_CLIENT13_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT13_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT13_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT13_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT13_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                 */
    #define COEXC_CCMALLOW_MODE_CLIENT13_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                          */

/* MODE1 @Bit 27 : Coexistence allowed configuration for mode [1] in client [13] */
    #define COEXC_CCMALLOW_MODE_CLIENT13_MODE1_Pos (27UL) /*!< Position of MODE1 field.                                        */
    #define COEXC_CCMALLOW_MODE_CLIENT13_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT13_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT13_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT13_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT13_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                 */
    #define COEXC_CCMALLOW_MODE_CLIENT13_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                          */

/* End field group CLIENT13. */

/* Field group CLIENT14 : (unspecified) */
/* MODE0 @Bit 28 : Coexistence allowed configuration for mode [0] in client [14] */
    #define COEXC_CCMALLOW_MODE_CLIENT14_MODE0_Pos (28UL) /*!< Position of MODE0 field.                                        */
    #define COEXC_CCMALLOW_MODE_CLIENT14_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT14_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT14_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT14_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT14_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                 */
    #define COEXC_CCMALLOW_MODE_CLIENT14_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                          */

/* MODE1 @Bit 29 : Coexistence allowed configuration for mode [1] in client [14] */
    #define COEXC_CCMALLOW_MODE_CLIENT14_MODE1_Pos (29UL) /*!< Position of MODE1 field.                                        */
    #define COEXC_CCMALLOW_MODE_CLIENT14_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT14_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT14_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT14_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT14_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                 */
    #define COEXC_CCMALLOW_MODE_CLIENT14_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                          */

/* End field group CLIENT14. */

