adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* Field group CLIENT15 : (unspecified) */
/* MODE0 @Bit 30 : Coexistence allowed configuration for mode [0] in client [15] */
    #define COEXC_CCMALLOW_MODE_CLIENT15_MODE0_Pos (30UL) /*!< Position of MODE0 field.                                        */
    #define COEXC_CCMALLOW_MODE_CLIENT15_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT15_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT15_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT15_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT15_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                 */
    #define COEXC_CCMALLOW_MODE_CLIENT15_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                          */

/* MODE1 @Bit 31 : Coexistence allowed configuration for mode [1] in client [15] */
    #define COEXC_CCMALLOW_MODE_CLIENT15_MODE1_Pos (31UL) /*!< Position of MODE1 field.                                        */
    #define COEXC_CCMALLOW_MODE_CLIENT15_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT15_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/                                              
    #define COEXC_CCMALLOW_MODE_CLIENT15_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT15_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                           */
    #define COEXC_CCMALLOW_MODE_CLIENT15_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                 */
    #define COEXC_CCMALLOW_MODE_CLIENT15_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                          */

/* End field group CLIENT15. */



/* ================================================= Struct COEXC_PCGCSLAVE ================================================== */
/**
  * @brief PCGCSLAVE [COEXC_PCGCSLAVE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PENALTY[2];                        /*!< (@ 0x00000000) Penalty level for power/clock pair n                  */
  __IM  uint32_t  RESERVED[30];
  __IOM uint32_t  FORCEOVERRIDE[2];                  /*!< (@ 0x00000080) Force override of power/clock pair n                  */
} NRF_COEXC_PCGCSLAVE_Type;                          /*!< Size = 136 (0x088)                                                   */

/* COEXC_PCGCSLAVE_PENALTY: Penalty level for power/clock pair n */
  #define COEXC_PCGCSLAVE_PENALTY_MaxCount (2UL)     /*!< Max size of PENALTY[2] array.                                        */
  #define COEXC_PCGCSLAVE_PENALTY_ResetValue (0x00000000UL) /*!< Reset value of PENALTY[2] register.                           */

/* PENALTY @Bits 0..7 : Penalty level */
  #define COEXC_PCGCSLAVE_PENALTY_PENALTY_Pos (0UL)  /*!< Position of PENALTY field.                                           */
  #define COEXC_PCGCSLAVE_PENALTY_PENALTY_Msk (0xFFUL << COEXC_PCGCSLAVE_PENALTY_PENALTY_Pos) /*!< Bit mask of PENALTY field.  */


/* COEXC_PCGCSLAVE_FORCEOVERRIDE: Force override of power/clock pair n */
  #define COEXC_PCGCSLAVE_FORCEOVERRIDE_MaxCount (2UL) /*!< Max size of FORCEOVERRIDE[2] array.                                */
  #define COEXC_PCGCSLAVE_FORCEOVERRIDE_ResetValue (0x00000000UL) /*!< Reset value of FORCEOVERRIDE[2] register.               */

/* CLOCKFORCINGPRE @Bits 0..3 : CLOCKFORCINGPRE */
  #define COEXC_PCGCSLAVE_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos (0UL) /*!< Position of CLOCKFORCINGPRE field.                      */
  #define COEXC_PCGCSLAVE_FORCEOVERRIDE_CLOCKFORCINGPRE_Msk (0xFUL << COEXC_PCGCSLAVE_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos) /*!<
                                                                            Bit mask of CLOCKFORCINGPRE field.*/                  

/* DOFORCECLOCKPRE @Bit 7 : DOFORCECLOCKPRE */
  #define COEXC_PCGCSLAVE_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos (7UL) /*!< Position of DOFORCECLOCKPRE field.                      */
  #define COEXC_PCGCSLAVE_FORCEOVERRIDE_DOFORCECLOCKPRE_Msk (0x1UL << COEXC_PCGCSLAVE_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos) /*!<
                                                                            Bit mask of DOFORCECLOCKPRE field.*/                  

/* POWERFORCINGPRE @Bits 8..9 : POWERFORCINGPRE */
  #define COEXC_PCGCSLAVE_FORCEOVERRIDE_POWERFORCINGPRE_Pos (8UL) /*!< Position of POWERFORCINGPRE field.                      */
  #define COEXC_PCGCSLAVE_FORCEOVERRIDE_POWERFORCINGPRE_Msk (0x3UL << COEXC_PCGCSLAVE_FORCEOVERRIDE_POWERFORCINGPRE_Pos) /*!<
                                                                            Bit mask of POWERFORCINGPRE field.*/                  

/* DOFORCEPOWERPRE @Bit 15 : DOFORCEPOWERPRE */
  #define COEXC_PCGCSLAVE_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos (15UL) /*!< Position of DOFORCEPOWERPRE field.                     */
  #define COEXC_PCGCSLAVE_FORCEOVERRIDE_DOFORCEPOWERPRE_Msk (0x1UL << COEXC_PCGCSLAVE_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos) /*!<
                                                                            Bit mask of DOFORCEPOWERPRE field.*/                  


/* ====================================================== Struct COEXC ======================================================= */
/**
  * @brief Coexistence controller
  */
  typedef struct {                                   /*!< COEXC Structure                                                      */
    __IM uint32_t RESERVED[256];
    __IOM NRF_COEXC_CCMALLOW_Type CCMALLOW[16];      /*!< (@ 0x00000400) (unspecified)                                         */
    __IOM uint32_t CCCONF[16];                       /*!< (@ 0x00000600) Configuration of coexistence client [n]               */
    __IOM uint32_t TURNAROUND[16];                   /*!< (@ 0x00000640) Turnaround time for the coexistence client [n]        */
    __IM uint32_t RESERVED1[32];
    __IM uint32_t GRANTED;                           /*!< (@ 0x00000700) Granted status of the shared resource                 */
    __IM uint32_t RESERVED2[511];
    __IOM NRF_COEXC_PCGCSLAVE_Type PCGCSLAVE;        /*!< (@ 0x00000F00) (unspecified)                                         */
  } NRF_COEXC_Type;                                  /*!< Size = 3976 (0xF88)                                                  */

