adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CLIENT7 @Bit 7 : Granted status coexistence client [7] */
  #define COEXC_GRANTED_CLIENT7_Pos (7UL)            /*!< Position of CLIENT7 field.                                           */
  #define COEXC_GRANTED_CLIENT7_Msk (0x1UL << COEXC_GRANTED_CLIENT7_Pos) /*!< Bit mask of CLIENT7 field.                       */
  #define COEXC_GRANTED_CLIENT7_Min (0x0UL)          /*!< Min enumerator value of CLIENT7 field.                               */
  #define COEXC_GRANTED_CLIENT7_Max (0x1UL)          /*!< Max enumerator value of CLIENT7 field.                               */
  #define COEXC_GRANTED_CLIENT7_NotGranted (0x0UL)   /*!< Shared resource is not granted for coexistence client [7]            */
  #define COEXC_GRANTED_CLIENT7_Granted (0x1UL)      /*!< Shared resource is granted for coexistence client [7]                */

/* CLIENT8 @Bit 8 : Granted status coexistence client [8] */
  #define COEXC_GRANTED_CLIENT8_Pos (8UL)            /*!< Position of CLIENT8 field.                                           */
  #define COEXC_GRANTED_CLIENT8_Msk (0x1UL << COEXC_GRANTED_CLIENT8_Pos) /*!< Bit mask of CLIENT8 field.                       */
  #define COEXC_GRANTED_CLIENT8_Min (0x0UL)          /*!< Min enumerator value of CLIENT8 field.                               */
  #define COEXC_GRANTED_CLIENT8_Max (0x1UL)          /*!< Max enumerator value of CLIENT8 field.                               */
  #define COEXC_GRANTED_CLIENT8_NotGranted (0x0UL)   /*!< Shared resource is not granted for coexistence client [8]            */
  #define COEXC_GRANTED_CLIENT8_Granted (0x1UL)      /*!< Shared resource is granted for coexistence client [8]                */

/* CLIENT9 @Bit 9 : Granted status coexistence client [9] */
  #define COEXC_GRANTED_CLIENT9_Pos (9UL)            /*!< Position of CLIENT9 field.                                           */
  #define COEXC_GRANTED_CLIENT9_Msk (0x1UL << COEXC_GRANTED_CLIENT9_Pos) /*!< Bit mask of CLIENT9 field.                       */
  #define COEXC_GRANTED_CLIENT9_Min (0x0UL)          /*!< Min enumerator value of CLIENT9 field.                               */
  #define COEXC_GRANTED_CLIENT9_Max (0x1UL)          /*!< Max enumerator value of CLIENT9 field.                               */
  #define COEXC_GRANTED_CLIENT9_NotGranted (0x0UL)   /*!< Shared resource is not granted for coexistence client [9]            */
  #define COEXC_GRANTED_CLIENT9_Granted (0x1UL)      /*!< Shared resource is granted for coexistence client [9]                */

/* CLIENT10 @Bit 10 : Granted status coexistence client [10] */
  #define COEXC_GRANTED_CLIENT10_Pos (10UL)          /*!< Position of CLIENT10 field.                                          */
  #define COEXC_GRANTED_CLIENT10_Msk (0x1UL << COEXC_GRANTED_CLIENT10_Pos) /*!< Bit mask of CLIENT10 field.                    */
  #define COEXC_GRANTED_CLIENT10_Min (0x0UL)         /*!< Min enumerator value of CLIENT10 field.                              */
  #define COEXC_GRANTED_CLIENT10_Max (0x1UL)         /*!< Max enumerator value of CLIENT10 field.                              */
  #define COEXC_GRANTED_CLIENT10_NotGranted (0x0UL)  /*!< Shared resource is not granted for coexistence client [10]           */
  #define COEXC_GRANTED_CLIENT10_Granted (0x1UL)     /*!< Shared resource is granted for coexistence client [10]               */

/* CLIENT11 @Bit 11 : Granted status coexistence client [11] */
  #define COEXC_GRANTED_CLIENT11_Pos (11UL)          /*!< Position of CLIENT11 field.                                          */
  #define COEXC_GRANTED_CLIENT11_Msk (0x1UL << COEXC_GRANTED_CLIENT11_Pos) /*!< Bit mask of CLIENT11 field.                    */
  #define COEXC_GRANTED_CLIENT11_Min (0x0UL)         /*!< Min enumerator value of CLIENT11 field.                              */
  #define COEXC_GRANTED_CLIENT11_Max (0x1UL)         /*!< Max enumerator value of CLIENT11 field.                              */
  #define COEXC_GRANTED_CLIENT11_NotGranted (0x0UL)  /*!< Shared resource is not granted for coexistence client [11]           */
  #define COEXC_GRANTED_CLIENT11_Granted (0x1UL)     /*!< Shared resource is granted for coexistence client [11]               */

/* CLIENT12 @Bit 12 : Granted status coexistence client [12] */
  #define COEXC_GRANTED_CLIENT12_Pos (12UL)          /*!< Position of CLIENT12 field.                                          */
  #define COEXC_GRANTED_CLIENT12_Msk (0x1UL << COEXC_GRANTED_CLIENT12_Pos) /*!< Bit mask of CLIENT12 field.                    */
  #define COEXC_GRANTED_CLIENT12_Min (0x0UL)         /*!< Min enumerator value of CLIENT12 field.                              */
  #define COEXC_GRANTED_CLIENT12_Max (0x1UL)         /*!< Max enumerator value of CLIENT12 field.                              */
  #define COEXC_GRANTED_CLIENT12_NotGranted (0x0UL)  /*!< Shared resource is not granted for coexistence client [12]           */
  #define COEXC_GRANTED_CLIENT12_Granted (0x1UL)     /*!< Shared resource is granted for coexistence client [12]               */

/* CLIENT13 @Bit 13 : Granted status coexistence client [13] */
  #define COEXC_GRANTED_CLIENT13_Pos (13UL)          /*!< Position of CLIENT13 field.                                          */
  #define COEXC_GRANTED_CLIENT13_Msk (0x1UL << COEXC_GRANTED_CLIENT13_Pos) /*!< Bit mask of CLIENT13 field.                    */
  #define COEXC_GRANTED_CLIENT13_Min (0x0UL)         /*!< Min enumerator value of CLIENT13 field.                              */
  #define COEXC_GRANTED_CLIENT13_Max (0x1UL)         /*!< Max enumerator value of CLIENT13 field.                              */
  #define COEXC_GRANTED_CLIENT13_NotGranted (0x0UL)  /*!< Shared resource is not granted for coexistence client [13]           */
  #define COEXC_GRANTED_CLIENT13_Granted (0x1UL)     /*!< Shared resource is granted for coexistence client [13]               */

/* CLIENT14 @Bit 14 : Granted status coexistence client [14] */
  #define COEXC_GRANTED_CLIENT14_Pos (14UL)          /*!< Position of CLIENT14 field.                                          */
  #define COEXC_GRANTED_CLIENT14_Msk (0x1UL << COEXC_GRANTED_CLIENT14_Pos) /*!< Bit mask of CLIENT14 field.                    */
  #define COEXC_GRANTED_CLIENT14_Min (0x0UL)         /*!< Min enumerator value of CLIENT14 field.                              */
  #define COEXC_GRANTED_CLIENT14_Max (0x1UL)         /*!< Max enumerator value of CLIENT14 field.                              */
  #define COEXC_GRANTED_CLIENT14_NotGranted (0x0UL)  /*!< Shared resource is not granted for coexistence client [14]           */
  #define COEXC_GRANTED_CLIENT14_Granted (0x1UL)     /*!< Shared resource is granted for coexistence client [14]               */

/* CLIENT15 @Bit 15 : Granted status coexistence client [15] */
  #define COEXC_GRANTED_CLIENT15_Pos (15UL)          /*!< Position of CLIENT15 field.                                          */
  #define COEXC_GRANTED_CLIENT15_Msk (0x1UL << COEXC_GRANTED_CLIENT15_Pos) /*!< Bit mask of CLIENT15 field.                    */
  #define COEXC_GRANTED_CLIENT15_Min (0x0UL)         /*!< Min enumerator value of CLIENT15 field.                              */
  #define COEXC_GRANTED_CLIENT15_Max (0x1UL)         /*!< Max enumerator value of CLIENT15 field.                              */
  #define COEXC_GRANTED_CLIENT15_NotGranted (0x0UL)  /*!< Shared resource is not granted for coexistence client [15]           */
  #define COEXC_GRANTED_CLIENT15_Granted (0x1UL)     /*!< Shared resource is granted for coexistence client [15]               */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           COMP                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct COMP_OVERRIDE =================================================== */
/**
  * @brief OVERRIDE [COMP_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signals to the analog modules      */
  __IOM uint32_t  CONFIGVOLTLVL;                     /*!< (@ 0x00000004) Override LPCMP_INSEL_RET_0V8 and GPCMP_CTRL_RET_0V8[0]*/
} NRF_COMP_OVERRIDE_Type;                            /*!< Size = 8 (0x008)                                                     */

/* COMP_OVERRIDE_PWRUP: Override the PWRUP signals to the analog modules */
  #define COMP_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                    */

/* WUCMP @Bit 0 : Override value for PWRUP_LPCMP_AO_0V8 */
  #define COMP_OVERRIDE_PWRUP_WUCMP_Pos (0UL)        /*!< Position of WUCMP field.                                             */
  #define COMP_OVERRIDE_PWRUP_WUCMP_Msk (0x1UL << COMP_OVERRIDE_PWRUP_WUCMP_Pos) /*!< Bit mask of WUCMP field.                 */

