adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GPCMP @Bit 1 : Override value for PWRUP_GPCMP_AO_0V8 */
  #define COMP_OVERRIDE_PWRUP_GPCMP_Pos (1UL)        /*!< Position of GPCMP field.                                             */
  #define COMP_OVERRIDE_PWRUP_GPCMP_Msk (0x1UL << COMP_OVERRIDE_PWRUP_GPCMP_Pos) /*!< Bit mask of GPCMP field.                 */

/* EN @Bit 31 : Enable the overrides */
  #define COMP_OVERRIDE_PWRUP_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define COMP_OVERRIDE_PWRUP_EN_Msk (0x1UL << COMP_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                          */
  #define COMP_OVERRIDE_PWRUP_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define COMP_OVERRIDE_PWRUP_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define COMP_OVERRIDE_PWRUP_EN_Disabled (0x0UL)    /*!< Overrides are disabled                                               */
  #define COMP_OVERRIDE_PWRUP_EN_Enabled (0x1UL)     /*!< Overrides are enabled                                                */


/* COMP_OVERRIDE_CONFIGVOLTLVL: Override LPCMP_INSEL_RET_0V8 and GPCMP_CTRL_RET_0V8[0] */
  #define COMP_OVERRIDE_CONFIGVOLTLVL_ResetValue (0x00000000UL) /*!< Reset value of CONFIGVOLTLVL register.                    */

/* VAL @Bit 0 : Override value for the signal */
  #define COMP_OVERRIDE_CONFIGVOLTLVL_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define COMP_OVERRIDE_CONFIGVOLTLVL_VAL_Msk (0x1UL << COMP_OVERRIDE_CONFIGVOLTLVL_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : Enable the override */
  #define COMP_OVERRIDE_CONFIGVOLTLVL_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define COMP_OVERRIDE_CONFIGVOLTLVL_EN_Msk (0x1UL << COMP_OVERRIDE_CONFIGVOLTLVL_EN_Pos) /*!< Bit mask of EN field.          */
  #define COMP_OVERRIDE_CONFIGVOLTLVL_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define COMP_OVERRIDE_CONFIGVOLTLVL_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define COMP_OVERRIDE_CONFIGVOLTLVL_EN_Disabled (0x0UL) /*!< Override is disabled                                            */
  #define COMP_OVERRIDE_CONFIGVOLTLVL_EN_Enabled (0x1UL) /*!< Override is enabled                                              */



/* ===================================================== Struct COMP_DFT ===================================================== */
/**
  * @brief DFT [COMP_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATBCONFIG;                         /*!< (@ 0x00000000) Analog Test Bus (ATB0-2) configuration                */
  __IM  uint32_t  RESERVED[3];
  __IOM uint32_t  DTBCONFIG;                         /*!< (@ 0x00000010) Digital Test Bus (DTB0-3) configuration               */
} NRF_COMP_DFT_Type;                                 /*!< Size = 20 (0x014)                                                    */

/* COMP_DFT_ATBCONFIG: Analog Test Bus (ATB0-2) configuration */
  #define COMP_DFT_ATBCONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATBCONFIG register.                                 */

/* SELMUXGROUP @Bit 0 : Select multiplexer group for ATB0-1 */
  #define COMP_DFT_ATBCONFIG_SELMUXGROUP_Pos (0UL)   /*!< Position of SELMUXGROUP field.                                       */
  #define COMP_DFT_ATBCONFIG_SELMUXGROUP_Msk (0x1UL << COMP_DFT_ATBCONFIG_SELMUXGROUP_Pos) /*!< Bit mask of SELMUXGROUP field. */
  #define COMP_DFT_ATBCONFIG_SELMUXGROUP_Min (0x0UL) /*!< Min enumerator value of SELMUXGROUP field.                           */
  #define COMP_DFT_ATBCONFIG_SELMUXGROUP_Max (0x1UL) /*!< Max enumerator value of SELMUXGROUP field.                           */
  #define COMP_DFT_ATBCONFIG_SELMUXGROUP_Group0 (0x0UL) /*!< multiplexer group 0                                               */
  #define COMP_DFT_ATBCONFIG_SELMUXGROUP_Group1 (0x1UL) /*!< multiplexer group 1                                               */

/* SELMUX0 @Bits 4..5 : Select multiplexer for ATB0 */
  #define COMP_DFT_ATBCONFIG_SELMUX0_Pos (4UL)       /*!< Position of SELMUX0 field.                                           */
  #define COMP_DFT_ATBCONFIG_SELMUX0_Msk (0x3UL << COMP_DFT_ATBCONFIG_SELMUX0_Pos) /*!< Bit mask of SELMUX0 field.             */
  #define COMP_DFT_ATBCONFIG_SELMUX0_Min (0x0UL)     /*!< Min enumerator value of SELMUX0 field.                               */
  #define COMP_DFT_ATBCONFIG_SELMUX0_Max (0x3UL)     /*!< Max enumerator value of SELMUX0 field.                               */
  #define COMP_DFT_ATBCONFIG_SELMUX0_Config0 (0x0UL) /*!< Configuration 0 selected                                             */
  #define COMP_DFT_ATBCONFIG_SELMUX0_Config1 (0x1UL) /*!< Configuration 1 selected                                             */
  #define COMP_DFT_ATBCONFIG_SELMUX0_Config2 (0x2UL) /*!< Configuration 2 selected                                             */
  #define COMP_DFT_ATBCONFIG_SELMUX0_Config3 (0x3UL) /*!< Configuration 3 selected                                             */

/* SELMUX1 @Bits 8..9 : Select multiplexer for ATB1 */
  #define COMP_DFT_ATBCONFIG_SELMUX1_Pos (8UL)       /*!< Position of SELMUX1 field.                                           */
  #define COMP_DFT_ATBCONFIG_SELMUX1_Msk (0x3UL << COMP_DFT_ATBCONFIG_SELMUX1_Pos) /*!< Bit mask of SELMUX1 field.             */
  #define COMP_DFT_ATBCONFIG_SELMUX1_Min (0x0UL)     /*!< Min enumerator value of SELMUX1 field.                               */
  #define COMP_DFT_ATBCONFIG_SELMUX1_Max (0x3UL)     /*!< Max enumerator value of SELMUX1 field.                               */
  #define COMP_DFT_ATBCONFIG_SELMUX1_Config0 (0x0UL) /*!< Configuration 0 selected                                             */
  #define COMP_DFT_ATBCONFIG_SELMUX1_Config1 (0x1UL) /*!< Configuration 1 selected                                             */
  #define COMP_DFT_ATBCONFIG_SELMUX1_Config2 (0x2UL) /*!< Configuration 2 selected                                             */
  #define COMP_DFT_ATBCONFIG_SELMUX1_Config3 (0x3UL) /*!< Configuration 3 selected                                             */

/* SELMUX2 @Bit 12 : Select multiplexer for ATB2 */
  #define COMP_DFT_ATBCONFIG_SELMUX2_Pos (12UL)      /*!< Position of SELMUX2 field.                                           */
  #define COMP_DFT_ATBCONFIG_SELMUX2_Msk (0x1UL << COMP_DFT_ATBCONFIG_SELMUX2_Pos) /*!< Bit mask of SELMUX2 field.             */
  #define COMP_DFT_ATBCONFIG_SELMUX2_Min (0x0UL)     /*!< Min enumerator value of SELMUX2 field.                               */
  #define COMP_DFT_ATBCONFIG_SELMUX2_Max (0x1UL)     /*!< Max enumerator value of SELMUX2 field.                               */
  #define COMP_DFT_ATBCONFIG_SELMUX2_Config0 (0x0UL) /*!< Configuration 0 selected                                             */
  #define COMP_DFT_ATBCONFIG_SELMUX2_Config1 (0x1UL) /*!< Configuration 1 selected                                             */


