adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* COMP_MODE: Mode configuration */
  #define COMP_MODE_ResetValue (0x00000000UL)        /*!< Reset value of MODE register.                                        */

/* SP @Bit 0 : Speed and power modes */
  #define COMP_MODE_SP_Pos (0UL)                     /*!< Position of SP field.                                                */
  #define COMP_MODE_SP_Msk (0x1UL << COMP_MODE_SP_Pos) /*!< Bit mask of SP field.                                              */
  #define COMP_MODE_SP_Min (0x0UL)                   /*!< Min enumerator value of SP field.                                    */
  #define COMP_MODE_SP_Max (0x1UL)                   /*!< Max enumerator value of SP field.                                    */
  #define COMP_MODE_SP_Low (0x0UL)                   /*!< Low-power mode                                                       */
  #define COMP_MODE_SP_High (0x1UL)                  /*!< High-speed mode                                                      */

/* MAIN @Bit 8 : Main operation modes */
  #define COMP_MODE_MAIN_Pos (8UL)                   /*!< Position of MAIN field.                                              */
  #define COMP_MODE_MAIN_Msk (0x1UL << COMP_MODE_MAIN_Pos) /*!< Bit mask of MAIN field.                                        */
  #define COMP_MODE_MAIN_Min (0x0UL)                 /*!< Min enumerator value of MAIN field.                                  */
  #define COMP_MODE_MAIN_Max (0x1UL)                 /*!< Max enumerator value of MAIN field.                                  */
  #define COMP_MODE_MAIN_SE (0x0UL)                  /*!< Single-ended mode                                                    */
  #define COMP_MODE_MAIN_Diff (0x1UL)                /*!< Differential mode                                                    */


/* COMP_HYST: Comparator hysteresis enable */
  #define COMP_HYST_ResetValue (0x00000000UL)        /*!< Reset value of HYST register.                                        */

/* HYST @Bit 0 : Comparator hysteresis */
  #define COMP_HYST_HYST_Pos (0UL)                   /*!< Position of HYST field.                                              */
  #define COMP_HYST_HYST_Msk (0x1UL << COMP_HYST_HYST_Pos) /*!< Bit mask of HYST field.                                        */
  #define COMP_HYST_HYST_Min (0x0UL)                 /*!< Min enumerator value of HYST field.                                  */
  #define COMP_HYST_HYST_Max (0x1UL)                 /*!< Max enumerator value of HYST field.                                  */
  #define COMP_HYST_HYST_NoHyst (0x0UL)              /*!< Comparator hysteresis disabled                                       */
  #define COMP_HYST_HYST_Hyst40mV (0x1UL)            /*!< Comparator hysteresis enabled                                        */


/* COMP_ISOURCE: Current source select on analog input */
  #define COMP_ISOURCE_ResetValue (0x00000000UL)     /*!< Reset value of ISOURCE register.                                     */

/* ISOURCE @Bits 0..1 : Current source select on analog input */
  #define COMP_ISOURCE_ISOURCE_Pos (0UL)             /*!< Position of ISOURCE field.                                           */
  #define COMP_ISOURCE_ISOURCE_Msk (0x3UL << COMP_ISOURCE_ISOURCE_Pos) /*!< Bit mask of ISOURCE field.                         */
  #define COMP_ISOURCE_ISOURCE_Min (0x0UL)           /*!< Min enumerator value of ISOURCE field.                               */
  #define COMP_ISOURCE_ISOURCE_Max (0x3UL)           /*!< Max enumerator value of ISOURCE field.                               */
  #define COMP_ISOURCE_ISOURCE_Off (0x0UL)           /*!< Current source disabled                                              */
  #define COMP_ISOURCE_ISOURCE_Ien2uA5 (0x1UL)       /*!< Current source enabled (+/- 2.5 uA)                                  */
  #define COMP_ISOURCE_ISOURCE_Ien5uA (0x2UL)        /*!< Current source enabled (+/- 5 uA)                                    */
  #define COMP_ISOURCE_ISOURCE_Ien10uA (0x3UL)       /*!< Current source enabled (+/- 10 uA)                                   */


/* COMP_REFTRIM: Trim internal band gap reference */
  #define COMP_REFTRIM_ResetValue (0x00000000UL)     /*!< Reset value of REFTRIM register.                                     */

/* REFTRIM @Bits 0..4 : Trimming value in 2's complement */
  #define COMP_REFTRIM_REFTRIM_Pos (0UL)             /*!< Position of REFTRIM field.                                           */
  #define COMP_REFTRIM_REFTRIM_Msk (0x1FUL << COMP_REFTRIM_REFTRIM_Pos) /*!< Bit mask of REFTRIM field.                        */
  #define COMP_REFTRIM_REFTRIM_Min (0xFFFFFFFFUL)    /*!< Min value of REFTRIM field.                                          */
  #define COMP_REFTRIM_REFTRIM_Max (0xFFFFFFFFUL)    /*!< Max size of REFTRIM field.                                           */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          CPUCONF                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ===================================================== Struct CPUCONF ====================================================== */
/**
  * @brief CPU Configuration
  */
  typedef struct {                                   /*!< CPUCONF Structure                                                    */
    __OM uint32_t TASKS_ERASECACHE;                  /*!< (@ 0x00000000) Erase the caches used by the CPU.                     */
    __IM uint32_t RESERVED[319];
    __IOM uint32_t INITSVTOR;                        /*!< (@ 0x00000500) Initial value of the secure VTOR (Vector Table Offset
                                                                         Register) after CPU reset.*/                             
    __IOM uint32_t INITNSVTOR;                       /*!< (@ 0x00000504) Initial value of the non-secure VTOR (Vector Table
                                                                         Offset Register).*/                                      
    __IOM uint32_t CPUSTART;                         /*!< (@ 0x00000508) Enable for starting the CPU                           */
    __IOM uint32_t CPUWAIT;                          /*!< (@ 0x0000050C) Enable for the CPU wait.                              */
  } NRF_CPUCONF_Type;                                /*!< Size = 1296 (0x510)                                                  */

/* CPUCONF_TASKS_ERASECACHE: Erase the caches used by the CPU. */
  #define CPUCONF_TASKS_ERASECACHE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_ERASECACHE register.                    */

/* TASKS_ERASECACHE @Bit 0 : Erase the caches used by the CPU. */
  #define CPUCONF_TASKS_ERASECACHE_TASKS_ERASECACHE_Pos (0UL) /*!< Position of TASKS_ERASECACHE field.                         */
  #define CPUCONF_TASKS_ERASECACHE_TASKS_ERASECACHE_Msk (0x1UL << CPUCONF_TASKS_ERASECACHE_TASKS_ERASECACHE_Pos) /*!< Bit mask
                                                                            of TASKS_ERASECACHE field.*/                          
  #define CPUCONF_TASKS_ERASECACHE_TASKS_ERASECACHE_Min (0x1UL) /*!< Min enumerator value of TASKS_ERASECACHE field.           */
  #define CPUCONF_TASKS_ERASECACHE_TASKS_ERASECACHE_Max (0x1UL) /*!< Max enumerator value of TASKS_ERASECACHE field.           */
  #define CPUCONF_TASKS_ERASECACHE_TASKS_ERASECACHE_Trigger (0x1UL) /*!< Trigger task                                          */


/* CPUCONF_INITSVTOR: Initial value of the secure VTOR (Vector Table Offset Register) after CPU reset. */
  #define CPUCONF_INITSVTOR_ResetValue (0x00000000UL) /*!< Reset value of INITSVTOR register.                                  */

