adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CRACEN_SEEDRAMLOCK: Lock the access to the RAM used for the seed. */
  #define CRACEN_SEEDRAMLOCK_ResetValue (0x00000000UL) /*!< Reset value of SEEDRAMLOCK register.                               */

/* ENABLE @Bit 0 : Enable the lock */
  #define CRACEN_SEEDRAMLOCK_ENABLE_Pos (0UL)        /*!< Position of ENABLE field.                                            */
  #define CRACEN_SEEDRAMLOCK_ENABLE_Msk (0x1UL << CRACEN_SEEDRAMLOCK_ENABLE_Pos) /*!< Bit mask of ENABLE field.                */
  #define CRACEN_SEEDRAMLOCK_ENABLE_Min (0x0UL)      /*!< Min enumerator value of ENABLE field.                                */
  #define CRACEN_SEEDRAMLOCK_ENABLE_Max (0x1UL)      /*!< Max enumerator value of ENABLE field.                                */
  #define CRACEN_SEEDRAMLOCK_ENABLE_Disabled (0x0UL) /*!< Lock disabled.                                                       */
  #define CRACEN_SEEDRAMLOCK_ENABLE_Enabled (0x1UL)  /*!< Lock enabled.                                                        */


/* CRACEN_SEED: Seed word [n] for private key generation. */
  #define CRACEN_SEED_MaxCount (12UL)                /*!< Max size of SEED[12] array.                                          */
  #define CRACEN_SEED_ResetValue (0x00000000UL)      /*!< Reset value of SEED[12] register.                                    */

/* VAL @Bits 0..31 : Seed value */
  #define CRACEN_SEED_VAL_Pos (0UL)                  /*!< Position of VAL field.                                               */
  #define CRACEN_SEED_VAL_Msk (0xFFFFFFFFUL << CRACEN_SEED_VAL_Pos) /*!< Bit mask of VAL field.                                */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        CRACENCORE                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================= Struct CRACENCORE_CRYPTMSTRDMA ============================================== */
/**
  * @brief CRYPTMSTRDMA [CRACENCORE_CRYPTMSTRDMA] (unspecified)
  */
typedef struct {
  __IOM uint32_t  FETCHADDRLSB;                      /*!< (@ 0x00000000) Fetch Address Least Significant Bit                   */
  __IOM uint32_t  FETCHADDRMSB;                      /*!< (@ 0x00000004) Fetch Address Most Significant Bit                    */
  __IOM uint32_t  FETCHLEN;                          /*!< (@ 0x00000008) Fetch Length                                          */
  __IOM uint32_t  FETCHTAG;                          /*!< (@ 0x0000000C) Fetch Tag                                             */
  __IOM uint32_t  PUSHADDRLSB;                       /*!< (@ 0x00000010) Push Address Least Significant Bit                    */
  __IOM uint32_t  PUSHADDRMSB;                       /*!< (@ 0x00000014) Push Address Most Significant Bit                     */
  __IOM uint32_t  PUSHLEN;                           /*!< (@ 0x00000018) Push Length                                           */
  __IOM uint32_t  INTEN;                             /*!< (@ 0x0000001C) Interrupt Enable                                      */
  __IOM uint32_t  INTENSET;                          /*!< (@ 0x00000020) Interrupt Set                                         */
  __IOM uint32_t  INTENCLR;                          /*!< (@ 0x00000024) Interrupt Clear                                       */
  __IOM uint32_t  INTSTATRAW;                        /*!< (@ 0x00000028) Interrupt Status Raw                                  */
  __IOM uint32_t  INTSTAT;                           /*!< (@ 0x0000002C) Interrupt Status                                      */
  __IOM uint32_t  INTSTATCLR;                        /*!< (@ 0x00000030) Interrupt Status Clear                                */
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000034) Configuration                                         */
  __IOM uint32_t  START;                             /*!< (@ 0x00000038) Start                                                 */
  __IOM uint32_t  STATUS;                            /*!< (@ 0x0000003C) Status                                                */
} NRF_CRACENCORE_CRYPTMSTRDMA_Type;                  /*!< Size = 64 (0x040)                                                    */

/* CRACENCORE_CRYPTMSTRDMA_FETCHADDRLSB: Fetch Address Least Significant Bit */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHADDRLSB_ResetValue (0x00000000UL) /*!< Reset value of FETCHADDRLSB register.            */

/* FETCHADDRLSB @Bits 0..31 : (unspecified) */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHADDRLSB_FETCHADDRLSB_Pos (0UL) /*!< Position of FETCHADDRLSB field.                     */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHADDRLSB_FETCHADDRLSB_Msk (0xFFFFFFFFUL << CRACENCORE_CRYPTMSTRDMA_FETCHADDRLSB_FETCHADDRLSB_Pos)
                                                                            /*!< Bit mask of FETCHADDRLSB field.*/                


/* CRACENCORE_CRYPTMSTRDMA_FETCHADDRMSB: Fetch Address Most Significant Bit */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHADDRMSB_ResetValue (0x00000000UL) /*!< Reset value of FETCHADDRMSB register.            */

/* FETCHADDRMSB @Bits 0..31 : (unspecified) */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHADDRMSB_FETCHADDRMSB_Pos (0UL) /*!< Position of FETCHADDRMSB field.                     */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHADDRMSB_FETCHADDRMSB_Msk (0xFFFFFFFFUL << CRACENCORE_CRYPTMSTRDMA_FETCHADDRMSB_FETCHADDRMSB_Pos)
                                                                            /*!< Bit mask of FETCHADDRMSB field.*/                


/* CRACENCORE_CRYPTMSTRDMA_FETCHLEN: Fetch Length */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHLEN_ResetValue (0x00000000UL) /*!< Reset value of FETCHLEN register.                    */

/* FETCHLEN @Bits 0..27 : (unspecified) */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHLEN_FETCHLEN_Pos (0UL) /*!< Position of FETCHLEN field.                                 */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHLEN_FETCHLEN_Msk (0xFFFFFFFUL << CRACENCORE_CRYPTMSTRDMA_FETCHLEN_FETCHLEN_Pos) /*!< Bit
                                                                            mask of FETCHLEN field.*/                             

/* FETCHCSTADDR @Bit 28 : (unspecified) */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHLEN_FETCHCSTADDR_Pos (28UL) /*!< Position of FETCHCSTADDR field.                        */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHLEN_FETCHCSTADDR_Msk (0x1UL << CRACENCORE_CRYPTMSTRDMA_FETCHLEN_FETCHCSTADDR_Pos) /*!<
                                                                            Bit mask of FETCHCSTADDR field.*/                     

