adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PREINT @Bit 8 : AIS31 preliminary noise alarm interrupt status. */
  #define CRACENCORE_RNGCONTROL_STATUS_PREINT_Pos (8UL) /*!< Position of PREINT field.                                         */
  #define CRACENCORE_RNGCONTROL_STATUS_PREINT_Msk (0x1UL << CRACENCORE_RNGCONTROL_STATUS_PREINT_Pos) /*!< Bit mask of PREINT
                                                                            field.*/                                              

/* ALMINT @Bit 9 : AIS31 noise alarm interrupt status. */
  #define CRACENCORE_RNGCONTROL_STATUS_ALMINT_Pos (9UL) /*!< Position of ALMINT field.                                         */
  #define CRACENCORE_RNGCONTROL_STATUS_ALMINT_Msk (0x1UL << CRACENCORE_RNGCONTROL_STATUS_ALMINT_Pos) /*!< Bit mask of ALMINT
                                                                            field.*/                                              

/* STARTUPFAIL @Bit 10 : Start-up test failure. */
  #define CRACENCORE_RNGCONTROL_STATUS_STARTUPFAIL_Pos (10UL) /*!< Position of STARTUPFAIL field.                              */
  #define CRACENCORE_RNGCONTROL_STATUS_STARTUPFAIL_Msk (0x1UL << CRACENCORE_RNGCONTROL_STATUS_STARTUPFAIL_Pos) /*!< Bit mask of
                                                                            STARTUPFAIL field.*/                                  

/* FIFOACCFAIL @Bit 11 : Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel =
                         0). */                                                                                                   
                                                                                                                                  
  #define CRACENCORE_RNGCONTROL_STATUS_FIFOACCFAIL_Pos (11UL) /*!< Position of FIFOACCFAIL field.                              */
  #define CRACENCORE_RNGCONTROL_STATUS_FIFOACCFAIL_Msk (0x1UL << CRACENCORE_RNGCONTROL_STATUS_FIFOACCFAIL_Pos) /*!< Bit mask of
                                                                            FIFOACCFAIL field.*/                                  


/* CRACENCORE_RNGCONTROL_INITWAITVAL: Initial wait counter value. */
  #define CRACENCORE_RNGCONTROL_INITWAITVAL_ResetValue (0x0000FFFFUL) /*!< Reset value of INITWAITVAL register.                */

/* INITWAITVAL @Bits 0..15 : Number of clock cycles to wait before sampling data from the noise source. */
  #define CRACENCORE_RNGCONTROL_INITWAITVAL_INITWAITVAL_Pos (0UL) /*!< Position of INITWAITVAL field.                          */
  #define CRACENCORE_RNGCONTROL_INITWAITVAL_INITWAITVAL_Msk (0xFFFFUL << CRACENCORE_RNGCONTROL_INITWAITVAL_INITWAITVAL_Pos) /*!<
                                                                            Bit mask of INITWAITVAL field.*/                      


/* CRACENCORE_RNGCONTROL_DISABLEOSC: Disable oscillator rings #n*32 to #((n+1)*32)-1. */
  #define CRACENCORE_RNGCONTROL_DISABLEOSC_MaxCount (2UL) /*!< Max size of DISABLEOSC[2] array.                                */
  #define CRACENCORE_RNGCONTROL_DISABLEOSC_ResetValue (0x00000000UL) /*!< Reset value of DISABLEOSC[2] register.               */

/* DISABLEOSC @Bits 0..31 : Disable oscillator rings #n*32 to #((n+1)*32)-1. */
  #define CRACENCORE_RNGCONTROL_DISABLEOSC_DISABLEOSC_Pos (0UL) /*!< Position of DISABLEOSC field.                             */
  #define CRACENCORE_RNGCONTROL_DISABLEOSC_DISABLEOSC_Msk (0xFFFFFFFFUL << CRACENCORE_RNGCONTROL_DISABLEOSC_DISABLEOSC_Pos) /*!<
                                                                            Bit mask of DISABLEOSC field.*/                       


/* CRACENCORE_RNGCONTROL_SWOFFTMRVAL: Switch off timer value. */
  #define CRACENCORE_RNGCONTROL_SWOFFTMRVAL_ResetValue (0x0000FFFFUL) /*!< Reset value of SWOFFTMRVAL register.                */

/* SWOFFTMRVAL @Bits 0..15 : Number of clk cycles to wait before stopping the rings after the FIFO is full. */
  #define CRACENCORE_RNGCONTROL_SWOFFTMRVAL_SWOFFTMRVAL_Pos (0UL) /*!< Position of SWOFFTMRVAL field.                          */
  #define CRACENCORE_RNGCONTROL_SWOFFTMRVAL_SWOFFTMRVAL_Msk (0xFFFFUL << CRACENCORE_RNGCONTROL_SWOFFTMRVAL_SWOFFTMRVAL_Pos) /*!<
                                                                            Bit mask of SWOFFTMRVAL field.*/                      


/* CRACENCORE_RNGCONTROL_CLKDIV: Sample clock divider. */
  #define CRACENCORE_RNGCONTROL_CLKDIV_ResetValue (0x00000000UL) /*!< Reset value of CLKDIV register.                          */

/* CLKDIV @Bits 0..7 : Sample clock divider. */
  #define CRACENCORE_RNGCONTROL_CLKDIV_CLKDIV_Pos (0UL) /*!< Position of CLKDIV field.                                         */
  #define CRACENCORE_RNGCONTROL_CLKDIV_CLKDIV_Msk (0xFFUL << CRACENCORE_RNGCONTROL_CLKDIV_CLKDIV_Pos) /*!< Bit mask of CLKDIV
                                                                            field.*/                                              


/* CRACENCORE_RNGCONTROL_AIS31CONF0: AIS31 configuration register 0. */
  #define CRACENCORE_RNGCONTROL_AIS31CONF0_ResetValue (0x43401040UL) /*!< Reset value of AIS31CONF0 register.                  */

/* STARTUPTHRESHOLD @Bits 0..14 : Start-up test threshold. */
  #define CRACENCORE_RNGCONTROL_AIS31CONF0_STARTUPTHRESHOLD_Pos (0UL) /*!< Position of STARTUPTHRESHOLD field.                 */
  #define CRACENCORE_RNGCONTROL_AIS31CONF0_STARTUPTHRESHOLD_Msk (0x7FFFUL << CRACENCORE_RNGCONTROL_AIS31CONF0_STARTUPTHRESHOLD_Pos)
                                                                            /*!< Bit mask of STARTUPTHRESHOLD field.*/            

/* ONLINETHRESHOLD @Bits 16..30 : Online threshold. */
  #define CRACENCORE_RNGCONTROL_AIS31CONF0_ONLINETHRESHOLD_Pos (16UL) /*!< Position of ONLINETHRESHOLD field.                  */
  #define CRACENCORE_RNGCONTROL_AIS31CONF0_ONLINETHRESHOLD_Msk (0x7FFFUL << CRACENCORE_RNGCONTROL_AIS31CONF0_ONLINETHRESHOLD_Pos)
                                                                            /*!< Bit mask of ONLINETHRESHOLD field.*/             


/* CRACENCORE_RNGCONTROL_AIS31CONF1: AIS31 configuration register 1. */
  #define CRACENCORE_RNGCONTROL_AIS31CONF1_ResetValue (0x03C00680UL) /*!< Reset value of AIS31CONF1 register.                  */

/* ONLINEREPTHRESHOLD @Bits 0..14 : Online repeat threshold. */
  #define CRACENCORE_RNGCONTROL_AIS31CONF1_ONLINEREPTHRESHOLD_Pos (0UL) /*!< Position of ONLINEREPTHRESHOLD field.             */
  #define CRACENCORE_RNGCONTROL_AIS31CONF1_ONLINEREPTHRESHOLD_Msk (0x7FFFUL << CRACENCORE_RNGCONTROL_AIS31CONF1_ONLINEREPTHRESHOLD_Pos)
                                                                            /*!< Bit mask of ONLINEREPTHRESHOLD field.*/          

/* HEXPECTEDVALUE @Bits 16..30 : Expected history value. */
  #define CRACENCORE_RNGCONTROL_AIS31CONF1_HEXPECTEDVALUE_Pos (16UL) /*!< Position of HEXPECTEDVALUE field.                    */
  #define CRACENCORE_RNGCONTROL_AIS31CONF1_HEXPECTEDVALUE_Msk (0x7FFFUL << CRACENCORE_RNGCONTROL_AIS31CONF1_HEXPECTEDVALUE_Pos)
                                                                            /*!< Bit mask of HEXPECTEDVALUE field.*/              


/* CRACENCORE_RNGCONTROL_AIS31CONF2: AIS31 configuration register 2. */
  #define CRACENCORE_RNGCONTROL_AIS31CONF2_ResetValue (0x04400340UL) /*!< Reset value of AIS31CONF2 register.                  */

