adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* HMIN @Bits 0..14 : Minimum allowed history value. */
  #define CRACENCORE_RNGCONTROL_AIS31CONF2_HMIN_Pos (0UL) /*!< Position of HMIN field.                                         */
  #define CRACENCORE_RNGCONTROL_AIS31CONF2_HMIN_Msk (0x7FFFUL << CRACENCORE_RNGCONTROL_AIS31CONF2_HMIN_Pos) /*!< Bit mask of
                                                                            HMIN field.*/                                         

/* HMAX @Bits 16..30 : Maximum allowed history value. */
  #define CRACENCORE_RNGCONTROL_AIS31CONF2_HMAX_Pos (16UL) /*!< Position of HMAX field.                                        */
  #define CRACENCORE_RNGCONTROL_AIS31CONF2_HMAX_Msk (0x7FFFUL << CRACENCORE_RNGCONTROL_AIS31CONF2_HMAX_Pos) /*!< Bit mask of
                                                                            HMAX field.*/                                         


/* CRACENCORE_RNGCONTROL_AIS31STATUS: AIS31 status register. */
  #define CRACENCORE_RNGCONTROL_AIS31STATUS_ResetValue (0x00000000UL) /*!< Reset value of AIS31STATUS register.                */

/* NUMPRELIMALARMS @Bits 0..15 : Number of preliminary noise alarms since counter was last cleared. */
  #define CRACENCORE_RNGCONTROL_AIS31STATUS_NUMPRELIMALARMS_Pos (0UL) /*!< Position of NUMPRELIMALARMS field.                  */
  #define CRACENCORE_RNGCONTROL_AIS31STATUS_NUMPRELIMALARMS_Msk (0xFFFFUL << CRACENCORE_RNGCONTROL_AIS31STATUS_NUMPRELIMALARMS_Pos)
                                                                            /*!< Bit mask of NUMPRELIMALARMS field.*/             

/* PRELIMNOISEALARMRNG @Bit 16 : Last preliminary noise alarm occurred due to history value out of range. */
  #define CRACENCORE_RNGCONTROL_AIS31STATUS_PRELIMNOISEALARMRNG_Pos (16UL) /*!< Position of PRELIMNOISEALARMRNG field.         */
  #define CRACENCORE_RNGCONTROL_AIS31STATUS_PRELIMNOISEALARMRNG_Msk (0x1UL << CRACENCORE_RNGCONTROL_AIS31STATUS_PRELIMNOISEALARMRNG_Pos)
                                                                            /*!< Bit mask of PRELIMNOISEALARMRNG field.*/         

/* PRELIMNOISEALARMREP @Bit 17 : Last preliminary noise alarm occurred due to consecutive high Χ**2. */
  #define CRACENCORE_RNGCONTROL_AIS31STATUS_PRELIMNOISEALARMREP_Pos (17UL) /*!< Position of PRELIMNOISEALARMREP field.         */
  #define CRACENCORE_RNGCONTROL_AIS31STATUS_PRELIMNOISEALARMREP_Msk (0x1UL << CRACENCORE_RNGCONTROL_AIS31STATUS_PRELIMNOISEALARMREP_Pos)
                                                                            /*!< Bit mask of PRELIMNOISEALARMREP field.*/         


/* CRACENCORE_RNGCONTROL_HWCONFIG: Hardware configuration register. */
  #define CRACENCORE_RNGCONTROL_HWCONFIG_ResetValue (0x00000337UL) /*!< Reset value of HWCONFIG register.                      */

/* NUMBOFRINGS @Bits 0..7 : Generic g_NumRings value. */
  #define CRACENCORE_RNGCONTROL_HWCONFIG_NUMBOFRINGS_Pos (0UL) /*!< Position of NUMBOFRINGS field.                             */
  #define CRACENCORE_RNGCONTROL_HWCONFIG_NUMBOFRINGS_Msk (0xFFUL << CRACENCORE_RNGCONTROL_HWCONFIG_NUMBOFRINGS_Pos) /*!< Bit
                                                                            mask of NUMBOFRINGS field.*/                          

/* AIS31 @Bit 8 : Generic g_AIS31 value. */
  #define CRACENCORE_RNGCONTROL_HWCONFIG_AIS31_Pos (8UL) /*!< Position of AIS31 field.                                         */
  #define CRACENCORE_RNGCONTROL_HWCONFIG_AIS31_Msk (0x1UL << CRACENCORE_RNGCONTROL_HWCONFIG_AIS31_Pos) /*!< Bit mask of AIS31
                                                                            field.*/                                              

/* AIS31FULL @Bit 9 : Generic g_AIS31Full value. */
  #define CRACENCORE_RNGCONTROL_HWCONFIG_AIS31FULL_Pos (9UL) /*!< Position of AIS31FULL field.                                 */
  #define CRACENCORE_RNGCONTROL_HWCONFIG_AIS31FULL_Msk (0x1UL << CRACENCORE_RNGCONTROL_HWCONFIG_AIS31FULL_Pos) /*!< Bit mask of
                                                                            AIS31FULL field.*/                                    


/* CRACENCORE_RNGCONTROL_FIFO: FIFO data */
  #define CRACENCORE_RNGCONTROL_FIFO_MaxCount (16UL) /*!< Max size of FIFO[16] array.                                          */
  #define CRACENCORE_RNGCONTROL_FIFO_ResetValue (0x00000000UL) /*!< Reset value of FIFO[16] register.                          */

/* DATA @Bits 0..31 : FIFO data */
  #define CRACENCORE_RNGCONTROL_FIFO_DATA_Pos (0UL)  /*!< Position of DATA field.                                              */
  #define CRACENCORE_RNGCONTROL_FIFO_DATA_Msk (0xFFFFFFFFUL << CRACENCORE_RNGCONTROL_FIFO_DATA_Pos) /*!< Bit mask of DATA
                                                                            field.*/                                              



/* ================================================== Struct CRACENCORE_PK =================================================== */
/**
  * @brief PK [CRACENCORE_PK] (unspecified)
  */
typedef struct {
  __IOM uint32_t  POINTERS;                          /*!< (@ 0x00000000) Pointers register.                                    */
  __IOM uint32_t  COMMAND;                           /*!< (@ 0x00000004) Command register.                                     */
  __IOM uint32_t  CONTROL;                           /*!< (@ 0x00000008) Command register.                                     */
  __IOM uint32_t  STATUS;                            /*!< (@ 0x0000000C) Status register.                                      */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  TIMER;                             /*!< (@ 0x00000014) Timer register.                                       */
  __IOM uint32_t  HWCONFIG;                          /*!< (@ 0x00000018) Hardware configuration register.                      */
  __IOM uint32_t  OPSIZE;                            /*!< (@ 0x0000001C) Operand size register.                                */
  __IOM uint32_t  MEMOFFSET;                         /*!< (@ 0x00000020) Memory offset register.                               */
  __IOM uint32_t  MICROCODEOFFSET;                   /*!< (@ 0x00000024) MicroCode offset register.                            */
  __IM  uint32_t  RESERVED1[6];
  __IOM uint32_t  RAMERRORINJECT;                    /*!< (@ 0x00000040) RAM error injection register.                         */
  __IOM uint32_t  RAMERRORSTATUS;                    /*!< (@ 0x00000044) RAM error status register.                            */
} NRF_CRACENCORE_PK_Type;                            /*!< Size = 72 (0x048)                                                    */

/* CRACENCORE_PK_POINTERS: Pointers register. */
  #define CRACENCORE_PK_POINTERS_ResetValue (0x00000000UL) /*!< Reset value of POINTERS register.                              */

/* OPPTRA @Bits 0..3 : When executing primitive arithmetic operations, this pointer defines where operand A is located in memory
                       (location 0x0 to 0xF). */                                                                                  
                                                                                                                                  
  #define CRACENCORE_PK_POINTERS_OPPTRA_Pos (0UL)    /*!< Position of OPPTRA field.                                            */
  #define CRACENCORE_PK_POINTERS_OPPTRA_Msk (0xFUL << CRACENCORE_PK_POINTERS_OPPTRA_Pos) /*!< Bit mask of OPPTRA field.        */

/* OPPTRB @Bits 8..11 : When executing primitive arithmetic operations, this pointer defines where operand B is located in
                        memory (location 0x0 to 0xF). */                                                                          
                                                                                                                                  
  #define CRACENCORE_PK_POINTERS_OPPTRB_Pos (8UL)    /*!< Position of OPPTRB field.                                            */
  #define CRACENCORE_PK_POINTERS_OPPTRB_Msk (0xFUL << CRACENCORE_PK_POINTERS_OPPTRB_Pos) /*!< Bit mask of OPPTRB field.        */

