adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ECC @Bit 18 : Support error correction. */
  #define CRACENCORE_PK_HWCONFIG_ECC_Pos (18UL)      /*!< Position of ECC field.                                               */
  #define CRACENCORE_PK_HWCONFIG_ECC_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_ECC_Pos) /*!< Bit mask of ECC field.                 */

/* P256 @Bit 20 : Support ECC P256 acceleration. */
  #define CRACENCORE_PK_HWCONFIG_P256_Pos (20UL)     /*!< Position of P256 field.                                              */
  #define CRACENCORE_PK_HWCONFIG_P256_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_P256_Pos) /*!< Bit mask of P256 field.              */

/* P384 @Bit 21 : Support ECC P384 acceleration. */
  #define CRACENCORE_PK_HWCONFIG_P384_Pos (21UL)     /*!< Position of P384 field.                                              */
  #define CRACENCORE_PK_HWCONFIG_P384_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_P384_Pos) /*!< Bit mask of P384 field.              */

/* P521 @Bit 22 : Support ECC P521 acceleration. */
  #define CRACENCORE_PK_HWCONFIG_P521_Pos (22UL)     /*!< Position of P521 field.                                              */
  #define CRACENCORE_PK_HWCONFIG_P521_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_P521_Pos) /*!< Bit mask of P521 field.              */

/* P192 @Bit 23 : Support ECC P192 acceleration. */
  #define CRACENCORE_PK_HWCONFIG_P192_Pos (23UL)     /*!< Position of P192 field.                                              */
  #define CRACENCORE_PK_HWCONFIG_P192_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_P192_Pos) /*!< Bit mask of P192 field.              */

/* X25519 @Bit 24 : Support Curve25519/Ed25519 acceleration. */
  #define CRACENCORE_PK_HWCONFIG_X25519_Pos (24UL)   /*!< Position of X25519 field.                                            */
  #define CRACENCORE_PK_HWCONFIG_X25519_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_X25519_Pos) /*!< Bit mask of X25519 field.        */

/* AHBMASTER @Bit 25 : Memory access */
  #define CRACENCORE_PK_HWCONFIG_AHBMASTER_Pos (25UL) /*!< Position of AHBMASTER field.                                        */
  #define CRACENCORE_PK_HWCONFIG_AHBMASTER_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_AHBMASTER_Pos) /*!< Bit mask of AHBMASTER
                                                                            field.*/                                              
  #define CRACENCORE_PK_HWCONFIG_AHBMASTER_Min (0x0UL) /*!< Min enumerator value of AHBMASTER field.                           */
  #define CRACENCORE_PK_HWCONFIG_AHBMASTER_Max (0x1UL) /*!< Max enumerator value of AHBMASTER field.                           */
  #define CRACENCORE_PK_HWCONFIG_AHBMASTER_SLAVE (0x0UL) /*!< Memory access through AHB Slave and internally in the PKE.       */
  #define CRACENCORE_PK_HWCONFIG_AHBMASTER_MASTER (0x1UL) /*!< Memory access through AHB Master, outside the PKE.              */

/* DISABLESMX @Bit 29 : State of DisableSMx input (high when SM2/SM9 operations are disabled). */
  #define CRACENCORE_PK_HWCONFIG_DISABLESMX_Pos (29UL) /*!< Position of DISABLESMX field.                                      */
  #define CRACENCORE_PK_HWCONFIG_DISABLESMX_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_DISABLESMX_Pos) /*!< Bit mask of DISABLESMX
                                                                            field.*/                                              

/* DISABLECLRMEM @Bit 30 : State of DisableClrMem input (high when automatic clear of the RAM after reset is disabled). */
  #define CRACENCORE_PK_HWCONFIG_DISABLECLRMEM_Pos (30UL) /*!< Position of DISABLECLRMEM field.                                */
  #define CRACENCORE_PK_HWCONFIG_DISABLECLRMEM_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_DISABLECLRMEM_Pos) /*!< Bit mask of
                                                                            DISABLECLRMEM field.*/                                

/* DISABLECM @Bit 31 : State of DisableCM input (high when counter-measures are disabled). */
  #define CRACENCORE_PK_HWCONFIG_DISABLECM_Pos (31UL) /*!< Position of DISABLECM field.                                        */
  #define CRACENCORE_PK_HWCONFIG_DISABLECM_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_DISABLECM_Pos) /*!< Bit mask of DISABLECM
                                                                            field.*/                                              


/* CRACENCORE_PK_OPSIZE: Operand size register. */
  #define CRACENCORE_PK_OPSIZE_ResetValue (0x00001000UL) /*!< Reset value of OPSIZE register.                                  */

/* OPSIZE @Bits 0..12 : Operand size (number of bytes): This register is used when the memory is accessed via AHB Master */
  #define CRACENCORE_PK_OPSIZE_OPSIZE_Pos (0UL)      /*!< Position of OPSIZE field.                                            */
  #define CRACENCORE_PK_OPSIZE_OPSIZE_Msk (0x1FFFUL << CRACENCORE_PK_OPSIZE_OPSIZE_Pos) /*!< Bit mask of OPSIZE field.         */
  #define CRACENCORE_PK_OPSIZE_OPSIZE_Min (0x100UL)  /*!< Min enumerator value of OPSIZE field.                                */
  #define CRACENCORE_PK_OPSIZE_OPSIZE_Max (0x1000UL) /*!< Max enumerator value of OPSIZE field.                                */
  #define CRACENCORE_PK_OPSIZE_OPSIZE_OPSIZE256 (0x0100UL) /*!< 256 bytes.                                                     */
  #define CRACENCORE_PK_OPSIZE_OPSIZE_OPSIZE521 (0x0209UL) /*!< 521 bytes.                                                     */
  #define CRACENCORE_PK_OPSIZE_OPSIZE_OPSIZE2048 (0x0800UL) /*!< 2048 bytes.                                                   */
  #define CRACENCORE_PK_OPSIZE_OPSIZE_OPSIZE3072 (0x0C00UL) /*!< 3072 bytes.                                                   */
  #define CRACENCORE_PK_OPSIZE_OPSIZE_OPSIZE4096 (0x1000UL) /*!< 4096 bytes.                                                   */


/* CRACENCORE_PK_MEMOFFSET: Memory offset register. */
  #define CRACENCORE_PK_MEMOFFSET_ResetValue (0x00000000UL) /*!< Reset value of MEMOFFSET register.                            */

/* MEMOFFSET @Bits 0..31 : Memory offset for AHB Master */
  #define CRACENCORE_PK_MEMOFFSET_MEMOFFSET_Pos (0UL) /*!< Position of MEMOFFSET field.                                        */
  #define CRACENCORE_PK_MEMOFFSET_MEMOFFSET_Msk (0xFFFFFFFFUL << CRACENCORE_PK_MEMOFFSET_MEMOFFSET_Pos) /*!< Bit mask of
                                                                            MEMOFFSET field.*/                                    


