adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* APPCLEAR0 @Bit 0 : Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel. */
  #define CTI_CTIAPPCLEAR_APPCLEAR0_Pos (0UL)        /*!< Position of APPCLEAR0 field.                                         */
  #define CTI_CTIAPPCLEAR_APPCLEAR0_Msk (0x1UL << CTI_CTIAPPCLEAR_APPCLEAR0_Pos) /*!< Bit mask of APPCLEAR0 field.             */
  #define CTI_CTIAPPCLEAR_APPCLEAR0_Min (0x1UL)      /*!< Min enumerator value of APPCLEAR0 field.                             */
  #define CTI_CTIAPPCLEAR_APPCLEAR0_Max (0x1UL)      /*!< Max enumerator value of APPCLEAR0 field.                             */
  #define CTI_CTIAPPCLEAR_APPCLEAR0_Clear (0x1UL)    /*!< Clears the event for channel 0.                                      */

/* APPCLEAR1 @Bit 1 : Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel. */
  #define CTI_CTIAPPCLEAR_APPCLEAR1_Pos (1UL)        /*!< Position of APPCLEAR1 field.                                         */
  #define CTI_CTIAPPCLEAR_APPCLEAR1_Msk (0x1UL << CTI_CTIAPPCLEAR_APPCLEAR1_Pos) /*!< Bit mask of APPCLEAR1 field.             */
  #define CTI_CTIAPPCLEAR_APPCLEAR1_Min (0x1UL)      /*!< Min enumerator value of APPCLEAR1 field.                             */
  #define CTI_CTIAPPCLEAR_APPCLEAR1_Max (0x1UL)      /*!< Max enumerator value of APPCLEAR1 field.                             */
  #define CTI_CTIAPPCLEAR_APPCLEAR1_Clear (0x1UL)    /*!< Clears the event for channel 1.                                      */

/* APPCLEAR2 @Bit 2 : Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel. */
  #define CTI_CTIAPPCLEAR_APPCLEAR2_Pos (2UL)        /*!< Position of APPCLEAR2 field.                                         */
  #define CTI_CTIAPPCLEAR_APPCLEAR2_Msk (0x1UL << CTI_CTIAPPCLEAR_APPCLEAR2_Pos) /*!< Bit mask of APPCLEAR2 field.             */
  #define CTI_CTIAPPCLEAR_APPCLEAR2_Min (0x1UL)      /*!< Min enumerator value of APPCLEAR2 field.                             */
  #define CTI_CTIAPPCLEAR_APPCLEAR2_Max (0x1UL)      /*!< Max enumerator value of APPCLEAR2 field.                             */
  #define CTI_CTIAPPCLEAR_APPCLEAR2_Clear (0x1UL)    /*!< Clears the event for channel 2.                                      */

/* APPCLEAR3 @Bit 3 : Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel. */
  #define CTI_CTIAPPCLEAR_APPCLEAR3_Pos (3UL)        /*!< Position of APPCLEAR3 field.                                         */
  #define CTI_CTIAPPCLEAR_APPCLEAR3_Msk (0x1UL << CTI_CTIAPPCLEAR_APPCLEAR3_Pos) /*!< Bit mask of APPCLEAR3 field.             */
  #define CTI_CTIAPPCLEAR_APPCLEAR3_Min (0x1UL)      /*!< Min enumerator value of APPCLEAR3 field.                             */
  #define CTI_CTIAPPCLEAR_APPCLEAR3_Max (0x1UL)      /*!< Max enumerator value of APPCLEAR3 field.                             */
  #define CTI_CTIAPPCLEAR_APPCLEAR3_Clear (0x1UL)    /*!< Clears the event for channel 3.                                      */


/* CTI_CTIAPPPULSE: CTI Application Pulse register */
  #define CTI_CTIAPPPULSE_ResetValue (0x00000000UL)  /*!< Reset value of CTIAPPPULSE register.                                 */

/* APPULSE0 @Bit 0 : Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the
                     register for each channel. */                                                                                
                                                                                                                                  
  #define CTI_CTIAPPPULSE_APPULSE0_Pos (0UL)         /*!< Position of APPULSE0 field.                                          */
  #define CTI_CTIAPPPULSE_APPULSE0_Msk (0x1UL << CTI_CTIAPPPULSE_APPULSE0_Pos) /*!< Bit mask of APPULSE0 field.                */
  #define CTI_CTIAPPPULSE_APPULSE0_Min (0x1UL)       /*!< Min enumerator value of APPULSE0 field.                              */
  #define CTI_CTIAPPPULSE_APPULSE0_Max (0x1UL)       /*!< Max enumerator value of APPULSE0 field.                              */
  #define CTI_CTIAPPPULSE_APPULSE0_Generate (0x1UL)  /*!< Generates an event pulse on channel 0.                               */

/* APPULSE1 @Bit 1 : Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the
                     register for each channel. */                                                                                
                                                                                                                                  
  #define CTI_CTIAPPPULSE_APPULSE1_Pos (1UL)         /*!< Position of APPULSE1 field.                                          */
  #define CTI_CTIAPPPULSE_APPULSE1_Msk (0x1UL << CTI_CTIAPPPULSE_APPULSE1_Pos) /*!< Bit mask of APPULSE1 field.                */
  #define CTI_CTIAPPPULSE_APPULSE1_Min (0x1UL)       /*!< Min enumerator value of APPULSE1 field.                              */
  #define CTI_CTIAPPPULSE_APPULSE1_Max (0x1UL)       /*!< Max enumerator value of APPULSE1 field.                              */
  #define CTI_CTIAPPPULSE_APPULSE1_Generate (0x1UL)  /*!< Generates an event pulse on channel 1.                               */

/* APPULSE2 @Bit 2 : Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the
                     register for each channel. */                                                                                
                                                                                                                                  
  #define CTI_CTIAPPPULSE_APPULSE2_Pos (2UL)         /*!< Position of APPULSE2 field.                                          */
  #define CTI_CTIAPPPULSE_APPULSE2_Msk (0x1UL << CTI_CTIAPPPULSE_APPULSE2_Pos) /*!< Bit mask of APPULSE2 field.                */
  #define CTI_CTIAPPPULSE_APPULSE2_Min (0x1UL)       /*!< Min enumerator value of APPULSE2 field.                              */
  #define CTI_CTIAPPPULSE_APPULSE2_Max (0x1UL)       /*!< Max enumerator value of APPULSE2 field.                              */
  #define CTI_CTIAPPPULSE_APPULSE2_Generate (0x1UL)  /*!< Generates an event pulse on channel 2.                               */

/* APPULSE3 @Bit 3 : Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the
                     register for each channel. */                                                                                
                                                                                                                                  
