adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TRIGINSTATUS0 @Bit 0 : Shows the status of ctitrigin0 input. */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS0_Pos (0UL) /*!< Position of TRIGINSTATUS0 field.                                    */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS0_Msk (0x1UL << CTI_CTITRIGINSTATUS_TRIGINSTATUS0_Pos) /*!< Bit mask of TRIGINSTATUS0
                                                                            field.*/                                              
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS0_Min (0x0UL) /*!< Min enumerator value of TRIGINSTATUS0 field.                      */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS0_Max (0x1UL) /*!< Max enumerator value of TRIGINSTATUS0 field.                      */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS0_Active (0x1UL) /*!< Ctitrigin 0 is active.                                         */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS0_Inactive (0x0UL) /*!< Ctitrigin 0 is inactive.                                     */

/* TRIGINSTATUS1 @Bit 1 : Shows the status of ctitrigin1 input. */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS1_Pos (1UL) /*!< Position of TRIGINSTATUS1 field.                                    */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS1_Msk (0x1UL << CTI_CTITRIGINSTATUS_TRIGINSTATUS1_Pos) /*!< Bit mask of TRIGINSTATUS1
                                                                            field.*/                                              
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS1_Min (0x0UL) /*!< Min enumerator value of TRIGINSTATUS1 field.                      */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS1_Max (0x1UL) /*!< Max enumerator value of TRIGINSTATUS1 field.                      */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS1_Active (0x1UL) /*!< Ctitrigin 1 is active.                                         */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS1_Inactive (0x0UL) /*!< Ctitrigin 1 is inactive.                                     */

/* TRIGINSTATUS2 @Bit 2 : Shows the status of ctitrigin2 input. */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS2_Pos (2UL) /*!< Position of TRIGINSTATUS2 field.                                    */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS2_Msk (0x1UL << CTI_CTITRIGINSTATUS_TRIGINSTATUS2_Pos) /*!< Bit mask of TRIGINSTATUS2
                                                                            field.*/                                              
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS2_Min (0x0UL) /*!< Min enumerator value of TRIGINSTATUS2 field.                      */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS2_Max (0x1UL) /*!< Max enumerator value of TRIGINSTATUS2 field.                      */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS2_Active (0x1UL) /*!< Ctitrigin 2 is active.                                         */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS2_Inactive (0x0UL) /*!< Ctitrigin 2 is inactive.                                     */

/* TRIGINSTATUS3 @Bit 3 : Shows the status of ctitrigin3 input. */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS3_Pos (3UL) /*!< Position of TRIGINSTATUS3 field.                                    */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS3_Msk (0x1UL << CTI_CTITRIGINSTATUS_TRIGINSTATUS3_Pos) /*!< Bit mask of TRIGINSTATUS3
                                                                            field.*/                                              
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS3_Min (0x0UL) /*!< Min enumerator value of TRIGINSTATUS3 field.                      */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS3_Max (0x1UL) /*!< Max enumerator value of TRIGINSTATUS3 field.                      */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS3_Active (0x1UL) /*!< Ctitrigin 3 is active.                                         */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS3_Inactive (0x0UL) /*!< Ctitrigin 3 is inactive.                                     */

/* TRIGINSTATUS4 @Bit 4 : Shows the status of ctitrigin4 input. */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS4_Pos (4UL) /*!< Position of TRIGINSTATUS4 field.                                    */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS4_Msk (0x1UL << CTI_CTITRIGINSTATUS_TRIGINSTATUS4_Pos) /*!< Bit mask of TRIGINSTATUS4
                                                                            field.*/                                              
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS4_Min (0x0UL) /*!< Min enumerator value of TRIGINSTATUS4 field.                      */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS4_Max (0x1UL) /*!< Max enumerator value of TRIGINSTATUS4 field.                      */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS4_Active (0x1UL) /*!< Ctitrigin 4 is active.                                         */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS4_Inactive (0x0UL) /*!< Ctitrigin 4 is inactive.                                     */

/* TRIGINSTATUS5 @Bit 5 : Shows the status of ctitrigin5 input. */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS5_Pos (5UL) /*!< Position of TRIGINSTATUS5 field.                                    */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS5_Msk (0x1UL << CTI_CTITRIGINSTATUS_TRIGINSTATUS5_Pos) /*!< Bit mask of TRIGINSTATUS5
                                                                            field.*/                                              
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS5_Min (0x0UL) /*!< Min enumerator value of TRIGINSTATUS5 field.                      */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS5_Max (0x1UL) /*!< Max enumerator value of TRIGINSTATUS5 field.                      */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS5_Active (0x1UL) /*!< Ctitrigin 5 is active.                                         */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS5_Inactive (0x0UL) /*!< Ctitrigin 5 is inactive.                                     */

/* TRIGINSTATUS6 @Bit 6 : Shows the status of ctitrigin6 input. */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS6_Pos (6UL) /*!< Position of TRIGINSTATUS6 field.                                    */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS6_Msk (0x1UL << CTI_CTITRIGINSTATUS_TRIGINSTATUS6_Pos) /*!< Bit mask of TRIGINSTATUS6
                                                                            field.*/                                              
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS6_Min (0x0UL) /*!< Min enumerator value of TRIGINSTATUS6 field.                      */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS6_Max (0x1UL) /*!< Max enumerator value of TRIGINSTATUS6 field.                      */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS6_Active (0x1UL) /*!< Ctitrigin 6 is active.                                         */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS6_Inactive (0x0UL) /*!< Ctitrigin 6 is inactive.                                     */

/* TRIGINSTATUS7 @Bit 7 : Shows the status of ctitrigin7 input. */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS7_Pos (7UL) /*!< Position of TRIGINSTATUS7 field.                                    */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS7_Msk (0x1UL << CTI_CTITRIGINSTATUS_TRIGINSTATUS7_Pos) /*!< Bit mask of TRIGINSTATUS7
                                                                            field.*/                                              
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS7_Min (0x0UL) /*!< Min enumerator value of TRIGINSTATUS7 field.                      */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS7_Max (0x1UL) /*!< Max enumerator value of TRIGINSTATUS7 field.                      */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS7_Active (0x1UL) /*!< Ctitrigin 7 is active.                                         */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS7_Inactive (0x0UL) /*!< Ctitrigin 7 is inactive.                                     */


/* CTI_CTITRIGOUTSTATUS: CTI Trigger Out Status register */
  #define CTI_CTITRIGOUTSTATUS_ResetValue (0x00000000UL) /*!< Reset value of CTITRIGOUTSTATUS register.                        */

