adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CTICHINSTATUS0 @Bit 0 : Shows the status of the ctitrigin 0 input. */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS0_Pos (0UL) /*!< Position of CTICHINSTATUS0 field.                                    */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS0_Msk (0x1UL << CTI_CTICHINSTATUS_CTICHINSTATUS0_Pos) /*!< Bit mask of CTICHINSTATUS0
                                                                            field.*/                                              
  #define CTI_CTICHINSTATUS_CTICHINSTATUS0_Min (0x0UL) /*!< Min enumerator value of CTICHINSTATUS0 field.                      */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS0_Max (0x1UL) /*!< Max enumerator value of CTICHINSTATUS0 field.                      */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS0_Active (0x1UL) /*!< Ctichin 0 is active.                                            */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS0_Inactive (0x0UL) /*!< Ctichin 0 is inactive.                                        */

/* CTICHINSTATUS1 @Bit 1 : Shows the status of the ctitrigin 1 input. */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS1_Pos (1UL) /*!< Position of CTICHINSTATUS1 field.                                    */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS1_Msk (0x1UL << CTI_CTICHINSTATUS_CTICHINSTATUS1_Pos) /*!< Bit mask of CTICHINSTATUS1
                                                                            field.*/                                              
  #define CTI_CTICHINSTATUS_CTICHINSTATUS1_Min (0x0UL) /*!< Min enumerator value of CTICHINSTATUS1 field.                      */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS1_Max (0x1UL) /*!< Max enumerator value of CTICHINSTATUS1 field.                      */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS1_Active (0x1UL) /*!< Ctichin 1 is active.                                            */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS1_Inactive (0x0UL) /*!< Ctichin 1 is inactive.                                        */

/* CTICHINSTATUS2 @Bit 2 : Shows the status of the ctitrigin 2 input. */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS2_Pos (2UL) /*!< Position of CTICHINSTATUS2 field.                                    */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS2_Msk (0x1UL << CTI_CTICHINSTATUS_CTICHINSTATUS2_Pos) /*!< Bit mask of CTICHINSTATUS2
                                                                            field.*/                                              
  #define CTI_CTICHINSTATUS_CTICHINSTATUS2_Min (0x0UL) /*!< Min enumerator value of CTICHINSTATUS2 field.                      */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS2_Max (0x1UL) /*!< Max enumerator value of CTICHINSTATUS2 field.                      */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS2_Active (0x1UL) /*!< Ctichin 2 is active.                                            */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS2_Inactive (0x0UL) /*!< Ctichin 2 is inactive.                                        */

/* CTICHINSTATUS3 @Bit 3 : Shows the status of the ctitrigin 3 input. */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS3_Pos (3UL) /*!< Position of CTICHINSTATUS3 field.                                    */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS3_Msk (0x1UL << CTI_CTICHINSTATUS_CTICHINSTATUS3_Pos) /*!< Bit mask of CTICHINSTATUS3
                                                                            field.*/                                              
  #define CTI_CTICHINSTATUS_CTICHINSTATUS3_Min (0x0UL) /*!< Min enumerator value of CTICHINSTATUS3 field.                      */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS3_Max (0x1UL) /*!< Max enumerator value of CTICHINSTATUS3 field.                      */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS3_Active (0x1UL) /*!< Ctichin 3 is active.                                            */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS3_Inactive (0x0UL) /*!< Ctichin 3 is inactive.                                        */


/* CTI_CTICHOUTSTATUS: CTI Channel Out Status register */
  #define CTI_CTICHOUTSTATUS_ResetValue (0x00000000UL) /*!< Reset value of CTICHOUTSTATUS register.                            */

/* CTICHOUTSTATUS0 @Bit 0 : Shows the status of the ctichout 0 output. */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS0_Pos (0UL) /*!< Position of CTICHOUTSTATUS0 field.                                 */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS0_Msk (0x1UL << CTI_CTICHOUTSTATUS_CTICHOUTSTATUS0_Pos) /*!< Bit mask of
                                                                            CTICHOUTSTATUS0 field.*/                              
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS0_Min (0x0UL) /*!< Min enumerator value of CTICHOUTSTATUS0 field.                   */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS0_Max (0x1UL) /*!< Max enumerator value of CTICHOUTSTATUS0 field.                   */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS0_Active (0x1UL) /*!< Ctichout 0 is active.                                         */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS0_Inactive (0x0UL) /*!< Ctichout 0 is inactive.                                     */

/* CTICHOUTSTATUS1 @Bit 1 : Shows the status of the ctichout 1 output. */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS1_Pos (1UL) /*!< Position of CTICHOUTSTATUS1 field.                                 */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS1_Msk (0x1UL << CTI_CTICHOUTSTATUS_CTICHOUTSTATUS1_Pos) /*!< Bit mask of
                                                                            CTICHOUTSTATUS1 field.*/                              
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS1_Min (0x0UL) /*!< Min enumerator value of CTICHOUTSTATUS1 field.                   */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS1_Max (0x1UL) /*!< Max enumerator value of CTICHOUTSTATUS1 field.                   */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS1_Active (0x1UL) /*!< Ctichout 1 is active.                                         */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS1_Inactive (0x0UL) /*!< Ctichout 1 is inactive.                                     */

/* CTICHOUTSTATUS2 @Bit 2 : Shows the status of the ctichout 2 output. */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS2_Pos (2UL) /*!< Position of CTICHOUTSTATUS2 field.                                 */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS2_Msk (0x1UL << CTI_CTICHOUTSTATUS_CTICHOUTSTATUS2_Pos) /*!< Bit mask of
                                                                            CTICHOUTSTATUS2 field.*/                              
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS2_Min (0x0UL) /*!< Min enumerator value of CTICHOUTSTATUS2 field.                   */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS2_Max (0x1UL) /*!< Max enumerator value of CTICHOUTSTATUS2 field.                   */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS2_Active (0x1UL) /*!< Ctichout 2 is active.                                         */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS2_Inactive (0x0UL) /*!< Ctichout 2 is inactive.                                     */

/* CTICHOUTSTATUS3 @Bit 3 : Shows the status of the ctichout 3 output. */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS3_Pos (3UL) /*!< Position of CTICHOUTSTATUS3 field.                                 */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS3_Msk (0x1UL << CTI_CTICHOUTSTATUS_CTICHOUTSTATUS3_Pos) /*!< Bit mask of
                                                                            CTICHOUTSTATUS3 field.*/                              
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS3_Min (0x0UL) /*!< Min enumerator value of CTICHOUTSTATUS3 field.                   */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS3_Max (0x1UL) /*!< Max enumerator value of CTICHOUTSTATUS3 field.                   */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS3_Active (0x1UL) /*!< Ctichout 3 is active.                                         */
  #define CTI_CTICHOUTSTATUS_CTICHOUTSTATUS3_Inactive (0x0UL) /*!< Ctichout 3 is inactive.                                     */


