adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CTI_CTIGATE: Enable CTI Channel Gate register */
  #define CTI_CTIGATE_ResetValue (0x0000000FUL)      /*!< Reset value of CTIGATE register.                                     */

/* CTIGATEEN0 @Bit 0 : Enable ctichout0. */
  #define CTI_CTIGATE_CTIGATEEN0_Pos (0UL)           /*!< Position of CTIGATEEN0 field.                                        */
  #define CTI_CTIGATE_CTIGATEEN0_Msk (0x1UL << CTI_CTIGATE_CTIGATEEN0_Pos) /*!< Bit mask of CTIGATEEN0 field.                  */
  #define CTI_CTIGATE_CTIGATEEN0_Min (0x0UL)         /*!< Min enumerator value of CTIGATEEN0 field.                            */
  #define CTI_CTIGATE_CTIGATEEN0_Max (0x1UL)         /*!< Max enumerator value of CTIGATEEN0 field.                            */
  #define CTI_CTIGATE_CTIGATEEN0_Enabled (0x1UL)     /*!< Enable ctichout channel 0 propagation.                               */
  #define CTI_CTIGATE_CTIGATEEN0_Disabled (0x0UL)    /*!< Disable ctichout channel 0 propagation.                              */

/* CTIGATEEN1 @Bit 1 : Enable ctichout1. */
  #define CTI_CTIGATE_CTIGATEEN1_Pos (1UL)           /*!< Position of CTIGATEEN1 field.                                        */
  #define CTI_CTIGATE_CTIGATEEN1_Msk (0x1UL << CTI_CTIGATE_CTIGATEEN1_Pos) /*!< Bit mask of CTIGATEEN1 field.                  */
  #define CTI_CTIGATE_CTIGATEEN1_Min (0x0UL)         /*!< Min enumerator value of CTIGATEEN1 field.                            */
  #define CTI_CTIGATE_CTIGATEEN1_Max (0x1UL)         /*!< Max enumerator value of CTIGATEEN1 field.                            */
  #define CTI_CTIGATE_CTIGATEEN1_Enabled (0x1UL)     /*!< Enable ctichout channel 1 propagation.                               */
  #define CTI_CTIGATE_CTIGATEEN1_Disabled (0x0UL)    /*!< Disable ctichout channel 1 propagation.                              */

/* CTIGATEEN2 @Bit 2 : Enable ctichout2. */
  #define CTI_CTIGATE_CTIGATEEN2_Pos (2UL)           /*!< Position of CTIGATEEN2 field.                                        */
  #define CTI_CTIGATE_CTIGATEEN2_Msk (0x1UL << CTI_CTIGATE_CTIGATEEN2_Pos) /*!< Bit mask of CTIGATEEN2 field.                  */
  #define CTI_CTIGATE_CTIGATEEN2_Min (0x0UL)         /*!< Min enumerator value of CTIGATEEN2 field.                            */
  #define CTI_CTIGATE_CTIGATEEN2_Max (0x1UL)         /*!< Max enumerator value of CTIGATEEN2 field.                            */
  #define CTI_CTIGATE_CTIGATEEN2_Enabled (0x1UL)     /*!< Enable ctichout channel 2 propagation.                               */
  #define CTI_CTIGATE_CTIGATEEN2_Disabled (0x0UL)    /*!< Disable ctichout channel 2 propagation.                              */

/* CTIGATEEN3 @Bit 3 : Enable ctichout3. */
  #define CTI_CTIGATE_CTIGATEEN3_Pos (3UL)           /*!< Position of CTIGATEEN3 field.                                        */
  #define CTI_CTIGATE_CTIGATEEN3_Msk (0x1UL << CTI_CTIGATE_CTIGATEEN3_Pos) /*!< Bit mask of CTIGATEEN3 field.                  */
  #define CTI_CTIGATE_CTIGATEEN3_Min (0x0UL)         /*!< Min enumerator value of CTIGATEEN3 field.                            */
  #define CTI_CTIGATE_CTIGATEEN3_Max (0x1UL)         /*!< Max enumerator value of CTIGATEEN3 field.                            */
  #define CTI_CTIGATE_CTIGATEEN3_Enabled (0x1UL)     /*!< Enable ctichout channel 3 propagation.                               */
  #define CTI_CTIGATE_CTIGATEEN3_Disabled (0x0UL)    /*!< Disable ctichout channel 3 propagation.                              */


/* CTI_ASICCTL: External Multiplexer Control register */
  #define CTI_ASICCTL_ResetValue (0x00000000UL)      /*!< Reset value of ASICCTL register.                                     */

/* ASICCTL @Bits 0..7 : When external multiplexing is implemented for trigger signals, then the number of multiplexed signals on
                        each trigger must be shown in the Device ID Register. This is done using a Verilog define EXTMUXNUM. */   
                                                                                                                                  
  #define CTI_ASICCTL_ASICCTL_Pos (0UL)              /*!< Position of ASICCTL field.                                           */
  #define CTI_ASICCTL_ASICCTL_Msk (0xFFUL << CTI_ASICCTL_ASICCTL_Pos) /*!< Bit mask of ASICCTL field.                          */


/* CTI_ITCHINACK: Integration Test Channel Input Acknowledge register */
  #define CTI_ITCHINACK_ResetValue (0x00000000UL)    /*!< Reset value of ITCHINACK register.                                   */

/* CTCHINACK0 @Bit 0 : Sets the value of the ctichinack 0 output */
  #define CTI_ITCHINACK_CTCHINACK0_Pos (0UL)         /*!< Position of CTCHINACK0 field.                                        */
  #define CTI_ITCHINACK_CTCHINACK0_Msk (0x1UL << CTI_ITCHINACK_CTCHINACK0_Pos) /*!< Bit mask of CTCHINACK0 field.              */

/* CTCHINACK1 @Bit 1 : Sets the value of the ctichinack 1 output */
  #define CTI_ITCHINACK_CTCHINACK1_Pos (1UL)         /*!< Position of CTCHINACK1 field.                                        */
  #define CTI_ITCHINACK_CTCHINACK1_Msk (0x1UL << CTI_ITCHINACK_CTCHINACK1_Pos) /*!< Bit mask of CTCHINACK1 field.              */

/* CTCHINACK2 @Bit 2 : Sets the value of the ctichinack 2 output */
  #define CTI_ITCHINACK_CTCHINACK2_Pos (2UL)         /*!< Position of CTCHINACK2 field.                                        */
  #define CTI_ITCHINACK_CTCHINACK2_Msk (0x1UL << CTI_ITCHINACK_CTCHINACK2_Pos) /*!< Bit mask of CTCHINACK2 field.              */

/* CTCHINACK3 @Bit 3 : Sets the value of the ctichinack 3 output */
  #define CTI_ITCHINACK_CTCHINACK3_Pos (3UL)         /*!< Position of CTCHINACK3 field.                                        */
  #define CTI_ITCHINACK_CTCHINACK3_Msk (0x1UL << CTI_ITCHINACK_CTCHINACK3_Pos) /*!< Bit mask of CTCHINACK3 field.              */


/* CTI_ITTRIGINACK: Integration Test Trigger Input Acknowledge register */
  #define CTI_ITTRIGINACK_ResetValue (0x00000000UL)  /*!< Reset value of ITTRIGINACK register.                                 */

/* CTTRIGINACK0 @Bit 0 : Sets the value of the ctitriginack 0 output */
  #define CTI_ITTRIGINACK_CTTRIGINACK0_Pos (0UL)     /*!< Position of CTTRIGINACK0 field.                                      */
  #define CTI_ITTRIGINACK_CTTRIGINACK0_Msk (0x1UL << CTI_ITTRIGINACK_CTTRIGINACK0_Pos) /*!< Bit mask of CTTRIGINACK0 field.    */

/* CTTRIGINACK1 @Bit 1 : Sets the value of the ctitriginack 1 output */
  #define CTI_ITTRIGINACK_CTTRIGINACK1_Pos (1UL)     /*!< Position of CTTRIGINACK1 field.                                      */
  #define CTI_ITTRIGINACK_CTTRIGINACK1_Msk (0x1UL << CTI_ITTRIGINACK_CTTRIGINACK1_Pos) /*!< Bit mask of CTTRIGINACK1 field.    */

