adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CTTRIGINACK2 @Bit 2 : Sets the value of the ctitriginack 2 output */
  #define CTI_ITTRIGINACK_CTTRIGINACK2_Pos (2UL)     /*!< Position of CTTRIGINACK2 field.                                      */
  #define CTI_ITTRIGINACK_CTTRIGINACK2_Msk (0x1UL << CTI_ITTRIGINACK_CTTRIGINACK2_Pos) /*!< Bit mask of CTTRIGINACK2 field.    */

/* CTTRIGINACK3 @Bit 3 : Sets the value of the ctitriginack 3 output */
  #define CTI_ITTRIGINACK_CTTRIGINACK3_Pos (3UL)     /*!< Position of CTTRIGINACK3 field.                                      */
  #define CTI_ITTRIGINACK_CTTRIGINACK3_Msk (0x1UL << CTI_ITTRIGINACK_CTTRIGINACK3_Pos) /*!< Bit mask of CTTRIGINACK3 field.    */

/* CTTRIGINACK4 @Bit 4 : Sets the value of the ctitriginack 4 output */
  #define CTI_ITTRIGINACK_CTTRIGINACK4_Pos (4UL)     /*!< Position of CTTRIGINACK4 field.                                      */
  #define CTI_ITTRIGINACK_CTTRIGINACK4_Msk (0x1UL << CTI_ITTRIGINACK_CTTRIGINACK4_Pos) /*!< Bit mask of CTTRIGINACK4 field.    */

/* CTTRIGINACK5 @Bit 5 : Sets the value of the ctitriginack 5 output */
  #define CTI_ITTRIGINACK_CTTRIGINACK5_Pos (5UL)     /*!< Position of CTTRIGINACK5 field.                                      */
  #define CTI_ITTRIGINACK_CTTRIGINACK5_Msk (0x1UL << CTI_ITTRIGINACK_CTTRIGINACK5_Pos) /*!< Bit mask of CTTRIGINACK5 field.    */

/* CTTRIGINACK6 @Bit 6 : Sets the value of the ctitriginack 6 output */
  #define CTI_ITTRIGINACK_CTTRIGINACK6_Pos (6UL)     /*!< Position of CTTRIGINACK6 field.                                      */
  #define CTI_ITTRIGINACK_CTTRIGINACK6_Msk (0x1UL << CTI_ITTRIGINACK_CTTRIGINACK6_Pos) /*!< Bit mask of CTTRIGINACK6 field.    */

/* CTTRIGINACK7 @Bit 7 : Sets the value of the ctitriginack 7 output */
  #define CTI_ITTRIGINACK_CTTRIGINACK7_Pos (7UL)     /*!< Position of CTTRIGINACK7 field.                                      */
  #define CTI_ITTRIGINACK_CTTRIGINACK7_Msk (0x1UL << CTI_ITTRIGINACK_CTTRIGINACK7_Pos) /*!< Bit mask of CTTRIGINACK7 field.    */


/* CTI_ITCHOUT: Integration Test Channel Output register */
  #define CTI_ITCHOUT_ResetValue (0x00000000UL)      /*!< Reset value of ITCHOUT register.                                     */

/* CTCHOUT0 @Bit 0 : Sets the value of the ctichout 0 output */
  #define CTI_ITCHOUT_CTCHOUT0_Pos (0UL)             /*!< Position of CTCHOUT0 field.                                          */
  #define CTI_ITCHOUT_CTCHOUT0_Msk (0x1UL << CTI_ITCHOUT_CTCHOUT0_Pos) /*!< Bit mask of CTCHOUT0 field.                        */

/* CTCHOUT1 @Bit 1 : Sets the value of the ctichout 1 output */
  #define CTI_ITCHOUT_CTCHOUT1_Pos (1UL)             /*!< Position of CTCHOUT1 field.                                          */
  #define CTI_ITCHOUT_CTCHOUT1_Msk (0x1UL << CTI_ITCHOUT_CTCHOUT1_Pos) /*!< Bit mask of CTCHOUT1 field.                        */

/* CTCHOUT2 @Bit 2 : Sets the value of the ctichout 2 output */
  #define CTI_ITCHOUT_CTCHOUT2_Pos (2UL)             /*!< Position of CTCHOUT2 field.                                          */
  #define CTI_ITCHOUT_CTCHOUT2_Msk (0x1UL << CTI_ITCHOUT_CTCHOUT2_Pos) /*!< Bit mask of CTCHOUT2 field.                        */

/* CTCHOUT3 @Bit 3 : Sets the value of the ctichout 3 output */
  #define CTI_ITCHOUT_CTCHOUT3_Pos (3UL)             /*!< Position of CTCHOUT3 field.                                          */
  #define CTI_ITCHOUT_CTCHOUT3_Msk (0x1UL << CTI_ITCHOUT_CTCHOUT3_Pos) /*!< Bit mask of CTCHOUT3 field.                        */


/* CTI_ITTRIGOUT: Integration Test Trigger Output register */
  #define CTI_ITTRIGOUT_ResetValue (0x00000000UL)    /*!< Reset value of ITTRIGOUT register.                                   */

/* CTTRIGOUT0 @Bit 0 : Sets the value of the ctitrigout 0 output */
  #define CTI_ITTRIGOUT_CTTRIGOUT0_Pos (0UL)         /*!< Position of CTTRIGOUT0 field.                                        */
  #define CTI_ITTRIGOUT_CTTRIGOUT0_Msk (0x1UL << CTI_ITTRIGOUT_CTTRIGOUT0_Pos) /*!< Bit mask of CTTRIGOUT0 field.              */

/* CTTRIGOUT1 @Bit 1 : Sets the value of the ctitrigout 1 output */
  #define CTI_ITTRIGOUT_CTTRIGOUT1_Pos (1UL)         /*!< Position of CTTRIGOUT1 field.                                        */
  #define CTI_ITTRIGOUT_CTTRIGOUT1_Msk (0x1UL << CTI_ITTRIGOUT_CTTRIGOUT1_Pos) /*!< Bit mask of CTTRIGOUT1 field.              */

/* CTTRIGOUT2 @Bit 2 : Sets the value of the ctitrigout 2 output */
  #define CTI_ITTRIGOUT_CTTRIGOUT2_Pos (2UL)         /*!< Position of CTTRIGOUT2 field.                                        */
  #define CTI_ITTRIGOUT_CTTRIGOUT2_Msk (0x1UL << CTI_ITTRIGOUT_CTTRIGOUT2_Pos) /*!< Bit mask of CTTRIGOUT2 field.              */

/* CTTRIGOUT3 @Bit 3 : Sets the value of the ctitrigout 3 output */
  #define CTI_ITTRIGOUT_CTTRIGOUT3_Pos (3UL)         /*!< Position of CTTRIGOUT3 field.                                        */
  #define CTI_ITTRIGOUT_CTTRIGOUT3_Msk (0x1UL << CTI_ITTRIGOUT_CTTRIGOUT3_Pos) /*!< Bit mask of CTTRIGOUT3 field.              */

/* CTTRIGOUT4 @Bit 4 : Sets the value of the ctitrigout 4 output */
  #define CTI_ITTRIGOUT_CTTRIGOUT4_Pos (4UL)         /*!< Position of CTTRIGOUT4 field.                                        */
  #define CTI_ITTRIGOUT_CTTRIGOUT4_Msk (0x1UL << CTI_ITTRIGOUT_CTTRIGOUT4_Pos) /*!< Bit mask of CTTRIGOUT4 field.              */

/* CTTRIGOUT5 @Bit 5 : Sets the value of the ctitrigout 5 output */
  #define CTI_ITTRIGOUT_CTTRIGOUT5_Pos (5UL)         /*!< Position of CTTRIGOUT5 field.                                        */
  #define CTI_ITTRIGOUT_CTTRIGOUT5_Msk (0x1UL << CTI_ITTRIGOUT_CTTRIGOUT5_Pos) /*!< Bit mask of CTTRIGOUT5 field.              */

/* CTTRIGOUT6 @Bit 6 : Sets the value of the ctitrigout 6 output */
  #define CTI_ITTRIGOUT_CTTRIGOUT6_Pos (6UL)         /*!< Position of CTTRIGOUT6 field.                                        */
  #define CTI_ITTRIGOUT_CTTRIGOUT6_Msk (0x1UL << CTI_ITTRIGOUT_CTTRIGOUT6_Pos) /*!< Bit mask of CTTRIGOUT6 field.              */

/* CTTRIGOUT7 @Bit 7 : Sets the value of the ctitrigout 7 output */
  #define CTI_ITTRIGOUT_CTTRIGOUT7_Pos (7UL)         /*!< Position of CTTRIGOUT7 field.                                        */
  #define CTI_ITTRIGOUT_CTTRIGOUT7_Msk (0x1UL << CTI_ITTRIGOUT_CTTRIGOUT7_Pos) /*!< Bit mask of CTTRIGOUT7 field.              */


