adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SET3 @Bit 3 : Determines whether claim bit 3 is implemented */
  #define CTI_CLAIMSET_SET3_Pos (3UL)                /*!< Position of SET3 field.                                              */
  #define CTI_CLAIMSET_SET3_Msk (0x1UL << CTI_CLAIMSET_SET3_Pos) /*!< Bit mask of SET3 field.                                  */
  #define CTI_CLAIMSET_SET3_Min (0x1UL)              /*!< Min enumerator value of SET3 field.                                  */
  #define CTI_CLAIMSET_SET3_Max (0x1UL)              /*!< Max enumerator value of SET3 field.                                  */
  #define CTI_CLAIMSET_SET3_Implemented (0x1UL)      /*!< Claim tag bit 3 is implemented                                       */
  #define CTI_CLAIMSET_SET3_Claim (0x1UL)            /*!< Set claim bit 3                                                      */


/* CTI_CLAIMCLR: Claim Tag Clear register */
  #define CTI_CLAIMCLR_ResetValue (0x00000000UL)     /*!< Reset value of CLAIMCLR register.                                    */

/* CLR0 @Bit 0 : Determines whether claim bit 0 is implemented */
  #define CTI_CLAIMCLR_CLR0_Pos (0UL)                /*!< Position of CLR0 field.                                              */
  #define CTI_CLAIMCLR_CLR0_Msk (0x1UL << CTI_CLAIMCLR_CLR0_Pos) /*!< Bit mask of CLR0 field.                                  */
  #define CTI_CLAIMCLR_CLR0_Min (0x0UL)              /*!< Min enumerator value of CLR0 field.                                  */
  #define CTI_CLAIMCLR_CLR0_Max (0x1UL)              /*!< Max enumerator value of CLR0 field.                                  */
  #define CTI_CLAIMCLR_CLR0_Unclaimed (0x0UL)        /*!< Claim tag bit 0 is not set                                           */
  #define CTI_CLAIMCLR_CLR0_Claimed (0x1UL)          /*!< Claim tag bit 0 is set                                               */
  #define CTI_CLAIMCLR_CLR0_Unclaim (0x1UL)          /*!< Clear bit 0 of the claim tag                                         */

/* CLR1 @Bit 1 : Determines whether claim bit 1 is implemented */
  #define CTI_CLAIMCLR_CLR1_Pos (1UL)                /*!< Position of CLR1 field.                                              */
  #define CTI_CLAIMCLR_CLR1_Msk (0x1UL << CTI_CLAIMCLR_CLR1_Pos) /*!< Bit mask of CLR1 field.                                  */
  #define CTI_CLAIMCLR_CLR1_Min (0x0UL)              /*!< Min enumerator value of CLR1 field.                                  */
  #define CTI_CLAIMCLR_CLR1_Max (0x1UL)              /*!< Max enumerator value of CLR1 field.                                  */
  #define CTI_CLAIMCLR_CLR1_Unclaimed (0x0UL)        /*!< Claim tag bit 1 is not set                                           */
  #define CTI_CLAIMCLR_CLR1_Claimed (0x1UL)          /*!< Claim tag bit 1 is set                                               */
  #define CTI_CLAIMCLR_CLR1_Unclaim (0x1UL)          /*!< Clear bit 1 of the claim tag                                         */

/* CLR2 @Bit 2 : Determines whether claim bit 2 is implemented */
  #define CTI_CLAIMCLR_CLR2_Pos (2UL)                /*!< Position of CLR2 field.                                              */
  #define CTI_CLAIMCLR_CLR2_Msk (0x1UL << CTI_CLAIMCLR_CLR2_Pos) /*!< Bit mask of CLR2 field.                                  */
  #define CTI_CLAIMCLR_CLR2_Min (0x0UL)              /*!< Min enumerator value of CLR2 field.                                  */
  #define CTI_CLAIMCLR_CLR2_Max (0x1UL)              /*!< Max enumerator value of CLR2 field.                                  */
  #define CTI_CLAIMCLR_CLR2_Unclaimed (0x0UL)        /*!< Claim tag bit 2 is not set                                           */
  #define CTI_CLAIMCLR_CLR2_Claimed (0x1UL)          /*!< Claim tag bit 2 is set                                               */
  #define CTI_CLAIMCLR_CLR2_Unclaim (0x1UL)          /*!< Clear bit 2 of the claim tag                                         */

/* CLR3 @Bit 3 : Determines whether claim bit 3 is implemented */
  #define CTI_CLAIMCLR_CLR3_Pos (3UL)                /*!< Position of CLR3 field.                                              */
  #define CTI_CLAIMCLR_CLR3_Msk (0x1UL << CTI_CLAIMCLR_CLR3_Pos) /*!< Bit mask of CLR3 field.                                  */
  #define CTI_CLAIMCLR_CLR3_Min (0x0UL)              /*!< Min enumerator value of CLR3 field.                                  */
  #define CTI_CLAIMCLR_CLR3_Max (0x1UL)              /*!< Max enumerator value of CLR3 field.                                  */
  #define CTI_CLAIMCLR_CLR3_Unclaimed (0x0UL)        /*!< Claim tag bit 3 is not set                                           */
  #define CTI_CLAIMCLR_CLR3_Claimed (0x1UL)          /*!< Claim tag bit 3 is set                                               */
  #define CTI_CLAIMCLR_CLR3_Unclaim (0x1UL)          /*!< Clear bit 3 of the claim tag                                         */


/* CTI_LAR: Lock Address Register */
  #define CTI_LAR_ResetValue (0x00000000UL)          /*!< Reset value of LAR register.                                         */

/* KEY @Bits 0..31 : Software lock key value */
  #define CTI_LAR_KEY_Pos (0UL)                      /*!< Position of KEY field.                                               */
  #define CTI_LAR_KEY_Msk (0xFFFFFFFFUL << CTI_LAR_KEY_Pos) /*!< Bit mask of KEY field.                                        */
  #define CTI_LAR_KEY_Min (0xC5ACCE55UL)             /*!< Min enumerator value of KEY field.                                   */
  #define CTI_LAR_KEY_Max (0xC5ACCE55UL)             /*!< Max enumerator value of KEY field.                                   */
  #define CTI_LAR_KEY_Clear (0xC5ACCE55UL)           /*!< Clear the software lock                                              */


/* CTI_LSR: Lock Status Register */
  #define CTI_LSR_ResetValue (0x00000003UL)          /*!< Reset value of LSR register.                                         */

/* SLI @Bit 0 : Software Lock Implemented. Indicates that a lock control mechanism is present from this interface */
  #define CTI_LSR_SLI_Pos (0UL)                      /*!< Position of SLI field.                                               */
  #define CTI_LSR_SLI_Msk (0x1UL << CTI_LSR_SLI_Pos) /*!< Bit mask of SLI field.                                               */
  #define CTI_LSR_SLI_Min (0x0UL)                    /*!< Min enumerator value of SLI field.                                   */
  #define CTI_LSR_SLI_Max (0x1UL)                    /*!< Max enumerator value of SLI field.                                   */
  #define CTI_LSR_SLI_Absent (0x0UL)                 /*!< Indicates that a lock control mechanism is not present from this
                                                          interface. Write operations to the LAR are ignored*/                    
  #define CTI_LSR_SLI_Present (0x1UL)                /*!< Indicates that a lock control mechanism present from this interface  */

/* SLK @Bit 1 : Software Lock Status. Returns the present lock status of the device, from the current interface */
  #define CTI_LSR_SLK_Pos (1UL)                      /*!< Position of SLK field.                                               */
  #define CTI_LSR_SLK_Msk (0x1UL << CTI_LSR_SLK_Pos) /*!< Bit mask of SLK field.                                               */
  #define CTI_LSR_SLK_Min (0x0UL)                    /*!< Min enumerator value of SLK field.                                   */
  #define CTI_LSR_SLK_Max (0x1UL)                    /*!< Max enumerator value of SLK field.                                   */
  #define CTI_LSR_SLK_Unlocked (0x0UL)               /*!< Indicates that write operations are permitted from this interface    */
  #define CTI_LSR_SLK_Locked (0x1UL)                 /*!< Indicates that write operations are not permitted from this interface.
                                                          Read operations are permitted*/                                         

/* NTT @Bit 2 : Register size indicator. Always 0. Indicates that the LAR is implemented as 32-bit. */
  #define CTI_LSR_NTT_Pos (2UL)                      /*!< Position of NTT field.                                               */
  #define CTI_LSR_NTT_Msk (0x1UL << CTI_LSR_NTT_Pos) /*!< Bit mask of NTT field.                                               */


/* CTI_AUTHSTATUS: Authentication Status Register */
  #define CTI_AUTHSTATUS_ResetValue (0x00000005UL)   /*!< Reset value of AUTHSTATUS register.                                  */

/* NSID @Bits 0..1 : Indicates the security level for Non-secure invasive debug */
  #define CTI_AUTHSTATUS_NSID_Pos (0UL)              /*!< Position of NSID field.                                              */
  #define CTI_AUTHSTATUS_NSID_Msk (0x3UL << CTI_AUTHSTATUS_NSID_Pos) /*!< Bit mask of NSID field.                              */
  #define CTI_AUTHSTATUS_NSID_Min (0x2UL)            /*!< Min enumerator value of NSID field.                                  */
  #define CTI_AUTHSTATUS_NSID_Max (0x3UL)            /*!< Max enumerator value of NSID field.                                  */
  #define CTI_AUTHSTATUS_NSID_Disabled (0x2UL)       /*!< Non-secure invasive debug disabled                                   */
  #define CTI_AUTHSTATUS_NSID_Enabled (0x3UL)        /*!< Non-secure invasive debug enabled                                    */

/* NSNID @Bits 2..3 : Indicates the security level for Non-secure non-invasive debug */
  #define CTI_AUTHSTATUS_NSNID_Pos (2UL)             /*!< Position of NSNID field.                                             */
  #define CTI_AUTHSTATUS_NSNID_Msk (0x3UL << CTI_AUTHSTATUS_NSNID_Pos) /*!< Bit mask of NSNID field.                           */
  #define CTI_AUTHSTATUS_NSNID_Min (0x2UL)           /*!< Min enumerator value of NSNID field.                                 */
  #define CTI_AUTHSTATUS_NSNID_Max (0x3UL)           /*!< Max enumerator value of NSNID field.                                 */
  #define CTI_AUTHSTATUS_NSNID_Disabled (0x2UL)      /*!< Non-secure non-invasive debug disabled                               */
  #define CTI_AUTHSTATUS_NSNID_Enabled (0x3UL)       /*!< Non-secure non-invasive debug enabled                                */

/* SID @Bits 4..5 : Always 0b00. Secure invasive debug is not implemented or is controlled elsewhere */
  #define CTI_AUTHSTATUS_SID_Pos (4UL)               /*!< Position of SID field.                                               */
  #define CTI_AUTHSTATUS_SID_Msk (0x3UL << CTI_AUTHSTATUS_SID_Pos) /*!< Bit mask of SID field.                                 */

/* SNID @Bits 6..7 : Always 0b00. The security level for Secure non-invasive debug is not implemented or is controlled elsewhere
                     */                                                                                                           
                                                                                                                                  
  #define CTI_AUTHSTATUS_SNID_Pos (6UL)              /*!< Position of SNID field.                                              */
  #define CTI_AUTHSTATUS_SNID_Msk (0x3UL << CTI_AUTHSTATUS_SNID_Pos) /*!< Bit mask of SNID field.                              */


/* CTI_DEVARCH: Device Architecture register */
  #define CTI_DEVARCH_ResetValue (0x47701A14UL)      /*!< Reset value of DEVARCH register.                                     */

/* Architecture @Bit 0 : Contains the CTI device architecture. */
  #define CTI_DEVARCH_Architecture_Pos (0UL)         /*!< Position of Architecture field.                                      */
  #define CTI_DEVARCH_Architecture_Msk (0x1UL << CTI_DEVARCH_Architecture_Pos) /*!< Bit mask of Architecture field.            */


/* CTI_DEVID: Device Configuration register */
  #define CTI_DEVID_ResetValue (0x00040800UL)        /*!< Reset value of DEVID register.                                       */

/* EXTMUXNUM @Bits 0..4 : Indicates the number of multiplexers available on Trigger Inputs and Trigger Outputs that are using
                          asicctl. The default value of 0b00000 indicates that no multiplexing is present. This value of this
                          bit depends on the Verilog define EXTMUXNUM that you must change accordingly. */                        
                                                                                                                                  
  #define CTI_DEVID_EXTMUXNUM_Pos (0UL)              /*!< Position of EXTMUXNUM field.                                         */
  #define CTI_DEVID_EXTMUXNUM_Msk (0x1FUL << CTI_DEVID_EXTMUXNUM_Pos) /*!< Bit mask of EXTMUXNUM field.                        */

/* NUMTRIG @Bits 8..15 : Number of ECT triggers available. */
  #define CTI_DEVID_NUMTRIG_Pos (8UL)                /*!< Position of NUMTRIG field.                                           */
  #define CTI_DEVID_NUMTRIG_Msk (0xFFUL << CTI_DEVID_NUMTRIG_Pos) /*!< Bit mask of NUMTRIG field.                              */

