adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CTRLAPPERI_MAILBOX_RXSTATUS: Status to indicate if data sent from the debugger to the CPU has been read */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_ResetValue (0x00000000UL) /*!< Reset value of RXSTATUS register.                         */

/* RXSTATUS @Bit 0 : Status of data in register RXDATA */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Pos (0UL) /*!< Position of RXSTATUS field.                                      */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Msk (0x1UL << CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Pos) /*!< Bit mask of RXSTATUS
                                                                            field.*/                                              
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Min (0x0UL) /*!< Min enumerator value of RXSTATUS field.                        */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Max (0x1UL) /*!< Max enumerator value of RXSTATUS field.                        */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_NoDataPending (0x0UL) /*!< No data pending in register RXDATA                   */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_DataPending (0x1UL) /*!< Data pending in register RXDATA                        */


/* CTRLAPPERI_MAILBOX_TXDATA: Data sent from the CPU to the debugger */
  #define CTRLAPPERI_MAILBOX_TXDATA_ResetValue (0x00000000UL) /*!< Reset value of TXDATA register.                             */

/* TXDATA @Bits 0..31 : Data sent to debugger */
  #define CTRLAPPERI_MAILBOX_TXDATA_TXDATA_Pos (0UL) /*!< Position of TXDATA field.                                            */
  #define CTRLAPPERI_MAILBOX_TXDATA_TXDATA_Msk (0xFFFFFFFFUL << CTRLAPPERI_MAILBOX_TXDATA_TXDATA_Pos) /*!< Bit mask of TXDATA
                                                                            field.*/                                              


/* CTRLAPPERI_MAILBOX_TXSTATUS: Status to indicate if data sent from the CPU to the debugger has been read */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_ResetValue (0x00000000UL) /*!< Reset value of TXSTATUS register.                         */

/* TXSTATUS @Bit 0 : Status of data in register TXDATA */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Pos (0UL) /*!< Position of TXSTATUS field.                                      */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Msk (0x1UL << CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Pos) /*!< Bit mask of TXSTATUS
                                                                            field.*/                                              
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Min (0x0UL) /*!< Min enumerator value of TXSTATUS field.                        */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Max (0x1UL) /*!< Max enumerator value of TXSTATUS field.                        */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_NoDataPending (0x0UL) /*!< No data pending in register TXDATA                   */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_DataPending (0x1UL) /*!< Data pending in register TXDATA                        */


/* CTRLAPPERI_MAILBOX_BOOTMODE: Secure domain boot mode. */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_ResetValue (0x00000000UL) /*!< Reset value of BOOTMODE register.                         */

/* MODE @Bit 0 : Mode */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Pos (0UL) /*!< Position of MODE field.                                              */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Msk (0x1UL << CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Pos) /*!< Bit mask of MODE field.    */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Min (0x0UL) /*!< Min enumerator value of MODE field.                                */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Max (0x1UL) /*!< Max enumerator value of MODE field.                                */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Normal (0x0UL) /*!< Normal mode of operation                                        */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_ROMOperation (0x1UL) /*!< ROM operation mode                                        */



/* ================================================= Struct CTRLAPPERI_INFO ================================================== */
/**
  * @brief INFO [CTRLAPPERI_INFO] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PARTNO;                            /*!< (@ 0x00000000) Part number of the device                             */
  __IOM uint32_t  HWREVISION;                        /*!< (@ 0x00000004) Hardware Revision of the device                       */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000008) The INFO registers ready status.                      */
} NRF_CTRLAPPERI_INFO_Type;                          /*!< Size = 12 (0x00C)                                                    */

/* CTRLAPPERI_INFO_PARTNO: Part number of the device */
  #define CTRLAPPERI_INFO_PARTNO_ResetValue (0x00000000UL) /*!< Reset value of PARTNO register.                                */

/* PARTNO @Bits 0..11 : Part number */
  #define CTRLAPPERI_INFO_PARTNO_PARTNO_Pos (0UL)    /*!< Position of PARTNO field.                                            */
  #define CTRLAPPERI_INFO_PARTNO_PARTNO_Msk (0xFFFUL << CTRLAPPERI_INFO_PARTNO_PARTNO_Pos) /*!< Bit mask of PARTNO field.      */


/* CTRLAPPERI_INFO_HWREVISION: Hardware Revision of the device */
  #define CTRLAPPERI_INFO_HWREVISION_ResetValue (0x00000000UL) /*!< Reset value of HWREVISION register.                        */

/* ID @Bits 0..3 : Part Variant */
  #define CTRLAPPERI_INFO_HWREVISION_ID_Pos (0UL)    /*!< Position of ID field.                                                */
  #define CTRLAPPERI_INFO_HWREVISION_ID_Msk (0xFUL << CTRLAPPERI_INFO_HWREVISION_ID_Pos) /*!< Bit mask of ID field.            */


/* CTRLAPPERI_INFO_READY: The INFO registers ready status. */
  #define CTRLAPPERI_INFO_READY_ResetValue (0x00000001UL) /*!< Reset value of READY register.                                  */

/* READY @Bit 0 : Ready status. */
  #define CTRLAPPERI_INFO_READY_READY_Pos (0UL)      /*!< Position of READY field.                                             */
  #define CTRLAPPERI_INFO_READY_READY_Msk (0x1UL << CTRLAPPERI_INFO_READY_READY_Pos) /*!< Bit mask of READY field.             */
  #define CTRLAPPERI_INFO_READY_READY_Min (0x0UL)    /*!< Min enumerator value of READY field.                                 */
  #define CTRLAPPERI_INFO_READY_READY_Max (0x1UL)    /*!< Max enumerator value of READY field.                                 */
  #define CTRLAPPERI_INFO_READY_READY_Ready (0x0UL)  /*!< Ready                                                                */
  #define CTRLAPPERI_INFO_READY_READY_NotReady (0x1UL) /*!< Not reday                                                          */


/* ==================================================== Struct CTRLAPPERI ==================================================== */
/**
  * @brief Control access port
  */
  typedef struct {                                   /*!< CTRLAPPERI Structure                                                 */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_RXREADY;                   /*!< (@ 0x00000100) The RXSTATUS is changed to DataPending                */
    __IOM uint32_t EVENTS_TXDONE;                    /*!< (@ 0x00000104) The TXSTATUS is changed to NoDataPending              */
    __IM uint32_t RESERVED1[126];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IOM NRF_CTRLAPPERI_MAILBOX_Type MAILBOX;       /*!< (@ 0x00000400) (unspecified)                                         */
    __IM uint32_t RESERVED3[29];
    __IOM NRF_CTRLAPPERI_INFO_Type INFO;             /*!< (@ 0x00000500) (unspecified)                                         */
    __IOM uint32_t BOOTSTATUS;                       /*!< (@ 0x0000050C) Boot status                                           */
  } NRF_CTRLAPPERI_Type;                             /*!< Size = 1296 (0x510)                                                  */

/* CTRLAPPERI_EVENTS_RXREADY: The RXSTATUS is changed to DataPending */
  #define CTRLAPPERI_EVENTS_RXREADY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXREADY register.                     */

