adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CTRLAPPERI_INTENCLR: Disable interrupt */
  #define CTRLAPPERI_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                 */

/* RXREADY @Bit 0 : Write '1' to disable interrupt for event RXREADY */
  #define CTRLAPPERI_INTENCLR_RXREADY_Pos (0UL)      /*!< Position of RXREADY field.                                           */
  #define CTRLAPPERI_INTENCLR_RXREADY_Msk (0x1UL << CTRLAPPERI_INTENCLR_RXREADY_Pos) /*!< Bit mask of RXREADY field.           */
  #define CTRLAPPERI_INTENCLR_RXREADY_Min (0x0UL)    /*!< Min enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTENCLR_RXREADY_Max (0x1UL)    /*!< Max enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTENCLR_RXREADY_Clear (0x1UL)  /*!< Disable                                                              */
  #define CTRLAPPERI_INTENCLR_RXREADY_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define CTRLAPPERI_INTENCLR_RXREADY_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* TXDONE @Bit 1 : Write '1' to disable interrupt for event TXDONE */
  #define CTRLAPPERI_INTENCLR_TXDONE_Pos (1UL)       /*!< Position of TXDONE field.                                            */
  #define CTRLAPPERI_INTENCLR_TXDONE_Msk (0x1UL << CTRLAPPERI_INTENCLR_TXDONE_Pos) /*!< Bit mask of TXDONE field.              */
  #define CTRLAPPERI_INTENCLR_TXDONE_Min (0x0UL)     /*!< Min enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTENCLR_TXDONE_Max (0x1UL)     /*!< Max enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTENCLR_TXDONE_Clear (0x1UL)   /*!< Disable                                                              */
  #define CTRLAPPERI_INTENCLR_TXDONE_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define CTRLAPPERI_INTENCLR_TXDONE_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* CTRLAPPERI_INTPEND: Pending interrupts */
  #define CTRLAPPERI_INTPEND_ResetValue (0x00000000UL) /*!< Reset value of INTPEND register.                                   */

/* RXREADY @Bit 0 : Read pending status of interrupt for event RXREADY */
  #define CTRLAPPERI_INTPEND_RXREADY_Pos (0UL)       /*!< Position of RXREADY field.                                           */
  #define CTRLAPPERI_INTPEND_RXREADY_Msk (0x1UL << CTRLAPPERI_INTPEND_RXREADY_Pos) /*!< Bit mask of RXREADY field.             */
  #define CTRLAPPERI_INTPEND_RXREADY_Min (0x0UL)     /*!< Min enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTPEND_RXREADY_Max (0x1UL)     /*!< Max enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTPEND_RXREADY_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define CTRLAPPERI_INTPEND_RXREADY_Pending (0x1UL) /*!< Read: Pending                                                        */

/* TXDONE @Bit 1 : Read pending status of interrupt for event TXDONE */
  #define CTRLAPPERI_INTPEND_TXDONE_Pos (1UL)        /*!< Position of TXDONE field.                                            */
  #define CTRLAPPERI_INTPEND_TXDONE_Msk (0x1UL << CTRLAPPERI_INTPEND_TXDONE_Pos) /*!< Bit mask of TXDONE field.                */
  #define CTRLAPPERI_INTPEND_TXDONE_Min (0x0UL)      /*!< Min enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTPEND_TXDONE_Max (0x1UL)      /*!< Max enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTPEND_TXDONE_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define CTRLAPPERI_INTPEND_TXDONE_Pending (0x1UL)  /*!< Read: Pending                                                        */


/* CTRLAPPERI_BOOTSTATUS: Boot status */
  #define CTRLAPPERI_BOOTSTATUS_ResetValue (0x00000000UL) /*!< Reset value of BOOTSTATUS register.                             */

/* VAL @Bits 0..31 : Value */
  #define CTRLAPPERI_BOOTSTATUS_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define CTRLAPPERI_BOOTSTATUS_VAL_Msk (0xFFFFFFFFUL << CTRLAPPERI_BOOTSTATUS_VAL_Pos) /*!< Bit mask of VAL field.            */
  #define CTRLAPPERI_BOOTSTATUS_VAL_Min (0x0UL)      /*!< Min value of VAL field.                                              */
  #define CTRLAPPERI_BOOTSTATUS_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                             */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        DCACHEDATA                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================== Struct DCACHEDATA_SET_WAY_DU =============================================== */
/**
  * @brief DU [DCACHEDATA_SET_WAY_DU] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DATA[1];                           /*!< (@ 0x00000000) Cache data bits for DATA[q] in DU[p] (DataUnit) of
                                                                         SET[n], WAY[o].*/                                        
} NRF_DCACHEDATA_SET_WAY_DU_Type;                    /*!< Size = 4 (0x004)                                                     */
  #define DCACHEDATA_SET_WAY_DU_MaxCount (8UL)       /*!< Max size of DU[8] array.                                             */

/* DCACHEDATA_SET_WAY_DU_DATA: Cache data bits for DATA[q] in DU[p] (DataUnit) of SET[n], WAY[o]. */
  #define DCACHEDATA_SET_WAY_DU_DATA_MaxCount (1UL)  /*!< Max size of DATA[1] array.                                           */
  #define DCACHEDATA_SET_WAY_DU_DATA_ResetValue (0x00000000UL) /*!< Reset value of DATA[1] register.                           */

/* Data @Bits 0..31 : Data */
  #define DCACHEDATA_SET_WAY_DU_DATA_Data_Pos (0UL)  /*!< Position of Data field.                                              */
  #define DCACHEDATA_SET_WAY_DU_DATA_Data_Msk (0xFFFFFFFFUL << DCACHEDATA_SET_WAY_DU_DATA_Data_Pos) /*!< Bit mask of Data
                                                                            field.*/                                              



/* ================================================ Struct DCACHEDATA_SET_WAY ================================================ */
/**
  * @brief WAY [DCACHEDATA_SET_WAY] (unspecified)
  */
typedef struct {
  __IOM NRF_DCACHEDATA_SET_WAY_DU_Type DU[8];        /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_DCACHEDATA_SET_WAY_Type;                       /*!< Size = 32 (0x020)                                                    */
  #define DCACHEDATA_SET_WAY_MaxCount (2UL)          /*!< Max size of WAY[2] array.                                            */


/* ================================================== Struct DCACHEDATA_SET ================================================== */
/**
  * @brief SET [DCACHEDATA_SET] (unspecified)
  */
typedef struct {
  __IOM NRF_DCACHEDATA_SET_WAY_Type WAY[2];          /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_DCACHEDATA_SET_Type;                           /*!< Size = 64 (0x040)                                                    */
  #define DCACHEDATA_SET_MaxCount (256UL)            /*!< Max size of SET[256] array.                                          */

/* ==================================================== Struct DCACHEDATA ==================================================== */
/**
  * @brief CACHEDATA
  */
  typedef struct {                                   /*!< DCACHEDATA Structure                                                 */
    __IOM NRF_DCACHEDATA_SET_Type SET[256];          /*!< (@ 0x00000000) (unspecified)                                         */
  } NRF_DCACHEDATA_Type;                             /*!< Size = 16384 (0x4000)                                                */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        DCACHEINFO                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct DCACHEINFO_SET_WAY ================================================ */
/**
  * @brief WAY [DCACHEINFO_SET_WAY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INFO;                              /*!< (@ 0x00000000) Cache information for SET[n], WAY[o].                 */
  __IOM uint32_t  INFOEXT;                           /*!< (@ 0x00000004) Extended cache information for SET[n], WAY[o].        */
} NRF_DCACHEINFO_SET_WAY_Type;                       /*!< Size = 8 (0x008)                                                     */
