adamkondraciuk/nrfx/mdk/nrf7140_types.h
  #define DCACHEINFO_SET_WAY_MaxCount (2UL)          /*!< Max size of WAY[2] array.                                            */

/* DCACHEINFO_SET_WAY_INFO: Cache information for SET[n], WAY[o]. */
  #define DCACHEINFO_SET_WAY_INFO_ResetValue (0x00000000UL) /*!< Reset value of INFO register.                                 */

/* TAG @Bits 0..19 : Cache tag. */
  #define DCACHEINFO_SET_WAY_INFO_TAG_Pos (0UL)      /*!< Position of TAG field.                                               */
  #define DCACHEINFO_SET_WAY_INFO_TAG_Msk (0xFFFFFUL << DCACHEINFO_SET_WAY_INFO_TAG_Pos) /*!< Bit mask of TAG field.           */

/* DUV0 @Bit 24 : Data unit valid info. */
  #define DCACHEINFO_SET_WAY_INFO_DUV0_Pos (24UL)    /*!< Position of DUV0 field.                                              */
  #define DCACHEINFO_SET_WAY_INFO_DUV0_Msk (0x1UL << DCACHEINFO_SET_WAY_INFO_DUV0_Pos) /*!< Bit mask of DUV0 field.            */
  #define DCACHEINFO_SET_WAY_INFO_DUV0_Min (0x0UL)   /*!< Min enumerator value of DUV0 field.                                  */
  #define DCACHEINFO_SET_WAY_INFO_DUV0_Max (0x1UL)   /*!< Max enumerator value of DUV0 field.                                  */
  #define DCACHEINFO_SET_WAY_INFO_DUV0_Invalid (0x0UL) /*!< Invalid data unit                                                  */
  #define DCACHEINFO_SET_WAY_INFO_DUV0_Valid (0x1UL) /*!< Valid data unit                                                      */

/* DUV1 @Bit 25 : Data unit valid info. */
  #define DCACHEINFO_SET_WAY_INFO_DUV1_Pos (25UL)    /*!< Position of DUV1 field.                                              */
  #define DCACHEINFO_SET_WAY_INFO_DUV1_Msk (0x1UL << DCACHEINFO_SET_WAY_INFO_DUV1_Pos) /*!< Bit mask of DUV1 field.            */
  #define DCACHEINFO_SET_WAY_INFO_DUV1_Min (0x0UL)   /*!< Min enumerator value of DUV1 field.                                  */
  #define DCACHEINFO_SET_WAY_INFO_DUV1_Max (0x1UL)   /*!< Max enumerator value of DUV1 field.                                  */
  #define DCACHEINFO_SET_WAY_INFO_DUV1_Invalid (0x0UL) /*!< Invalid data unit                                                  */
  #define DCACHEINFO_SET_WAY_INFO_DUV1_Valid (0x1UL) /*!< Valid data unit                                                      */

/* DUV2 @Bit 26 : Data unit valid info. */
  #define DCACHEINFO_SET_WAY_INFO_DUV2_Pos (26UL)    /*!< Position of DUV2 field.                                              */
  #define DCACHEINFO_SET_WAY_INFO_DUV2_Msk (0x1UL << DCACHEINFO_SET_WAY_INFO_DUV2_Pos) /*!< Bit mask of DUV2 field.            */
  #define DCACHEINFO_SET_WAY_INFO_DUV2_Min (0x0UL)   /*!< Min enumerator value of DUV2 field.                                  */
  #define DCACHEINFO_SET_WAY_INFO_DUV2_Max (0x1UL)   /*!< Max enumerator value of DUV2 field.                                  */
  #define DCACHEINFO_SET_WAY_INFO_DUV2_Invalid (0x0UL) /*!< Invalid data unit                                                  */
  #define DCACHEINFO_SET_WAY_INFO_DUV2_Valid (0x1UL) /*!< Valid data unit                                                      */

/* DUV3 @Bit 27 : Data unit valid info. */
  #define DCACHEINFO_SET_WAY_INFO_DUV3_Pos (27UL)    /*!< Position of DUV3 field.                                              */
  #define DCACHEINFO_SET_WAY_INFO_DUV3_Msk (0x1UL << DCACHEINFO_SET_WAY_INFO_DUV3_Pos) /*!< Bit mask of DUV3 field.            */
  #define DCACHEINFO_SET_WAY_INFO_DUV3_Min (0x0UL)   /*!< Min enumerator value of DUV3 field.                                  */
  #define DCACHEINFO_SET_WAY_INFO_DUV3_Max (0x1UL)   /*!< Max enumerator value of DUV3 field.                                  */
  #define DCACHEINFO_SET_WAY_INFO_DUV3_Invalid (0x0UL) /*!< Invalid data unit                                                  */
  #define DCACHEINFO_SET_WAY_INFO_DUV3_Valid (0x1UL) /*!< Valid data unit                                                      */

/* V @Bit 30 : Line valid bit. */
  #define DCACHEINFO_SET_WAY_INFO_V_Pos (30UL)       /*!< Position of V field.                                                 */
  #define DCACHEINFO_SET_WAY_INFO_V_Msk (0x1UL << DCACHEINFO_SET_WAY_INFO_V_Pos) /*!< Bit mask of V field.                     */
  #define DCACHEINFO_SET_WAY_INFO_V_Min (0x0UL)      /*!< Min enumerator value of V field.                                     */
  #define DCACHEINFO_SET_WAY_INFO_V_Max (0x1UL)      /*!< Max enumerator value of V field.                                     */
  #define DCACHEINFO_SET_WAY_INFO_V_Invalid (0x0UL)  /*!< Invalid cache line                                                   */
  #define DCACHEINFO_SET_WAY_INFO_V_Valid (0x1UL)    /*!< Valid cache line                                                     */

/* MRU @Bit 31 : Most recently used way. */
  #define DCACHEINFO_SET_WAY_INFO_MRU_Pos (31UL)     /*!< Position of MRU field.                                               */
  #define DCACHEINFO_SET_WAY_INFO_MRU_Msk (0x1UL << DCACHEINFO_SET_WAY_INFO_MRU_Pos) /*!< Bit mask of MRU field.               */
  #define DCACHEINFO_SET_WAY_INFO_MRU_Min (0x0UL)    /*!< Min enumerator value of MRU field.                                   */
  #define DCACHEINFO_SET_WAY_INFO_MRU_Max (0x1UL)    /*!< Max enumerator value of MRU field.                                   */
  #define DCACHEINFO_SET_WAY_INFO_MRU_Way0 (0x0UL)   /*!< Way0 was most recently used                                          */
  #define DCACHEINFO_SET_WAY_INFO_MRU_Way1 (0x1UL)   /*!< Way1 was most recently used                                          */


/* DCACHEINFO_SET_WAY_INFOEXT: Extended cache information for SET[n], WAY[o]. */
  #define DCACHEINFO_SET_WAY_INFOEXT_ResetValue (0x00000000UL) /*!< Reset value of INFOEXT register.                           */

/* D0 @Bit 16 : Dirty status. */
  #define DCACHEINFO_SET_WAY_INFOEXT_D0_Pos (16UL)   /*!< Position of D0 field.                                                */
  #define DCACHEINFO_SET_WAY_INFOEXT_D0_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_D0_Pos) /*!< Bit mask of D0 field.            */
  #define DCACHEINFO_SET_WAY_INFOEXT_D0_Min (0x0UL)  /*!< Min enumerator value of D0 field.                                    */
  #define DCACHEINFO_SET_WAY_INFOEXT_D0_Max (0x1UL)  /*!< Max enumerator value of D0 field.                                    */
  #define DCACHEINFO_SET_WAY_INFOEXT_D0_Clean (0x0UL) /*!< Clean data unit                                                     */
  #define DCACHEINFO_SET_WAY_INFOEXT_D0_Dirty (0x1UL) /*!< Dirty data unit                                                     */

