adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* D1 @Bit 17 : Dirty status. */
  #define DCACHEINFO_SET_WAY_INFOEXT_D1_Pos (17UL)   /*!< Position of D1 field.                                                */
  #define DCACHEINFO_SET_WAY_INFOEXT_D1_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_D1_Pos) /*!< Bit mask of D1 field.            */
  #define DCACHEINFO_SET_WAY_INFOEXT_D1_Min (0x0UL)  /*!< Min enumerator value of D1 field.                                    */
  #define DCACHEINFO_SET_WAY_INFOEXT_D1_Max (0x1UL)  /*!< Max enumerator value of D1 field.                                    */
  #define DCACHEINFO_SET_WAY_INFOEXT_D1_Clean (0x0UL) /*!< Clean data unit                                                     */
  #define DCACHEINFO_SET_WAY_INFOEXT_D1_Dirty (0x1UL) /*!< Dirty data unit                                                     */

/* D2 @Bit 18 : Dirty status. */
  #define DCACHEINFO_SET_WAY_INFOEXT_D2_Pos (18UL)   /*!< Position of D2 field.                                                */
  #define DCACHEINFO_SET_WAY_INFOEXT_D2_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_D2_Pos) /*!< Bit mask of D2 field.            */
  #define DCACHEINFO_SET_WAY_INFOEXT_D2_Min (0x0UL)  /*!< Min enumerator value of D2 field.                                    */
  #define DCACHEINFO_SET_WAY_INFOEXT_D2_Max (0x1UL)  /*!< Max enumerator value of D2 field.                                    */
  #define DCACHEINFO_SET_WAY_INFOEXT_D2_Clean (0x0UL) /*!< Clean data unit                                                     */
  #define DCACHEINFO_SET_WAY_INFOEXT_D2_Dirty (0x1UL) /*!< Dirty data unit                                                     */

/* D3 @Bit 19 : Dirty status. */
  #define DCACHEINFO_SET_WAY_INFOEXT_D3_Pos (19UL)   /*!< Position of D3 field.                                                */
  #define DCACHEINFO_SET_WAY_INFOEXT_D3_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_D3_Pos) /*!< Bit mask of D3 field.            */
  #define DCACHEINFO_SET_WAY_INFOEXT_D3_Min (0x0UL)  /*!< Min enumerator value of D3 field.                                    */
  #define DCACHEINFO_SET_WAY_INFOEXT_D3_Max (0x1UL)  /*!< Max enumerator value of D3 field.                                    */
  #define DCACHEINFO_SET_WAY_INFOEXT_D3_Clean (0x0UL) /*!< Clean data unit                                                     */
  #define DCACHEINFO_SET_WAY_INFOEXT_D3_Dirty (0x1UL) /*!< Dirty data unit                                                     */

/* D4 @Bit 20 : Dirty status. */
  #define DCACHEINFO_SET_WAY_INFOEXT_D4_Pos (20UL)   /*!< Position of D4 field.                                                */
  #define DCACHEINFO_SET_WAY_INFOEXT_D4_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_D4_Pos) /*!< Bit mask of D4 field.            */
  #define DCACHEINFO_SET_WAY_INFOEXT_D4_Min (0x0UL)  /*!< Min enumerator value of D4 field.                                    */
  #define DCACHEINFO_SET_WAY_INFOEXT_D4_Max (0x1UL)  /*!< Max enumerator value of D4 field.                                    */
  #define DCACHEINFO_SET_WAY_INFOEXT_D4_Clean (0x0UL) /*!< Clean data unit                                                     */
  #define DCACHEINFO_SET_WAY_INFOEXT_D4_Dirty (0x1UL) /*!< Dirty data unit                                                     */

/* D5 @Bit 21 : Dirty status. */
  #define DCACHEINFO_SET_WAY_INFOEXT_D5_Pos (21UL)   /*!< Position of D5 field.                                                */
  #define DCACHEINFO_SET_WAY_INFOEXT_D5_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_D5_Pos) /*!< Bit mask of D5 field.            */
  #define DCACHEINFO_SET_WAY_INFOEXT_D5_Min (0x0UL)  /*!< Min enumerator value of D5 field.                                    */
  #define DCACHEINFO_SET_WAY_INFOEXT_D5_Max (0x1UL)  /*!< Max enumerator value of D5 field.                                    */
  #define DCACHEINFO_SET_WAY_INFOEXT_D5_Clean (0x0UL) /*!< Clean data unit                                                     */
  #define DCACHEINFO_SET_WAY_INFOEXT_D5_Dirty (0x1UL) /*!< Dirty data unit                                                     */

/* D6 @Bit 22 : Dirty status. */
  #define DCACHEINFO_SET_WAY_INFOEXT_D6_Pos (22UL)   /*!< Position of D6 field.                                                */
  #define DCACHEINFO_SET_WAY_INFOEXT_D6_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_D6_Pos) /*!< Bit mask of D6 field.            */
  #define DCACHEINFO_SET_WAY_INFOEXT_D6_Min (0x0UL)  /*!< Min enumerator value of D6 field.                                    */
  #define DCACHEINFO_SET_WAY_INFOEXT_D6_Max (0x1UL)  /*!< Max enumerator value of D6 field.                                    */
  #define DCACHEINFO_SET_WAY_INFOEXT_D6_Clean (0x0UL) /*!< Clean data unit                                                     */
  #define DCACHEINFO_SET_WAY_INFOEXT_D6_Dirty (0x1UL) /*!< Dirty data unit                                                     */

/* D7 @Bit 23 : Dirty status. */
  #define DCACHEINFO_SET_WAY_INFOEXT_D7_Pos (23UL)   /*!< Position of D7 field.                                                */
  #define DCACHEINFO_SET_WAY_INFOEXT_D7_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_D7_Pos) /*!< Bit mask of D7 field.            */
  #define DCACHEINFO_SET_WAY_INFOEXT_D7_Min (0x0UL)  /*!< Min enumerator value of D7 field.                                    */
  #define DCACHEINFO_SET_WAY_INFOEXT_D7_Max (0x1UL)  /*!< Max enumerator value of D7 field.                                    */
  #define DCACHEINFO_SET_WAY_INFOEXT_D7_Clean (0x0UL) /*!< Clean data unit                                                     */
  #define DCACHEINFO_SET_WAY_INFOEXT_D7_Dirty (0x1UL) /*!< Dirty data unit                                                     */

/* DUVEXT0 @Bit 24 : Extended data unit valid info. */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT0_Pos (24UL) /*!< Position of DUVEXT0 field.                                        */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT0_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_DUVEXT0_Pos) /*!< Bit mask of DUVEXT0
                                                                            field.*/                                              
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT0_Min (0x0UL) /*!< Min enumerator value of DUVEXT0 field.                           */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT0_Max (0x1UL) /*!< Max enumerator value of DUVEXT0 field.                           */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT0_Invalid (0x0UL) /*!< Invalid data unit                                            */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT0_Valid (0x1UL) /*!< Valid data unit                                                */

/* DUVEXT1 @Bit 25 : Extended data unit valid info. */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT1_Pos (25UL) /*!< Position of DUVEXT1 field.                                        */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT1_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_DUVEXT1_Pos) /*!< Bit mask of DUVEXT1
                                                                            field.*/                                              
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT1_Min (0x0UL) /*!< Min enumerator value of DUVEXT1 field.                           */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT1_Max (0x1UL) /*!< Max enumerator value of DUVEXT1 field.                           */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT1_Invalid (0x0UL) /*!< Invalid data unit                                            */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT1_Valid (0x1UL) /*!< Valid data unit                                                */

