adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DUVEXT2 @Bit 26 : Extended data unit valid info. */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Pos (26UL) /*!< Position of DUVEXT2 field.                                        */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Pos) /*!< Bit mask of DUVEXT2
                                                                            field.*/                                              
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Min (0x0UL) /*!< Min enumerator value of DUVEXT2 field.                           */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Max (0x1UL) /*!< Max enumerator value of DUVEXT2 field.                           */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Invalid (0x0UL) /*!< Invalid data unit                                            */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Valid (0x1UL) /*!< Valid data unit                                                */

/* DUVEXT3 @Bit 27 : Extended data unit valid info. */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Pos (27UL) /*!< Position of DUVEXT3 field.                                        */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Pos) /*!< Bit mask of DUVEXT3
                                                                            field.*/                                              
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Min (0x0UL) /*!< Min enumerator value of DUVEXT3 field.                           */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Max (0x1UL) /*!< Max enumerator value of DUVEXT3 field.                           */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Invalid (0x0UL) /*!< Invalid data unit                                            */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Valid (0x1UL) /*!< Valid data unit                                                */



/* ================================================== Struct DCACHEINFO_SET ================================================== */
/**
  * @brief SET [DCACHEINFO_SET] (unspecified)
  */
typedef struct {
  __IOM NRF_DCACHEINFO_SET_WAY_Type WAY[2];          /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_DCACHEINFO_SET_Type;                           /*!< Size = 16 (0x010)                                                    */
  #define DCACHEINFO_SET_MaxCount (256UL)            /*!< Max size of SET[256] array.                                          */

/* ==================================================== Struct DCACHEINFO ==================================================== */
/**
  * @brief CACHEINFO
  */
  typedef struct {                                   /*!< DCACHEINFO Structure                                                 */
    __IOM NRF_DCACHEINFO_SET_Type SET[256];          /*!< (@ 0x00000000) (unspecified)                                         */
  } NRF_DCACHEINFO_Type;                             /*!< Size = 4096 (0x1000)                                                 */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           DPPIC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct DPPIC_TASKS_CHG ================================================== */
/**
  * @brief TASKS_CHG [DPPIC_TASKS_CHG] Channel group tasks
  */
typedef struct {
  __OM  uint32_t  EN;                                /*!< (@ 0x00000000) Enable channel group n                                */
  __OM  uint32_t  DIS;                               /*!< (@ 0x00000004) Disable channel group n                               */
} NRF_DPPIC_TASKS_CHG_Type;                          /*!< Size = 8 (0x008)                                                     */
  #define DPPIC_TASKS_CHG_MaxCount (4UL)             /*!< Max size of TASKS_CHG[4] array.                                      */

/* DPPIC_TASKS_CHG_EN: Enable channel group n */
  #define DPPIC_TASKS_CHG_EN_ResetValue (0x00000000UL) /*!< Reset value of EN register.                                        */

/* EN @Bit 0 : Enable channel group n */
  #define DPPIC_TASKS_CHG_EN_EN_Pos (0UL)            /*!< Position of EN field.                                                */
  #define DPPIC_TASKS_CHG_EN_EN_Msk (0x1UL << DPPIC_TASKS_CHG_EN_EN_Pos) /*!< Bit mask of EN field.                            */
  #define DPPIC_TASKS_CHG_EN_EN_Min (0x1UL)          /*!< Min enumerator value of EN field.                                    */
  #define DPPIC_TASKS_CHG_EN_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define DPPIC_TASKS_CHG_EN_EN_Trigger (0x1UL)      /*!< Trigger task                                                         */


/* DPPIC_TASKS_CHG_DIS: Disable channel group n */
  #define DPPIC_TASKS_CHG_DIS_ResetValue (0x00000000UL) /*!< Reset value of DIS register.                                      */

/* DIS @Bit 0 : Disable channel group n */
  #define DPPIC_TASKS_CHG_DIS_DIS_Pos (0UL)          /*!< Position of DIS field.                                               */
  #define DPPIC_TASKS_CHG_DIS_DIS_Msk (0x1UL << DPPIC_TASKS_CHG_DIS_DIS_Pos) /*!< Bit mask of DIS field.                       */
  #define DPPIC_TASKS_CHG_DIS_DIS_Min (0x1UL)        /*!< Min enumerator value of DIS field.                                   */
  #define DPPIC_TASKS_CHG_DIS_DIS_Max (0x1UL)        /*!< Max enumerator value of DIS field.                                   */
  #define DPPIC_TASKS_CHG_DIS_DIS_Trigger (0x1UL)    /*!< Trigger task                                                         */



