adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CH6 @Bit 6 : Channel 6 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH6_Pos (6UL)                /*!< Position of CH6 field.                                               */
  #define DPPIC_CHENSET_CH6_Msk (0x1UL << DPPIC_CHENSET_CH6_Pos) /*!< Bit mask of CH6 field.                                   */
  #define DPPIC_CHENSET_CH6_Min (0x0UL)              /*!< Min enumerator value of CH6 field.                                   */
  #define DPPIC_CHENSET_CH6_Max (0x1UL)              /*!< Max enumerator value of CH6 field.                                   */
  #define DPPIC_CHENSET_CH6_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH6_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH6_Set (0x1UL)              /*!< Write: Enable channel                                                */

/* CH7 @Bit 7 : Channel 7 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH7_Pos (7UL)                /*!< Position of CH7 field.                                               */
  #define DPPIC_CHENSET_CH7_Msk (0x1UL << DPPIC_CHENSET_CH7_Pos) /*!< Bit mask of CH7 field.                                   */
  #define DPPIC_CHENSET_CH7_Min (0x0UL)              /*!< Min enumerator value of CH7 field.                                   */
  #define DPPIC_CHENSET_CH7_Max (0x1UL)              /*!< Max enumerator value of CH7 field.                                   */
  #define DPPIC_CHENSET_CH7_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH7_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH7_Set (0x1UL)              /*!< Write: Enable channel                                                */

/* CH8 @Bit 8 : Channel 8 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH8_Pos (8UL)                /*!< Position of CH8 field.                                               */
  #define DPPIC_CHENSET_CH8_Msk (0x1UL << DPPIC_CHENSET_CH8_Pos) /*!< Bit mask of CH8 field.                                   */
  #define DPPIC_CHENSET_CH8_Min (0x0UL)              /*!< Min enumerator value of CH8 field.                                   */
  #define DPPIC_CHENSET_CH8_Max (0x1UL)              /*!< Max enumerator value of CH8 field.                                   */
  #define DPPIC_CHENSET_CH8_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH8_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH8_Set (0x1UL)              /*!< Write: Enable channel                                                */

/* CH9 @Bit 9 : Channel 9 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH9_Pos (9UL)                /*!< Position of CH9 field.                                               */
  #define DPPIC_CHENSET_CH9_Msk (0x1UL << DPPIC_CHENSET_CH9_Pos) /*!< Bit mask of CH9 field.                                   */
  #define DPPIC_CHENSET_CH9_Min (0x0UL)              /*!< Min enumerator value of CH9 field.                                   */
  #define DPPIC_CHENSET_CH9_Max (0x1UL)              /*!< Max enumerator value of CH9 field.                                   */
  #define DPPIC_CHENSET_CH9_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH9_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH9_Set (0x1UL)              /*!< Write: Enable channel                                                */

/* CH10 @Bit 10 : Channel 10 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH10_Pos (10UL)              /*!< Position of CH10 field.                                              */
  #define DPPIC_CHENSET_CH10_Msk (0x1UL << DPPIC_CHENSET_CH10_Pos) /*!< Bit mask of CH10 field.                                */
  #define DPPIC_CHENSET_CH10_Min (0x0UL)             /*!< Min enumerator value of CH10 field.                                  */
  #define DPPIC_CHENSET_CH10_Max (0x1UL)             /*!< Max enumerator value of CH10 field.                                  */
  #define DPPIC_CHENSET_CH10_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH10_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH10_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH11 @Bit 11 : Channel 11 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH11_Pos (11UL)              /*!< Position of CH11 field.                                              */
  #define DPPIC_CHENSET_CH11_Msk (0x1UL << DPPIC_CHENSET_CH11_Pos) /*!< Bit mask of CH11 field.                                */
  #define DPPIC_CHENSET_CH11_Min (0x0UL)             /*!< Min enumerator value of CH11 field.                                  */
  #define DPPIC_CHENSET_CH11_Max (0x1UL)             /*!< Max enumerator value of CH11 field.                                  */
  #define DPPIC_CHENSET_CH11_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH11_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH11_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH12 @Bit 12 : Channel 12 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH12_Pos (12UL)              /*!< Position of CH12 field.                                              */
  #define DPPIC_CHENSET_CH12_Msk (0x1UL << DPPIC_CHENSET_CH12_Pos) /*!< Bit mask of CH12 field.                                */
  #define DPPIC_CHENSET_CH12_Min (0x0UL)             /*!< Min enumerator value of CH12 field.                                  */
  #define DPPIC_CHENSET_CH12_Max (0x1UL)             /*!< Max enumerator value of CH12 field.                                  */
  #define DPPIC_CHENSET_CH12_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH12_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH12_Set (0x1UL)             /*!< Write: Enable channel                                                */

