adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CH20 @Bit 20 : Include or exclude channel 20 */
  #define DPPIC_CHG_CH20_Pos (20UL)                  /*!< Position of CH20 field.                                              */
  #define DPPIC_CHG_CH20_Msk (0x1UL << DPPIC_CHG_CH20_Pos) /*!< Bit mask of CH20 field.                                        */
  #define DPPIC_CHG_CH20_Min (0x0UL)                 /*!< Min enumerator value of CH20 field.                                  */
  #define DPPIC_CHG_CH20_Max (0x1UL)                 /*!< Max enumerator value of CH20 field.                                  */
  #define DPPIC_CHG_CH20_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH20_Included (0x1UL)            /*!< Include                                                              */

/* CH21 @Bit 21 : Include or exclude channel 21 */
  #define DPPIC_CHG_CH21_Pos (21UL)                  /*!< Position of CH21 field.                                              */
  #define DPPIC_CHG_CH21_Msk (0x1UL << DPPIC_CHG_CH21_Pos) /*!< Bit mask of CH21 field.                                        */
  #define DPPIC_CHG_CH21_Min (0x0UL)                 /*!< Min enumerator value of CH21 field.                                  */
  #define DPPIC_CHG_CH21_Max (0x1UL)                 /*!< Max enumerator value of CH21 field.                                  */
  #define DPPIC_CHG_CH21_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH21_Included (0x1UL)            /*!< Include                                                              */

/* CH22 @Bit 22 : Include or exclude channel 22 */
  #define DPPIC_CHG_CH22_Pos (22UL)                  /*!< Position of CH22 field.                                              */
  #define DPPIC_CHG_CH22_Msk (0x1UL << DPPIC_CHG_CH22_Pos) /*!< Bit mask of CH22 field.                                        */
  #define DPPIC_CHG_CH22_Min (0x0UL)                 /*!< Min enumerator value of CH22 field.                                  */
  #define DPPIC_CHG_CH22_Max (0x1UL)                 /*!< Max enumerator value of CH22 field.                                  */
  #define DPPIC_CHG_CH22_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH22_Included (0x1UL)            /*!< Include                                                              */

/* CH23 @Bit 23 : Include or exclude channel 23 */
  #define DPPIC_CHG_CH23_Pos (23UL)                  /*!< Position of CH23 field.                                              */
  #define DPPIC_CHG_CH23_Msk (0x1UL << DPPIC_CHG_CH23_Pos) /*!< Bit mask of CH23 field.                                        */
  #define DPPIC_CHG_CH23_Min (0x0UL)                 /*!< Min enumerator value of CH23 field.                                  */
  #define DPPIC_CHG_CH23_Max (0x1UL)                 /*!< Max enumerator value of CH23 field.                                  */
  #define DPPIC_CHG_CH23_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH23_Included (0x1UL)            /*!< Include                                                              */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         EASYVDMA                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =============================================== Struct EASYVDMA_EVENTS_DONE =============================================== */
/**
  * @brief EVENTS_DONE [EASYVDMA_EVENTS_DONE] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  LIST;                              /*!< (@ 0x00000000) Descriptor list is complete.                          */
  __IOM uint32_t  LISTPART;                          /*!< (@ 0x00000004) Descriptor list is partially complete. Threshold in
                                                                         CONFIG.LISTPARTTHRESH register has been passed.*/        
  __IOM uint32_t  SELECTJOB;                         /*!< (@ 0x00000008) Selected job is completed. Selection is done via
                                                                         CONFIG.SELECTJOBENABLE.*/                                
  __IOM uint32_t  DATA;                              /*!< (@ 0x0000000C) A job has been completed, i.e. the job's data has been
                                                                         completely transferred either to AXI or DMA bus,
                                                                         depending on direction.*/                                
  __IOM uint32_t  JOB;                               /*!< (@ 0x00000010) A job has been fetched from the joblist.              */
} NRF_EASYVDMA_EVENTS_DONE_Type;                     /*!< Size = 20 (0x014)                                                    */

/* EASYVDMA_EVENTS_DONE_LIST: Descriptor list is complete. */
  #define EASYVDMA_EVENTS_DONE_LIST_ResetValue (0x00000000UL) /*!< Reset value of LIST register.                               */

/* LIST @Bit 0 : Descriptor list is complete. */
  #define EASYVDMA_EVENTS_DONE_LIST_LIST_Pos (0UL)   /*!< Position of LIST field.                                              */
  #define EASYVDMA_EVENTS_DONE_LIST_LIST_Msk (0x1UL << EASYVDMA_EVENTS_DONE_LIST_LIST_Pos) /*!< Bit mask of LIST field.        */
  #define EASYVDMA_EVENTS_DONE_LIST_LIST_Min (0x0UL) /*!< Min enumerator value of LIST field.                                  */
  #define EASYVDMA_EVENTS_DONE_LIST_LIST_Max (0x1UL) /*!< Max enumerator value of LIST field.                                  */
  #define EASYVDMA_EVENTS_DONE_LIST_LIST_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define EASYVDMA_EVENTS_DONE_LIST_LIST_Generated (0x1UL) /*!< Event generated                                                */


