adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LISTPARTTHRESH @Bits 0..15 : Threshold value. */
  #define EASYVDMA_CONFIG_LISTPARTTHRESH_LISTPARTTHRESH_Pos (0UL) /*!< Position of LISTPARTTHRESH field.                       */
  #define EASYVDMA_CONFIG_LISTPARTTHRESH_LISTPARTTHRESH_Msk (0xFFFFUL << EASYVDMA_CONFIG_LISTPARTTHRESH_LISTPARTTHRESH_Pos) /*!<
                                                                            Bit mask of LISTPARTTHRESH field.*/                   


/* ===================================================== Struct EASYVDMA ===================================================== */
/**
  * @brief Vector-based DMA.
  */
  typedef struct {                                   /*!< EASYVDMA Structure                                                   */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start operation.                                      */
    __OM uint32_t TASKS_PAUSE;                       /*!< (@ 0x00000004) Pause operation.                                      */
    __OM uint32_t TASKS_RESET;                       /*!< (@ 0x00000008) Reset operation.                                      */
    __IM uint32_t RESERVED[61];
    __IOM NRF_EASYVDMA_EVENTS_DONE_Type EVENTS_DONE; /*!< (@ 0x00000100) Peripheral events.                                    */
    __IOM uint32_t EVENTS_ERROR;                     /*!< (@ 0x00000114) AXI bus error received.                               */
    __IOM uint32_t EVENTS_PAUSED;                    /*!< (@ 0x00000118) DMA paused with task TASKS_PAUSE.                     */
    __IOM uint32_t EVENTS_RESET;                     /*!< (@ 0x0000011C) DMA reset with task TASKS_RESET.                      */
    __IM uint32_t RESERVED1[56];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED2[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED3[60];
    __IOM NRF_EASYVDMA_STATUS_Type STATUS;           /*!< (@ 0x00000400) EasyVDMA status registers.                            */
    __IM uint32_t RESERVED4[57];
    __IOM NRF_EASYVDMA_CONFIG_Type CONFIG;           /*!< (@ 0x00000500) General config registers                              */
  } NRF_EASYVDMA_Type;                               /*!< Size = 1292 (0x50C)                                                  */

/* EASYVDMA_TASKS_START: Start operation. */
  #define EASYVDMA_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                             */

/* TASKS_START @Bit 0 : Start operation. */
  #define EASYVDMA_TASKS_START_TASKS_START_Pos (0UL) /*!< Position of TASKS_START field.                                       */
  #define EASYVDMA_TASKS_START_TASKS_START_Msk (0x1UL << EASYVDMA_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START
                                                                            field.*/                                              
  #define EASYVDMA_TASKS_START_TASKS_START_Min (0x1UL) /*!< Min enumerator value of TASKS_START field.                         */
  #define EASYVDMA_TASKS_START_TASKS_START_Max (0x1UL) /*!< Max enumerator value of TASKS_START field.                         */
  #define EASYVDMA_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                   */


/* EASYVDMA_TASKS_PAUSE: Pause operation. */
  #define EASYVDMA_TASKS_PAUSE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PAUSE register.                             */

/* TASKS_PAUSE @Bit 0 : Pause operation. */
  #define EASYVDMA_TASKS_PAUSE_TASKS_PAUSE_Pos (0UL) /*!< Position of TASKS_PAUSE field.                                       */
  #define EASYVDMA_TASKS_PAUSE_TASKS_PAUSE_Msk (0x1UL << EASYVDMA_TASKS_PAUSE_TASKS_PAUSE_Pos) /*!< Bit mask of TASKS_PAUSE
                                                                            field.*/                                              
  #define EASYVDMA_TASKS_PAUSE_TASKS_PAUSE_Min (0x1UL) /*!< Min enumerator value of TASKS_PAUSE field.                         */
  #define EASYVDMA_TASKS_PAUSE_TASKS_PAUSE_Max (0x1UL) /*!< Max enumerator value of TASKS_PAUSE field.                         */
  #define EASYVDMA_TASKS_PAUSE_TASKS_PAUSE_Trigger (0x1UL) /*!< Trigger task                                                   */


/* EASYVDMA_TASKS_RESET: Reset operation. */
  #define EASYVDMA_TASKS_RESET_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RESET register.                             */

/* TASKS_RESET @Bit 0 : Reset operation. */
  #define EASYVDMA_TASKS_RESET_TASKS_RESET_Pos (0UL) /*!< Position of TASKS_RESET field.                                       */
  #define EASYVDMA_TASKS_RESET_TASKS_RESET_Msk (0x1UL << EASYVDMA_TASKS_RESET_TASKS_RESET_Pos) /*!< Bit mask of TASKS_RESET
                                                                            field.*/                                              
  #define EASYVDMA_TASKS_RESET_TASKS_RESET_Min (0x1UL) /*!< Min enumerator value of TASKS_RESET field.                         */
  #define EASYVDMA_TASKS_RESET_TASKS_RESET_Max (0x1UL) /*!< Max enumerator value of TASKS_RESET field.                         */
  #define EASYVDMA_TASKS_RESET_TASKS_RESET_Trigger (0x1UL) /*!< Trigger task                                                   */


/* EASYVDMA_EVENTS_ERROR: AXI bus error received. */
  #define EASYVDMA_EVENTS_ERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERROR register.                           */

/* EVENTS_ERROR @Bit 0 : AXI bus error received. */
  #define EASYVDMA_EVENTS_ERROR_EVENTS_ERROR_Pos (0UL) /*!< Position of EVENTS_ERROR field.                                    */
  #define EASYVDMA_EVENTS_ERROR_EVENTS_ERROR_Msk (0x1UL << EASYVDMA_EVENTS_ERROR_EVENTS_ERROR_Pos) /*!< Bit mask of EVENTS_ERROR
                                                                            field.*/                                              
  #define EASYVDMA_EVENTS_ERROR_EVENTS_ERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERROR field.                      */
  #define EASYVDMA_EVENTS_ERROR_EVENTS_ERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERROR field.                      */
  #define EASYVDMA_EVENTS_ERROR_EVENTS_ERROR_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define EASYVDMA_EVENTS_ERROR_EVENTS_ERROR_Generated (0x1UL) /*!< Event generated                                            */


/* EASYVDMA_EVENTS_PAUSED: DMA paused with task TASKS_PAUSE. */
  #define EASYVDMA_EVENTS_PAUSED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PAUSED register.                         */

