adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DONESELECTJOB @Bit 2 : Enable or disable interrupt for event DONESELECTJOB */
  #define EASYVDMA_INTEN_DONESELECTJOB_Pos (2UL)     /*!< Position of DONESELECTJOB field.                                     */
  #define EASYVDMA_INTEN_DONESELECTJOB_Msk (0x1UL << EASYVDMA_INTEN_DONESELECTJOB_Pos) /*!< Bit mask of DONESELECTJOB field.   */
  #define EASYVDMA_INTEN_DONESELECTJOB_Min (0x0UL)   /*!< Min enumerator value of DONESELECTJOB field.                         */
  #define EASYVDMA_INTEN_DONESELECTJOB_Max (0x1UL)   /*!< Max enumerator value of DONESELECTJOB field.                         */
  #define EASYVDMA_INTEN_DONESELECTJOB_Disabled (0x0UL) /*!< Disable                                                           */
  #define EASYVDMA_INTEN_DONESELECTJOB_Enabled (0x1UL) /*!< Enable                                                             */

/* DONEDATA @Bit 3 : Enable or disable interrupt for event DONEDATA */
  #define EASYVDMA_INTEN_DONEDATA_Pos (3UL)          /*!< Position of DONEDATA field.                                          */
  #define EASYVDMA_INTEN_DONEDATA_Msk (0x1UL << EASYVDMA_INTEN_DONEDATA_Pos) /*!< Bit mask of DONEDATA field.                  */
  #define EASYVDMA_INTEN_DONEDATA_Min (0x0UL)        /*!< Min enumerator value of DONEDATA field.                              */
  #define EASYVDMA_INTEN_DONEDATA_Max (0x1UL)        /*!< Max enumerator value of DONEDATA field.                              */
  #define EASYVDMA_INTEN_DONEDATA_Disabled (0x0UL)   /*!< Disable                                                              */
  #define EASYVDMA_INTEN_DONEDATA_Enabled (0x1UL)    /*!< Enable                                                               */

/* DONEJOB @Bit 4 : Enable or disable interrupt for event DONEJOB */
  #define EASYVDMA_INTEN_DONEJOB_Pos (4UL)           /*!< Position of DONEJOB field.                                           */
  #define EASYVDMA_INTEN_DONEJOB_Msk (0x1UL << EASYVDMA_INTEN_DONEJOB_Pos) /*!< Bit mask of DONEJOB field.                     */
  #define EASYVDMA_INTEN_DONEJOB_Min (0x0UL)         /*!< Min enumerator value of DONEJOB field.                               */
  #define EASYVDMA_INTEN_DONEJOB_Max (0x1UL)         /*!< Max enumerator value of DONEJOB field.                               */
  #define EASYVDMA_INTEN_DONEJOB_Disabled (0x0UL)    /*!< Disable                                                              */
  #define EASYVDMA_INTEN_DONEJOB_Enabled (0x1UL)     /*!< Enable                                                               */

/* ERROR @Bit 5 : Enable or disable interrupt for event ERROR */
  #define EASYVDMA_INTEN_ERROR_Pos (5UL)             /*!< Position of ERROR field.                                             */
  #define EASYVDMA_INTEN_ERROR_Msk (0x1UL << EASYVDMA_INTEN_ERROR_Pos) /*!< Bit mask of ERROR field.                           */
  #define EASYVDMA_INTEN_ERROR_Min (0x0UL)           /*!< Min enumerator value of ERROR field.                                 */
  #define EASYVDMA_INTEN_ERROR_Max (0x1UL)           /*!< Max enumerator value of ERROR field.                                 */
  #define EASYVDMA_INTEN_ERROR_Disabled (0x0UL)      /*!< Disable                                                              */
  #define EASYVDMA_INTEN_ERROR_Enabled (0x1UL)       /*!< Enable                                                               */

/* PAUSED @Bit 6 : Enable or disable interrupt for event PAUSED */
  #define EASYVDMA_INTEN_PAUSED_Pos (6UL)            /*!< Position of PAUSED field.                                            */
  #define EASYVDMA_INTEN_PAUSED_Msk (0x1UL << EASYVDMA_INTEN_PAUSED_Pos) /*!< Bit mask of PAUSED field.                        */
  #define EASYVDMA_INTEN_PAUSED_Min (0x0UL)          /*!< Min enumerator value of PAUSED field.                                */
  #define EASYVDMA_INTEN_PAUSED_Max (0x1UL)          /*!< Max enumerator value of PAUSED field.                                */
  #define EASYVDMA_INTEN_PAUSED_Disabled (0x0UL)     /*!< Disable                                                              */
  #define EASYVDMA_INTEN_PAUSED_Enabled (0x1UL)      /*!< Enable                                                               */

/* RESET @Bit 7 : Enable or disable interrupt for event RESET */
  #define EASYVDMA_INTEN_RESET_Pos (7UL)             /*!< Position of RESET field.                                             */
  #define EASYVDMA_INTEN_RESET_Msk (0x1UL << EASYVDMA_INTEN_RESET_Pos) /*!< Bit mask of RESET field.                           */
  #define EASYVDMA_INTEN_RESET_Min (0x0UL)           /*!< Min enumerator value of RESET field.                                 */
  #define EASYVDMA_INTEN_RESET_Max (0x1UL)           /*!< Max enumerator value of RESET field.                                 */
  #define EASYVDMA_INTEN_RESET_Disabled (0x0UL)      /*!< Disable                                                              */
  #define EASYVDMA_INTEN_RESET_Enabled (0x1UL)       /*!< Enable                                                               */


/* EASYVDMA_INTENSET: Enable interrupt */
  #define EASYVDMA_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                   */

/* DONELIST @Bit 0 : Write '1' to enable interrupt for event DONELIST */
  #define EASYVDMA_INTENSET_DONELIST_Pos (0UL)       /*!< Position of DONELIST field.                                          */
  #define EASYVDMA_INTENSET_DONELIST_Msk (0x1UL << EASYVDMA_INTENSET_DONELIST_Pos) /*!< Bit mask of DONELIST field.            */
  #define EASYVDMA_INTENSET_DONELIST_Min (0x0UL)     /*!< Min enumerator value of DONELIST field.                              */
  #define EASYVDMA_INTENSET_DONELIST_Max (0x1UL)     /*!< Max enumerator value of DONELIST field.                              */
  #define EASYVDMA_INTENSET_DONELIST_Set (0x1UL)     /*!< Enable                                                               */
  #define EASYVDMA_INTENSET_DONELIST_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define EASYVDMA_INTENSET_DONELIST_Enabled (0x1UL) /*!< Read: Enabled                                                        */

