adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DONELISTPART @Bit 1 : Read pending status of interrupt for event DONELISTPART */
  #define EASYVDMA_INTPEND_DONELISTPART_Pos (1UL)    /*!< Position of DONELISTPART field.                                      */
  #define EASYVDMA_INTPEND_DONELISTPART_Msk (0x1UL << EASYVDMA_INTPEND_DONELISTPART_Pos) /*!< Bit mask of DONELISTPART field.  */
  #define EASYVDMA_INTPEND_DONELISTPART_Min (0x0UL)  /*!< Min enumerator value of DONELISTPART field.                          */
  #define EASYVDMA_INTPEND_DONELISTPART_Max (0x1UL)  /*!< Max enumerator value of DONELISTPART field.                          */
  #define EASYVDMA_INTPEND_DONELISTPART_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define EASYVDMA_INTPEND_DONELISTPART_Pending (0x1UL) /*!< Read: Pending                                                     */

/* DONESELECTJOB @Bit 2 : Read pending status of interrupt for event DONESELECTJOB */
  #define EASYVDMA_INTPEND_DONESELECTJOB_Pos (2UL)   /*!< Position of DONESELECTJOB field.                                     */
  #define EASYVDMA_INTPEND_DONESELECTJOB_Msk (0x1UL << EASYVDMA_INTPEND_DONESELECTJOB_Pos) /*!< Bit mask of DONESELECTJOB
                                                                            field.*/                                              
  #define EASYVDMA_INTPEND_DONESELECTJOB_Min (0x0UL) /*!< Min enumerator value of DONESELECTJOB field.                         */
  #define EASYVDMA_INTPEND_DONESELECTJOB_Max (0x1UL) /*!< Max enumerator value of DONESELECTJOB field.                         */
  #define EASYVDMA_INTPEND_DONESELECTJOB_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define EASYVDMA_INTPEND_DONESELECTJOB_Pending (0x1UL) /*!< Read: Pending                                                    */

/* DONEDATA @Bit 3 : Read pending status of interrupt for event DONEDATA */
  #define EASYVDMA_INTPEND_DONEDATA_Pos (3UL)        /*!< Position of DONEDATA field.                                          */
  #define EASYVDMA_INTPEND_DONEDATA_Msk (0x1UL << EASYVDMA_INTPEND_DONEDATA_Pos) /*!< Bit mask of DONEDATA field.              */
  #define EASYVDMA_INTPEND_DONEDATA_Min (0x0UL)      /*!< Min enumerator value of DONEDATA field.                              */
  #define EASYVDMA_INTPEND_DONEDATA_Max (0x1UL)      /*!< Max enumerator value of DONEDATA field.                              */
  #define EASYVDMA_INTPEND_DONEDATA_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define EASYVDMA_INTPEND_DONEDATA_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* DONEJOB @Bit 4 : Read pending status of interrupt for event DONEJOB */
  #define EASYVDMA_INTPEND_DONEJOB_Pos (4UL)         /*!< Position of DONEJOB field.                                           */
  #define EASYVDMA_INTPEND_DONEJOB_Msk (0x1UL << EASYVDMA_INTPEND_DONEJOB_Pos) /*!< Bit mask of DONEJOB field.                 */
  #define EASYVDMA_INTPEND_DONEJOB_Min (0x0UL)       /*!< Min enumerator value of DONEJOB field.                               */
  #define EASYVDMA_INTPEND_DONEJOB_Max (0x1UL)       /*!< Max enumerator value of DONEJOB field.                               */
  #define EASYVDMA_INTPEND_DONEJOB_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define EASYVDMA_INTPEND_DONEJOB_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* ERROR @Bit 5 : Read pending status of interrupt for event ERROR */
  #define EASYVDMA_INTPEND_ERROR_Pos (5UL)           /*!< Position of ERROR field.                                             */
  #define EASYVDMA_INTPEND_ERROR_Msk (0x1UL << EASYVDMA_INTPEND_ERROR_Pos) /*!< Bit mask of ERROR field.                       */
  #define EASYVDMA_INTPEND_ERROR_Min (0x0UL)         /*!< Min enumerator value of ERROR field.                                 */
  #define EASYVDMA_INTPEND_ERROR_Max (0x1UL)         /*!< Max enumerator value of ERROR field.                                 */
  #define EASYVDMA_INTPEND_ERROR_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define EASYVDMA_INTPEND_ERROR_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* PAUSED @Bit 6 : Read pending status of interrupt for event PAUSED */
  #define EASYVDMA_INTPEND_PAUSED_Pos (6UL)          /*!< Position of PAUSED field.                                            */
  #define EASYVDMA_INTPEND_PAUSED_Msk (0x1UL << EASYVDMA_INTPEND_PAUSED_Pos) /*!< Bit mask of PAUSED field.                    */
  #define EASYVDMA_INTPEND_PAUSED_Min (0x0UL)        /*!< Min enumerator value of PAUSED field.                                */
  #define EASYVDMA_INTPEND_PAUSED_Max (0x1UL)        /*!< Max enumerator value of PAUSED field.                                */
  #define EASYVDMA_INTPEND_PAUSED_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define EASYVDMA_INTPEND_PAUSED_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* RESET @Bit 7 : Read pending status of interrupt for event RESET */
  #define EASYVDMA_INTPEND_RESET_Pos (7UL)           /*!< Position of RESET field.                                             */
  #define EASYVDMA_INTPEND_RESET_Msk (0x1UL << EASYVDMA_INTPEND_RESET_Pos) /*!< Bit mask of RESET field.                       */
  #define EASYVDMA_INTPEND_RESET_Min (0x0UL)         /*!< Min enumerator value of RESET field.                                 */
  #define EASYVDMA_INTPEND_RESET_Max (0x1UL)         /*!< Max enumerator value of RESET field.                                 */
  #define EASYVDMA_INTPEND_RESET_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define EASYVDMA_INTPEND_RESET_Pending (0x1UL)     /*!< Read: Pending                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            ECB                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

