adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ETM_TRCPRGCTLR: Enables the trace unit. */
  #define ETM_TRCPRGCTLR_ResetValue (0x00000000UL)   /*!< Reset value of TRCPRGCTLR register.                                  */

/* EN @Bit 0 : Trace unit enable bit */
  #define ETM_TRCPRGCTLR_EN_Pos (0UL)                /*!< Position of EN field.                                                */
  #define ETM_TRCPRGCTLR_EN_Msk (0x1UL << ETM_TRCPRGCTLR_EN_Pos) /*!< Bit mask of EN field.                                    */
  #define ETM_TRCPRGCTLR_EN_Min (0x0UL)              /*!< Min enumerator value of EN field.                                    */
  #define ETM_TRCPRGCTLR_EN_Max (0x1UL)              /*!< Max enumerator value of EN field.                                    */
  #define ETM_TRCPRGCTLR_EN_Disabled (0x0UL)         /*!< The trace unit is disabled. All trace resources are inactive and no
                                                          trace is generated.*/                                                   
  #define ETM_TRCPRGCTLR_EN_Enabled (0x1UL)          /*!< The trace unit is enabled.                                           */


/* ETM_TRCPROCSELR: Controls which PE to trace. Might ignore writes when the trace unit is enabled or not idle. Before writing
                     to this register, ensure that TRCSTATR.IDLE == 1 so that the trace unit can synchronize with the chosen PE.
                     Implemented if TRCIDR3.NUMPROC is greater than zero. */                                                      
                                                                                                                                  
  #define ETM_TRCPROCSELR_ResetValue (0x00000000UL)  /*!< Reset value of TRCPROCSELR register.                                 */

/* PROCSEL @Bits 0..4 : PE select bits that select the PE to trace. */
  #define ETM_TRCPROCSELR_PROCSEL_Pos (0UL)          /*!< Position of PROCSEL field.                                           */
  #define ETM_TRCPROCSELR_PROCSEL_Msk (0x1FUL << ETM_TRCPROCSELR_PROCSEL_Pos) /*!< Bit mask of PROCSEL field.                  */


/* ETM_TRCSTATR: Idle status bit */
  #define ETM_TRCSTATR_ResetValue (0x00000000UL)     /*!< Reset value of TRCSTATR register.                                    */

/* IDLE @Bit 0 : Trace unit enable bit */
  #define ETM_TRCSTATR_IDLE_Pos (0UL)                /*!< Position of IDLE field.                                              */
  #define ETM_TRCSTATR_IDLE_Msk (0x1UL << ETM_TRCSTATR_IDLE_Pos) /*!< Bit mask of IDLE field.                                  */
  #define ETM_TRCSTATR_IDLE_Min (0x0UL)              /*!< Min enumerator value of IDLE field.                                  */
  #define ETM_TRCSTATR_IDLE_Max (0x1UL)              /*!< Max enumerator value of IDLE field.                                  */
  #define ETM_TRCSTATR_IDLE_NotIdle (0x0UL)          /*!< The trace unit is not idle.                                          */
  #define ETM_TRCSTATR_IDLE_Idle (0x1UL)             /*!< The trace unit is idle.                                              */

/* PMSTABLE @Bit 1 : Programmers' model stable bit */
  #define ETM_TRCSTATR_PMSTABLE_Pos (1UL)            /*!< Position of PMSTABLE field.                                          */
  #define ETM_TRCSTATR_PMSTABLE_Msk (0x1UL << ETM_TRCSTATR_PMSTABLE_Pos) /*!< Bit mask of PMSTABLE field.                      */
  #define ETM_TRCSTATR_PMSTABLE_Min (0x0UL)          /*!< Min enumerator value of PMSTABLE field.                              */
  #define ETM_TRCSTATR_PMSTABLE_Max (0x1UL)          /*!< Max enumerator value of PMSTABLE field.                              */
  #define ETM_TRCSTATR_PMSTABLE_NotStable (0x0UL)    /*!< The programmers' model is not stable.                                */
  #define ETM_TRCSTATR_PMSTABLE_Stable (0x1UL)       /*!< The programmers' model is stable.                                    */


/* ETM_TRCCONFIGR: Controls the tracing options This register must always be programmed as part of trace unit initialization.
                    Might ignore writes when the trace unit is enabled or not idle. */                                            
                                                                                                                                  
  #define ETM_TRCCONFIGR_ResetValue (0x00000000UL)   /*!< Reset value of TRCCONFIGR register.                                  */

/* LOADASP0INST @Bit 1 : Instruction P0 load field. This field controls whether load instructions are traced as P0 instructions.
                         */                                                                                                       
                                                                                                                                  
  #define ETM_TRCCONFIGR_LOADASP0INST_Pos (1UL)      /*!< Position of LOADASP0INST field.                                      */
  #define ETM_TRCCONFIGR_LOADASP0INST_Msk (0x1UL << ETM_TRCCONFIGR_LOADASP0INST_Pos) /*!< Bit mask of LOADASP0INST field.      */
  #define ETM_TRCCONFIGR_LOADASP0INST_Min (0x0UL)    /*!< Min enumerator value of LOADASP0INST field.                          */
  #define ETM_TRCCONFIGR_LOADASP0INST_Max (0x1UL)    /*!< Max enumerator value of LOADASP0INST field.                          */
  #define ETM_TRCCONFIGR_LOADASP0INST_No (0x0UL)     /*!< Do not trace load instructions as P0 instructions.                   */
  #define ETM_TRCCONFIGR_LOADASP0INST_Yes (0x1UL)    /*!< Trace load instructions as P0 instructions.                          */

/* STOREASP0INST @Bit 2 : Instruction P0 field. This field controls whether store instructions are traced as P0 instructions. */
  #define ETM_TRCCONFIGR_STOREASP0INST_Pos (2UL)     /*!< Position of STOREASP0INST field.                                     */
  #define ETM_TRCCONFIGR_STOREASP0INST_Msk (0x1UL << ETM_TRCCONFIGR_STOREASP0INST_Pos) /*!< Bit mask of STOREASP0INST field.   */
  #define ETM_TRCCONFIGR_STOREASP0INST_Min (0x0UL)   /*!< Min enumerator value of STOREASP0INST field.                         */
  #define ETM_TRCCONFIGR_STOREASP0INST_Max (0x1UL)   /*!< Max enumerator value of STOREASP0INST field.                         */
  #define ETM_TRCCONFIGR_STOREASP0INST_No (0x0UL)    /*!< Do not trace store instructions as P0 instructions.                  */
  #define ETM_TRCCONFIGR_STOREASP0INST_Yes (0x1UL)   /*!< Trace store instructions as P0 instructions.                         */

