adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* BB @Bit 3 : Branch broadcast mode bit. */
  #define ETM_TRCCONFIGR_BB_Pos (3UL)                /*!< Position of BB field.                                                */
  #define ETM_TRCCONFIGR_BB_Msk (0x1UL << ETM_TRCCONFIGR_BB_Pos) /*!< Bit mask of BB field.                                    */
  #define ETM_TRCCONFIGR_BB_Min (0x0UL)              /*!< Min enumerator value of BB field.                                    */
  #define ETM_TRCCONFIGR_BB_Max (0x1UL)              /*!< Max enumerator value of BB field.                                    */
  #define ETM_TRCCONFIGR_BB_Disabled (0x0UL)         /*!< Branch broadcast mode is disabled.                                   */
  #define ETM_TRCCONFIGR_BB_Enabled (0x1UL)          /*!< Branch broadcast mode is enabled.                                    */

/* CCI @Bit 4 : Cycle counting instruction trace bit. */
  #define ETM_TRCCONFIGR_CCI_Pos (4UL)               /*!< Position of CCI field.                                               */
  #define ETM_TRCCONFIGR_CCI_Msk (0x1UL << ETM_TRCCONFIGR_CCI_Pos) /*!< Bit mask of CCI field.                                 */
  #define ETM_TRCCONFIGR_CCI_Min (0x0UL)             /*!< Min enumerator value of CCI field.                                   */
  #define ETM_TRCCONFIGR_CCI_Max (0x1UL)             /*!< Max enumerator value of CCI field.                                   */
  #define ETM_TRCCONFIGR_CCI_Disabled (0x0UL)        /*!< Cycle counting in the instruction trace is disabled.                 */
  #define ETM_TRCCONFIGR_CCI_Enabled (0x1UL)         /*!< Cycle counting in the instruction trace is enabled.                  */

/* CID @Bit 6 : Context ID tracing bit. */
  #define ETM_TRCCONFIGR_CID_Pos (6UL)               /*!< Position of CID field.                                               */
  #define ETM_TRCCONFIGR_CID_Msk (0x1UL << ETM_TRCCONFIGR_CID_Pos) /*!< Bit mask of CID field.                                 */
  #define ETM_TRCCONFIGR_CID_Min (0x0UL)             /*!< Min enumerator value of CID field.                                   */
  #define ETM_TRCCONFIGR_CID_Max (0x1UL)             /*!< Max enumerator value of CID field.                                   */
  #define ETM_TRCCONFIGR_CID_Disabled (0x0UL)        /*!< Context ID tracing is disabled.                                      */
  #define ETM_TRCCONFIGR_CID_Enabled (0x1UL)         /*!< Context ID tracing is enabled.                                       */

/* VMID @Bit 7 : Virtual context identifier tracing bit. */
  #define ETM_TRCCONFIGR_VMID_Pos (7UL)              /*!< Position of VMID field.                                              */
  #define ETM_TRCCONFIGR_VMID_Msk (0x1UL << ETM_TRCCONFIGR_VMID_Pos) /*!< Bit mask of VMID field.                              */
  #define ETM_TRCCONFIGR_VMID_Min (0x0UL)            /*!< Min enumerator value of VMID field.                                  */
  #define ETM_TRCCONFIGR_VMID_Max (0x1UL)            /*!< Max enumerator value of VMID field.                                  */
  #define ETM_TRCCONFIGR_VMID_Disabled (0x0UL)       /*!< Virtual context identifier tracing is disabled.                      */
  #define ETM_TRCCONFIGR_VMID_Enabled (0x1UL)        /*!< Virtual context identifier tracing is enabled.                       */

/* COND @Bits 8..10 : Conditional instruction tracing bit. */
  #define ETM_TRCCONFIGR_COND_Pos (8UL)              /*!< Position of COND field.                                              */
  #define ETM_TRCCONFIGR_COND_Msk (0x7UL << ETM_TRCCONFIGR_COND_Pos) /*!< Bit mask of COND field.                              */
  #define ETM_TRCCONFIGR_COND_Min (0x0UL)            /*!< Min enumerator value of COND field.                                  */
  #define ETM_TRCCONFIGR_COND_Max (0x7UL)            /*!< Max enumerator value of COND field.                                  */
  #define ETM_TRCCONFIGR_COND_Disabled (0x0UL)       /*!< Conditional instruction tracing is disabled.                         */
  #define ETM_TRCCONFIGR_COND_LoadOnly (0x1UL)       /*!< Conditional load instructions are traced.                            */
  #define ETM_TRCCONFIGR_COND_StoreOnly (0x2UL)      /*!< Conditional store instructions are traced.                           */
  #define ETM_TRCCONFIGR_COND_LoadAndStore (0x3UL)   /*!< Conditional load and store instructions are traced.                  */
  #define ETM_TRCCONFIGR_COND_All (0x7UL)            /*!< All conditional instructions are traced.                             */

/* TS @Bit 11 : Global timestamp tracing bit. */
  #define ETM_TRCCONFIGR_TS_Pos (11UL)               /*!< Position of TS field.                                                */
  #define ETM_TRCCONFIGR_TS_Msk (0x1UL << ETM_TRCCONFIGR_TS_Pos) /*!< Bit mask of TS field.                                    */
  #define ETM_TRCCONFIGR_TS_Min (0x0UL)              /*!< Min enumerator value of TS field.                                    */
  #define ETM_TRCCONFIGR_TS_Max (0x1UL)              /*!< Max enumerator value of TS field.                                    */
  #define ETM_TRCCONFIGR_TS_Disabled (0x0UL)         /*!< Global timestamp tracing is disabled.                                */
  #define ETM_TRCCONFIGR_TS_Enabled (0x1UL)          /*!< Global timestamp tracing is enabled.                                 */

/* RS @Bit 12 : Return stack enable bit. */
  #define ETM_TRCCONFIGR_RS_Pos (12UL)               /*!< Position of RS field.                                                */
  #define ETM_TRCCONFIGR_RS_Msk (0x1UL << ETM_TRCCONFIGR_RS_Pos) /*!< Bit mask of RS field.                                    */
  #define ETM_TRCCONFIGR_RS_Min (0x0UL)              /*!< Min enumerator value of RS field.                                    */
  #define ETM_TRCCONFIGR_RS_Max (0x1UL)              /*!< Max enumerator value of RS field.                                    */
  #define ETM_TRCCONFIGR_RS_Disabled (0x0UL)         /*!< Return stack is disabled.                                            */
  #define ETM_TRCCONFIGR_RS_Enabled (0x1UL)          /*!< Return stack is enabled.                                             */

/* QE @Bits 13..14 : Q element enable field. */
  #define ETM_TRCCONFIGR_QE_Pos (13UL)               /*!< Position of QE field.                                                */
  #define ETM_TRCCONFIGR_QE_Msk (0x3UL << ETM_TRCCONFIGR_QE_Pos) /*!< Bit mask of QE field.                                    */
  #define ETM_TRCCONFIGR_QE_Min (0x0UL)              /*!< Min enumerator value of QE field.                                    */
  #define ETM_TRCCONFIGR_QE_Max (0x3UL)              /*!< Max enumerator value of QE field.                                    */
  #define ETM_TRCCONFIGR_QE_Disabled (0x0UL)         /*!< Q elements are disabled.                                             */
  #define ETM_TRCCONFIGR_QE_OnlyWithoutInstCounts (0x1UL) /*!< Q elements with instruction counts are enabled. Q elements
                                                               without instruction counts are disabled.*/                         
  #define ETM_TRCCONFIGR_QE_Enabled (0x3UL)          /*!< Q elements with and without instruction counts are enabled.          */

/* VMIDOPT @Bit 15 : Control bit to select the Virtual context identifier value used by the trace unit, both for trace
                     generation and in the Virtual context identifier comparators. */                                             
                                                                                                                                  
