adamkondraciuk/nrfx/mdk/nrf7140_types.h
  #define ETM_TRCBBCTLR_RANGE3_Pos (3UL)             /*!< Position of RANGE3 field.                                            */
  #define ETM_TRCBBCTLR_RANGE3_Msk (0x1UL << ETM_TRCBBCTLR_RANGE3_Pos) /*!< Bit mask of RANGE3 field.                          */
  #define ETM_TRCBBCTLR_RANGE3_Min (0x0UL)           /*!< Min enumerator value of RANGE3 field.                                */
  #define ETM_TRCBBCTLR_RANGE3_Max (0x1UL)           /*!< Max enumerator value of RANGE3 field.                                */
  #define ETM_TRCBBCTLR_RANGE3_Disabled (0x0UL)      /*!< The address range that address range comparator pair 3 defines, is not
                                                          selected.*/                                                             
  #define ETM_TRCBBCTLR_RANGE3_Enabled (0x1UL)       /*!< The address range that address range comparator pair n defines, is
                                                          selected.*/                                                             

/* RANGE4 @Bit 4 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. Each
                   field represents an address range comparator pair, so field[4] controls the selection of address range
                   comparator pair 4. */                                                                                          
                                                                                                                                  
  #define ETM_TRCBBCTLR_RANGE4_Pos (4UL)             /*!< Position of RANGE4 field.                                            */
  #define ETM_TRCBBCTLR_RANGE4_Msk (0x1UL << ETM_TRCBBCTLR_RANGE4_Pos) /*!< Bit mask of RANGE4 field.                          */
  #define ETM_TRCBBCTLR_RANGE4_Min (0x0UL)           /*!< Min enumerator value of RANGE4 field.                                */
  #define ETM_TRCBBCTLR_RANGE4_Max (0x1UL)           /*!< Max enumerator value of RANGE4 field.                                */
  #define ETM_TRCBBCTLR_RANGE4_Disabled (0x0UL)      /*!< The address range that address range comparator pair 4 defines, is not
                                                          selected.*/                                                             
  #define ETM_TRCBBCTLR_RANGE4_Enabled (0x1UL)       /*!< The address range that address range comparator pair n defines, is
                                                          selected.*/                                                             

/* RANGE5 @Bit 5 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. Each
                   field represents an address range comparator pair, so field[5] controls the selection of address range
                   comparator pair 5. */                                                                                          
                                                                                                                                  
  #define ETM_TRCBBCTLR_RANGE5_Pos (5UL)             /*!< Position of RANGE5 field.                                            */
  #define ETM_TRCBBCTLR_RANGE5_Msk (0x1UL << ETM_TRCBBCTLR_RANGE5_Pos) /*!< Bit mask of RANGE5 field.                          */
  #define ETM_TRCBBCTLR_RANGE5_Min (0x0UL)           /*!< Min enumerator value of RANGE5 field.                                */
  #define ETM_TRCBBCTLR_RANGE5_Max (0x1UL)           /*!< Max enumerator value of RANGE5 field.                                */
  #define ETM_TRCBBCTLR_RANGE5_Disabled (0x0UL)      /*!< The address range that address range comparator pair 5 defines, is not
                                                          selected.*/                                                             
  #define ETM_TRCBBCTLR_RANGE5_Enabled (0x1UL)       /*!< The address range that address range comparator pair n defines, is
                                                          selected.*/                                                             

/* RANGE6 @Bit 6 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. Each
                   field represents an address range comparator pair, so field[6] controls the selection of address range
                   comparator pair 6. */                                                                                          
                                                                                                                                  
  #define ETM_TRCBBCTLR_RANGE6_Pos (6UL)             /*!< Position of RANGE6 field.                                            */
  #define ETM_TRCBBCTLR_RANGE6_Msk (0x1UL << ETM_TRCBBCTLR_RANGE6_Pos) /*!< Bit mask of RANGE6 field.                          */
  #define ETM_TRCBBCTLR_RANGE6_Min (0x0UL)           /*!< Min enumerator value of RANGE6 field.                                */
  #define ETM_TRCBBCTLR_RANGE6_Max (0x1UL)           /*!< Max enumerator value of RANGE6 field.                                */
  #define ETM_TRCBBCTLR_RANGE6_Disabled (0x0UL)      /*!< The address range that address range comparator pair 6 defines, is not
                                                          selected.*/                                                             
  #define ETM_TRCBBCTLR_RANGE6_Enabled (0x1UL)       /*!< The address range that address range comparator pair n defines, is
                                                          selected.*/                                                             

/* RANGE7 @Bit 7 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. Each
                   field represents an address range comparator pair, so field[7] controls the selection of address range
                   comparator pair 7. */                                                                                          
                                                                                                                                  
