adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EXCLUDE7 @Bit 23 : Selects which single address comparators are in use with ViewData exclude control. */
  #define ETM_TRCVDSACCTLR_EXCLUDE7_Pos (23UL)       /*!< Position of EXCLUDE7 field.                                          */
  #define ETM_TRCVDSACCTLR_EXCLUDE7_Msk (0x1UL << ETM_TRCVDSACCTLR_EXCLUDE7_Pos) /*!< Bit mask of EXCLUDE7 field.              */
  #define ETM_TRCVDSACCTLR_EXCLUDE7_Min (0x0UL)      /*!< Min enumerator value of EXCLUDE7 field.                              */
  #define ETM_TRCVDSACCTLR_EXCLUDE7_Max (0x1UL)      /*!< Max enumerator value of EXCLUDE7 field.                              */
  #define ETM_TRCVDSACCTLR_EXCLUDE7_Disabled (0x0UL) /*!< The single address comparator 7, is not selected for ViewData exclude
                                                          control.*/                                                              
  #define ETM_TRCVDSACCTLR_EXCLUDE7_Enabled (0x1UL)  /*!< The single address comparator 7, s selected for ViewData exclude
                                                          control.*/                                                              


/* ETM_TRCVDARCCTLR: ViewData include / exclude control. Might ignore writes when the trace unit is enabled or not idle. This
                      register must be programmed when one or more address comparators are implemented. */                        
                                                                                                                                  
  #define ETM_TRCVDARCCTLR_ResetValue (0x00000000UL) /*!< Reset value of TRCVDARCCTLR register.                                */

/* INCLUDE0 @Bit 0 : Include range field. Selects which address range comparator pairs are in use with ViewData include control.
                     */                                                                                                           
                                                                                                                                  
  #define ETM_TRCVDARCCTLR_INCLUDE0_Pos (0UL)        /*!< Position of INCLUDE0 field.                                          */
  #define ETM_TRCVDARCCTLR_INCLUDE0_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE0_Pos) /*!< Bit mask of INCLUDE0 field.              */
  #define ETM_TRCVDARCCTLR_INCLUDE0_Min (0x0UL)      /*!< Min enumerator value of INCLUDE0 field.                              */
  #define ETM_TRCVDARCCTLR_INCLUDE0_Max (0x1UL)      /*!< Max enumerator value of INCLUDE0 field.                              */
  #define ETM_TRCVDARCCTLR_INCLUDE0_Disabled (0x0UL) /*!< The address range that address range comparator 0 defines, is not
                                                          selected for ViewData include control.*/                                
  #define ETM_TRCVDARCCTLR_INCLUDE0_Enabled (0x1UL)  /*!< The address range that address range comparator 0 defines, is selected
                                                          for ViewData include control.*/                                         

/* INCLUDE1 @Bit 1 : Include range field. Selects which address range comparator pairs are in use with ViewData include control.
                     */                                                                                                           
                                                                                                                                  
  #define ETM_TRCVDARCCTLR_INCLUDE1_Pos (1UL)        /*!< Position of INCLUDE1 field.                                          */
  #define ETM_TRCVDARCCTLR_INCLUDE1_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE1_Pos) /*!< Bit mask of INCLUDE1 field.              */
  #define ETM_TRCVDARCCTLR_INCLUDE1_Min (0x0UL)      /*!< Min enumerator value of INCLUDE1 field.                              */
  #define ETM_TRCVDARCCTLR_INCLUDE1_Max (0x1UL)      /*!< Max enumerator value of INCLUDE1 field.                              */
  #define ETM_TRCVDARCCTLR_INCLUDE1_Disabled (0x0UL) /*!< The address range that address range comparator 1 defines, is not
                                                          selected for ViewData include control.*/                                
  #define ETM_TRCVDARCCTLR_INCLUDE1_Enabled (0x1UL)  /*!< The address range that address range comparator 1 defines, is selected
                                                          for ViewData include control.*/                                         

/* INCLUDE2 @Bit 2 : Include range field. Selects which address range comparator pairs are in use with ViewData include control.
                     */                                                                                                           
                                                                                                                                  
  #define ETM_TRCVDARCCTLR_INCLUDE2_Pos (2UL)        /*!< Position of INCLUDE2 field.                                          */
  #define ETM_TRCVDARCCTLR_INCLUDE2_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE2_Pos) /*!< Bit mask of INCLUDE2 field.              */
  #define ETM_TRCVDARCCTLR_INCLUDE2_Min (0x0UL)      /*!< Min enumerator value of INCLUDE2 field.                              */
  #define ETM_TRCVDARCCTLR_INCLUDE2_Max (0x1UL)      /*!< Max enumerator value of INCLUDE2 field.                              */
  #define ETM_TRCVDARCCTLR_INCLUDE2_Disabled (0x0UL) /*!< The address range that address range comparator 2 defines, is not
                                                          selected for ViewData include control.*/                                
  #define ETM_TRCVDARCCTLR_INCLUDE2_Enabled (0x1UL)  /*!< The address range that address range comparator 2 defines, is selected
                                                          for ViewData include control.*/                                         

/* INCLUDE3 @Bit 3 : Include range field. Selects which address range comparator pairs are in use with ViewData include control.
                     */                                                                                                           
                                                                                                                                  
