adamkondraciuk/nrfx/mdk/nrf7140_types.h
  #define ETM_TRCVDARCCTLR_INCLUDE3_Pos (3UL)        /*!< Position of INCLUDE3 field.                                          */
  #define ETM_TRCVDARCCTLR_INCLUDE3_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE3_Pos) /*!< Bit mask of INCLUDE3 field.              */
  #define ETM_TRCVDARCCTLR_INCLUDE3_Min (0x0UL)      /*!< Min enumerator value of INCLUDE3 field.                              */
  #define ETM_TRCVDARCCTLR_INCLUDE3_Max (0x1UL)      /*!< Max enumerator value of INCLUDE3 field.                              */
  #define ETM_TRCVDARCCTLR_INCLUDE3_Disabled (0x0UL) /*!< The address range that address range comparator 3 defines, is not
                                                          selected for ViewData include control.*/                                
  #define ETM_TRCVDARCCTLR_INCLUDE3_Enabled (0x1UL)  /*!< The address range that address range comparator 3 defines, is selected
                                                          for ViewData include control.*/                                         

/* INCLUDE4 @Bit 4 : Include range field. Selects which address range comparator pairs are in use with ViewData include control.
                     */                                                                                                           
                                                                                                                                  
  #define ETM_TRCVDARCCTLR_INCLUDE4_Pos (4UL)        /*!< Position of INCLUDE4 field.                                          */
  #define ETM_TRCVDARCCTLR_INCLUDE4_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE4_Pos) /*!< Bit mask of INCLUDE4 field.              */
  #define ETM_TRCVDARCCTLR_INCLUDE4_Min (0x0UL)      /*!< Min enumerator value of INCLUDE4 field.                              */
  #define ETM_TRCVDARCCTLR_INCLUDE4_Max (0x1UL)      /*!< Max enumerator value of INCLUDE4 field.                              */
  #define ETM_TRCVDARCCTLR_INCLUDE4_Disabled (0x0UL) /*!< The address range that address range comparator 4 defines, is not
                                                          selected for ViewData include control.*/                                
  #define ETM_TRCVDARCCTLR_INCLUDE4_Enabled (0x1UL)  /*!< The address range that address range comparator 4 defines, is selected
                                                          for ViewData include control.*/                                         

/* INCLUDE5 @Bit 5 : Include range field. Selects which address range comparator pairs are in use with ViewData include control.
                     */                                                                                                           
                                                                                                                                  
  #define ETM_TRCVDARCCTLR_INCLUDE5_Pos (5UL)        /*!< Position of INCLUDE5 field.                                          */
  #define ETM_TRCVDARCCTLR_INCLUDE5_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE5_Pos) /*!< Bit mask of INCLUDE5 field.              */
  #define ETM_TRCVDARCCTLR_INCLUDE5_Min (0x0UL)      /*!< Min enumerator value of INCLUDE5 field.                              */
  #define ETM_TRCVDARCCTLR_INCLUDE5_Max (0x1UL)      /*!< Max enumerator value of INCLUDE5 field.                              */
  #define ETM_TRCVDARCCTLR_INCLUDE5_Disabled (0x0UL) /*!< The address range that address range comparator 5 defines, is not
                                                          selected for ViewData include control.*/                                
  #define ETM_TRCVDARCCTLR_INCLUDE5_Enabled (0x1UL)  /*!< The address range that address range comparator 5 defines, is selected
                                                          for ViewData include control.*/                                         

/* INCLUDE6 @Bit 6 : Include range field. Selects which address range comparator pairs are in use with ViewData include control.
                     */                                                                                                           
                                                                                                                                  
  #define ETM_TRCVDARCCTLR_INCLUDE6_Pos (6UL)        /*!< Position of INCLUDE6 field.                                          */
  #define ETM_TRCVDARCCTLR_INCLUDE6_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE6_Pos) /*!< Bit mask of INCLUDE6 field.              */
  #define ETM_TRCVDARCCTLR_INCLUDE6_Min (0x0UL)      /*!< Min enumerator value of INCLUDE6 field.                              */
  #define ETM_TRCVDARCCTLR_INCLUDE6_Max (0x1UL)      /*!< Max enumerator value of INCLUDE6 field.                              */
  #define ETM_TRCVDARCCTLR_INCLUDE6_Disabled (0x0UL) /*!< The address range that address range comparator 6 defines, is not
                                                          selected for ViewData include control.*/                                
  #define ETM_TRCVDARCCTLR_INCLUDE6_Enabled (0x1UL)  /*!< The address range that address range comparator 6 defines, is selected
                                                          for ViewData include control.*/                                         

/* INCLUDE7 @Bit 7 : Include range field. Selects which address range comparator pairs are in use with ViewData include control.
                     */                                                                                                           
                                                                                                                                  
  #define ETM_TRCVDARCCTLR_INCLUDE7_Pos (7UL)        /*!< Position of INCLUDE7 field.                                          */
  #define ETM_TRCVDARCCTLR_INCLUDE7_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE7_Pos) /*!< Bit mask of INCLUDE7 field.              */
  #define ETM_TRCVDARCCTLR_INCLUDE7_Min (0x0UL)      /*!< Min enumerator value of INCLUDE7 field.                              */
  #define ETM_TRCVDARCCTLR_INCLUDE7_Max (0x1UL)      /*!< Max enumerator value of INCLUDE7 field.                              */
  #define ETM_TRCVDARCCTLR_INCLUDE7_Disabled (0x0UL) /*!< The address range that address range comparator 7 defines, is not
                                                          selected for ViewData include control.*/                                
  #define ETM_TRCVDARCCTLR_INCLUDE7_Enabled (0x1UL)  /*!< The address range that address range comparator 7 defines, is selected
                                                          for ViewData include control.*/                                         

/* EXCLUDE0 @Bit 16 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude
                      control. */                                                                                                 
                                                                                                                                  
  #define ETM_TRCVDARCCTLR_EXCLUDE0_Pos (16UL)       /*!< Position of EXCLUDE0 field.                                          */
  #define ETM_TRCVDARCCTLR_EXCLUDE0_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE0_Pos) /*!< Bit mask of EXCLUDE0 field.              */
  #define ETM_TRCVDARCCTLR_EXCLUDE0_Min (0x0UL)      /*!< Min enumerator value of EXCLUDE0 field.                              */
  #define ETM_TRCVDARCCTLR_EXCLUDE0_Max (0x1UL)      /*!< Max enumerator value of EXCLUDE0 field.                              */
  #define ETM_TRCVDARCCTLR_EXCLUDE0_Disabled (0x0UL) /*!< The address range that address range comparator 0 defines, is not
                                                          selected for ViewData exclude control.*/                                
  #define ETM_TRCVDARCCTLR_EXCLUDE0_Enabled (0x1UL)  /*!< The address range that address range comparator 0 defines, s selected
                                                          for ViewData exclude control.*/                                         

