adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EXCLUDE1 @Bit 17 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude
                      control. */                                                                                                 
                                                                                                                                  
  #define ETM_TRCVDARCCTLR_EXCLUDE1_Pos (17UL)       /*!< Position of EXCLUDE1 field.                                          */
  #define ETM_TRCVDARCCTLR_EXCLUDE1_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE1_Pos) /*!< Bit mask of EXCLUDE1 field.              */
  #define ETM_TRCVDARCCTLR_EXCLUDE1_Min (0x0UL)      /*!< Min enumerator value of EXCLUDE1 field.                              */
  #define ETM_TRCVDARCCTLR_EXCLUDE1_Max (0x1UL)      /*!< Max enumerator value of EXCLUDE1 field.                              */
  #define ETM_TRCVDARCCTLR_EXCLUDE1_Disabled (0x0UL) /*!< The address range that address range comparator 1 defines, is not
                                                          selected for ViewData exclude control.*/                                
  #define ETM_TRCVDARCCTLR_EXCLUDE1_Enabled (0x1UL)  /*!< The address range that address range comparator 1 defines, s selected
                                                          for ViewData exclude control.*/                                         

/* EXCLUDE2 @Bit 18 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude
                      control. */                                                                                                 
                                                                                                                                  
  #define ETM_TRCVDARCCTLR_EXCLUDE2_Pos (18UL)       /*!< Position of EXCLUDE2 field.                                          */
  #define ETM_TRCVDARCCTLR_EXCLUDE2_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE2_Pos) /*!< Bit mask of EXCLUDE2 field.              */
  #define ETM_TRCVDARCCTLR_EXCLUDE2_Min (0x0UL)      /*!< Min enumerator value of EXCLUDE2 field.                              */
  #define ETM_TRCVDARCCTLR_EXCLUDE2_Max (0x1UL)      /*!< Max enumerator value of EXCLUDE2 field.                              */
  #define ETM_TRCVDARCCTLR_EXCLUDE2_Disabled (0x0UL) /*!< The address range that address range comparator 2 defines, is not
                                                          selected for ViewData exclude control.*/                                
  #define ETM_TRCVDARCCTLR_EXCLUDE2_Enabled (0x1UL)  /*!< The address range that address range comparator 2 defines, s selected
                                                          for ViewData exclude control.*/                                         

/* EXCLUDE3 @Bit 19 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude
                      control. */                                                                                                 
                                                                                                                                  
  #define ETM_TRCVDARCCTLR_EXCLUDE3_Pos (19UL)       /*!< Position of EXCLUDE3 field.                                          */
  #define ETM_TRCVDARCCTLR_EXCLUDE3_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE3_Pos) /*!< Bit mask of EXCLUDE3 field.              */
  #define ETM_TRCVDARCCTLR_EXCLUDE3_Min (0x0UL)      /*!< Min enumerator value of EXCLUDE3 field.                              */
  #define ETM_TRCVDARCCTLR_EXCLUDE3_Max (0x1UL)      /*!< Max enumerator value of EXCLUDE3 field.                              */
  #define ETM_TRCVDARCCTLR_EXCLUDE3_Disabled (0x0UL) /*!< The address range that address range comparator 3 defines, is not
                                                          selected for ViewData exclude control.*/                                
  #define ETM_TRCVDARCCTLR_EXCLUDE3_Enabled (0x1UL)  /*!< The address range that address range comparator 3 defines, s selected
                                                          for ViewData exclude control.*/                                         

/* EXCLUDE4 @Bit 20 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude
                      control. */                                                                                                 
                                                                                                                                  
  #define ETM_TRCVDARCCTLR_EXCLUDE4_Pos (20UL)       /*!< Position of EXCLUDE4 field.                                          */
  #define ETM_TRCVDARCCTLR_EXCLUDE4_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE4_Pos) /*!< Bit mask of EXCLUDE4 field.              */
  #define ETM_TRCVDARCCTLR_EXCLUDE4_Min (0x0UL)      /*!< Min enumerator value of EXCLUDE4 field.                              */
  #define ETM_TRCVDARCCTLR_EXCLUDE4_Max (0x1UL)      /*!< Max enumerator value of EXCLUDE4 field.                              */
  #define ETM_TRCVDARCCTLR_EXCLUDE4_Disabled (0x0UL) /*!< The address range that address range comparator 4 defines, is not
                                                          selected for ViewData exclude control.*/                                
  #define ETM_TRCVDARCCTLR_EXCLUDE4_Enabled (0x1UL)  /*!< The address range that address range comparator 4 defines, s selected
                                                          for ViewData exclude control.*/                                         

/* EXCLUDE5 @Bit 21 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude
                      control. */                                                                                                 
                                                                                                                                  
  #define ETM_TRCVDARCCTLR_EXCLUDE5_Pos (21UL)       /*!< Position of EXCLUDE5 field.                                          */
  #define ETM_TRCVDARCCTLR_EXCLUDE5_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE5_Pos) /*!< Bit mask of EXCLUDE5 field.              */
  #define ETM_TRCVDARCCTLR_EXCLUDE5_Min (0x0UL)      /*!< Min enumerator value of EXCLUDE5 field.                              */
  #define ETM_TRCVDARCCTLR_EXCLUDE5_Max (0x1UL)      /*!< Max enumerator value of EXCLUDE5 field.                              */
  #define ETM_TRCVDARCCTLR_EXCLUDE5_Disabled (0x0UL) /*!< The address range that address range comparator 5 defines, is not
                                                          selected for ViewData exclude control.*/                                
  #define ETM_TRCVDARCCTLR_EXCLUDE5_Enabled (0x1UL)  /*!< The address range that address range comparator 5 defines, s selected
                                                          for ViewData exclude control.*/                                         

/* EXCLUDE6 @Bit 22 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude
                      control. */                                                                                                 
                                                                                                                                  
  #define ETM_TRCVDARCCTLR_EXCLUDE6_Pos (22UL)       /*!< Position of EXCLUDE6 field.                                          */
  #define ETM_TRCVDARCCTLR_EXCLUDE6_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE6_Pos) /*!< Bit mask of EXCLUDE6 field.              */
  #define ETM_TRCVDARCCTLR_EXCLUDE6_Min (0x0UL)      /*!< Min enumerator value of EXCLUDE6 field.                              */
  #define ETM_TRCVDARCCTLR_EXCLUDE6_Max (0x1UL)      /*!< Max enumerator value of EXCLUDE6 field.                              */
  #define ETM_TRCVDARCCTLR_EXCLUDE6_Disabled (0x0UL) /*!< The address range that address range comparator 6 defines, is not
                                                          selected for ViewData exclude control.*/                                
  #define ETM_TRCVDARCCTLR_EXCLUDE6_Enabled (0x1UL)  /*!< The address range that address range comparator 6 defines, s selected
                                                          for ViewData exclude control.*/                                         

