adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EXCLUDE7 @Bit 23 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude
                      control. */                                                                                                 
                                                                                                                                  
  #define ETM_TRCVDARCCTLR_EXCLUDE7_Pos (23UL)       /*!< Position of EXCLUDE7 field.                                          */
  #define ETM_TRCVDARCCTLR_EXCLUDE7_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE7_Pos) /*!< Bit mask of EXCLUDE7 field.              */
  #define ETM_TRCVDARCCTLR_EXCLUDE7_Min (0x0UL)      /*!< Min enumerator value of EXCLUDE7 field.                              */
  #define ETM_TRCVDARCCTLR_EXCLUDE7_Max (0x1UL)      /*!< Max enumerator value of EXCLUDE7 field.                              */
  #define ETM_TRCVDARCCTLR_EXCLUDE7_Disabled (0x0UL) /*!< The address range that address range comparator 7 defines, is not
                                                          selected for ViewData exclude control.*/                                
  #define ETM_TRCVDARCCTLR_EXCLUDE7_Enabled (0x1UL)  /*!< The address range that address range comparator 7 defines, s selected
                                                          for ViewData exclude control.*/                                         


/* ETM_TRCSEQEVR: Moves the sequencer state according to programmed events. Might ignore writes when the trace unit is enabled
                   or not idle. When the sequencer is used, all sequencer state transitions must be programmed with a valid
                   event. */                                                                                                      
                                                                                                                                  
  #define ETM_TRCSEQEVR_MaxCount (3UL)               /*!< Max size of TRCSEQEVR[3] array.                                      */
  #define ETM_TRCSEQEVR_ResetValue (0x00000000UL)    /*!< Reset value of TRCSEQEVR[3] register.                                */

/* F0 @Bit 0 : Forward field. */
  #define ETM_TRCSEQEVR_F0_Pos (0UL)                 /*!< Position of F0 field.                                                */
  #define ETM_TRCSEQEVR_F0_Msk (0x1UL << ETM_TRCSEQEVR_F0_Pos) /*!< Bit mask of F0 field.                                      */
  #define ETM_TRCSEQEVR_F0_Min (0x0UL)               /*!< Min enumerator value of F0 field.                                    */
  #define ETM_TRCSEQEVR_F0_Max (0x1UL)               /*!< Max enumerator value of F0 field.                                    */
  #define ETM_TRCSEQEVR_F0_Disabled (0x0UL)          /*!< The trace event does not affect the sequencer.                       */
  #define ETM_TRCSEQEVR_F0_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n to
                                                          state n+1.*/                                                            

/* F1 @Bit 1 : Forward field. */
  #define ETM_TRCSEQEVR_F1_Pos (1UL)                 /*!< Position of F1 field.                                                */
  #define ETM_TRCSEQEVR_F1_Msk (0x1UL << ETM_TRCSEQEVR_F1_Pos) /*!< Bit mask of F1 field.                                      */
  #define ETM_TRCSEQEVR_F1_Min (0x0UL)               /*!< Min enumerator value of F1 field.                                    */
  #define ETM_TRCSEQEVR_F1_Max (0x1UL)               /*!< Max enumerator value of F1 field.                                    */
  #define ETM_TRCSEQEVR_F1_Disabled (0x0UL)          /*!< The trace event does not affect the sequencer.                       */
  #define ETM_TRCSEQEVR_F1_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n to
                                                          state n+1.*/                                                            

/* F2 @Bit 2 : Forward field. */
  #define ETM_TRCSEQEVR_F2_Pos (2UL)                 /*!< Position of F2 field.                                                */
  #define ETM_TRCSEQEVR_F2_Msk (0x1UL << ETM_TRCSEQEVR_F2_Pos) /*!< Bit mask of F2 field.                                      */
  #define ETM_TRCSEQEVR_F2_Min (0x0UL)               /*!< Min enumerator value of F2 field.                                    */
  #define ETM_TRCSEQEVR_F2_Max (0x1UL)               /*!< Max enumerator value of F2 field.                                    */
  #define ETM_TRCSEQEVR_F2_Disabled (0x0UL)          /*!< The trace event does not affect the sequencer.                       */
  #define ETM_TRCSEQEVR_F2_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n to
                                                          state n+1.*/                                                            

/* F3 @Bit 3 : Forward field. */
  #define ETM_TRCSEQEVR_F3_Pos (3UL)                 /*!< Position of F3 field.                                                */
  #define ETM_TRCSEQEVR_F3_Msk (0x1UL << ETM_TRCSEQEVR_F3_Pos) /*!< Bit mask of F3 field.                                      */
  #define ETM_TRCSEQEVR_F3_Min (0x0UL)               /*!< Min enumerator value of F3 field.                                    */
  #define ETM_TRCSEQEVR_F3_Max (0x1UL)               /*!< Max enumerator value of F3 field.                                    */
  #define ETM_TRCSEQEVR_F3_Disabled (0x0UL)          /*!< The trace event does not affect the sequencer.                       */
  #define ETM_TRCSEQEVR_F3_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n to
                                                          state n+1.*/                                                            

/* F4 @Bit 4 : Forward field. */
  #define ETM_TRCSEQEVR_F4_Pos (4UL)                 /*!< Position of F4 field.                                                */
  #define ETM_TRCSEQEVR_F4_Msk (0x1UL << ETM_TRCSEQEVR_F4_Pos) /*!< Bit mask of F4 field.                                      */
  #define ETM_TRCSEQEVR_F4_Min (0x0UL)               /*!< Min enumerator value of F4 field.                                    */
  #define ETM_TRCSEQEVR_F4_Max (0x1UL)               /*!< Max enumerator value of F4 field.                                    */
  #define ETM_TRCSEQEVR_F4_Disabled (0x0UL)          /*!< The trace event does not affect the sequencer.                       */
  #define ETM_TRCSEQEVR_F4_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n to
                                                          state n+1.*/                                                            

/* F5 @Bit 5 : Forward field. */
  #define ETM_TRCSEQEVR_F5_Pos (5UL)                 /*!< Position of F5 field.                                                */
  #define ETM_TRCSEQEVR_F5_Msk (0x1UL << ETM_TRCSEQEVR_F5_Pos) /*!< Bit mask of F5 field.                                      */
  #define ETM_TRCSEQEVR_F5_Min (0x0UL)               /*!< Min enumerator value of F5 field.                                    */
  #define ETM_TRCSEQEVR_F5_Max (0x1UL)               /*!< Max enumerator value of F5 field.                                    */
  #define ETM_TRCSEQEVR_F5_Disabled (0x0UL)          /*!< The trace event does not affect the sequencer.                       */
  #define ETM_TRCSEQEVR_F5_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n to
                                                          state n+1.*/                                                            

/* F6 @Bit 6 : Forward field. */
  #define ETM_TRCSEQEVR_F6_Pos (6UL)                 /*!< Position of F6 field.                                                */
  #define ETM_TRCSEQEVR_F6_Msk (0x1UL << ETM_TRCSEQEVR_F6_Pos) /*!< Bit mask of F6 field.                                      */
  #define ETM_TRCSEQEVR_F6_Min (0x0UL)               /*!< Min enumerator value of F6 field.                                    */
  #define ETM_TRCSEQEVR_F6_Max (0x1UL)               /*!< Max enumerator value of F6 field.                                    */
  #define ETM_TRCSEQEVR_F6_Disabled (0x0UL)          /*!< The trace event does not affect the sequencer.                       */
  #define ETM_TRCSEQEVR_F6_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n to
                                                          state n+1.*/                                                            

/* F7 @Bit 7 : Forward field. */
  #define ETM_TRCSEQEVR_F7_Pos (7UL)                 /*!< Position of F7 field.                                                */
  #define ETM_TRCSEQEVR_F7_Msk (0x1UL << ETM_TRCSEQEVR_F7_Pos) /*!< Bit mask of F7 field.                                      */
  #define ETM_TRCSEQEVR_F7_Min (0x0UL)               /*!< Min enumerator value of F7 field.                                    */
  #define ETM_TRCSEQEVR_F7_Max (0x1UL)               /*!< Max enumerator value of F7 field.                                    */
  #define ETM_TRCSEQEVR_F7_Disabled (0x0UL)          /*!< The trace event does not affect the sequencer.                       */
  #define ETM_TRCSEQEVR_F7_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n to
                                                          state n+1.*/                                                            

/* B0 @Bit 8 : Backward field. */
  #define ETM_TRCSEQEVR_B0_Pos (8UL)                 /*!< Position of B0 field.                                                */
  #define ETM_TRCSEQEVR_B0_Msk (0x1UL << ETM_TRCSEQEVR_B0_Pos) /*!< Bit mask of B0 field.                                      */
  #define ETM_TRCSEQEVR_B0_Min (0x0UL)               /*!< Min enumerator value of B0 field.                                    */
  #define ETM_TRCSEQEVR_B0_Max (0x1UL)               /*!< Max enumerator value of B0 field.                                    */
  #define ETM_TRCSEQEVR_B0_Disabled (0x0UL)          /*!< The trace event does not affect the sequencer.                       */
  #define ETM_TRCSEQEVR_B0_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n+1 to
                                                          state n.*/                                                              

/* B1 @Bit 9 : Backward field. */
  #define ETM_TRCSEQEVR_B1_Pos (9UL)                 /*!< Position of B1 field.                                                */
  #define ETM_TRCSEQEVR_B1_Msk (0x1UL << ETM_TRCSEQEVR_B1_Pos) /*!< Bit mask of B1 field.                                      */
  #define ETM_TRCSEQEVR_B1_Min (0x0UL)               /*!< Min enumerator value of B1 field.                                    */
  #define ETM_TRCSEQEVR_B1_Max (0x1UL)               /*!< Max enumerator value of B1 field.                                    */
  #define ETM_TRCSEQEVR_B1_Disabled (0x0UL)          /*!< The trace event does not affect the sequencer.                       */
  #define ETM_TRCSEQEVR_B1_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n+1 to
                                                          state n.*/                                                              

/* B2 @Bit 10 : Backward field. */
  #define ETM_TRCSEQEVR_B2_Pos (10UL)                /*!< Position of B2 field.                                                */
  #define ETM_TRCSEQEVR_B2_Msk (0x1UL << ETM_TRCSEQEVR_B2_Pos) /*!< Bit mask of B2 field.                                      */
  #define ETM_TRCSEQEVR_B2_Min (0x0UL)               /*!< Min enumerator value of B2 field.                                    */
  #define ETM_TRCSEQEVR_B2_Max (0x1UL)               /*!< Max enumerator value of B2 field.                                    */
  #define ETM_TRCSEQEVR_B2_Disabled (0x0UL)          /*!< The trace event does not affect the sequencer.                       */
  #define ETM_TRCSEQEVR_B2_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n+1 to
                                                          state n.*/                                                              

/* B3 @Bit 11 : Backward field. */
  #define ETM_TRCSEQEVR_B3_Pos (11UL)                /*!< Position of B3 field.                                                */
  #define ETM_TRCSEQEVR_B3_Msk (0x1UL << ETM_TRCSEQEVR_B3_Pos) /*!< Bit mask of B3 field.                                      */
  #define ETM_TRCSEQEVR_B3_Min (0x0UL)               /*!< Min enumerator value of B3 field.                                    */
  #define ETM_TRCSEQEVR_B3_Max (0x1UL)               /*!< Max enumerator value of B3 field.                                    */
  #define ETM_TRCSEQEVR_B3_Disabled (0x0UL)          /*!< The trace event does not affect the sequencer.                       */
  #define ETM_TRCSEQEVR_B3_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n+1 to
                                                          state n.*/                                                              

/* B4 @Bit 12 : Backward field. */
  #define ETM_TRCSEQEVR_B4_Pos (12UL)                /*!< Position of B4 field.                                                */
  #define ETM_TRCSEQEVR_B4_Msk (0x1UL << ETM_TRCSEQEVR_B4_Pos) /*!< Bit mask of B4 field.                                      */
  #define ETM_TRCSEQEVR_B4_Min (0x0UL)               /*!< Min enumerator value of B4 field.                                    */
  #define ETM_TRCSEQEVR_B4_Max (0x1UL)               /*!< Max enumerator value of B4 field.                                    */
  #define ETM_TRCSEQEVR_B4_Disabled (0x0UL)          /*!< The trace event does not affect the sequencer.                       */
  #define ETM_TRCSEQEVR_B4_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n+1 to
                                                          state n.*/                                                              

/* B5 @Bit 13 : Backward field. */
  #define ETM_TRCSEQEVR_B5_Pos (13UL)                /*!< Position of B5 field.                                                */
  #define ETM_TRCSEQEVR_B5_Msk (0x1UL << ETM_TRCSEQEVR_B5_Pos) /*!< Bit mask of B5 field.                                      */
  #define ETM_TRCSEQEVR_B5_Min (0x0UL)               /*!< Min enumerator value of B5 field.                                    */
  #define ETM_TRCSEQEVR_B5_Max (0x1UL)               /*!< Max enumerator value of B5 field.                                    */
  #define ETM_TRCSEQEVR_B5_Disabled (0x0UL)          /*!< The trace event does not affect the sequencer.                       */
  #define ETM_TRCSEQEVR_B5_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n+1 to
                                                          state n.*/                                                              

/* B6 @Bit 14 : Backward field. */
  #define ETM_TRCSEQEVR_B6_Pos (14UL)                /*!< Position of B6 field.                                                */
  #define ETM_TRCSEQEVR_B6_Msk (0x1UL << ETM_TRCSEQEVR_B6_Pos) /*!< Bit mask of B6 field.                                      */
  #define ETM_TRCSEQEVR_B6_Min (0x0UL)               /*!< Min enumerator value of B6 field.                                    */
  #define ETM_TRCSEQEVR_B6_Max (0x1UL)               /*!< Max enumerator value of B6 field.                                    */
  #define ETM_TRCSEQEVR_B6_Disabled (0x0UL)          /*!< The trace event does not affect the sequencer.                       */
  #define ETM_TRCSEQEVR_B6_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n+1 to
                                                          state n.*/                                                              

/* B7 @Bit 15 : Backward field. */
  #define ETM_TRCSEQEVR_B7_Pos (15UL)                /*!< Position of B7 field.                                                */
  #define ETM_TRCSEQEVR_B7_Msk (0x1UL << ETM_TRCSEQEVR_B7_Pos) /*!< Bit mask of B7 field.                                      */
  #define ETM_TRCSEQEVR_B7_Min (0x0UL)               /*!< Min enumerator value of B7 field.                                    */
  #define ETM_TRCSEQEVR_B7_Max (0x1UL)               /*!< Max enumerator value of B7 field.                                    */
  #define ETM_TRCSEQEVR_B7_Disabled (0x0UL)          /*!< The trace event does not affect the sequencer.                       */
  #define ETM_TRCSEQEVR_B7_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n+1 to
                                                          state n.*/                                                              


/* ETM_TRCSEQRSTEVR: Moves the sequencer to state 0 when a programmed event occurs. Might ignore writes when the trace unit is
                      enabled or not idle. When the sequencer is used, all sequencer state transitions must be programmed with a
                      valid event. */                                                                                             
                                                                                                                                  
  #define ETM_TRCSEQRSTEVR_ResetValue (0x00000000UL) /*!< Reset value of TRCSEQRSTEVR register.                                */

/* EVENT @Bits 0..7 : Select which event should reset the sequencer. */
  #define ETM_TRCSEQRSTEVR_EVENT_Pos (0UL)           /*!< Position of EVENT field.                                             */
  #define ETM_TRCSEQRSTEVR_EVENT_Msk (0xFFUL << ETM_TRCSEQRSTEVR_EVENT_Pos) /*!< Bit mask of EVENT field.                      */
  #define ETM_TRCSEQRSTEVR_EVENT_Min (0x0UL)         /*!< Min value of EVENT field.                                            */
  #define ETM_TRCSEQRSTEVR_EVENT_Max (0xFFUL)        /*!< Max size of EVENT field.                                             */


