adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ETM_TRCDEVARCH: The TRCDEVARCH identifies ETM-M33 as an ETMv4.2 component */
  #define ETM_TRCDEVARCH_ResetValue (0x00000000UL)   /*!< Reset value of TRCDEVARCH register.                                  */

/* ARCHID @Bits 0..15 : Architecture ID */
  #define ETM_TRCDEVARCH_ARCHID_Pos (0UL)            /*!< Position of ARCHID field.                                            */
  #define ETM_TRCDEVARCH_ARCHID_Msk (0xFFFFUL << ETM_TRCDEVARCH_ARCHID_Pos) /*!< Bit mask of ARCHID field.                     */
  #define ETM_TRCDEVARCH_ARCHID_Min (0x4A13UL)       /*!< Min enumerator value of ARCHID field.                                */
  #define ETM_TRCDEVARCH_ARCHID_Max (0x4A13UL)       /*!< Max enumerator value of ARCHID field.                                */
  #define ETM_TRCDEVARCH_ARCHID_ETMv42 (0x4A13UL)    /*!< Component is an ETMv4 component                                      */

/* REVISION @Bits 16..19 : Architecture revision */
  #define ETM_TRCDEVARCH_REVISION_Pos (16UL)         /*!< Position of REVISION field.                                          */
  #define ETM_TRCDEVARCH_REVISION_Msk (0xFUL << ETM_TRCDEVARCH_REVISION_Pos) /*!< Bit mask of REVISION field.                  */
  #define ETM_TRCDEVARCH_REVISION_Min (0x2UL)        /*!< Min enumerator value of REVISION field.                              */
  #define ETM_TRCDEVARCH_REVISION_Max (0x2UL)        /*!< Max enumerator value of REVISION field.                              */
  #define ETM_TRCDEVARCH_REVISION_v2 (0x2UL)         /*!< Component is part of architecture 4.2                                */

/* PRESENT @Bit 20 : This register is implemented */
  #define ETM_TRCDEVARCH_PRESENT_Pos (20UL)          /*!< Position of PRESENT field.                                           */
  #define ETM_TRCDEVARCH_PRESENT_Msk (0x1UL << ETM_TRCDEVARCH_PRESENT_Pos) /*!< Bit mask of PRESENT field.                     */
  #define ETM_TRCDEVARCH_PRESENT_Min (0x0UL)         /*!< Min enumerator value of PRESENT field.                               */
  #define ETM_TRCDEVARCH_PRESENT_Max (0x1UL)         /*!< Max enumerator value of PRESENT field.                               */
  #define ETM_TRCDEVARCH_PRESENT_Absent (0x0UL)      /*!< The register is not implemented.                                     */
  #define ETM_TRCDEVARCH_PRESENT_Present (0x1UL)     /*!< The register is implemented.                                         */

/* ARCHITECT @Bits 21..31 : Defines the architect of the component */
  #define ETM_TRCDEVARCH_ARCHITECT_Pos (21UL)        /*!< Position of ARCHITECT field.                                         */
  #define ETM_TRCDEVARCH_ARCHITECT_Msk (0x7FFUL << ETM_TRCDEVARCH_ARCHITECT_Pos) /*!< Bit mask of ARCHITECT field.             */
  #define ETM_TRCDEVARCH_ARCHITECT_Min (0x23BUL)     /*!< Min enumerator value of ARCHITECT field.                             */
  #define ETM_TRCDEVARCH_ARCHITECT_Max (0x23BUL)     /*!< Max enumerator value of ARCHITECT field.                             */
  #define ETM_TRCDEVARCH_ARCHITECT_Arm (0x23BUL)     /*!< This peripheral was architected by Arm.                              */


/* ETM_TRCDEVTYPE: Controls the single-shot comparator. */
  #define ETM_TRCDEVTYPE_ResetValue (0x00000000UL)   /*!< Reset value of TRCDEVTYPE register.                                  */

/* MAJOR @Bits 0..3 : The main type of the component */
  #define ETM_TRCDEVTYPE_MAJOR_Pos (0UL)             /*!< Position of MAJOR field.                                             */
  #define ETM_TRCDEVTYPE_MAJOR_Msk (0xFUL << ETM_TRCDEVTYPE_MAJOR_Pos) /*!< Bit mask of MAJOR field.                           */
  #define ETM_TRCDEVTYPE_MAJOR_Min (0x3UL)           /*!< Min enumerator value of MAJOR field.                                 */
  #define ETM_TRCDEVTYPE_MAJOR_Max (0x3UL)           /*!< Max enumerator value of MAJOR field.                                 */
  #define ETM_TRCDEVTYPE_MAJOR_TraceSource (0x3UL)   /*!< Peripheral is a trace source.                                        */

/* SUB @Bits 4..7 : The sub-type of the component */
  #define ETM_TRCDEVTYPE_SUB_Pos (4UL)               /*!< Position of SUB field.                                               */
  #define ETM_TRCDEVTYPE_SUB_Msk (0xFUL << ETM_TRCDEVTYPE_SUB_Pos) /*!< Bit mask of SUB field.                                 */
  #define ETM_TRCDEVTYPE_SUB_Min (0x1UL)             /*!< Min enumerator value of SUB field.                                   */
  #define ETM_TRCDEVTYPE_SUB_Max (0x1UL)             /*!< Max enumerator value of SUB field.                                   */
  #define ETM_TRCDEVTYPE_SUB_ProcessorTrace (0x1UL)  /*!< Peripheral is a processor trace source.                              */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           EXMEE                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================== Struct EXMEE_PAGE_UNENCRYPTED ============================================== */
/**
  * @brief UNENCRYPTED [EXMEE_PAGE_UNENCRYPTED] Unencrypted memory access page. This area of memory provides an unencrypted page
            into the secure memory region.                                                                                        
                                                                                                                                  
  */
typedef struct {
  __IOM uint32_t  START;                             /*!< (@ 0x00000000) Start address for input memory page                   */
  __IOM uint32_t  END;                               /*!< (@ 0x00000004) End address for input memory page                     */
} NRF_EXMEE_PAGE_UNENCRYPTED_Type;                   /*!< Size = 8 (0x008)                                                     */

/* EXMEE_PAGE_UNENCRYPTED_START: Start address for input memory page */
  #define EXMEE_PAGE_UNENCRYPTED_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                           */

/* ADDRESS @Bits 0..31 : Start address of page */
  #define EXMEE_PAGE_UNENCRYPTED_START_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                       */
  #define EXMEE_PAGE_UNENCRYPTED_START_ADDRESS_Msk (0xFFFFFFFFUL << EXMEE_PAGE_UNENCRYPTED_START_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/                                      


/* EXMEE_PAGE_UNENCRYPTED_END: End address for input memory page */
  #define EXMEE_PAGE_UNENCRYPTED_END_ResetValue (0x00000000UL) /*!< Reset value of END register.                               */

