adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ADDRESS @Bits 0..31 : End address of page */
  #define EXMEE_PAGE_UNENCRYPTED_END_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                         */
  #define EXMEE_PAGE_UNENCRYPTED_END_ADDRESS_Msk (0xFFFFFFFFUL << EXMEE_PAGE_UNENCRYPTED_END_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/                                      



/* =============================================== Struct EXMEE_PAGE_ENCRYPTED =============================================== */
/**
  * @brief ENCRYPTED [EXMEE_PAGE_ENCRYPTED] Secure memory access page. This area of memory stores the encrypted data.
  */
typedef struct {
  __IOM uint32_t  START;                             /*!< (@ 0x00000000) Start address for output memory page                  */
  __IOM uint32_t  END;                               /*!< (@ 0x00000004) End address for output memory page                    */
} NRF_EXMEE_PAGE_ENCRYPTED_Type;                     /*!< Size = 8 (0x008)                                                     */

/* EXMEE_PAGE_ENCRYPTED_START: Start address for output memory page */
  #define EXMEE_PAGE_ENCRYPTED_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                             */

/* ADDRESS @Bits 0..31 : Start address of page */
  #define EXMEE_PAGE_ENCRYPTED_START_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                         */
  #define EXMEE_PAGE_ENCRYPTED_START_ADDRESS_Msk (0xFFFFFFFFUL << EXMEE_PAGE_ENCRYPTED_START_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/                                      


/* EXMEE_PAGE_ENCRYPTED_END: End address for output memory page */
  #define EXMEE_PAGE_ENCRYPTED_END_ResetValue (0x00000000UL) /*!< Reset value of END register.                                 */

/* ADDRESS @Bits 0..31 : End address of page */
  #define EXMEE_PAGE_ENCRYPTED_END_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                           */
  #define EXMEE_PAGE_ENCRYPTED_END_ADDRESS_Msk (0xFFFFFFFFUL << EXMEE_PAGE_ENCRYPTED_END_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/                                              



/* ==================================================== Struct EXMEE_PAGE ==================================================== */
/**
  * @brief PAGE [EXMEE_PAGE] Memory pages the EXMEE works on
  */
typedef struct {
  __IOM NRF_EXMEE_PAGE_UNENCRYPTED_Type UNENCRYPTED; /*!< (@ 0x00000000) Unencrypted memory access page. This area of memory
                                                                         provides an unencrypted page into the secure memory
                                                                         region.*/                                                
  __IOM NRF_EXMEE_PAGE_ENCRYPTED_Type ENCRYPTED;     /*!< (@ 0x00000008) Secure memory access page. This area of memory stores
                                                                         the encrypted data.*/                                    
} NRF_EXMEE_PAGE_Type;                               /*!< Size = 16 (0x010)                                                    */


/* ================================================ Struct EXMEE_TRANSACTION ================================================= */
/**
  * @brief TRANSACTION [EXMEE_TRANSACTION] Information about the currently processed transaction
  */
typedef struct {
  __IM  uint32_t  ADDRESS;                           /*!< (@ 0x00000000) Target address in external memory of the currently
                                                                         processed AXI transaction*/                              
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  COUNTER[2];                        /*!< (@ 0x00000008) 64 bit write counter                                  */
  __IM  uint32_t  PLAINTEXT[4];                      /*!< (@ 0x00000010) 128 bit plaintext register.                           */
  __IM  uint32_t  CIPHERTEXT[4];                     /*!< (@ 0x00000020) 128 bit ciphertext register.                          */
  __IOM uint32_t  NONCE[4];                          /*!< (@ 0x00000030) 128 bit nonce register.                               */
} NRF_EXMEE_TRANSACTION_Type;                        /*!< Size = 64 (0x040)                                                    */

/* EXMEE_TRANSACTION_ADDRESS: Target address in external memory of the currently processed AXI transaction */
  #define EXMEE_TRANSACTION_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                            */

/* ADDRESS @Bit 0 : Address in EXMIF */
  #define EXMEE_TRANSACTION_ADDRESS_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                          */
  #define EXMEE_TRANSACTION_ADDRESS_ADDRESS_Msk (0x1UL << EXMEE_TRANSACTION_ADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/                                              


/* EXMEE_TRANSACTION_COUNTER: 64 bit write counter */
  #define EXMEE_TRANSACTION_COUNTER_MaxCount (2UL)   /*!< Max size of COUNTER[2] array.                                        */
  #define EXMEE_TRANSACTION_COUNTER_ResetValue (0x00000000UL) /*!< Reset value of COUNTER[2] register.                         */

/* COUNTER @Bits 0..31 : The n-th word of the 64 bit counter value */
  #define EXMEE_TRANSACTION_COUNTER_COUNTER_Pos (0UL) /*!< Position of COUNTER field.                                          */
  #define EXMEE_TRANSACTION_COUNTER_COUNTER_Msk (0xFFFFFFFFUL << EXMEE_TRANSACTION_COUNTER_COUNTER_Pos) /*!< Bit mask of COUNTER
                                                                            field.*/                                              


/* EXMEE_TRANSACTION_PLAINTEXT: 128 bit plaintext register. */
  #define EXMEE_TRANSACTION_PLAINTEXT_MaxCount (4UL) /*!< Max size of PLAINTEXT[4] array.                                      */
  #define EXMEE_TRANSACTION_PLAINTEXT_ResetValue (0x00000000UL) /*!< Reset value of PLAINTEXT[4] register.                     */

/* WORD @Bits 0..31 : The n-th word of the 128 bit plaintext input */
  #define EXMEE_TRANSACTION_PLAINTEXT_WORD_Pos (0UL) /*!< Position of WORD field.                                              */
  #define EXMEE_TRANSACTION_PLAINTEXT_WORD_Msk (0xFFFFFFFFUL << EXMEE_TRANSACTION_PLAINTEXT_WORD_Pos) /*!< Bit mask of WORD
                                                                            field.*/                                              


/* EXMEE_TRANSACTION_CIPHERTEXT: 128 bit ciphertext register. */
  #define EXMEE_TRANSACTION_CIPHERTEXT_MaxCount (4UL) /*!< Max size of CIPHERTEXT[4] array.                                    */
  #define EXMEE_TRANSACTION_CIPHERTEXT_ResetValue (0x00000000UL) /*!< Reset value of CIPHERTEXT[4] register.                   */

