adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* WORD @Bits 0..31 : The n-th word of the 128 bit ciphertext input */
  #define EXMEE_TRANSACTION_CIPHERTEXT_WORD_Pos (0UL) /*!< Position of WORD field.                                             */
  #define EXMEE_TRANSACTION_CIPHERTEXT_WORD_Msk (0xFFFFFFFFUL << EXMEE_TRANSACTION_CIPHERTEXT_WORD_Pos) /*!< Bit mask of WORD
                                                                            field.*/                                              


/* EXMEE_TRANSACTION_NONCE: 128 bit nonce register. */
  #define EXMEE_TRANSACTION_NONCE_MaxCount (4UL)     /*!< Max size of NONCE[4] array.                                          */
  #define EXMEE_TRANSACTION_NONCE_ResetValue (0x00000000UL) /*!< Reset value of NONCE[4] register.                             */

/* WORD @Bits 0..31 : The n-th word of the 128 bit nonce input */
  #define EXMEE_TRANSACTION_NONCE_WORD_Pos (0UL)     /*!< Position of WORD field.                                              */
  #define EXMEE_TRANSACTION_NONCE_WORD_Msk (0xFFFFFFFFUL << EXMEE_TRANSACTION_NONCE_WORD_Pos) /*!< Bit mask of WORD field.     */



/* =================================================== Struct EXMEE_REGION =================================================== */
/**
  * @brief REGION [EXMEE_REGION] Encryption region n
  */
typedef struct {
  __IOM uint32_t  START;                             /*!< (@ 0x00000000) Start offset relative to memory window for encryption
                                                                         region n*/                                               
  __IOM uint32_t  END;                               /*!< (@ 0x00000004) End offset relative to memory window for encryption
                                                                         region n*/                                               
  __IOM uint32_t  COUNTER;                           /*!< (@ 0x00000008) Address offset where the write counters for encryption
                                                                         region n should be stored*/                              
  __IOM uint32_t  NONCEMODE;                         /*!< (@ 0x0000000C) Nonce mode for encryption region n                    */
  __OM  uint32_t  KEY[4];                            /*!< (@ 0x00000010) 128b key for encryption region n                      */
} NRF_EXMEE_REGION_Type;                             /*!< Size = 32 (0x020)                                                    */
  #define EXMEE_REGION_MaxCount (16UL)               /*!< Max size of REGION[16] array.                                        */

/* EXMEE_REGION_START: Start offset relative to memory window for encryption region n */
  #define EXMEE_REGION_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                                     */

/* OFFSET @Bits 0..31 : Start offset of encryption region */
  #define EXMEE_REGION_START_OFFSET_Pos (0UL)        /*!< Position of OFFSET field.                                            */
  #define EXMEE_REGION_START_OFFSET_Msk (0xFFFFFFFFUL << EXMEE_REGION_START_OFFSET_Pos) /*!< Bit mask of OFFSET field.         */


/* EXMEE_REGION_END: End offset relative to memory window for encryption region n */
  #define EXMEE_REGION_END_ResetValue (0x00000000UL) /*!< Reset value of END register.                                         */

/* OFFSET @Bits 0..31 : End offset of encryption region */
  #define EXMEE_REGION_END_OFFSET_Pos (0UL)          /*!< Position of OFFSET field.                                            */
  #define EXMEE_REGION_END_OFFSET_Msk (0xFFFFFFFFUL << EXMEE_REGION_END_OFFSET_Pos) /*!< Bit mask of OFFSET field.             */


/* EXMEE_REGION_COUNTER: Address offset where the write counters for encryption region n should be stored */
  #define EXMEE_REGION_COUNTER_ResetValue (0x00000000UL) /*!< Reset value of COUNTER register.                                 */

/* OFFSET @Bits 0..31 : Counter offset of encryption region */
  #define EXMEE_REGION_COUNTER_OFFSET_Pos (0UL)      /*!< Position of OFFSET field.                                            */
  #define EXMEE_REGION_COUNTER_OFFSET_Msk (0xFFFFFFFFUL << EXMEE_REGION_COUNTER_OFFSET_Pos) /*!< Bit mask of OFFSET field.     */


/* EXMEE_REGION_NONCEMODE: Nonce mode for encryption region n */
  #define EXMEE_REGION_NONCEMODE_ResetValue (0x00000000UL) /*!< Reset value of NONCEMODE register.                             */

/* MODE @Bit 0 : Nonce mode for encryption region. This register enables the EVENTS_NONCEREADY to TASKS_START shortcut */
  #define EXMEE_REGION_NONCEMODE_MODE_Pos (0UL)      /*!< Position of MODE field.                                              */
  #define EXMEE_REGION_NONCEMODE_MODE_Msk (0x1UL << EXMEE_REGION_NONCEMODE_MODE_Pos) /*!< Bit mask of MODE field.              */
  #define EXMEE_REGION_NONCEMODE_MODE_Min (0x0UL)    /*!< Min enumerator value of MODE field.                                  */
  #define EXMEE_REGION_NONCEMODE_MODE_Max (0x1UL)    /*!< Max enumerator value of MODE field.                                  */
  #define EXMEE_REGION_NONCEMODE_MODE_AUTO (0x0UL)   /*!< EXMEE does not wait before reading NONCE register                    */
  #define EXMEE_REGION_NONCEMODE_MODE_WAIT (0x1UL)   /*!< EXMEE waits for TASKS_START before reading NONCE register            */


/* EXMEE_REGION_KEY: 128b key for encryption region n */
  #define EXMEE_REGION_KEY_MaxCount (4UL)            /*!< Max size of KEY[4] array.                                            */
  #define EXMEE_REGION_KEY_ResetValue (0x00000000UL) /*!< Reset value of KEY[4] register.                                      */

/* WORD @Bits 0..31 : The o-th word of the 128b key */
  #define EXMEE_REGION_KEY_WORD_Pos (0UL)            /*!< Position of WORD field.                                              */
  #define EXMEE_REGION_KEY_WORD_Msk (0xFFFFFFFFUL << EXMEE_REGION_KEY_WORD_Pos) /*!< Bit mask of WORD field.                   */


/* ====================================================== Struct EXMEE ======================================================= */
/**
  * @brief EXternal Memory Encryption Engine
  */
  typedef struct {                                   /*!< EXMEE Structure                                                      */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start EXMEE operations.                               */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop EXMEE operations.                                */
    __OM uint32_t TASKS_RESET;                       /*!< (@ 0x00000008) Reset the EXMEE and its registers. Reset the FSM to
                                                                         default values.*/                                        
    __OM uint32_t TASKS_COMMIT;                      /*!< (@ 0x0000000C) Pad data buffer and commit to memory.                 */
    __IM uint32_t RESERVED[28];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_RESET;                  /*!< (@ 0x00000088) Subscribe configuration for task RESET                */
    __IOM uint32_t SUBSCRIBE_COMMIT;                 /*!< (@ 0x0000008C) Subscribe configuration for task COMMIT               */
    __IM uint32_t RESERVED1[28];
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000100) (unspecified)                                         */
    __IOM uint32_t EVENTS_READACCESS;                /*!< (@ 0x00000104) The read access event fires when a read access to the
                                                                         decrypted memory window is received*/                    
    __IOM uint32_t EVENTS_WRITEACCESS;               /*!< (@ 0x00000108) The write access event fires when a write access to the
                                                                         decrypted memory window is received*/                    
    __IOM uint32_t EVENTS_INVALIDKEYREGION;          /*!< (@ 0x0000010C) The invalid key region event fires if the address of
                                                                         the AXI transaction does not correspond with any of the
                                                                         regions there is keys for in the key register*/          
    __IOM uint32_t EVENTS_INCREMENTCOUNTER;          /*!< (@ 0x00000110) The increment counter event fires when the counter
                                                                         needs to be incremented. Typically when an encryption
                                                                         operation has completed, before the next encryption
                                                                         operation can start*/                                    
    __IOM uint32_t EVENTS_DATARECEIVED;              /*!< (@ 0x00000114) The data received event fires when an AXI operation
                                                                         happens on the slave port, and the data received is the
                                                                         first data in a new 512b chunk*/                         
    __IOM uint32_t EVENTS_CIPHERTEXTREADY;           /*!< (@ 0x00000118) The ciphertext ready event fires when the data is
                                                                         encrypted and the ciphertext is ready in the CIPHERTEXT
                                                                         register*/                                               
    __IOM uint32_t EVENTS_NONCEREADY;                /*!< (@ 0x0000011C) The nonce ready event fires when the nonce is ready in
                                                                         the NONCE register*/                                     
    __IOM uint32_t EVENTS_WRITECOMPLETE;             /*!< (@ 0x00000120) The write complete event fires when the ciphertext and
                                                                         counter has been written to the external memory*/        
    __IM uint32_t RESERVED2[23];
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000180) Publish configuration for event STOPPED               */
    __IOM uint32_t PUBLISH_READACCESS;               /*!< (@ 0x00000184) Publish configuration for event READACCESS            */
    __IOM uint32_t PUBLISH_WRITEACCESS;              /*!< (@ 0x00000188) Publish configuration for event WRITEACCESS           */
    __IOM uint32_t PUBLISH_INVALIDKEYREGION;         /*!< (@ 0x0000018C) Publish configuration for event INVALIDKEYREGION      */
    __IOM uint32_t PUBLISH_INCREMENTCOUNTER;         /*!< (@ 0x00000190) Publish configuration for event INCREMENTCOUNTER      */
    __IOM uint32_t PUBLISH_DATARECEIVED;             /*!< (@ 0x00000194) Publish configuration for event DATARECEIVED          */
    __IOM uint32_t PUBLISH_CIPHERTEXTREADY;          /*!< (@ 0x00000198) Publish configuration for event CIPHERTEXTREADY       */
    __IOM uint32_t PUBLISH_NONCEREADY;               /*!< (@ 0x0000019C) Publish configuration for event NONCEREADY            */
    __IOM uint32_t PUBLISH_WRITECOMPLETE;            /*!< (@ 0x000001A0) Publish configuration for event WRITECOMPLETE         */
    __IM uint32_t RESERVED3[23];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED4[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED5[125];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable the EXMEE peripheral.                          */
    __IM uint32_t RESERVED6[3];
    __IOM NRF_EXMEE_PAGE_Type PAGE;                  /*!< (@ 0x00000510) Memory pages the EXMEE works on                       */
    __IM uint32_t RESERVED7[4];
    __IOM NRF_EXMEE_TRANSACTION_Type TRANSACTION;    /*!< (@ 0x00000530) Information about the currently processed transaction */
    __IM uint32_t RESERVED8[36];
    __IOM NRF_EXMEE_REGION_Type REGION[16];          /*!< (@ 0x00000600) Encryption region n                                   */
  } NRF_EXMEE_Type;                                  /*!< Size = 2048 (0x800)                                                  */

