adamkondraciuk/nrfx/mdk/nrf7140_types.h
  #define EXMEE_EVENTS_INCREMENTCOUNTER_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_INCREMENTCOUNTER register.        */

/* EVENTS_INCREMENTCOUNTER @Bit 0 : The increment counter event fires when the counter needs to be incremented. Typically when
                                    an encryption operation has completed, before the next encryption operation can start */      
                                                                                                                                  
  #define EXMEE_EVENTS_INCREMENTCOUNTER_EVENTS_INCREMENTCOUNTER_Pos (0UL) /*!< Position of EVENTS_INCREMENTCOUNTER field.      */
  #define EXMEE_EVENTS_INCREMENTCOUNTER_EVENTS_INCREMENTCOUNTER_Msk (0x1UL << EXMEE_EVENTS_INCREMENTCOUNTER_EVENTS_INCREMENTCOUNTER_Pos)
                                                                            /*!< Bit mask of EVENTS_INCREMENTCOUNTER field.*/     
  #define EXMEE_EVENTS_INCREMENTCOUNTER_EVENTS_INCREMENTCOUNTER_Min (0x0UL) /*!< Min enumerator value of EVENTS_INCREMENTCOUNTER
                                                                            field.*/                                              
  #define EXMEE_EVENTS_INCREMENTCOUNTER_EVENTS_INCREMENTCOUNTER_Max (0x1UL) /*!< Max enumerator value of EVENTS_INCREMENTCOUNTER
                                                                            field.*/                                              
  #define EXMEE_EVENTS_INCREMENTCOUNTER_EVENTS_INCREMENTCOUNTER_NotGenerated (0x0UL) /*!< Event not generated                  */
  #define EXMEE_EVENTS_INCREMENTCOUNTER_EVENTS_INCREMENTCOUNTER_Generated (0x1UL) /*!< Event generated                         */


/* EXMEE_EVENTS_DATARECEIVED: The data received event fires when an AXI operation happens on the slave port, and the data
                               received is the first data in a new 512b chunk */                                                  
                                                                                                                                  
  #define EXMEE_EVENTS_DATARECEIVED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_DATARECEIVED register.                */

/* EVENTS_DATARECEIVED @Bit 0 : The data received event fires when an AXI operation happens on the slave port, and the data
                                received is the first data in a new 512b chunk */                                                 
                                                                                                                                  
  #define EXMEE_EVENTS_DATARECEIVED_EVENTS_DATARECEIVED_Pos (0UL) /*!< Position of EVENTS_DATARECEIVED field.                  */
  #define EXMEE_EVENTS_DATARECEIVED_EVENTS_DATARECEIVED_Msk (0x1UL << EXMEE_EVENTS_DATARECEIVED_EVENTS_DATARECEIVED_Pos) /*!<
                                                                            Bit mask of EVENTS_DATARECEIVED field.*/              
  #define EXMEE_EVENTS_DATARECEIVED_EVENTS_DATARECEIVED_Min (0x0UL) /*!< Min enumerator value of EVENTS_DATARECEIVED field.    */
  #define EXMEE_EVENTS_DATARECEIVED_EVENTS_DATARECEIVED_Max (0x1UL) /*!< Max enumerator value of EVENTS_DATARECEIVED field.    */
  #define EXMEE_EVENTS_DATARECEIVED_EVENTS_DATARECEIVED_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define EXMEE_EVENTS_DATARECEIVED_EVENTS_DATARECEIVED_Generated (0x1UL) /*!< Event generated                                 */


/* EXMEE_EVENTS_CIPHERTEXTREADY: The ciphertext ready event fires when the data is encrypted and the ciphertext is ready in the
                                  CIPHERTEXT register */                                                                          
                                                                                                                                  
  #define EXMEE_EVENTS_CIPHERTEXTREADY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CIPHERTEXTREADY register.          */

/* EVENTS_CIPHERTEXTREADY @Bit 0 : The ciphertext ready event fires when the data is encrypted and the ciphertext is ready in
                                   the CIPHERTEXT register */                                                                     
                                                                                                                                  
  #define EXMEE_EVENTS_CIPHERTEXTREADY_EVENTS_CIPHERTEXTREADY_Pos (0UL) /*!< Position of EVENTS_CIPHERTEXTREADY field.         */
  #define EXMEE_EVENTS_CIPHERTEXTREADY_EVENTS_CIPHERTEXTREADY_Msk (0x1UL << EXMEE_EVENTS_CIPHERTEXTREADY_EVENTS_CIPHERTEXTREADY_Pos)
                                                                            /*!< Bit mask of EVENTS_CIPHERTEXTREADY field.*/      
  #define EXMEE_EVENTS_CIPHERTEXTREADY_EVENTS_CIPHERTEXTREADY_Min (0x0UL) /*!< Min enumerator value of EVENTS_CIPHERTEXTREADY
                                                                            field.*/                                              
  #define EXMEE_EVENTS_CIPHERTEXTREADY_EVENTS_CIPHERTEXTREADY_Max (0x1UL) /*!< Max enumerator value of EVENTS_CIPHERTEXTREADY
                                                                            field.*/                                              
  #define EXMEE_EVENTS_CIPHERTEXTREADY_EVENTS_CIPHERTEXTREADY_NotGenerated (0x0UL) /*!< Event not generated                    */
  #define EXMEE_EVENTS_CIPHERTEXTREADY_EVENTS_CIPHERTEXTREADY_Generated (0x1UL) /*!< Event generated                           */


/* EXMEE_EVENTS_NONCEREADY: The nonce ready event fires when the nonce is ready in the NONCE register */
  #define EXMEE_EVENTS_NONCEREADY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_NONCEREADY register.                    */

/* EVENTS_NONCEREADY @Bit 0 : The nonce ready event fires when the nonce is ready in the NONCE register */
  #define EXMEE_EVENTS_NONCEREADY_EVENTS_NONCEREADY_Pos (0UL) /*!< Position of EVENTS_NONCEREADY field.                        */
  #define EXMEE_EVENTS_NONCEREADY_EVENTS_NONCEREADY_Msk (0x1UL << EXMEE_EVENTS_NONCEREADY_EVENTS_NONCEREADY_Pos) /*!< Bit mask
                                                                            of EVENTS_NONCEREADY field.*/                         
  #define EXMEE_EVENTS_NONCEREADY_EVENTS_NONCEREADY_Min (0x0UL) /*!< Min enumerator value of EVENTS_NONCEREADY field.          */
  #define EXMEE_EVENTS_NONCEREADY_EVENTS_NONCEREADY_Max (0x1UL) /*!< Max enumerator value of EVENTS_NONCEREADY field.          */
  #define EXMEE_EVENTS_NONCEREADY_EVENTS_NONCEREADY_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define EXMEE_EVENTS_NONCEREADY_EVENTS_NONCEREADY_Generated (0x1UL) /*!< Event generated                                     */


