adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EXMEE_EVENTS_WRITECOMPLETE: The write complete event fires when the ciphertext and counter has been written to the external
                                memory */                                                                                         
                                                                                                                                  
  #define EXMEE_EVENTS_WRITECOMPLETE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_WRITECOMPLETE register.              */

/* EVENTS_WRITECOMPLETE @Bit 0 : The write complete event fires when the ciphertext and counter has been written to the external
                                 memory */                                                                                        
                                                                                                                                  
  #define EXMEE_EVENTS_WRITECOMPLETE_EVENTS_WRITECOMPLETE_Pos (0UL) /*!< Position of EVENTS_WRITECOMPLETE field.               */
  #define EXMEE_EVENTS_WRITECOMPLETE_EVENTS_WRITECOMPLETE_Msk (0x1UL << EXMEE_EVENTS_WRITECOMPLETE_EVENTS_WRITECOMPLETE_Pos)
                                                                            /*!< Bit mask of EVENTS_WRITECOMPLETE field.*/        
  #define EXMEE_EVENTS_WRITECOMPLETE_EVENTS_WRITECOMPLETE_Min (0x0UL) /*!< Min enumerator value of EVENTS_WRITECOMPLETE field. */
  #define EXMEE_EVENTS_WRITECOMPLETE_EVENTS_WRITECOMPLETE_Max (0x1UL) /*!< Max enumerator value of EVENTS_WRITECOMPLETE field. */
  #define EXMEE_EVENTS_WRITECOMPLETE_EVENTS_WRITECOMPLETE_NotGenerated (0x0UL) /*!< Event not generated                        */
  #define EXMEE_EVENTS_WRITECOMPLETE_EVENTS_WRITECOMPLETE_Generated (0x1UL) /*!< Event generated                               */


/* EXMEE_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define EXMEE_PUBLISH_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STOPPED register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define EXMEE_PUBLISH_STOPPED_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define EXMEE_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << EXMEE_PUBLISH_STOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define EXMEE_PUBLISH_STOPPED_CHIDX_Min (0x0UL)    /*!< Min value of CHIDX field.                                            */
  #define EXMEE_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define EXMEE_PUBLISH_STOPPED_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define EXMEE_PUBLISH_STOPPED_EN_Msk (0x1UL << EXMEE_PUBLISH_STOPPED_EN_Pos) /*!< Bit mask of EN field.                      */
  #define EXMEE_PUBLISH_STOPPED_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define EXMEE_PUBLISH_STOPPED_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define EXMEE_PUBLISH_STOPPED_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define EXMEE_PUBLISH_STOPPED_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* EXMEE_PUBLISH_READACCESS: Publish configuration for event READACCESS */
  #define EXMEE_PUBLISH_READACCESS_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_READACCESS register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that event READACCESS will publish to */
  #define EXMEE_PUBLISH_READACCESS_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define EXMEE_PUBLISH_READACCESS_CHIDX_Msk (0xFFUL << EXMEE_PUBLISH_READACCESS_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define EXMEE_PUBLISH_READACCESS_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                            */
  #define EXMEE_PUBLISH_READACCESS_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define EXMEE_PUBLISH_READACCESS_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define EXMEE_PUBLISH_READACCESS_EN_Msk (0x1UL << EXMEE_PUBLISH_READACCESS_EN_Pos) /*!< Bit mask of EN field.                */
  #define EXMEE_PUBLISH_READACCESS_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define EXMEE_PUBLISH_READACCESS_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define EXMEE_PUBLISH_READACCESS_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define EXMEE_PUBLISH_READACCESS_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* EXMEE_PUBLISH_WRITEACCESS: Publish configuration for event WRITEACCESS */
  #define EXMEE_PUBLISH_WRITEACCESS_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_WRITEACCESS register.                */

/* CHIDX @Bits 0..7 : DPPI channel that event WRITEACCESS will publish to */
  #define EXMEE_PUBLISH_WRITEACCESS_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define EXMEE_PUBLISH_WRITEACCESS_CHIDX_Msk (0xFFUL << EXMEE_PUBLISH_WRITEACCESS_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define EXMEE_PUBLISH_WRITEACCESS_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                           */
  #define EXMEE_PUBLISH_WRITEACCESS_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define EXMEE_PUBLISH_WRITEACCESS_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define EXMEE_PUBLISH_WRITEACCESS_EN_Msk (0x1UL << EXMEE_PUBLISH_WRITEACCESS_EN_Pos) /*!< Bit mask of EN field.              */
  #define EXMEE_PUBLISH_WRITEACCESS_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define EXMEE_PUBLISH_WRITEACCESS_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define EXMEE_PUBLISH_WRITEACCESS_EN_Disabled (0x0UL) /*!< Disable publishing                                                */
  #define EXMEE_PUBLISH_WRITEACCESS_EN_Enabled (0x1UL) /*!< Enable publishing                                                  */


/* EXMEE_PUBLISH_INVALIDKEYREGION: Publish configuration for event INVALIDKEYREGION */
  #define EXMEE_PUBLISH_INVALIDKEYREGION_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_INVALIDKEYREGION register.      */

/* CHIDX @Bits 0..7 : DPPI channel that event INVALIDKEYREGION will publish to */
  #define EXMEE_PUBLISH_INVALIDKEYREGION_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                         */
  #define EXMEE_PUBLISH_INVALIDKEYREGION_CHIDX_Msk (0xFFUL << EXMEE_PUBLISH_INVALIDKEYREGION_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define EXMEE_PUBLISH_INVALIDKEYREGION_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                      */
  #define EXMEE_PUBLISH_INVALIDKEYREGION_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                      */

/* EN @Bit 31 : (unspecified) */
  #define EXMEE_PUBLISH_INVALIDKEYREGION_EN_Pos (31UL) /*!< Position of EN field.                                              */
  #define EXMEE_PUBLISH_INVALIDKEYREGION_EN_Msk (0x1UL << EXMEE_PUBLISH_INVALIDKEYREGION_EN_Pos) /*!< Bit mask of EN field.    */
  #define EXMEE_PUBLISH_INVALIDKEYREGION_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                 */
  #define EXMEE_PUBLISH_INVALIDKEYREGION_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                 */
  #define EXMEE_PUBLISH_INVALIDKEYREGION_EN_Disabled (0x0UL) /*!< Disable publishing                                           */
  #define EXMEE_PUBLISH_INVALIDKEYREGION_EN_Enabled (0x1UL) /*!< Enable publishing                                             */


/* EXMEE_PUBLISH_INCREMENTCOUNTER: Publish configuration for event INCREMENTCOUNTER */
  #define EXMEE_PUBLISH_INCREMENTCOUNTER_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_INCREMENTCOUNTER register.      */

/* CHIDX @Bits 0..7 : DPPI channel that event INCREMENTCOUNTER will publish to */
  #define EXMEE_PUBLISH_INCREMENTCOUNTER_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                         */
  #define EXMEE_PUBLISH_INCREMENTCOUNTER_CHIDX_Msk (0xFFUL << EXMEE_PUBLISH_INCREMENTCOUNTER_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define EXMEE_PUBLISH_INCREMENTCOUNTER_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                      */
  #define EXMEE_PUBLISH_INCREMENTCOUNTER_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                      */

/* EN @Bit 31 : (unspecified) */
  #define EXMEE_PUBLISH_INCREMENTCOUNTER_EN_Pos (31UL) /*!< Position of EN field.                                              */
  #define EXMEE_PUBLISH_INCREMENTCOUNTER_EN_Msk (0x1UL << EXMEE_PUBLISH_INCREMENTCOUNTER_EN_Pos) /*!< Bit mask of EN field.    */
  #define EXMEE_PUBLISH_INCREMENTCOUNTER_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                 */
  #define EXMEE_PUBLISH_INCREMENTCOUNTER_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                 */
  #define EXMEE_PUBLISH_INCREMENTCOUNTER_EN_Disabled (0x0UL) /*!< Disable publishing                                           */
  #define EXMEE_PUBLISH_INCREMENTCOUNTER_EN_Enabled (0x1UL) /*!< Enable publishing                                             */


