adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EXMEE_PUBLISH_DATARECEIVED: Publish configuration for event DATARECEIVED */
  #define EXMEE_PUBLISH_DATARECEIVED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_DATARECEIVED register.              */

/* CHIDX @Bits 0..7 : DPPI channel that event DATARECEIVED will publish to */
  #define EXMEE_PUBLISH_DATARECEIVED_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define EXMEE_PUBLISH_DATARECEIVED_CHIDX_Msk (0xFFUL << EXMEE_PUBLISH_DATARECEIVED_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define EXMEE_PUBLISH_DATARECEIVED_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                          */
  #define EXMEE_PUBLISH_DATARECEIVED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define EXMEE_PUBLISH_DATARECEIVED_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define EXMEE_PUBLISH_DATARECEIVED_EN_Msk (0x1UL << EXMEE_PUBLISH_DATARECEIVED_EN_Pos) /*!< Bit mask of EN field.            */
  #define EXMEE_PUBLISH_DATARECEIVED_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define EXMEE_PUBLISH_DATARECEIVED_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define EXMEE_PUBLISH_DATARECEIVED_EN_Disabled (0x0UL) /*!< Disable publishing                                               */
  #define EXMEE_PUBLISH_DATARECEIVED_EN_Enabled (0x1UL) /*!< Enable publishing                                                 */


/* EXMEE_PUBLISH_CIPHERTEXTREADY: Publish configuration for event CIPHERTEXTREADY */
  #define EXMEE_PUBLISH_CIPHERTEXTREADY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_CIPHERTEXTREADY register.        */

/* CHIDX @Bits 0..7 : DPPI channel that event CIPHERTEXTREADY will publish to */
  #define EXMEE_PUBLISH_CIPHERTEXTREADY_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                          */
  #define EXMEE_PUBLISH_CIPHERTEXTREADY_CHIDX_Msk (0xFFUL << EXMEE_PUBLISH_CIPHERTEXTREADY_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define EXMEE_PUBLISH_CIPHERTEXTREADY_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                       */
  #define EXMEE_PUBLISH_CIPHERTEXTREADY_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                       */

/* EN @Bit 31 : (unspecified) */
  #define EXMEE_PUBLISH_CIPHERTEXTREADY_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define EXMEE_PUBLISH_CIPHERTEXTREADY_EN_Msk (0x1UL << EXMEE_PUBLISH_CIPHERTEXTREADY_EN_Pos) /*!< Bit mask of EN field.      */
  #define EXMEE_PUBLISH_CIPHERTEXTREADY_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define EXMEE_PUBLISH_CIPHERTEXTREADY_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define EXMEE_PUBLISH_CIPHERTEXTREADY_EN_Disabled (0x0UL) /*!< Disable publishing                                            */
  #define EXMEE_PUBLISH_CIPHERTEXTREADY_EN_Enabled (0x1UL) /*!< Enable publishing                                              */


/* EXMEE_PUBLISH_NONCEREADY: Publish configuration for event NONCEREADY */
  #define EXMEE_PUBLISH_NONCEREADY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_NONCEREADY register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that event NONCEREADY will publish to */
  #define EXMEE_PUBLISH_NONCEREADY_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define EXMEE_PUBLISH_NONCEREADY_CHIDX_Msk (0xFFUL << EXMEE_PUBLISH_NONCEREADY_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define EXMEE_PUBLISH_NONCEREADY_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                            */
  #define EXMEE_PUBLISH_NONCEREADY_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define EXMEE_PUBLISH_NONCEREADY_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define EXMEE_PUBLISH_NONCEREADY_EN_Msk (0x1UL << EXMEE_PUBLISH_NONCEREADY_EN_Pos) /*!< Bit mask of EN field.                */
  #define EXMEE_PUBLISH_NONCEREADY_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define EXMEE_PUBLISH_NONCEREADY_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define EXMEE_PUBLISH_NONCEREADY_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define EXMEE_PUBLISH_NONCEREADY_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* EXMEE_PUBLISH_WRITECOMPLETE: Publish configuration for event WRITECOMPLETE */
  #define EXMEE_PUBLISH_WRITECOMPLETE_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_WRITECOMPLETE register.            */

/* CHIDX @Bits 0..7 : DPPI channel that event WRITECOMPLETE will publish to */
  #define EXMEE_PUBLISH_WRITECOMPLETE_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define EXMEE_PUBLISH_WRITECOMPLETE_CHIDX_Msk (0xFFUL << EXMEE_PUBLISH_WRITECOMPLETE_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define EXMEE_PUBLISH_WRITECOMPLETE_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                         */
  #define EXMEE_PUBLISH_WRITECOMPLETE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define EXMEE_PUBLISH_WRITECOMPLETE_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define EXMEE_PUBLISH_WRITECOMPLETE_EN_Msk (0x1UL << EXMEE_PUBLISH_WRITECOMPLETE_EN_Pos) /*!< Bit mask of EN field.          */
  #define EXMEE_PUBLISH_WRITECOMPLETE_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define EXMEE_PUBLISH_WRITECOMPLETE_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define EXMEE_PUBLISH_WRITECOMPLETE_EN_Disabled (0x0UL) /*!< Disable publishing                                              */
  #define EXMEE_PUBLISH_WRITECOMPLETE_EN_Enabled (0x1UL) /*!< Enable publishing                                                */


