adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EXMEE_SHORTS: Shortcuts between local events and tasks */
  #define EXMEE_SHORTS_ResetValue (0x00000000UL)     /*!< Reset value of SHORTS register.                                      */

/* NONCEREADY_START @Bit 0 : Shortcut between event NONCEREADY and task START */
  #define EXMEE_SHORTS_NONCEREADY_START_Pos (0UL)    /*!< Position of NONCEREADY_START field.                                  */
  #define EXMEE_SHORTS_NONCEREADY_START_Msk (0x1UL << EXMEE_SHORTS_NONCEREADY_START_Pos) /*!< Bit mask of NONCEREADY_START
                                                                            field.*/                                              
  #define EXMEE_SHORTS_NONCEREADY_START_Min (0x0UL)  /*!< Min enumerator value of NONCEREADY_START field.                      */
  #define EXMEE_SHORTS_NONCEREADY_START_Max (0x1UL)  /*!< Max enumerator value of NONCEREADY_START field.                      */
  #define EXMEE_SHORTS_NONCEREADY_START_Disabled (0x0UL) /*!< Disable shortcut                                                 */
  #define EXMEE_SHORTS_NONCEREADY_START_Enabled (0x1UL) /*!< Enable shortcut                                                   */


/* EXMEE_INTEN: Enable or disable interrupt */
  #define EXMEE_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* STOPPED @Bit 0 : Enable or disable interrupt for event STOPPED */
  #define EXMEE_INTEN_STOPPED_Pos (0UL)              /*!< Position of STOPPED field.                                           */
  #define EXMEE_INTEN_STOPPED_Msk (0x1UL << EXMEE_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                           */
  #define EXMEE_INTEN_STOPPED_Min (0x0UL)            /*!< Min enumerator value of STOPPED field.                               */
  #define EXMEE_INTEN_STOPPED_Max (0x1UL)            /*!< Max enumerator value of STOPPED field.                               */
  #define EXMEE_INTEN_STOPPED_Disabled (0x0UL)       /*!< Disable                                                              */
  #define EXMEE_INTEN_STOPPED_Enabled (0x1UL)        /*!< Enable                                                               */

/* READACCESS @Bit 1 : Enable or disable interrupt for event READACCESS */
  #define EXMEE_INTEN_READACCESS_Pos (1UL)           /*!< Position of READACCESS field.                                        */
  #define EXMEE_INTEN_READACCESS_Msk (0x1UL << EXMEE_INTEN_READACCESS_Pos) /*!< Bit mask of READACCESS field.                  */
  #define EXMEE_INTEN_READACCESS_Min (0x0UL)         /*!< Min enumerator value of READACCESS field.                            */
  #define EXMEE_INTEN_READACCESS_Max (0x1UL)         /*!< Max enumerator value of READACCESS field.                            */
  #define EXMEE_INTEN_READACCESS_Disabled (0x0UL)    /*!< Disable                                                              */
  #define EXMEE_INTEN_READACCESS_Enabled (0x1UL)     /*!< Enable                                                               */

/* WRITEACCESS @Bit 2 : Enable or disable interrupt for event WRITEACCESS */
  #define EXMEE_INTEN_WRITEACCESS_Pos (2UL)          /*!< Position of WRITEACCESS field.                                       */
  #define EXMEE_INTEN_WRITEACCESS_Msk (0x1UL << EXMEE_INTEN_WRITEACCESS_Pos) /*!< Bit mask of WRITEACCESS field.               */
  #define EXMEE_INTEN_WRITEACCESS_Min (0x0UL)        /*!< Min enumerator value of WRITEACCESS field.                           */
  #define EXMEE_INTEN_WRITEACCESS_Max (0x1UL)        /*!< Max enumerator value of WRITEACCESS field.                           */
  #define EXMEE_INTEN_WRITEACCESS_Disabled (0x0UL)   /*!< Disable                                                              */
  #define EXMEE_INTEN_WRITEACCESS_Enabled (0x1UL)    /*!< Enable                                                               */

/* INVALIDKEYREGION @Bit 3 : Enable or disable interrupt for event INVALIDKEYREGION */
  #define EXMEE_INTEN_INVALIDKEYREGION_Pos (3UL)     /*!< Position of INVALIDKEYREGION field.                                  */
  #define EXMEE_INTEN_INVALIDKEYREGION_Msk (0x1UL << EXMEE_INTEN_INVALIDKEYREGION_Pos) /*!< Bit mask of INVALIDKEYREGION field.*/
  #define EXMEE_INTEN_INVALIDKEYREGION_Min (0x0UL)   /*!< Min enumerator value of INVALIDKEYREGION field.                      */
  #define EXMEE_INTEN_INVALIDKEYREGION_Max (0x1UL)   /*!< Max enumerator value of INVALIDKEYREGION field.                      */
  #define EXMEE_INTEN_INVALIDKEYREGION_Disabled (0x0UL) /*!< Disable                                                           */
  #define EXMEE_INTEN_INVALIDKEYREGION_Enabled (0x1UL) /*!< Enable                                                             */

/* INCREMENTCOUNTER @Bit 4 : Enable or disable interrupt for event INCREMENTCOUNTER */
  #define EXMEE_INTEN_INCREMENTCOUNTER_Pos (4UL)     /*!< Position of INCREMENTCOUNTER field.                                  */
  #define EXMEE_INTEN_INCREMENTCOUNTER_Msk (0x1UL << EXMEE_INTEN_INCREMENTCOUNTER_Pos) /*!< Bit mask of INCREMENTCOUNTER field.*/
  #define EXMEE_INTEN_INCREMENTCOUNTER_Min (0x0UL)   /*!< Min enumerator value of INCREMENTCOUNTER field.                      */
  #define EXMEE_INTEN_INCREMENTCOUNTER_Max (0x1UL)   /*!< Max enumerator value of INCREMENTCOUNTER field.                      */
  #define EXMEE_INTEN_INCREMENTCOUNTER_Disabled (0x0UL) /*!< Disable                                                           */
  #define EXMEE_INTEN_INCREMENTCOUNTER_Enabled (0x1UL) /*!< Enable                                                             */

/* DATARECEIVED @Bit 5 : Enable or disable interrupt for event DATARECEIVED */
  #define EXMEE_INTEN_DATARECEIVED_Pos (5UL)         /*!< Position of DATARECEIVED field.                                      */
  #define EXMEE_INTEN_DATARECEIVED_Msk (0x1UL << EXMEE_INTEN_DATARECEIVED_Pos) /*!< Bit mask of DATARECEIVED field.            */
  #define EXMEE_INTEN_DATARECEIVED_Min (0x0UL)       /*!< Min enumerator value of DATARECEIVED field.                          */
  #define EXMEE_INTEN_DATARECEIVED_Max (0x1UL)       /*!< Max enumerator value of DATARECEIVED field.                          */
  #define EXMEE_INTEN_DATARECEIVED_Disabled (0x0UL)  /*!< Disable                                                              */
  #define EXMEE_INTEN_DATARECEIVED_Enabled (0x1UL)   /*!< Enable                                                               */

/* CIPHERTEXTREADY @Bit 6 : Enable or disable interrupt for event CIPHERTEXTREADY */
  #define EXMEE_INTEN_CIPHERTEXTREADY_Pos (6UL)      /*!< Position of CIPHERTEXTREADY field.                                   */
  #define EXMEE_INTEN_CIPHERTEXTREADY_Msk (0x1UL << EXMEE_INTEN_CIPHERTEXTREADY_Pos) /*!< Bit mask of CIPHERTEXTREADY field.   */
  #define EXMEE_INTEN_CIPHERTEXTREADY_Min (0x0UL)    /*!< Min enumerator value of CIPHERTEXTREADY field.                       */
  #define EXMEE_INTEN_CIPHERTEXTREADY_Max (0x1UL)    /*!< Max enumerator value of CIPHERTEXTREADY field.                       */
  #define EXMEE_INTEN_CIPHERTEXTREADY_Disabled (0x0UL) /*!< Disable                                                            */
  #define EXMEE_INTEN_CIPHERTEXTREADY_Enabled (0x1UL) /*!< Enable                                                              */

/* NONCEREADY @Bit 7 : Enable or disable interrupt for event NONCEREADY */
  #define EXMEE_INTEN_NONCEREADY_Pos (7UL)           /*!< Position of NONCEREADY field.                                        */
  #define EXMEE_INTEN_NONCEREADY_Msk (0x1UL << EXMEE_INTEN_NONCEREADY_Pos) /*!< Bit mask of NONCEREADY field.                  */
  #define EXMEE_INTEN_NONCEREADY_Min (0x0UL)         /*!< Min enumerator value of NONCEREADY field.                            */
  #define EXMEE_INTEN_NONCEREADY_Max (0x1UL)         /*!< Max enumerator value of NONCEREADY field.                            */
  #define EXMEE_INTEN_NONCEREADY_Disabled (0x0UL)    /*!< Disable                                                              */
  #define EXMEE_INTEN_NONCEREADY_Enabled (0x1UL)     /*!< Enable                                                               */

