adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* WRITECOMPLETE @Bit 8 : Enable or disable interrupt for event WRITECOMPLETE */
  #define EXMEE_INTEN_WRITECOMPLETE_Pos (8UL)        /*!< Position of WRITECOMPLETE field.                                     */
  #define EXMEE_INTEN_WRITECOMPLETE_Msk (0x1UL << EXMEE_INTEN_WRITECOMPLETE_Pos) /*!< Bit mask of WRITECOMPLETE field.         */
  #define EXMEE_INTEN_WRITECOMPLETE_Min (0x0UL)      /*!< Min enumerator value of WRITECOMPLETE field.                         */
  #define EXMEE_INTEN_WRITECOMPLETE_Max (0x1UL)      /*!< Max enumerator value of WRITECOMPLETE field.                         */
  #define EXMEE_INTEN_WRITECOMPLETE_Disabled (0x0UL) /*!< Disable                                                              */
  #define EXMEE_INTEN_WRITECOMPLETE_Enabled (0x1UL)  /*!< Enable                                                               */


/* EXMEE_INTENSET: Enable interrupt */
  #define EXMEE_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* STOPPED @Bit 0 : Write '1' to enable interrupt for event STOPPED */
  #define EXMEE_INTENSET_STOPPED_Pos (0UL)           /*!< Position of STOPPED field.                                           */
  #define EXMEE_INTENSET_STOPPED_Msk (0x1UL << EXMEE_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                     */
  #define EXMEE_INTENSET_STOPPED_Min (0x0UL)         /*!< Min enumerator value of STOPPED field.                               */
  #define EXMEE_INTENSET_STOPPED_Max (0x1UL)         /*!< Max enumerator value of STOPPED field.                               */
  #define EXMEE_INTENSET_STOPPED_Set (0x1UL)         /*!< Enable                                                               */
  #define EXMEE_INTENSET_STOPPED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define EXMEE_INTENSET_STOPPED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* READACCESS @Bit 1 : Write '1' to enable interrupt for event READACCESS */
  #define EXMEE_INTENSET_READACCESS_Pos (1UL)        /*!< Position of READACCESS field.                                        */
  #define EXMEE_INTENSET_READACCESS_Msk (0x1UL << EXMEE_INTENSET_READACCESS_Pos) /*!< Bit mask of READACCESS field.            */
  #define EXMEE_INTENSET_READACCESS_Min (0x0UL)      /*!< Min enumerator value of READACCESS field.                            */
  #define EXMEE_INTENSET_READACCESS_Max (0x1UL)      /*!< Max enumerator value of READACCESS field.                            */
  #define EXMEE_INTENSET_READACCESS_Set (0x1UL)      /*!< Enable                                                               */
  #define EXMEE_INTENSET_READACCESS_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define EXMEE_INTENSET_READACCESS_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* WRITEACCESS @Bit 2 : Write '1' to enable interrupt for event WRITEACCESS */
  #define EXMEE_INTENSET_WRITEACCESS_Pos (2UL)       /*!< Position of WRITEACCESS field.                                       */
  #define EXMEE_INTENSET_WRITEACCESS_Msk (0x1UL << EXMEE_INTENSET_WRITEACCESS_Pos) /*!< Bit mask of WRITEACCESS field.         */
  #define EXMEE_INTENSET_WRITEACCESS_Min (0x0UL)     /*!< Min enumerator value of WRITEACCESS field.                           */
  #define EXMEE_INTENSET_WRITEACCESS_Max (0x1UL)     /*!< Max enumerator value of WRITEACCESS field.                           */
  #define EXMEE_INTENSET_WRITEACCESS_Set (0x1UL)     /*!< Enable                                                               */
  #define EXMEE_INTENSET_WRITEACCESS_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define EXMEE_INTENSET_WRITEACCESS_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* INVALIDKEYREGION @Bit 3 : Write '1' to enable interrupt for event INVALIDKEYREGION */
  #define EXMEE_INTENSET_INVALIDKEYREGION_Pos (3UL)  /*!< Position of INVALIDKEYREGION field.                                  */
  #define EXMEE_INTENSET_INVALIDKEYREGION_Msk (0x1UL << EXMEE_INTENSET_INVALIDKEYREGION_Pos) /*!< Bit mask of INVALIDKEYREGION
                                                                            field.*/                                              
  #define EXMEE_INTENSET_INVALIDKEYREGION_Min (0x0UL) /*!< Min enumerator value of INVALIDKEYREGION field.                     */
  #define EXMEE_INTENSET_INVALIDKEYREGION_Max (0x1UL) /*!< Max enumerator value of INVALIDKEYREGION field.                     */
  #define EXMEE_INTENSET_INVALIDKEYREGION_Set (0x1UL) /*!< Enable                                                              */
  #define EXMEE_INTENSET_INVALIDKEYREGION_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define EXMEE_INTENSET_INVALIDKEYREGION_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* INCREMENTCOUNTER @Bit 4 : Write '1' to enable interrupt for event INCREMENTCOUNTER */
  #define EXMEE_INTENSET_INCREMENTCOUNTER_Pos (4UL)  /*!< Position of INCREMENTCOUNTER field.                                  */
  #define EXMEE_INTENSET_INCREMENTCOUNTER_Msk (0x1UL << EXMEE_INTENSET_INCREMENTCOUNTER_Pos) /*!< Bit mask of INCREMENTCOUNTER
                                                                            field.*/                                              
  #define EXMEE_INTENSET_INCREMENTCOUNTER_Min (0x0UL) /*!< Min enumerator value of INCREMENTCOUNTER field.                     */
  #define EXMEE_INTENSET_INCREMENTCOUNTER_Max (0x1UL) /*!< Max enumerator value of INCREMENTCOUNTER field.                     */
  #define EXMEE_INTENSET_INCREMENTCOUNTER_Set (0x1UL) /*!< Enable                                                              */
  #define EXMEE_INTENSET_INCREMENTCOUNTER_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define EXMEE_INTENSET_INCREMENTCOUNTER_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* DATARECEIVED @Bit 5 : Write '1' to enable interrupt for event DATARECEIVED */
  #define EXMEE_INTENSET_DATARECEIVED_Pos (5UL)      /*!< Position of DATARECEIVED field.                                      */
  #define EXMEE_INTENSET_DATARECEIVED_Msk (0x1UL << EXMEE_INTENSET_DATARECEIVED_Pos) /*!< Bit mask of DATARECEIVED field.      */
  #define EXMEE_INTENSET_DATARECEIVED_Min (0x0UL)    /*!< Min enumerator value of DATARECEIVED field.                          */
  #define EXMEE_INTENSET_DATARECEIVED_Max (0x1UL)    /*!< Max enumerator value of DATARECEIVED field.                          */
  #define EXMEE_INTENSET_DATARECEIVED_Set (0x1UL)    /*!< Enable                                                               */
  #define EXMEE_INTENSET_DATARECEIVED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define EXMEE_INTENSET_DATARECEIVED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

