adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CIPHERTEXTREADY @Bit 6 : Write '1' to enable interrupt for event CIPHERTEXTREADY */
  #define EXMEE_INTENSET_CIPHERTEXTREADY_Pos (6UL)   /*!< Position of CIPHERTEXTREADY field.                                   */
  #define EXMEE_INTENSET_CIPHERTEXTREADY_Msk (0x1UL << EXMEE_INTENSET_CIPHERTEXTREADY_Pos) /*!< Bit mask of CIPHERTEXTREADY
                                                                            field.*/                                              
  #define EXMEE_INTENSET_CIPHERTEXTREADY_Min (0x0UL) /*!< Min enumerator value of CIPHERTEXTREADY field.                       */
  #define EXMEE_INTENSET_CIPHERTEXTREADY_Max (0x1UL) /*!< Max enumerator value of CIPHERTEXTREADY field.                       */
  #define EXMEE_INTENSET_CIPHERTEXTREADY_Set (0x1UL) /*!< Enable                                                               */
  #define EXMEE_INTENSET_CIPHERTEXTREADY_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define EXMEE_INTENSET_CIPHERTEXTREADY_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* NONCEREADY @Bit 7 : Write '1' to enable interrupt for event NONCEREADY */
  #define EXMEE_INTENSET_NONCEREADY_Pos (7UL)        /*!< Position of NONCEREADY field.                                        */
  #define EXMEE_INTENSET_NONCEREADY_Msk (0x1UL << EXMEE_INTENSET_NONCEREADY_Pos) /*!< Bit mask of NONCEREADY field.            */
  #define EXMEE_INTENSET_NONCEREADY_Min (0x0UL)      /*!< Min enumerator value of NONCEREADY field.                            */
  #define EXMEE_INTENSET_NONCEREADY_Max (0x1UL)      /*!< Max enumerator value of NONCEREADY field.                            */
  #define EXMEE_INTENSET_NONCEREADY_Set (0x1UL)      /*!< Enable                                                               */
  #define EXMEE_INTENSET_NONCEREADY_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define EXMEE_INTENSET_NONCEREADY_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* WRITECOMPLETE @Bit 8 : Write '1' to enable interrupt for event WRITECOMPLETE */
  #define EXMEE_INTENSET_WRITECOMPLETE_Pos (8UL)     /*!< Position of WRITECOMPLETE field.                                     */
  #define EXMEE_INTENSET_WRITECOMPLETE_Msk (0x1UL << EXMEE_INTENSET_WRITECOMPLETE_Pos) /*!< Bit mask of WRITECOMPLETE field.   */
  #define EXMEE_INTENSET_WRITECOMPLETE_Min (0x0UL)   /*!< Min enumerator value of WRITECOMPLETE field.                         */
  #define EXMEE_INTENSET_WRITECOMPLETE_Max (0x1UL)   /*!< Max enumerator value of WRITECOMPLETE field.                         */
  #define EXMEE_INTENSET_WRITECOMPLETE_Set (0x1UL)   /*!< Enable                                                               */
  #define EXMEE_INTENSET_WRITECOMPLETE_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define EXMEE_INTENSET_WRITECOMPLETE_Enabled (0x1UL) /*!< Read: Enabled                                                      */


/* EXMEE_INTENCLR: Disable interrupt */
  #define EXMEE_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* STOPPED @Bit 0 : Write '1' to disable interrupt for event STOPPED */
  #define EXMEE_INTENCLR_STOPPED_Pos (0UL)           /*!< Position of STOPPED field.                                           */
  #define EXMEE_INTENCLR_STOPPED_Msk (0x1UL << EXMEE_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                     */
  #define EXMEE_INTENCLR_STOPPED_Min (0x0UL)         /*!< Min enumerator value of STOPPED field.                               */
  #define EXMEE_INTENCLR_STOPPED_Max (0x1UL)         /*!< Max enumerator value of STOPPED field.                               */
  #define EXMEE_INTENCLR_STOPPED_Clear (0x1UL)       /*!< Disable                                                              */
  #define EXMEE_INTENCLR_STOPPED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define EXMEE_INTENCLR_STOPPED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* READACCESS @Bit 1 : Write '1' to disable interrupt for event READACCESS */
  #define EXMEE_INTENCLR_READACCESS_Pos (1UL)        /*!< Position of READACCESS field.                                        */
  #define EXMEE_INTENCLR_READACCESS_Msk (0x1UL << EXMEE_INTENCLR_READACCESS_Pos) /*!< Bit mask of READACCESS field.            */
  #define EXMEE_INTENCLR_READACCESS_Min (0x0UL)      /*!< Min enumerator value of READACCESS field.                            */
  #define EXMEE_INTENCLR_READACCESS_Max (0x1UL)      /*!< Max enumerator value of READACCESS field.                            */
  #define EXMEE_INTENCLR_READACCESS_Clear (0x1UL)    /*!< Disable                                                              */
  #define EXMEE_INTENCLR_READACCESS_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define EXMEE_INTENCLR_READACCESS_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* WRITEACCESS @Bit 2 : Write '1' to disable interrupt for event WRITEACCESS */
  #define EXMEE_INTENCLR_WRITEACCESS_Pos (2UL)       /*!< Position of WRITEACCESS field.                                       */
  #define EXMEE_INTENCLR_WRITEACCESS_Msk (0x1UL << EXMEE_INTENCLR_WRITEACCESS_Pos) /*!< Bit mask of WRITEACCESS field.         */
  #define EXMEE_INTENCLR_WRITEACCESS_Min (0x0UL)     /*!< Min enumerator value of WRITEACCESS field.                           */
  #define EXMEE_INTENCLR_WRITEACCESS_Max (0x1UL)     /*!< Max enumerator value of WRITEACCESS field.                           */
  #define EXMEE_INTENCLR_WRITEACCESS_Clear (0x1UL)   /*!< Disable                                                              */
  #define EXMEE_INTENCLR_WRITEACCESS_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define EXMEE_INTENCLR_WRITEACCESS_Enabled (0x1UL) /*!< Read: Enabled                                                        */

