adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EXMIF_CORE_SSICADDRESS_CTRLR0: This register controls the serial data transfer. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_ResetValue (0x00004007UL) /*!< Reset value of CTRLR0 register.                         */

/* DFS @Bits 0..4 : Data Frame Size. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_Pos (0UL) /*!< Position of DFS field.                                              */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_Msk (0x1FUL << EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_Pos) /*!< Bit mask of DFS field.  */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_Min (0x0UL) /*!< Min enumerator value of DFS field.                                */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_Max (0x1FUL) /*!< Max enumerator value of DFS field.                               */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_01_BIT (0x00UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_02_BIT (0x01UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_03_BIT (0x02UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_04_BIT (0x03UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_05_BIT (0x04UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_06_BIT (0x05UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_07_BIT (0x06UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_08_BIT (0x07UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_09_BIT (0x08UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_10_BIT (0x09UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_11_BIT (0x0AUL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_12_BIT (0x0BUL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_13_BIT (0x0CUL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_14_BIT (0x0DUL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_15_BIT (0x0EUL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_16_BIT (0x0FUL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_17_BIT (0x10UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_18_BIT (0x11UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_19_BIT (0x12UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_20_BIT (0x13UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_21_BIT (0x14UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_22_BIT (0x15UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_23_BIT (0x16UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_24_BIT (0x17UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_25_BIT (0x18UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_26_BIT (0x19UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_27_BIT (0x1AUL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_28_BIT (0x1BUL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_29_BIT (0x1CUL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_30_BIT (0x1DUL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_31_BIT (0x1EUL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_32_BIT (0x1FUL) /*!< (unspecified)                                             */

/* FRF @Bits 6..7 : Frame Format. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_FRF_Pos (6UL) /*!< Position of FRF field.                                              */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_FRF_Msk (0x3UL << EXMIF_CORE_SSICADDRESS_CTRLR0_FRF_Pos) /*!< Bit mask of FRF field.   */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_FRF_Min (0x0UL) /*!< Min enumerator value of FRF field.                                */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_FRF_Max (0x2UL) /*!< Max enumerator value of FRF field.                                */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_FRF_SPI (0x0UL) /*!< (unspecified)                                                     */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_FRF_SSP (0x1UL) /*!< (unspecified)                                                     */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_FRF_MICROWIRE (0x2UL) /*!< (unspecified)                                               */

/* SCPH @Bit 8 : Serial Clock Phase. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPH_Pos (8UL) /*!< Position of SCPH field.                                            */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPH_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_CTRLR0_SCPH_Pos) /*!< Bit mask of SCPH field.*/
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPH_Min (0x0UL) /*!< Min enumerator value of SCPH field.                              */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPH_Max (0x1UL) /*!< Max enumerator value of SCPH field.                              */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPH_MIDDLE_BIT (0x0UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPH_START_BIT (0x1UL) /*!< (unspecified)                                              */

/* SCPOL @Bit 9 : Serial Clock Polarity. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPOL_Pos (9UL) /*!< Position of SCPOL field.                                          */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPOL_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_CTRLR0_SCPOL_Pos) /*!< Bit mask of SCPOL
                                                                            field.*/                                              
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPOL_Min (0x0UL) /*!< Min enumerator value of SCPOL field.                            */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPOL_Max (0x1UL) /*!< Max enumerator value of SCPOL field.                            */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPOL_INACTIVE_HIGH (0x0UL) /*!< (unspecified)                                         */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPOL_INACTIVE_LOW (0x1UL) /*!< (unspecified)                                          */

