adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TMOD @Bits 10..11 : Transfer Mode. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_TMOD_Pos (10UL) /*!< Position of TMOD field.                                           */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_TMOD_Msk (0x3UL << EXMIF_CORE_SSICADDRESS_CTRLR0_TMOD_Pos) /*!< Bit mask of TMOD field.*/
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_TMOD_Min (0x0UL) /*!< Min enumerator value of TMOD field.                              */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_TMOD_Max (0x3UL) /*!< Max enumerator value of TMOD field.                              */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_TMOD_TX_AND_RX (0x0UL) /*!< (unspecified)                                              */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_TMOD_TX_ONLY (0x1UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_TMOD_RX_ONLY (0x2UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_TMOD_EEPROM_READ (0x3UL) /*!< (unspecified)                                            */

/* SLVOE @Bit 12 : Slave Output Enable. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SLVOE_Pos (12UL) /*!< Position of SLVOE field.                                         */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SLVOE_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_CTRLR0_SLVOE_Pos) /*!< Bit mask of SLVOE
                                                                            field.*/                                              
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SLVOE_Min (0x0UL) /*!< Min enumerator value of SLVOE field.                            */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SLVOE_Max (0x1UL) /*!< Max enumerator value of SLVOE field.                            */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SLVOE_ENABLED (0x0UL) /*!< (unspecified)                                               */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SLVOE_DISABLED (0x1UL) /*!< (unspecified)                                              */

/* SRL @Bit 13 : Shift Register Loop. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SRL_Pos (13UL) /*!< Position of SRL field.                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SRL_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_CTRLR0_SRL_Pos) /*!< Bit mask of SRL field.   */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SRL_Min (0x0UL) /*!< Min enumerator value of SRL field.                                */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SRL_Max (0x1UL) /*!< Max enumerator value of SRL field.                                */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SRL_NORMAL_MODE (0x0UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SRL_TESTING_MODE (0x1UL) /*!< (unspecified)                                            */

/* SSTE @Bit 14 : Slave Select Toggle Enable. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SSTE_Pos (14UL) /*!< Position of SSTE field.                                           */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SSTE_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_CTRLR0_SSTE_Pos) /*!< Bit mask of SSTE field.*/
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SSTE_Min (0x0UL) /*!< Min enumerator value of SSTE field.                              */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SSTE_Max (0x1UL) /*!< Max enumerator value of SSTE field.                              */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SSTE_TOGGLE_DISABLE (0x0UL) /*!< (unspecified)                                         */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SSTE_TOGGLE_EN (0x1UL) /*!< (unspecified)                                              */

/* CFS @Bits 16..19 : Control Frame Size. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_Pos (16UL) /*!< Position of CFS field.                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_Msk (0xFUL << EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_Pos) /*!< Bit mask of CFS field.   */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_Min (0x0UL) /*!< Min enumerator value of CFS field.                                */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_Max (0xFUL) /*!< Max enumerator value of CFS field.                                */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_01_BIT (0x0UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_02_BIT (0x1UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_03_BIT (0x2UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_04_BIT (0x3UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_05_BIT (0x4UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_06_BIT (0x5UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_07_BIT (0x6UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_08_BIT (0x7UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_09_BIT (0x8UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_10_BIT (0x9UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_11_BIT (0xAUL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_12_BIT (0xBUL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_13_BIT (0xCUL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_14_BIT (0xDUL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_15_BIT (0xEUL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_16_BIT (0xFUL) /*!< (unspecified)                                             */

