adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* MWMOD @Bit 0 : Microwire Transfer Mode. */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_Pos (0UL) /*!< Position of MWMOD field.                                            */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_Pos) /*!< Bit mask of MWMOD field. */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_Min (0x0UL) /*!< Min enumerator value of MWMOD field.                              */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_Max (0x1UL) /*!< Max enumerator value of MWMOD field.                              */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_NON_SEQUENTIAL (0x0UL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_SEQUENTIAL (0x1UL) /*!< (unspecified)                                              */

/* MDD @Bit 1 : Microwire Control. */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MDD_Pos (1UL)  /*!< Position of MDD field.                                               */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MDD_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_MWCR_MDD_Pos) /*!< Bit mask of MDD field.       */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MDD_Min (0x0UL) /*!< Min enumerator value of MDD field.                                  */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MDD_Max (0x1UL) /*!< Max enumerator value of MDD field.                                  */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MDD_RECEIVE (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MDD_TRANSMIT (0x1UL) /*!< (unspecified)                                                  */

/* MHS @Bit 2 : Microwire Handshaking. */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_Pos (2UL)  /*!< Position of MHS field.                                               */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_MWCR_MHS_Pos) /*!< Bit mask of MHS field.       */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_Min (0x0UL) /*!< Min enumerator value of MHS field.                                  */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_Max (0x1UL) /*!< Max enumerator value of MHS field.                                  */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_DISABLE (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_ENABLED (0x1UL) /*!< (unspecified)                                                   */


/* EXMIF_CORE_SSICADDRESS_SER: This register is valid only when the DWC_ssi is configured as a master device. */
  #define EXMIF_CORE_SSICADDRESS_SER_ResetValue (0x00000000UL) /*!< Reset value of SER register.                               */

/* SER @Bits 0..1 : Slave Select Enable Flag. */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_Pos (0UL)   /*!< Position of SER field.                                               */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_Msk (0x3UL << EXMIF_CORE_SSICADDRESS_SER_SER_Pos) /*!< Bit mask of SER field.         */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_Min (0x0UL) /*!< Min enumerator value of SER field.                                   */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_Max (0x1UL) /*!< Max enumerator value of SER field.                                   */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_NOTSELECTED (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_SELECTED (0x1UL) /*!< (unspecified)                                                   */


/* EXMIF_CORE_SSICADDRESS_BAUDR: This register is valid only when the DWC_ssi is configured as a master device. */
  #define EXMIF_CORE_SSICADDRESS_BAUDR_ResetValue (0x00000000UL) /*!< Reset value of BAUDR register.                           */

/* SCKDV @Bits 1..15 : SSI Clock Divider. */
  #define EXMIF_CORE_SSICADDRESS_BAUDR_SCKDV_Pos (1UL) /*!< Position of SCKDV field.                                           */
  #define EXMIF_CORE_SSICADDRESS_BAUDR_SCKDV_Msk (0x7FFFUL << EXMIF_CORE_SSICADDRESS_BAUDR_SCKDV_Pos) /*!< Bit mask of SCKDV
                                                                            field.*/                                              


/* EXMIF_CORE_SSICADDRESS_TXFTLR: This register controls the threshold value for the transmit FIFO memory.. */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_ResetValue (0x00000000UL) /*!< Reset value of TXFTLR register.                         */

/* TFT @Bits 0..4 : Transmit FIFO Threshold. */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_TFT_Pos (0UL) /*!< Position of TFT field.                                              */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_TFT_Msk (0x1FUL << EXMIF_CORE_SSICADDRESS_TXFTLR_TFT_Pos) /*!< Bit mask of TFT field.  */

/* TXFTHR @Bits 16..20 : Transfer start FIFO level. */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_TXFTHR_Pos (16UL) /*!< Position of TXFTHR field.                                       */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_TXFTHR_Msk (0x1FUL << EXMIF_CORE_SSICADDRESS_TXFTLR_TXFTHR_Pos) /*!< Bit mask of TXFTHR
                                                                            field.*/                                              


/* EXMIF_CORE_SSICADDRESS_RXFTLR: This register controls the threshold value for the receive FIFO memory.. */
  #define EXMIF_CORE_SSICADDRESS_RXFTLR_ResetValue (0x00000000UL) /*!< Reset value of RXFTLR register.                         */

/* RFT @Bits 0..4 : Receive FIFO Threshold. */
  #define EXMIF_CORE_SSICADDRESS_RXFTLR_RFT_Pos (0UL) /*!< Position of RFT field.                                              */
  #define EXMIF_CORE_SSICADDRESS_RXFTLR_RFT_Msk (0x1FUL << EXMIF_CORE_SSICADDRESS_RXFTLR_RFT_Pos) /*!< Bit mask of RFT field.  */


/* EXMIF_CORE_SSICADDRESS_TXFLR: This register contains the number of valid data entries in the transmit FIFO memory. */
  #define EXMIF_CORE_SSICADDRESS_TXFLR_ResetValue (0x00000000UL) /*!< Reset value of TXFLR register.                           */

