adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TXTFL @Bits 0..5 : Transmit FIFO Level. */
  #define EXMIF_CORE_SSICADDRESS_TXFLR_TXTFL_Pos (0UL) /*!< Position of TXTFL field.                                           */
  #define EXMIF_CORE_SSICADDRESS_TXFLR_TXTFL_Msk (0x3FUL << EXMIF_CORE_SSICADDRESS_TXFLR_TXTFL_Pos) /*!< Bit mask of TXTFL
                                                                            field.*/                                              


/* EXMIF_CORE_SSICADDRESS_RXFLR: This register contains the number of valid data entries in the receive FIFO memory. */
  #define EXMIF_CORE_SSICADDRESS_RXFLR_ResetValue (0x00000000UL) /*!< Reset value of RXFLR register.                           */

/* RXTFL @Bits 0..5 : Receive FIFO Level. */
  #define EXMIF_CORE_SSICADDRESS_RXFLR_RXTFL_Pos (0UL) /*!< Position of RXTFL field.                                           */
  #define EXMIF_CORE_SSICADDRESS_RXFLR_RXTFL_Msk (0x3FUL << EXMIF_CORE_SSICADDRESS_RXFLR_RXTFL_Pos) /*!< Bit mask of RXTFL
                                                                            field.*/                                              


/* EXMIF_CORE_SSICADDRESS_SR: This is a read-only register used to indicate the current transfer status, FIFO status, and any
                               transmission/reception errors that may have occurred. */                                           
                                                                                                                                  
  #define EXMIF_CORE_SSICADDRESS_SR_ResetValue (0x00000006UL) /*!< Reset value of SR register.                                 */

/* BUSY @Bit 0 : SSI Busy Flag. */
  #define EXMIF_CORE_SSICADDRESS_SR_BUSY_Pos (0UL)   /*!< Position of BUSY field.                                              */
  #define EXMIF_CORE_SSICADDRESS_SR_BUSY_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_BUSY_Pos) /*!< Bit mask of BUSY field.        */
  #define EXMIF_CORE_SSICADDRESS_SR_BUSY_Min (0x0UL) /*!< Min enumerator value of BUSY field.                                  */
  #define EXMIF_CORE_SSICADDRESS_SR_BUSY_Max (0x1UL) /*!< Max enumerator value of BUSY field.                                  */
  #define EXMIF_CORE_SSICADDRESS_SR_BUSY_INACTIVE (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_SR_BUSY_ACTIVE (0x1UL) /*!< (unspecified)                                                     */

/* TFNF @Bit 1 : Transmit FIFO Not Full. */
  #define EXMIF_CORE_SSICADDRESS_SR_TFNF_Pos (1UL)   /*!< Position of TFNF field.                                              */
  #define EXMIF_CORE_SSICADDRESS_SR_TFNF_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_TFNF_Pos) /*!< Bit mask of TFNF field.        */
  #define EXMIF_CORE_SSICADDRESS_SR_TFNF_Min (0x0UL) /*!< Min enumerator value of TFNF field.                                  */
  #define EXMIF_CORE_SSICADDRESS_SR_TFNF_Max (0x1UL) /*!< Max enumerator value of TFNF field.                                  */
  #define EXMIF_CORE_SSICADDRESS_SR_TFNF_FULL (0x0UL) /*!< (unspecified)                                                       */
  #define EXMIF_CORE_SSICADDRESS_SR_TFNF_NOT_FULL (0x1UL) /*!< (unspecified)                                                   */

/* TFE @Bit 2 : Transmit FIFO Empty. */
  #define EXMIF_CORE_SSICADDRESS_SR_TFE_Pos (2UL)    /*!< Position of TFE field.                                               */
  #define EXMIF_CORE_SSICADDRESS_SR_TFE_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_TFE_Pos) /*!< Bit mask of TFE field.           */
  #define EXMIF_CORE_SSICADDRESS_SR_TFE_Min (0x0UL)  /*!< Min enumerator value of TFE field.                                   */
  #define EXMIF_CORE_SSICADDRESS_SR_TFE_Max (0x1UL)  /*!< Max enumerator value of TFE field.                                   */
  #define EXMIF_CORE_SSICADDRESS_SR_TFE_NOT_EMPTY (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_SR_TFE_EMPTY (0x1UL) /*!< (unspecified)                                                       */

/* RFNE @Bit 3 : Receive FIFO Not Empty. */
  #define EXMIF_CORE_SSICADDRESS_SR_RFNE_Pos (3UL)   /*!< Position of RFNE field.                                              */
  #define EXMIF_CORE_SSICADDRESS_SR_RFNE_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_RFNE_Pos) /*!< Bit mask of RFNE field.        */
  #define EXMIF_CORE_SSICADDRESS_SR_RFNE_Min (0x0UL) /*!< Min enumerator value of RFNE field.                                  */
  #define EXMIF_CORE_SSICADDRESS_SR_RFNE_Max (0x1UL) /*!< Max enumerator value of RFNE field.                                  */
  #define EXMIF_CORE_SSICADDRESS_SR_RFNE_EMPTY (0x0UL) /*!< (unspecified)                                                      */
  #define EXMIF_CORE_SSICADDRESS_SR_RFNE_NOT_EMPTY (0x1UL) /*!< (unspecified)                                                  */

/* RFF @Bit 4 : Receive FIFO Full. */
  #define EXMIF_CORE_SSICADDRESS_SR_RFF_Pos (4UL)    /*!< Position of RFF field.                                               */
  #define EXMIF_CORE_SSICADDRESS_SR_RFF_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_RFF_Pos) /*!< Bit mask of RFF field.           */
  #define EXMIF_CORE_SSICADDRESS_SR_RFF_Min (0x0UL)  /*!< Min enumerator value of RFF field.                                   */
  #define EXMIF_CORE_SSICADDRESS_SR_RFF_Max (0x1UL)  /*!< Max enumerator value of RFF field.                                   */
  #define EXMIF_CORE_SSICADDRESS_SR_RFF_NOT_FULL (0x0UL) /*!< (unspecified)                                                    */
  #define EXMIF_CORE_SSICADDRESS_SR_RFF_FULL (0x1UL) /*!< (unspecified)                                                        */

/* TXE @Bit 5 : Transmission Error. */
  #define EXMIF_CORE_SSICADDRESS_SR_TXE_Pos (5UL)    /*!< Position of TXE field.                                               */
  #define EXMIF_CORE_SSICADDRESS_SR_TXE_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_TXE_Pos) /*!< Bit mask of TXE field.           */
  #define EXMIF_CORE_SSICADDRESS_SR_TXE_Min (0x0UL)  /*!< Min enumerator value of TXE field.                                   */
  #define EXMIF_CORE_SSICADDRESS_SR_TXE_Max (0x1UL)  /*!< Max enumerator value of TXE field.                                   */
  #define EXMIF_CORE_SSICADDRESS_SR_TXE_NO_ERROR (0x0UL) /*!< (unspecified)                                                    */
  #define EXMIF_CORE_SSICADDRESS_SR_TXE_TX_ERROR (0x1UL) /*!< (unspecified)                                                    */

/* DCOL @Bit 6 : Data Collision Error. */
  #define EXMIF_CORE_SSICADDRESS_SR_DCOL_Pos (6UL)   /*!< Position of DCOL field.                                              */
  #define EXMIF_CORE_SSICADDRESS_SR_DCOL_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_DCOL_Pos) /*!< Bit mask of DCOL field.        */
  #define EXMIF_CORE_SSICADDRESS_SR_DCOL_Min (0x0UL) /*!< Min enumerator value of DCOL field.                                  */
  #define EXMIF_CORE_SSICADDRESS_SR_DCOL_Max (0x1UL) /*!< Max enumerator value of DCOL field.                                  */
  #define EXMIF_CORE_SSICADDRESS_SR_DCOL_NO_ERROR_CONDITION (0x0UL) /*!< (unspecified)                                         */
  #define EXMIF_CORE_SSICADDRESS_SR_DCOL_TX_COLLISION_ERROR (0x1UL) /*!< (unspecified)                                         */


/* EXMIF_CORE_SSICADDRESS_IMR: This read/write register masks or enables all interrupts generated by the DWC_ssi. */
  #define EXMIF_CORE_SSICADDRESS_IMR_ResetValue (0x000000FFUL) /*!< Reset value of IMR register.                               */

