adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TXEIM @Bit 0 : Transmit FIFO Empty Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXEIM_Pos (0UL) /*!< Position of TXEIM field.                                             */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXEIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_TXEIM_Pos) /*!< Bit mask of TXEIM field.   */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXEIM_Min (0x0UL) /*!< Min enumerator value of TXEIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXEIM_Max (0x1UL) /*!< Max enumerator value of TXEIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXEIM_MASKED (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXEIM_UNMASKED (0x1UL) /*!< (unspecified)                                                 */

/* TXOIM @Bit 1 : Transmit FIFO Overflow Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXOIM_Pos (1UL) /*!< Position of TXOIM field.                                             */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXOIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_TXOIM_Pos) /*!< Bit mask of TXOIM field.   */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXOIM_Min (0x0UL) /*!< Min enumerator value of TXOIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXOIM_Max (0x1UL) /*!< Max enumerator value of TXOIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXOIM_MASKED (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXOIM_UNMASKED (0x1UL) /*!< (unspecified)                                                 */

/* RXUIM @Bit 2 : Receive FIFO Underflow Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXUIM_Pos (2UL) /*!< Position of RXUIM field.                                             */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXUIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_RXUIM_Pos) /*!< Bit mask of RXUIM field.   */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXUIM_Min (0x0UL) /*!< Min enumerator value of RXUIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXUIM_Max (0x1UL) /*!< Max enumerator value of RXUIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXUIM_MASKED (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXUIM_UNMASKED (0x1UL) /*!< (unspecified)                                                 */

/* RXOIM @Bit 3 : Receive FIFO Overflow Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXOIM_Pos (3UL) /*!< Position of RXOIM field.                                             */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXOIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_RXOIM_Pos) /*!< Bit mask of RXOIM field.   */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXOIM_Min (0x0UL) /*!< Min enumerator value of RXOIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXOIM_Max (0x1UL) /*!< Max enumerator value of RXOIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXOIM_MASKED (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXOIM_UNMASKED (0x1UL) /*!< (unspecified)                                                 */

/* RXFIM @Bit 4 : Receive FIFO Full Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXFIM_Pos (4UL) /*!< Position of RXFIM field.                                             */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXFIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_RXFIM_Pos) /*!< Bit mask of RXFIM field.   */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXFIM_Min (0x0UL) /*!< Min enumerator value of RXFIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXFIM_Max (0x1UL) /*!< Max enumerator value of RXFIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXFIM_MASKED (0x0UL) /*!< ssi_rxf_intr interrupt is masked                                */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXFIM_UNMASKED (0x1UL) /*!< ssi_rxf_intr interrupt is not masked                          */

/* MSTIM @Bit 5 : Multi-Master Contention Interrupt Mask. */
  #define EXMIF_CORE_SSICADDRESS_IMR_MSTIM_Pos (5UL) /*!< Position of MSTIM field.                                             */
  #define EXMIF_CORE_SSICADDRESS_IMR_MSTIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_MSTIM_Pos) /*!< Bit mask of MSTIM field.   */
  #define EXMIF_CORE_SSICADDRESS_IMR_MSTIM_Min (0x0UL) /*!< Min enumerator value of MSTIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_MSTIM_Max (0x1UL) /*!< Max enumerator value of MSTIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_MSTIM_MASKED (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_IMR_MSTIM_UNMASKED (0x1UL) /*!< (unspecified)                                                 */

/* XRXOIM @Bit 6 : XIP Receive FIFO Overflow Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_Pos (6UL) /*!< Position of XRXOIM field.                                           */
  #define EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_Pos) /*!< Bit mask of XRXOIM field.*/
  #define EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_Min (0x0UL) /*!< Min enumerator value of XRXOIM field.                             */
  #define EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_Max (0x1UL) /*!< Max enumerator value of XRXOIM field.                             */
  #define EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_MASKED (0x0UL) /*!< (unspecified)                                                  */
  #define EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_UNMASKED (0x1UL) /*!< (unspecified)                                                */

/* TXUIM @Bit 7 : Transmit FIFO Underflow Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXUIM_Pos (7UL) /*!< Position of TXUIM field.                                             */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXUIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_TXUIM_Pos) /*!< Bit mask of TXUIM field.   */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXUIM_Min (0x0UL) /*!< Min enumerator value of TXUIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXUIM_Max (0x1UL) /*!< Max enumerator value of TXUIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXUIM_MASKED (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXUIM_UNMASKED (0x1UL) /*!< (unspecified)                                                 */

/* DONEM @Bit 11 : SSI Done Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_DONEM_Pos (11UL) /*!< Position of DONEM field.                                            */
  #define EXMIF_CORE_SSICADDRESS_IMR_DONEM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_DONEM_Pos) /*!< Bit mask of DONEM field.   */
  #define EXMIF_CORE_SSICADDRESS_IMR_DONEM_Min (0x0UL) /*!< Min enumerator value of DONEM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_DONEM_Max (0x1UL) /*!< Max enumerator value of DONEM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_DONEM_MASKED (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_IMR_DONEM_UNMASKED (0x1UL) /*!< (unspecified)                                                 */


