adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EXMIF_CORE_SSICADDRESS_ISR: This register reports the status of the DWC_ssi interrupts after they have been masked. */
  #define EXMIF_CORE_SSICADDRESS_ISR_ResetValue (0x00000000UL) /*!< Reset value of ISR register.                               */

/* TXEIS @Bit 0 : Transmit FIFO Empty Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXEIS_Pos (0UL) /*!< Position of TXEIS field.                                             */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXEIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_TXEIS_Pos) /*!< Bit mask of TXEIS field.   */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXEIS_Min (0x0UL) /*!< Min enumerator value of TXEIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXEIS_Max (0x1UL) /*!< Max enumerator value of TXEIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXEIS_INACTIVE (0x0UL) /*!< (unspecified)                                                 */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXEIS_ACTIVE (0x1UL) /*!< (unspecified)                                                   */

/* TXOIS @Bit 1 : Transmit FIFO Overflow Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXOIS_Pos (1UL) /*!< Position of TXOIS field.                                             */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXOIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_TXOIS_Pos) /*!< Bit mask of TXOIS field.   */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXOIS_Min (0x0UL) /*!< Min enumerator value of TXOIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXOIS_Max (0x1UL) /*!< Max enumerator value of TXOIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXOIS_INACTIVE (0x0UL) /*!< (unspecified)                                                 */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXOIS_ACTIVE (0x1UL) /*!< (unspecified)                                                   */

/* RXUIS @Bit 2 : Receive FIFO Underflow Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXUIS_Pos (2UL) /*!< Position of RXUIS field.                                             */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXUIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_RXUIS_Pos) /*!< Bit mask of RXUIS field.   */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXUIS_Min (0x0UL) /*!< Min enumerator value of RXUIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXUIS_Max (0x1UL) /*!< Max enumerator value of RXUIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXUIS_INACTIVE (0x0UL) /*!< (unspecified)                                                 */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXUIS_ACTIVE (0x1UL) /*!< (unspecified)                                                   */

/* RXOIS @Bit 3 : Receive FIFO Overflow Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXOIS_Pos (3UL) /*!< Position of RXOIS field.                                             */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXOIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_RXOIS_Pos) /*!< Bit mask of RXOIS field.   */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXOIS_Min (0x0UL) /*!< Min enumerator value of RXOIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXOIS_Max (0x1UL) /*!< Max enumerator value of RXOIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXOIS_INACTIVE (0x0UL) /*!< (unspecified)                                                 */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXOIS_ACTIVE (0x1UL) /*!< (unspecified)                                                   */

/* RXFIS @Bit 4 : Receive FIFO Full Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXFIS_Pos (4UL) /*!< Position of RXFIS field.                                             */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXFIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_RXFIS_Pos) /*!< Bit mask of RXFIS field.   */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXFIS_Min (0x0UL) /*!< Min enumerator value of RXFIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXFIS_Max (0x1UL) /*!< Max enumerator value of RXFIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXFIS_INACTIVE (0x0UL) /*!< (unspecified)                                                 */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXFIS_ACTIVE (0x1UL) /*!< (unspecified)                                                   */

/* MSTIS @Bit 5 : Multi-Master Contention Interrupt Status. */
  #define EXMIF_CORE_SSICADDRESS_ISR_MSTIS_Pos (5UL) /*!< Position of MSTIS field.                                             */
  #define EXMIF_CORE_SSICADDRESS_ISR_MSTIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_MSTIS_Pos) /*!< Bit mask of MSTIS field.   */
  #define EXMIF_CORE_SSICADDRESS_ISR_MSTIS_Min (0x0UL) /*!< Min enumerator value of MSTIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_MSTIS_Max (0x1UL) /*!< Max enumerator value of MSTIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_MSTIS_INACTIVE (0x0UL) /*!< (unspecified)                                                 */
  #define EXMIF_CORE_SSICADDRESS_ISR_MSTIS_ACTIVE (0x1UL) /*!< (unspecified)                                                   */

/* XRXOIS @Bit 6 : XIP Receive FIFO Overflow Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_Pos (6UL) /*!< Position of XRXOIS field.                                           */
  #define EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_Pos) /*!< Bit mask of XRXOIS field.*/
  #define EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_Min (0x0UL) /*!< Min enumerator value of XRXOIS field.                             */
  #define EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_Max (0x1UL) /*!< Max enumerator value of XRXOIS field.                             */
  #define EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_INACTIVE (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_ACTIVE (0x1UL) /*!< (unspecified)                                                  */

/* TXUIS @Bit 7 : Transmit FIFO Underflow Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXUIS_Pos (7UL) /*!< Position of TXUIS field.                                             */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXUIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_TXUIS_Pos) /*!< Bit mask of TXUIS field.   */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXUIS_Min (0x0UL) /*!< Min enumerator value of TXUIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXUIS_Max (0x1UL) /*!< Max enumerator value of TXUIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXUIS_INACTIVE (0x0UL) /*!< (unspecified)                                                 */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXUIS_ACTIVE (0x1UL) /*!< (unspecified)                                                   */

/* DONES @Bit 11 : SSI Done Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_DONES_Pos (11UL) /*!< Position of DONES field.                                            */
  #define EXMIF_CORE_SSICADDRESS_ISR_DONES_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_DONES_Pos) /*!< Bit mask of DONES field.   */
  #define EXMIF_CORE_SSICADDRESS_ISR_DONES_Min (0x0UL) /*!< Min enumerator value of DONES field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_DONES_Max (0x1UL) /*!< Max enumerator value of DONES field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_DONES_INACTIVE (0x0UL) /*!< (unspecified)                                                 */
  #define EXMIF_CORE_SSICADDRESS_ISR_DONES_ACTIVE (0x1UL) /*!< (unspecified)                                                   */


