adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EXMIF_CORE_SSICADDRESS_TXEICR: Transmit FIFO Error Interrupt Clear Register */
  #define EXMIF_CORE_SSICADDRESS_TXEICR_ResetValue (0x00000000UL) /*!< Reset value of TXEICR register.                         */

/* TXEICR @Bit 0 : Clear Transmit FIFO Overflow/Underflow Interrupt. */
  #define EXMIF_CORE_SSICADDRESS_TXEICR_TXEICR_Pos (0UL) /*!< Position of TXEICR field.                                        */
  #define EXMIF_CORE_SSICADDRESS_TXEICR_TXEICR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_TXEICR_TXEICR_Pos) /*!< Bit mask of TXEICR
                                                                            field.*/                                              


/* EXMIF_CORE_SSICADDRESS_RXOICR: Receive FIFO Overflow Interrupt Clear Register */
  #define EXMIF_CORE_SSICADDRESS_RXOICR_ResetValue (0x00000000UL) /*!< Reset value of RXOICR register.                         */

/* RXOICR @Bit 0 : Clear Receive FIFO Overflow Interrupt. */
  #define EXMIF_CORE_SSICADDRESS_RXOICR_RXOICR_Pos (0UL) /*!< Position of RXOICR field.                                        */
  #define EXMIF_CORE_SSICADDRESS_RXOICR_RXOICR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RXOICR_RXOICR_Pos) /*!< Bit mask of RXOICR
                                                                            field.*/                                              


/* EXMIF_CORE_SSICADDRESS_RXUICR: Receive FIFO Underflow Interrupt Clear Register */
  #define EXMIF_CORE_SSICADDRESS_RXUICR_ResetValue (0x00000000UL) /*!< Reset value of RXUICR register.                         */

/* RXUICR @Bit 0 : Clear Receive FIFO Underflow Interrupt. */
  #define EXMIF_CORE_SSICADDRESS_RXUICR_RXUICR_Pos (0UL) /*!< Position of RXUICR field.                                        */
  #define EXMIF_CORE_SSICADDRESS_RXUICR_RXUICR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RXUICR_RXUICR_Pos) /*!< Bit mask of RXUICR
                                                                            field.*/                                              


/* EXMIF_CORE_SSICADDRESS_MSTICR: Multi-Master Interrupt Clear Register */
  #define EXMIF_CORE_SSICADDRESS_MSTICR_ResetValue (0x00000000UL) /*!< Reset value of MSTICR register.                         */

/* MSTICR @Bit 0 : Clear Multi-Master Contention Interrupt. */
  #define EXMIF_CORE_SSICADDRESS_MSTICR_MSTICR_Pos (0UL) /*!< Position of MSTICR field.                                        */
  #define EXMIF_CORE_SSICADDRESS_MSTICR_MSTICR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_MSTICR_MSTICR_Pos) /*!< Bit mask of MSTICR
                                                                            field.*/                                              


/* EXMIF_CORE_SSICADDRESS_ICR: Interrupt Clear Register */
  #define EXMIF_CORE_SSICADDRESS_ICR_ResetValue (0x00000000UL) /*!< Reset value of ICR register.                               */

/* ICR @Bit 0 : Clear Interrupts. */
  #define EXMIF_CORE_SSICADDRESS_ICR_ICR_Pos (0UL)   /*!< Position of ICR field.                                               */
  #define EXMIF_CORE_SSICADDRESS_ICR_ICR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ICR_ICR_Pos) /*!< Bit mask of ICR field.         */


/* EXMIF_CORE_SSICADDRESS_IDR: This register contains the peripherals identification code, which is written into the register at
                                configuration time using coreConsultant. */                                                       
                                                                                                                                  
  #define EXMIF_CORE_SSICADDRESS_IDR_ResetValue (0x00010003UL) /*!< Reset value of IDR register.                               */

/* IDCODE @Bits 0..31 : Identification code. */
  #define EXMIF_CORE_SSICADDRESS_IDR_IDCODE_Pos (0UL) /*!< Position of IDCODE field.                                           */
  #define EXMIF_CORE_SSICADDRESS_IDR_IDCODE_Msk (0xFFFFFFFFUL << EXMIF_CORE_SSICADDRESS_IDR_IDCODE_Pos) /*!< Bit mask of IDCODE
                                                                            field.*/                                              


/* EXMIF_CORE_SSICADDRESS_SSICVERSIONID: This read-only register stores the specific DWC_ssi component version. */
  #define EXMIF_CORE_SSICADDRESS_SSICVERSIONID_ResetValue (0x3130332AUL) /*!< Reset value of SSICVERSIONID register.           */

/* SSICCOMPVERSION @Bits 0..31 : Contains the hex representation of the Synopsys component version. */
  #define EXMIF_CORE_SSICADDRESS_SSICVERSIONID_SSICCOMPVERSION_Pos (0UL) /*!< Position of SSICCOMPVERSION field.               */
  #define EXMIF_CORE_SSICADDRESS_SSICVERSIONID_SSICCOMPVERSION_Msk (0xFFFFFFFFUL << EXMIF_CORE_SSICADDRESS_SSICVERSIONID_SSICCOMPVERSION_Pos)
                                                                            /*!< Bit mask of SSICCOMPVERSION field.*/             


/* EXMIF_CORE_SSICADDRESS_DR: The DWC_ssi data register is a 32-bit read/write buffer for the transmit/receive FIFOs. */
  #define EXMIF_CORE_SSICADDRESS_DR_MaxCount (36UL)  /*!< Max size of DR[36] array.                                            */
  #define EXMIF_CORE_SSICADDRESS_DR_ResetValue (0x00000000UL) /*!< Reset value of DR[36] register.                             */

/* DR @Bits 0..31 : Data Register. */
  #define EXMIF_CORE_SSICADDRESS_DR_DR_Pos (0UL)     /*!< Position of DR field.                                                */
  #define EXMIF_CORE_SSICADDRESS_DR_DR_Msk (0xFFFFFFFFUL << EXMIF_CORE_SSICADDRESS_DR_DR_Pos) /*!< Bit mask of DR field.       */


/* EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY: This register is only valid when the DWC_ssi is configured with rxd sample delay logic
                                          (SSIC_HAS_RX_SAMPLE_DELAY==1). */                                                       
                                                                                                                                  
  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_ResetValue (0x00000000UL) /*!< Reset value of RXSAMPLEDELAY register.           */

