adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* WRSPIDDREN @Bit 10 : SPI DDR Enable bit. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRSPIDDREN_Pos (10UL) /*!< Position of WRSPIDDREN field.                      */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRSPIDDREN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRSPIDDREN_Pos)
                                                                            /*!< Bit mask of WRSPIDDREN field.*/                  

/* WRINSTDDREN @Bit 11 : Instruction DDR Enable bit. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTDDREN_Pos (11UL) /*!< Position of WRINSTDDREN field.                    */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTDDREN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTDDREN_Pos)
                                                                            /*!< Bit mask of WRINSTDDREN field.*/                 

/* XIPWRHYPERBUSEN @Bit 12 : SPI Hyperbus Frame format enable for XIP Write transfers. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_XIPWRHYPERBUSEN_Pos (12UL) /*!< Position of XIPWRHYPERBUSEN field.            */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_XIPWRHYPERBUSEN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_XIPWRHYPERBUSEN_Pos)
                                                                            /*!< Bit mask of XIPWRHYPERBUSEN field.*/             

/* XIPWRRXDSSIGEN @Bit 13 : Enable rxds signaling during address and command phase of Hyperbus transfer. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_XIPWRRXDSSIGEN_Pos (13UL) /*!< Position of XIPWRRXDSSIGEN field.              */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_XIPWRRXDSSIGEN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_XIPWRRXDSSIGEN_Pos)
                                                                            /*!< Bit mask of XIPWRRXDSSIGEN field.*/              

/* RSVDXIPWRITECTRL14TO15 @Bits 14..15 : Reserved bits - Read Only */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_RSVDXIPWRITECTRL14TO15_Pos (14UL) /*!< Position of RSVDXIPWRITECTRL14TO15
                                                                            field.*/                                              
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_RSVDXIPWRITECTRL14TO15_Msk (0x3UL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_RSVDXIPWRITECTRL14TO15_Pos)
                                                                            /*!< Bit mask of RSVDXIPWRITECTRL14TO15 field.*/      

/* XIPWRWAITCYCLES @Bits 16..20 : Wait cycles in Dual/Quad/Octal mode between control frames transmit and data reception. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_XIPWRWAITCYCLES_Pos (16UL) /*!< Position of XIPWRWAITCYCLES field.            */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_XIPWRWAITCYCLES_Msk (0x1FUL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_XIPWRWAITCYCLES_Pos)
                                                                            /*!< Bit mask of XIPWRWAITCYCLES field.*/             

/* RSVDXIPWRITECTRL21TO31 @Bits 21..31 : Reserved bits - Read Only */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_RSVDXIPWRITECTRL21TO31_Pos (21UL) /*!< Position of RSVDXIPWRITECTRL21TO31
                                                                            field.*/                                              
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_RSVDXIPWRITECTRL21TO31_Msk (0x7FFUL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_RSVDXIPWRITECTRL21TO31_Pos)
                                                                            /*!< Bit mask of RSVDXIPWRITECTRL21TO31 field.*/      



/* ==================================================== Struct EXMIF_CORE ==================================================== */
/**
  * @brief CORE [EXMIF_CORE] (unspecified)
  */
typedef struct {
  __IOM NRF_EXMIF_CORE_SSICADDRESS_Type SSICADDRESS; /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_EXMIF_CORE_SSICXIPADDRESS_Type SSICXIPADDRESS; /*!< (@ 0x00000100) (unspecified)                                   */
} NRF_EXMIF_CORE_Type;                               /*!< Size = 332 (0x14C)                                                   */

/* ====================================================== Struct EXMIF ======================================================= */
/**
  * @brief External Memory Interface
  */
  typedef struct {                                   /*!< EXMIF Structure                                                      */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start operation.                                      */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop operation.                                       */
    __IM uint32_t RESERVED[3];
    __IOM uint32_t LOCKEDACCESS;                     /*!< (@ 0x00000014) Enable or disable locked APB access to serial memory
                                                                         controller.*/                                            
    __IOM uint32_t PROGDELAY;                        /*!< (@ 0x00000018) Configures delay of the incoming data strobe.         */
    __IOM uint32_t RESET;                            /*!< (@ 0x0000001C) Reset the external memory.                            */
    __IM uint32_t RESERVED1[56];
    __IOM uint32_t EVENTS_CORE;                      /*!< (@ 0x00000100) Event indicating that interrupt triggered at EXMIF
                                                                         core*/                                                   
    __IOM uint32_t EVENTS_STARTED;                   /*!< (@ 0x00000104) Event indicating that the START task is completed and
                                                                         the EXMIF has started.*/                                 
    __IM uint32_t RESERVED2[126];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED3[60];
    #if defined(_GNUC_)
      #pragma GCC diagnostic push
      #pragma GCC diagnostic ignored "-Wpedantic"
    #endif
    union {
      __IOM NRF_EXMIF_EXTCONF1_Type EXTCONF1;        /*!< (@ 0x00000400) Configuration for external memory device 1.           */
      struct {
        __IM uint32_t RESERVED4[2];
        __IOM NRF_EXMIF_EXTCONF2_Type EXTCONF2;      /*!< (@ 0x00000408) Configuration for external memory device 2.           */
      };
    };
    #if defined(_GNUC_)
      #pragma GCC diagnostic pop
    #endif
    __IM uint32_t RESERVED5[55];
    __IOM NRF_EXMIF_CORE_Type CORE;                  /*!< (@ 0x00000500) (unspecified)                                         */
  } NRF_EXMIF_Type;                                  /*!< Size = 1612 (0x64C)                                                  */

/* EXMIF_TASKS_START: Start operation. */
  #define EXMIF_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                */

