adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EXMIF_EVENTS_CORE: Event indicating that interrupt triggered at EXMIF core */
  #define EXMIF_EVENTS_CORE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CORE register.                                */

/* EVENTS_CORE @Bit 0 : Event indicating that interrupt triggered at EXMIF core */
  #define EXMIF_EVENTS_CORE_EVENTS_CORE_Pos (0UL)    /*!< Position of EVENTS_CORE field.                                       */
  #define EXMIF_EVENTS_CORE_EVENTS_CORE_Msk (0x1UL << EXMIF_EVENTS_CORE_EVENTS_CORE_Pos) /*!< Bit mask of EVENTS_CORE field.   */
  #define EXMIF_EVENTS_CORE_EVENTS_CORE_Min (0x0UL)  /*!< Min enumerator value of EVENTS_CORE field.                           */
  #define EXMIF_EVENTS_CORE_EVENTS_CORE_Max (0x1UL)  /*!< Max enumerator value of EVENTS_CORE field.                           */
  #define EXMIF_EVENTS_CORE_EVENTS_CORE_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define EXMIF_EVENTS_CORE_EVENTS_CORE_Generated (0x1UL) /*!< Event generated                                                 */


/* EXMIF_EVENTS_STARTED: Event indicating that the START task is completed and the EXMIF has started. */
  #define EXMIF_EVENTS_STARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STARTED register.                          */

/* EVENTS_STARTED @Bit 0 : Event indicating that the START task is completed and the EXMIF has started. */
  #define EXMIF_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL) /*!< Position of EVENTS_STARTED field.                                 */
  #define EXMIF_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << EXMIF_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/                               
  #define EXMIF_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STARTED field.                   */
  #define EXMIF_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STARTED field.                   */
  #define EXMIF_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define EXMIF_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL) /*!< Event generated                                           */


/* EXMIF_INTEN: Enable or disable interrupt */
  #define EXMIF_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* CORE @Bit 0 : Enable or disable interrupt for event CORE */
  #define EXMIF_INTEN_CORE_Pos (0UL)                 /*!< Position of CORE field.                                              */
  #define EXMIF_INTEN_CORE_Msk (0x1UL << EXMIF_INTEN_CORE_Pos) /*!< Bit mask of CORE field.                                    */
  #define EXMIF_INTEN_CORE_Min (0x0UL)               /*!< Min enumerator value of CORE field.                                  */
  #define EXMIF_INTEN_CORE_Max (0x1UL)               /*!< Max enumerator value of CORE field.                                  */
  #define EXMIF_INTEN_CORE_Disabled (0x0UL)          /*!< Disable                                                              */
  #define EXMIF_INTEN_CORE_Enabled (0x1UL)           /*!< Enable                                                               */

/* STARTED @Bit 1 : Enable or disable interrupt for event STARTED */
  #define EXMIF_INTEN_STARTED_Pos (1UL)              /*!< Position of STARTED field.                                           */
  #define EXMIF_INTEN_STARTED_Msk (0x1UL << EXMIF_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field.                           */
  #define EXMIF_INTEN_STARTED_Min (0x0UL)            /*!< Min enumerator value of STARTED field.                               */
  #define EXMIF_INTEN_STARTED_Max (0x1UL)            /*!< Max enumerator value of STARTED field.                               */
  #define EXMIF_INTEN_STARTED_Disabled (0x0UL)       /*!< Disable                                                              */
  #define EXMIF_INTEN_STARTED_Enabled (0x1UL)        /*!< Enable                                                               */


/* EXMIF_INTENSET: Enable interrupt */
  #define EXMIF_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* CORE @Bit 0 : Write '1' to enable interrupt for event CORE */
  #define EXMIF_INTENSET_CORE_Pos (0UL)              /*!< Position of CORE field.                                              */
  #define EXMIF_INTENSET_CORE_Msk (0x1UL << EXMIF_INTENSET_CORE_Pos) /*!< Bit mask of CORE field.                              */
  #define EXMIF_INTENSET_CORE_Min (0x0UL)            /*!< Min enumerator value of CORE field.                                  */
  #define EXMIF_INTENSET_CORE_Max (0x1UL)            /*!< Max enumerator value of CORE field.                                  */
  #define EXMIF_INTENSET_CORE_Set (0x1UL)            /*!< Enable                                                               */
  #define EXMIF_INTENSET_CORE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define EXMIF_INTENSET_CORE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* STARTED @Bit 1 : Write '1' to enable interrupt for event STARTED */
  #define EXMIF_INTENSET_STARTED_Pos (1UL)           /*!< Position of STARTED field.                                           */
  #define EXMIF_INTENSET_STARTED_Msk (0x1UL << EXMIF_INTENSET_STARTED_Pos) /*!< Bit mask of STARTED field.                     */
  #define EXMIF_INTENSET_STARTED_Min (0x0UL)         /*!< Min enumerator value of STARTED field.                               */
  #define EXMIF_INTENSET_STARTED_Max (0x1UL)         /*!< Max enumerator value of STARTED field.                               */
  #define EXMIF_INTENSET_STARTED_Set (0x1UL)         /*!< Enable                                                               */
  #define EXMIF_INTENSET_STARTED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define EXMIF_INTENSET_STARTED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* EXMIF_INTENCLR: Disable interrupt */
  #define EXMIF_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* CORE @Bit 0 : Write '1' to disable interrupt for event CORE */
  #define EXMIF_INTENCLR_CORE_Pos (0UL)              /*!< Position of CORE field.                                              */
  #define EXMIF_INTENCLR_CORE_Msk (0x1UL << EXMIF_INTENCLR_CORE_Pos) /*!< Bit mask of CORE field.                              */
  #define EXMIF_INTENCLR_CORE_Min (0x0UL)            /*!< Min enumerator value of CORE field.                                  */
  #define EXMIF_INTENCLR_CORE_Max (0x1UL)            /*!< Max enumerator value of CORE field.                                  */
  #define EXMIF_INTENCLR_CORE_Clear (0x1UL)          /*!< Disable                                                              */
  #define EXMIF_INTENCLR_CORE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define EXMIF_INTENCLR_CORE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* STARTED @Bit 1 : Write '1' to disable interrupt for event STARTED */
  #define EXMIF_INTENCLR_STARTED_Pos (1UL)           /*!< Position of STARTED field.                                           */
  #define EXMIF_INTENCLR_STARTED_Msk (0x1UL << EXMIF_INTENCLR_STARTED_Pos) /*!< Bit mask of STARTED field.                     */
  #define EXMIF_INTENCLR_STARTED_Min (0x0UL)         /*!< Min enumerator value of STARTED field.                               */
  #define EXMIF_INTENCLR_STARTED_Max (0x1UL)         /*!< Max enumerator value of STARTED field.                               */
  #define EXMIF_INTENCLR_STARTED_Clear (0x1UL)       /*!< Disable                                                              */
  #define EXMIF_INTENCLR_STARTED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define EXMIF_INTENCLR_STARTED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* EXMIF_INTPEND: Pending interrupts */
  #define EXMIF_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* CORE @Bit 0 : Read pending status of interrupt for event CORE */
  #define EXMIF_INTPEND_CORE_Pos (0UL)               /*!< Position of CORE field.                                              */
  #define EXMIF_INTPEND_CORE_Msk (0x1UL << EXMIF_INTPEND_CORE_Pos) /*!< Bit mask of CORE field.                                */
  #define EXMIF_INTPEND_CORE_Min (0x0UL)             /*!< Min enumerator value of CORE field.                                  */
  #define EXMIF_INTPEND_CORE_Max (0x1UL)             /*!< Max enumerator value of CORE field.                                  */
  #define EXMIF_INTPEND_CORE_NotPending (0x0UL)      /*!< Read: Not pending                                                    */
  #define EXMIF_INTPEND_CORE_Pending (0x1UL)         /*!< Read: Pending                                                        */

