adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* STARTED @Bit 1 : Read pending status of interrupt for event STARTED */
  #define EXMIF_INTPEND_STARTED_Pos (1UL)            /*!< Position of STARTED field.                                           */
  #define EXMIF_INTPEND_STARTED_Msk (0x1UL << EXMIF_INTPEND_STARTED_Pos) /*!< Bit mask of STARTED field.                       */
  #define EXMIF_INTPEND_STARTED_Min (0x0UL)          /*!< Min enumerator value of STARTED field.                               */
  #define EXMIF_INTPEND_STARTED_Max (0x1UL)          /*!< Max enumerator value of STARTED field.                               */
  #define EXMIF_INTPEND_STARTED_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define EXMIF_INTPEND_STARTED_Pending (0x1UL)      /*!< Read: Pending                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           FICR                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct FICR_SOCINFO =================================================== */
/**
  * @brief SOCINFO [FICR_SOCINFO] (unspecified)
  */
typedef struct {
  __IM  uint32_t  PARTNO;                            /*!< (@ 0x00000000) Part number.                                          */
  __IM  uint32_t  HWREVISION;                        /*!< (@ 0x00000004) Hardware revision.                                    */
  __IM  uint32_t  PRODUCTIONREVISION;                /*!< (@ 0x00000008) Production reversion.                                 */
} NRF_FICR_SOCINFO_Type;                             /*!< Size = 12 (0x00C)                                                    */

/* FICR_SOCINFO_PARTNO: Part number. */
  #define FICR_SOCINFO_PARTNO_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PARTNO register.                                   */

/* PART @Bits 0..31 : Part number. */
  #define FICR_SOCINFO_PARTNO_PART_Pos (0UL)         /*!< Position of PART field.                                              */
  #define FICR_SOCINFO_PARTNO_PART_Msk (0xFFFFFFFFUL << FICR_SOCINFO_PARTNO_PART_Pos) /*!< Bit mask of PART field.             */


/* FICR_SOCINFO_HWREVISION: Hardware revision. */
  #define FICR_SOCINFO_HWREVISION_ResetValue (0xFFFFFFFFUL) /*!< Reset value of HWREVISION register.                           */

/* HWREVISION @Bits 0..31 : Hardvare revision. */
  #define FICR_SOCINFO_HWREVISION_HWREVISION_Pos (0UL) /*!< Position of HWREVISION field.                                      */
  #define FICR_SOCINFO_HWREVISION_HWREVISION_Msk (0xFFFFFFFFUL << FICR_SOCINFO_HWREVISION_HWREVISION_Pos) /*!< Bit mask of
                                                                            HWREVISION field.*/                                   


/* FICR_SOCINFO_PRODUCTIONREVISION: Production reversion. */
  #define FICR_SOCINFO_PRODUCTIONREVISION_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PRODUCTIONREVISION register.           */

/* PRODUCTIONREVISION @Bits 0..31 : Production reversion. */
  #define FICR_SOCINFO_PRODUCTIONREVISION_PRODUCTIONREVISION_Pos (0UL) /*!< Position of PRODUCTIONREVISION field.              */
  #define FICR_SOCINFO_PRODUCTIONREVISION_PRODUCTIONREVISION_Msk (0xFFFFFFFFUL << FICR_SOCINFO_PRODUCTIONREVISION_PRODUCTIONREVISION_Pos)
                                                                            /*!< Bit mask of PRODUCTIONREVISION field.*/          



/* ===================================================== Struct FICR_BLE ===================================================== */
/**
  * @brief BLE [FICR_BLE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  ADDRTYPE;                          /*!< (@ 0x00000000) Device address type.                                  */
  __IM  uint32_t  ADDR[2];                           /*!< (@ 0x00000004) 48 bit device address.                                */
  __IM  uint32_t  ER[4];                             /*!< (@ 0x0000000C) Encryption Root.                                      */
  __IM  uint32_t  IR[4];                             /*!< (@ 0x0000001C) Identity Root.                                        */
} NRF_FICR_BLE_Type;                                 /*!< Size = 44 (0x02C)                                                    */

/* FICR_BLE_ADDRTYPE: Device address type. */
  #define FICR_BLE_ADDRTYPE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ADDRTYPE register.                                   */

/* TYPE @Bit 0 : Device address type. */
  #define FICR_BLE_ADDRTYPE_TYPE_Pos (0UL)           /*!< Position of TYPE field.                                              */
  #define FICR_BLE_ADDRTYPE_TYPE_Msk (0x1UL << FICR_BLE_ADDRTYPE_TYPE_Pos) /*!< Bit mask of TYPE field.                        */
  #define FICR_BLE_ADDRTYPE_TYPE_Min (0x0UL)         /*!< Min enumerator value of TYPE field.                                  */
  #define FICR_BLE_ADDRTYPE_TYPE_Max (0x1UL)         /*!< Max enumerator value of TYPE field.                                  */
  #define FICR_BLE_ADDRTYPE_TYPE_Public (0x0UL)      /*!< Public address.                                                      */
  #define FICR_BLE_ADDRTYPE_TYPE_Random (0x1UL)      /*!< Random address.                                                      */


/* FICR_BLE_ADDR: 48 bit device address. */
  #define FICR_BLE_ADDR_MaxCount (2UL)               /*!< Max size of ADDR[2] array.                                           */
  #define FICR_BLE_ADDR_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of ADDR[2] register.                                     */

