adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FICR_WIFI_DISABLE5GHZ: Disable 5GHz */
  #define FICR_WIFI_DISABLE5GHZ_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DISABLE5GHZ register.                            */

/* VALUE @Bits 0..31 : Disable 5GHz support. Firmware reads at start of day. Set to 0x50FA50FA to disable 5GHz operation. */
  #define FICR_WIFI_DISABLE5GHZ_VALUE_Pos (0UL)      /*!< Position of VALUE field.                                             */
  #define FICR_WIFI_DISABLE5GHZ_VALUE_Msk (0xFFFFFFFFUL << FICR_WIFI_DISABLE5GHZ_VALUE_Pos) /*!< Bit mask of VALUE field.      */


/* FICR_WIFI_MACADDR0: Least significant 4 bytes of default MAC address for VIF[n]. */
  #define FICR_WIFI_MACADDR0_MaxCount (3UL)          /*!< Max size of MACADDR0[3] array.                                       */
  #define FICR_WIFI_MACADDR0_ResetValue (0xFFFFFFFFUL) /*!< Reset value of MACADDR0[3] register.                               */

/* MACADDRLO @Bits 0..31 : MAC address for VIF[n] bytes 3:0. */
  #define FICR_WIFI_MACADDR0_MACADDRLO_Pos (0UL)     /*!< Position of MACADDRLO field.                                         */
  #define FICR_WIFI_MACADDR0_MACADDRLO_Msk (0xFFFFFFFFUL << FICR_WIFI_MACADDR0_MACADDRLO_Pos) /*!< Bit mask of MACADDRLO field.*/


/* FICR_WIFI_MACADDR1: Most significant 2 bytes of default MAC address for VIF[n]. */
  #define FICR_WIFI_MACADDR1_MaxCount (3UL)          /*!< Max size of MACADDR1[3] array.                                       */
  #define FICR_WIFI_MACADDR1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of MACADDR1[3] register.                               */

/* MACADDRHI @Bits 0..15 : MAC address for VIF[n] bytes 5:4. */
  #define FICR_WIFI_MACADDR1_MACADDRHI_Pos (0UL)     /*!< Position of MACADDRHI field.                                         */
  #define FICR_WIFI_MACADDR1_MACADDRHI_Msk (0xFFFFUL << FICR_WIFI_MACADDR1_MACADDRHI_Pos) /*!< Bit mask of MACADDRHI field.    */



/* ================================================= Struct FICR_PRODTEST_CP ================================================= */
/**
  * @brief CP [FICR_PRODTEST_CP] (unspecified)
  */
typedef struct {
  __IM  uint32_t  LOTNR[2];                          /*!< (@ 0x00000000) Lot number.                                           */
  __IM  uint32_t  WAFERXY;                           /*!< (@ 0x00000008) Wafer number and die X,Y coordinate.                  */
  __IM  uint32_t  PROGVERSION1;                      /*!< (@ 0x0000000C) CP1 test program version.                             */
  __IM  uint32_t  PROGVERSION2;                      /*!< (@ 0x00000010) CP2 test program version.                             */
} NRF_FICR_PRODTEST_CP_Type;                         /*!< Size = 20 (0x014)                                                    */

/* FICR_PRODTEST_CP_LOTNR: Lot number. */
  #define FICR_PRODTEST_CP_LOTNR_MaxCount (2UL)      /*!< Max size of LOTNR[2] array.                                          */
  #define FICR_PRODTEST_CP_LOTNR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LOTNR[2] register.                              */

/* LOTNR @Bits 0..31 : Lot number */
  #define FICR_PRODTEST_CP_LOTNR_LOTNR_Pos (0UL)     /*!< Position of LOTNR field.                                             */
  #define FICR_PRODTEST_CP_LOTNR_LOTNR_Msk (0xFFFFFFFFUL << FICR_PRODTEST_CP_LOTNR_LOTNR_Pos) /*!< Bit mask of LOTNR field.    */


/* FICR_PRODTEST_CP_WAFERXY: Wafer number and die X,Y coordinate. */
  #define FICR_PRODTEST_CP_WAFERXY_ResetValue (0xFFFFFFFFUL) /*!< Reset value of WAFERXY register.                             */

/* YCOORD @Bits 0..7 : Die y coordinate */
  #define FICR_PRODTEST_CP_WAFERXY_YCOORD_Pos (0UL)  /*!< Position of YCOORD field.                                            */
  #define FICR_PRODTEST_CP_WAFERXY_YCOORD_Msk (0xFFUL << FICR_PRODTEST_CP_WAFERXY_YCOORD_Pos) /*!< Bit mask of YCOORD field.   */

/* XCOORD @Bits 8..15 : Die x coordinate */
  #define FICR_PRODTEST_CP_WAFERXY_XCOORD_Pos (8UL)  /*!< Position of XCOORD field.                                            */
  #define FICR_PRODTEST_CP_WAFERXY_XCOORD_Msk (0xFFUL << FICR_PRODTEST_CP_WAFERXY_XCOORD_Pos) /*!< Bit mask of XCOORD field.   */

/* WAFER @Bits 16..23 : Wafer number */
  #define FICR_PRODTEST_CP_WAFERXY_WAFER_Pos (16UL)  /*!< Position of WAFER field.                                             */
  #define FICR_PRODTEST_CP_WAFERXY_WAFER_Msk (0xFFUL << FICR_PRODTEST_CP_WAFERXY_WAFER_Pos) /*!< Bit mask of WAFER field.      */


/* FICR_PRODTEST_CP_PROGVERSION1: CP1 test program version. */
  #define FICR_PRODTEST_CP_PROGVERSION1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PROGVERSION1 register.                   */

/* PROGVERSION1 @Bits 0..31 : CP1 test program version */
  #define FICR_PRODTEST_CP_PROGVERSION1_PROGVERSION1_Pos (0UL) /*!< Position of PROGVERSION1 field.                            */
  #define FICR_PRODTEST_CP_PROGVERSION1_PROGVERSION1_Msk (0xFFFFFFFFUL << FICR_PRODTEST_CP_PROGVERSION1_PROGVERSION1_Pos) /*!<
                                                                            Bit mask of PROGVERSION1 field.*/                     


/* FICR_PRODTEST_CP_PROGVERSION2: CP2 test program version. */
  #define FICR_PRODTEST_CP_PROGVERSION2_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PROGVERSION2 register.                   */

/* PROGVERSION2 @Bits 0..31 : CP2 test program version */
  #define FICR_PRODTEST_CP_PROGVERSION2_PROGVERSION2_Pos (0UL) /*!< Position of PROGVERSION2 field.                            */
  #define FICR_PRODTEST_CP_PROGVERSION2_PROGVERSION2_Msk (0xFFFFFFFFUL << FICR_PRODTEST_CP_PROGVERSION2_PROGVERSION2_Pos) /*!<
                                                                            Bit mask of PROGVERSION2 field.*/                     



/* ================================================= Struct FICR_PRODTEST_FT ================================================= */
/**
  * @brief FT [FICR_PRODTEST_FT] (unspecified)
  */
typedef struct {
  __IM  uint32_t  PROGVERSION1;                      /*!< (@ 0x00000000) FT1 test program version.                             */
  __IM  uint32_t  PROGVERSION2;                      /*!< (@ 0x00000004) FT2 test program version.                             */
} NRF_FICR_PRODTEST_FT_Type;                         /*!< Size = 8 (0x008)                                                     */

/* FICR_PRODTEST_FT_PROGVERSION1: FT1 test program version. */
  #define FICR_PRODTEST_FT_PROGVERSION1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PROGVERSION1 register.                   */

