adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PROGVERSION1 @Bits 0..31 : FT1 test program version */
  #define FICR_PRODTEST_FT_PROGVERSION1_PROGVERSION1_Pos (0UL) /*!< Position of PROGVERSION1 field.                            */
  #define FICR_PRODTEST_FT_PROGVERSION1_PROGVERSION1_Msk (0xFFFFFFFFUL << FICR_PRODTEST_FT_PROGVERSION1_PROGVERSION1_Pos) /*!<
                                                                            Bit mask of PROGVERSION1 field.*/                     


/* FICR_PRODTEST_FT_PROGVERSION2: FT2 test program version. */
  #define FICR_PRODTEST_FT_PROGVERSION2_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PROGVERSION2 register.                   */

/* PROGVERSION2 @Bits 0..31 : FT2 test program version */
  #define FICR_PRODTEST_FT_PROGVERSION2_PROGVERSION2_Pos (0UL) /*!< Position of PROGVERSION2 field.                            */
  #define FICR_PRODTEST_FT_PROGVERSION2_PROGVERSION2_Msk (0xFFFFFFFFUL << FICR_PRODTEST_FT_PROGVERSION2_PROGVERSION2_Pos) /*!<
                                                                            Bit mask of PROGVERSION2 field.*/                     



/* ================================================== Struct FICR_PRODTEST =================================================== */
/**
  * @brief PRODTEST [FICR_PRODTEST] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_PRODTEST_CP_Type CP;                /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FICR_PRODTEST_FT_Type FT;                /*!< (@ 0x00000014) (unspecified)                                         */
} NRF_FICR_PRODTEST_Type;                            /*!< Size = 28 (0x01C)                                                    */


/* ========================================== Struct FICR_TRIM_SYSCTRL_FLL16M_TRIM =========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_FLL16M_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RCOARSE;                           /*!< (@ 0x00000000) Trim value for SYSCTRL.FLL16M.RCOARSE                 */
  __IM  uint32_t  RFINE;                             /*!< (@ 0x00000004) Trim value for SYSCTRL.FLL16M.RFINE                   */
  __IM  uint32_t  TCOEF;                             /*!< (@ 0x00000008) Trim value for SYSCTRL.FLL16M.TCOEF                   */
  __IM  uint32_t  VSUP;                              /*!< (@ 0x0000000C) Trim value for SYSCTRL.FLL16M.VSUP                    */
  __IM  uint32_t  CKSW16MTRIM;                       /*!< (@ 0x00000010) Trim value for SYSCTRL.FLL16M.CKSW16MTRIM             */
} NRF_FICR_TRIM_SYSCTRL_FLL16M_TRIM_Type;            /*!< Size = 20 (0x014)                                                    */

/* FICR_TRIM_SYSCTRL_FLL16M_TRIM_RCOARSE: Trim value for SYSCTRL.FLL16M.RCOARSE */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_RCOARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RCOARSE register.                */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_RCOARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_RCOARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_FLL16M_TRIM_RCOARSE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            


/* FICR_TRIM_SYSCTRL_FLL16M_TRIM_RFINE: Trim value for SYSCTRL.FLL16M.RFINE */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_RFINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RFINE register.                    */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_RFINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_RFINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_FLL16M_TRIM_RFINE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                


/* FICR_TRIM_SYSCTRL_FLL16M_TRIM_TCOEF: Trim value for SYSCTRL.FLL16M.TCOEF */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_TCOEF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TCOEF register.                    */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_TCOEF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_TCOEF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_FLL16M_TRIM_TCOEF_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                


/* FICR_TRIM_SYSCTRL_FLL16M_TRIM_VSUP: Trim value for SYSCTRL.FLL16M.VSUP */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                      */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_FLL16M_TRIM_VSUP_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                


/* FICR_TRIM_SYSCTRL_FLL16M_TRIM_CKSW16MTRIM: Trim value for SYSCTRL.FLL16M.CKSW16MTRIM */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_CKSW16MTRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CKSW16MTRIM register.        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_CKSW16MTRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                              */
  #define FICR_TRIM_SYSCTRL_FLL16M_TRIM_CKSW16MTRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_FLL16M_TRIM_CKSW16MTRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* ============================================= Struct FICR_TRIM_SYSCTRL_FLL16M ============================================= */
/**
  * @brief FLL16M [FICR_TRIM_SYSCTRL_FLL16M] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_FLL16M_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_FICR_TRIM_SYSCTRL_FLL16M_Type;                 /*!< Size = 20 (0x014)                                                    */


/* ============================================ Struct FICR_TRIM_SYSCTRL_LFRC_CAL ============================================ */
/**
  * @brief CAL [FICR_TRIM_SYSCTRL_LFRC_CAL] (unspecified)
  */
typedef struct {
  __IM  uint32_t  LFRCOSCTRIM;                       /*!< (@ 0x00000000) Trim value for SYSCTRL.LFRC.LFRCOSCTRIM               */
} NRF_FICR_TRIM_SYSCTRL_LFRC_CAL_Type;               /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SYSCTRL_LFRC_CAL_LFRCOSCTRIM: Trim value for SYSCTRL.LFRC.LFRCOSCTRIM */
  #define FICR_TRIM_SYSCTRL_LFRC_CAL_LFRCOSCTRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LFRCOSCTRIM register.           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFRC_CAL_LFRCOSCTRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_LFRC_CAL_LFRCOSCTRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFRC_CAL_LFRCOSCTRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* ============================================== Struct FICR_TRIM_SYSCTRL_LFRC ============================================== */
/**
  * @brief LFRC [FICR_TRIM_SYSCTRL_LFRC] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_LFRC_CAL_Type CAL;     /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_FICR_TRIM_SYSCTRL_LFRC_Type;                   /*!< Size = 4 (0x004)                                                     */


