adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* =========================================== Struct FICR_TRIM_SYSCTRL_LFXO_TRIM ============================================ */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_LFXO_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  PDLOWERTHR;                        /*!< (@ 0x00000000) Trim value for SYSCTRL.LFXO.PDLOWERTHR                */
  __IM  uint32_t  PDUPPERTHR;                        /*!< (@ 0x00000004) Trim value for SYSCTRL.LFXO.PDUPPERTHR                */
  __IM  uint32_t  BIAS;                              /*!< (@ 0x00000008) Trim value for SYSCTRL.LFXO.BIAS                      */
  __IM  uint32_t  PIXO;                              /*!< (@ 0x0000000C) Trim value for SYSCTRL.LFXO.PIXO                      */
  __IM  uint32_t  TRIMBUS;                           /*!< (@ 0x00000010) Trim value for SYSCTRL.LFXO.TRIMBUS                   */
} NRF_FICR_TRIM_SYSCTRL_LFXO_TRIM_Type;              /*!< Size = 20 (0x014)                                                    */

/* FICR_TRIM_SYSCTRL_LFXO_TRIM_PDLOWERTHR: Trim value for SYSCTRL.LFXO.PDLOWERTHR */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_PDLOWERTHR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PDLOWERTHR register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_PDLOWERTHR_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_PDLOWERTHR_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFXO_TRIM_PDLOWERTHR_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_LFXO_TRIM_PDUPPERTHR: Trim value for SYSCTRL.LFXO.PDUPPERTHR */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_PDUPPERTHR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PDUPPERTHR register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_PDUPPERTHR_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_PDUPPERTHR_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFXO_TRIM_PDUPPERTHR_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_LFXO_TRIM_BIAS: Trim value for SYSCTRL.LFXO.BIAS */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_BIAS_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BIAS register.                        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_BIAS_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_BIAS_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFXO_TRIM_BIAS_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/                                     


/* FICR_TRIM_SYSCTRL_LFXO_TRIM_PIXO: Trim value for SYSCTRL.LFXO.PIXO */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_PIXO_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PIXO register.                        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_PIXO_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_PIXO_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFXO_TRIM_PIXO_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/                                     


/* FICR_TRIM_SYSCTRL_LFXO_TRIM_TRIMBUS: Trim value for SYSCTRL.LFXO.TRIMBUS */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_TRIMBUS_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIMBUS register.                  */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_TRIMBUS_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_SYSCTRL_LFXO_TRIM_TRIMBUS_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFXO_TRIM_TRIMBUS_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                



/* ============================================== Struct FICR_TRIM_SYSCTRL_LFXO ============================================== */
/**
  * @brief LFXO [FICR_TRIM_SYSCTRL_LFXO] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_LFXO_TRIM_Type TRIM;   /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_FICR_TRIM_SYSCTRL_LFXO_Type;                   /*!< Size = 20 (0x014)                                                    */


/* ========================================== Struct FICR_TRIM_SYSCTRL_HFXO64M_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_HFXO64M_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  DOUBLERCOMP;                       /*!< (@ 0x00000000) Trim value for SYSCTRL.HFXO64M.TRIM.DOUBLERCOMP       */
  __IM  uint32_t  CHIRPTUNE;                         /*!< (@ 0x00000004) Trim value for SYSCTRL.HFXO64M.TRIM.CHIRPTUNE         */
  __IM  uint32_t  RTUNE;                             /*!< (@ 0x00000008) Trim value for SYSCTRL.HFXO64M.TRIM.RTUNE             */
} NRF_FICR_TRIM_SYSCTRL_HFXO64M_TRIM_Type;           /*!< Size = 12 (0x00C)                                                    */

/* FICR_TRIM_SYSCTRL_HFXO64M_TRIM_DOUBLERCOMP: Trim value for SYSCTRL.HFXO64M.TRIM.DOUBLERCOMP */
  #define FICR_TRIM_SYSCTRL_HFXO64M_TRIM_DOUBLERCOMP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DOUBLERCOMP register.       */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HFXO64M_TRIM_DOUBLERCOMP_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define FICR_TRIM_SYSCTRL_HFXO64M_TRIM_DOUBLERCOMP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HFXO64M_TRIM_DOUBLERCOMP_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_HFXO64M_TRIM_CHIRPTUNE: Trim value for SYSCTRL.HFXO64M.TRIM.CHIRPTUNE */
  #define FICR_TRIM_SYSCTRL_HFXO64M_TRIM_CHIRPTUNE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CHIRPTUNE register.           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HFXO64M_TRIM_CHIRPTUNE_VALUE_Pos (0UL) /*!< Position of VALUE field.                               */
  #define FICR_TRIM_SYSCTRL_HFXO64M_TRIM_CHIRPTUNE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HFXO64M_TRIM_CHIRPTUNE_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_HFXO64M_TRIM_RTUNE: Trim value for SYSCTRL.HFXO64M.TRIM.RTUNE */
  #define FICR_TRIM_SYSCTRL_HFXO64M_TRIM_RTUNE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RTUNE register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HFXO64M_TRIM_RTUNE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define FICR_TRIM_SYSCTRL_HFXO64M_TRIM_RTUNE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HFXO64M_TRIM_RTUNE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            



/* ============================================ Struct FICR_TRIM_SYSCTRL_HFXO64M ============================================= */
/**
  * @brief HFXO64M [FICR_TRIM_SYSCTRL_HFXO64M] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_HFXO64M_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                        */
} NRF_FICR_TRIM_SYSCTRL_HFXO64M_Type;                /*!< Size = 12 (0x00C)                                                    */


/* ============================================= Struct FICR_TRIM_SYSCTRL_LFLPRC ============================================= */
/**
  * @brief LFLPRC [FICR_TRIM_SYSCTRL_LFLPRC] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.LFLPRC.VSUP                    */
  __IM  uint32_t  RCOARSE;                           /*!< (@ 0x00000004) Trim value for SYSCTRL.LFLPRC.RCOARSE                 */
  __IM  uint32_t  RFINE;                             /*!< (@ 0x00000008) Trim value for SYSCTRL.LFLPRC.RFINE                   */
  __IM  uint32_t  PWMFINE;                           /*!< (@ 0x0000000C) Trim value for SYSCTRL.LFLPRC.PWMFINE                 */
} NRF_FICR_TRIM_SYSCTRL_LFLPRC_Type;                 /*!< Size = 16 (0x010)                                                    */

/* FICR_TRIM_SYSCTRL_LFLPRC_VSUP: Trim value for SYSCTRL.LFLPRC.VSUP */
  #define FICR_TRIM_SYSCTRL_LFLPRC_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFLPRC_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                          */
  #define FICR_TRIM_SYSCTRL_LFLPRC_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFLPRC_VSUP_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/                                        


/* FICR_TRIM_SYSCTRL_LFLPRC_RCOARSE: Trim value for SYSCTRL.LFLPRC.RCOARSE */
  #define FICR_TRIM_SYSCTRL_LFLPRC_RCOARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RCOARSE register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFLPRC_RCOARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define FICR_TRIM_SYSCTRL_LFLPRC_RCOARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFLPRC_RCOARSE_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/                                     


