adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FICR_TRIM_SYSCTRL_LFLPRC_RFINE: Trim value for SYSCTRL.LFLPRC.RFINE */
  #define FICR_TRIM_SYSCTRL_LFLPRC_RFINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RFINE register.                         */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFLPRC_RFINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define FICR_TRIM_SYSCTRL_LFLPRC_RFINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFLPRC_RFINE_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/                                        


/* FICR_TRIM_SYSCTRL_LFLPRC_PWMFINE: Trim value for SYSCTRL.LFLPRC.PWMFINE */
  #define FICR_TRIM_SYSCTRL_LFLPRC_PWMFINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PWMFINE register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_LFLPRC_PWMFINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define FICR_TRIM_SYSCTRL_LFLPRC_PWMFINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_LFLPRC_PWMFINE_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/                                     



/* ======================================== Struct FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  PWRGOOD;                           /*!< (@ 0x00000000) Trim value for SYSCTRL.VDETPOF5V0.PWRGOOD             */
} NRF_FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM_Type;        /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM_PWRGOOD: Trim value for SYSCTRL.VDETPOF5V0.PWRGOOD */
  #define FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM_PWRGOOD_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PWRGOOD register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM_PWRGOOD_VALUE_Pos (0UL) /*!< Position of VALUE field.                              */
  #define FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM_PWRGOOD_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM_PWRGOOD_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* =========================================== Struct FICR_TRIM_SYSCTRL_VDETPOF5V0 =========================================== */
/**
  * @brief VDETPOF5V0 [FICR_TRIM_SYSCTRL_VDETPOF5V0] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                     */
} NRF_FICR_TRIM_SYSCTRL_VDETPOF5V0_Type;             /*!< Size = 4 (0x004)                                                     */


/* ======================================== Struct FICR_TRIM_SYSCTRL_VDETPOFVBAT_TRIM ======================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VDETPOFVBAT_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  POFWARN;                           /*!< (@ 0x00000000) Trim value for SYSCTRL.VDETPOFVBAT.POFWARN            */
} NRF_FICR_TRIM_SYSCTRL_VDETPOFVBAT_TRIM_Type;       /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SYSCTRL_VDETPOFVBAT_TRIM_POFWARN: Trim value for SYSCTRL.VDETPOFVBAT.POFWARN */
  #define FICR_TRIM_SYSCTRL_VDETPOFVBAT_TRIM_POFWARN_ResetValue (0xFFFFFFFFUL) /*!< Reset value of POFWARN register.           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VDETPOFVBAT_TRIM_POFWARN_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define FICR_TRIM_SYSCTRL_VDETPOFVBAT_TRIM_POFWARN_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VDETPOFVBAT_TRIM_POFWARN_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* ========================================== Struct FICR_TRIM_SYSCTRL_VDETPOFVBAT =========================================== */
/**
  * @brief VDETPOFVBAT [FICR_TRIM_SYSCTRL_VDETPOFVBAT] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETPOFVBAT_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                    */
} NRF_FICR_TRIM_SYSCTRL_VDETPOFVBAT_Type;            /*!< Size = 4 (0x004)                                                     */


/* ========================================= Struct FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CTUNE;                             /*!< (@ 0x00000000) Trim value for SYSCTRL.AUDIOPLL.CTUNE                 */
} NRF_FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM_Type;          /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM_CTUNE: Trim value for SYSCTRL.AUDIOPLL.CTUNE */
  #define FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM_CTUNE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CTUNE register.                  */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM_CTUNE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM_CTUNE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM_CTUNE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            



/* ============================================ Struct FICR_TRIM_SYSCTRL_AUDIOPLL ============================================ */
/**
  * @brief AUDIOPLL [FICR_TRIM_SYSCTRL_AUDIOPLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                       */
} NRF_FICR_TRIM_SYSCTRL_AUDIOPLL_Type;               /*!< Size = 4 (0x004)                                                     */


/* ========================================= Struct FICR_TRIM_SYSCTRL_USBHSPLL_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_USBHSPLL_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CTUNE;                             /*!< (@ 0x00000000) Trim value for SYSCTRL.USBHSPLL.CTUNE                 */
} NRF_FICR_TRIM_SYSCTRL_USBHSPLL_TRIM_Type;          /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SYSCTRL_USBHSPLL_TRIM_CTUNE: Trim value for SYSCTRL.USBHSPLL.CTUNE */
  #define FICR_TRIM_SYSCTRL_USBHSPLL_TRIM_CTUNE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CTUNE register.                  */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_USBHSPLL_TRIM_CTUNE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SYSCTRL_USBHSPLL_TRIM_CTUNE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_USBHSPLL_TRIM_CTUNE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            



/* ============================================ Struct FICR_TRIM_SYSCTRL_USBHSPLL ============================================ */
/**
  * @brief USBHSPLL [FICR_TRIM_SYSCTRL_USBHSPLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_USBHSPLL_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                       */
} NRF_FICR_TRIM_SYSCTRL_USBHSPLL_Type;               /*!< Size = 4 (0x004)                                                     */


