adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ========================================== Struct FICR_TRIM_SYSCTRL_MBIAS_CONFIG ========================================== */
/**
  * @brief CONFIG [FICR_TRIM_SYSCTRL_MBIAS_CONFIG] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CFG;                               /*!< (@ 0x00000000) Trim value for SYSCTRL.MBIAS.CFG                      */
} NRF_FICR_TRIM_SYSCTRL_MBIAS_CONFIG_Type;           /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SYSCTRL_MBIAS_CONFIG_CFG: Trim value for SYSCTRL.MBIAS.CFG */
  #define FICR_TRIM_SYSCTRL_MBIAS_CONFIG_CFG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CFG register.                       */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_MBIAS_CONFIG_CFG_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_SYSCTRL_MBIAS_CONFIG_CFG_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_MBIAS_CONFIG_CFG_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                



/* =========================================== Struct FICR_TRIM_SYSCTRL_MBIAS_TRIM =========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_MBIAS_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  MBIASIBPP;                         /*!< (@ 0x00000000) Trim value for SYSCTRL.MBIAS.MBIASIBPP                */
  __IM  uint32_t  MBIASIBPSR;                        /*!< (@ 0x00000004) Trim value for SYSCTRL.MBIAS.MBIASIBPSR               */
} NRF_FICR_TRIM_SYSCTRL_MBIAS_TRIM_Type;             /*!< Size = 8 (0x008)                                                     */

/* FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPP: Trim value for SYSCTRL.MBIAS.MBIASIBPP */
  #define FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of MBIASIBPP register.             */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPP_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPSR: Trim value for SYSCTRL.MBIAS.MBIASIBPSR */
  #define FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPSR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of MBIASIBPSR register.           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPSR_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPSR_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_MBIAS_TRIM_MBIASIBPSR_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* ============================================= Struct FICR_TRIM_SYSCTRL_MBIAS ============================================== */
/**
  * @brief MBIAS [FICR_TRIM_SYSCTRL_MBIAS] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_MBIAS_CONFIG_Type CONFIG; /*!< (@ 0x00000000) (unspecified)                                      */
  __IOM NRF_FICR_TRIM_SYSCTRL_MBIAS_TRIM_Type TRIM;  /*!< (@ 0x00000004) (unspecified)                                         */
} NRF_FICR_TRIM_SYSCTRL_MBIAS_Type;                  /*!< Size = 12 (0x00C)                                                    */


/* ========================================== Struct FICR_TRIM_SYSCTRL_OSCRFR_TRIM =========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_OSCRFR_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  OSC;                               /*!< (@ 0x00000000) Trim value for SYSCTRL.OSCRFR.OSC                     */
  __IM  uint32_t  IBPSR;                             /*!< (@ 0x00000004) Trim value for SYSCTRL.OSCRFR.IBPSR                   */
} NRF_FICR_TRIM_SYSCTRL_OSCRFR_TRIM_Type;            /*!< Size = 8 (0x008)                                                     */

/* FICR_TRIM_SYSCTRL_OSCRFR_TRIM_OSC: Trim value for SYSCTRL.OSCRFR.OSC */
  #define FICR_TRIM_SYSCTRL_OSCRFR_TRIM_OSC_ResetValue (0xFFFFFFFFUL) /*!< Reset value of OSC register.                        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_OSCRFR_TRIM_OSC_VALUE_Pos (0UL) /*!< Position of VALUE field.                                      */
  #define FICR_TRIM_SYSCTRL_OSCRFR_TRIM_OSC_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_OSCRFR_TRIM_OSC_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                


/* FICR_TRIM_SYSCTRL_OSCRFR_TRIM_IBPSR: Trim value for SYSCTRL.OSCRFR.IBPSR */
  #define FICR_TRIM_SYSCTRL_OSCRFR_TRIM_IBPSR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of IBPSR register.                    */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_OSCRFR_TRIM_IBPSR_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_SYSCTRL_OSCRFR_TRIM_IBPSR_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_OSCRFR_TRIM_IBPSR_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                



/* ============================================= Struct FICR_TRIM_SYSCTRL_OSCRFR ============================================= */
/**
  * @brief OSCRFR [FICR_TRIM_SYSCTRL_OSCRFR] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_OSCRFR_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_FICR_TRIM_SYSCTRL_OSCRFR_Type;                 /*!< Size = 8 (0x008)                                                     */


/* ========================================== Struct FICR_TRIM_SYSCTRL_VREG1V0_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VREG1V0_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  IREF;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.VREG1V0.IREF                   */
  __IM  uint32_t  HIGHPOWER;                         /*!< (@ 0x00000004) Trim value for SYSCTRL.VREG1V0.HIGHPOWER              */
  __IM  uint32_t  LOWPOWER;                          /*!< (@ 0x00000008) Trim value for SYSCTRL.VREG1V0.LOWPOWER               */
  __IM  uint32_t  ULPR;                              /*!< (@ 0x0000000C) Trim value for SYSCTRL.VREG1V0.ULPR                   */
} NRF_FICR_TRIM_SYSCTRL_VREG1V0_TRIM_Type;           /*!< Size = 16 (0x010)                                                    */

/* FICR_TRIM_SYSCTRL_VREG1V0_TRIM_IREF: Trim value for SYSCTRL.VREG1V0.IREF */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_IREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of IREF register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_IREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_IREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREG1V0_TRIM_IREF_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                


/* FICR_TRIM_SYSCTRL_VREG1V0_TRIM_HIGHPOWER: Trim value for SYSCTRL.VREG1V0.HIGHPOWER */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_HIGHPOWER_ResetValue (0xFFFFFFFFUL) /*!< Reset value of HIGHPOWER register.           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_HIGHPOWER_VALUE_Pos (0UL) /*!< Position of VALUE field.                               */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_HIGHPOWER_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREG1V0_TRIM_HIGHPOWER_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VREG1V0_TRIM_LOWPOWER: Trim value for SYSCTRL.VREG1V0.LOWPOWER */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_LOWPOWER_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LOWPOWER register.             */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_LOWPOWER_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_LOWPOWER_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREG1V0_TRIM_LOWPOWER_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VREG1V0_TRIM_ULPR: Trim value for SYSCTRL.VREG1V0.ULPR */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_ULPR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ULPR register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_ULPR_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_SYSCTRL_VREG1V0_TRIM_ULPR_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREG1V0_TRIM_ULPR_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                



/* ============================================ Struct FICR_TRIM_SYSCTRL_VREG1V0 ============================================= */
/**
  * @brief VREG1V0 [FICR_TRIM_SYSCTRL_VREG1V0] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VREG1V0_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                        */
  __IM  uint32_t  VOUTHPNOMINAL;                     /*!< (@ 0x00000010) Config value for SYSCTRL.VREG1V0.VOUTHPNOMINAL        */
} NRF_FICR_TRIM_SYSCTRL_VREG1V0_Type;                /*!< Size = 20 (0x014)                                                    */

/* FICR_TRIM_SYSCTRL_VREG1V0_VOUTHPNOMINAL: Config value for SYSCTRL.VREG1V0.VOUTHPNOMINAL */
  #define FICR_TRIM_SYSCTRL_VREG1V0_VOUTHPNOMINAL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VOUTHPNOMINAL register.        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREG1V0_VOUTHPNOMINAL_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_SYSCTRL_VREG1V0_VOUTHPNOMINAL_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREG1V0_VOUTHPNOMINAL_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



