adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ========================================= Struct FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  IREF;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.VREGAO0V8.IREF                 */
  __IM  uint32_t  HIGHPOWER;                         /*!< (@ 0x00000004) Trim value for SYSCTRL.VREGAO0V8.HIGHPOWER            */
  __IM  uint32_t  LOWPOWER;                          /*!< (@ 0x00000008) Trim value for SYSCTRL.VREGAO0V8.LOWPOWER             */
  __IM  uint32_t  ULTRALOWPOWER;                     /*!< (@ 0x0000000C) Trim value for SYSCTRL.VREGAO0V8.ULTRALOWPOWER        */
  __IM  uint32_t  BPDET;                             /*!< (@ 0x00000010) Trim value for SYSCTRL.VREGAO0V8.BPDET                */
} NRF_FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_Type;         /*!< Size = 20 (0x014)                                                    */

/* FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_IREF: Trim value for SYSCTRL.VREGAO0V8.IREF */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_IREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of IREF register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_IREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_IREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_IREF_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            


/* FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_HIGHPOWER: Trim value for SYSCTRL.VREGAO0V8.HIGHPOWER */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_HIGHPOWER_ResetValue (0xFFFFFFFFUL) /*!< Reset value of HIGHPOWER register.         */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_HIGHPOWER_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_HIGHPOWER_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_HIGHPOWER_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_LOWPOWER: Trim value for SYSCTRL.VREGAO0V8.LOWPOWER */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_LOWPOWER_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LOWPOWER register.           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_LOWPOWER_VALUE_Pos (0UL) /*!< Position of VALUE field.                              */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_LOWPOWER_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_LOWPOWER_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_ULTRALOWPOWER: Trim value for SYSCTRL.VREGAO0V8.ULTRALOWPOWER */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_ULTRALOWPOWER_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ULTRALOWPOWER register. */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_ULTRALOWPOWER_VALUE_Pos (0UL) /*!< Position of VALUE field.                         */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_ULTRALOWPOWER_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_ULTRALOWPOWER_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_BPDET: Trim value for SYSCTRL.VREGAO0V8.BPDET */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_BPDET_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BPDET register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_BPDET_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_BPDET_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_BPDET_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* =========================================== Struct FICR_TRIM_SYSCTRL_VREGAO0V8 ============================================ */
/**
  * @brief VREGAO0V8 [FICR_TRIM_SYSCTRL_VREGAO0V8] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                      */
} NRF_FICR_TRIM_SYSCTRL_VREGAO0V8_Type;              /*!< Size = 20 (0x014)                                                    */


/* ========================================= Struct FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  IREF;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.VREGAO1V8.IREF                 */
  __IM  uint32_t  VREF;                              /*!< (@ 0x00000004) Trim value for SYSCTRL.VREGAO1V8.VREF                 */
  __IM  uint32_t  LOWPOWER;                          /*!< (@ 0x00000008) Trim value for SYSCTRL.VREGAO1V8.LOWPOWER             */
  __IM  uint32_t  LOWPOWERDIFF;                      /*!< (@ 0x0000000C) Trim value for SYSCTRL.VREGAO1V8.LOWPOWERDIFF         */
} NRF_FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_Type;         /*!< Size = 16 (0x010)                                                    */

/* FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_IREF: Trim value for SYSCTRL.VREGAO1V8.IREF */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_IREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of IREF register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_IREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_IREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_IREF_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            


/* FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_VREF: Trim value for SYSCTRL.VREGAO1V8.VREF */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_VREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VREF register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_VREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_VREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_VREF_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            


/* FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_LOWPOWER: Trim value for SYSCTRL.VREGAO1V8.LOWPOWER */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_LOWPOWER_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LOWPOWER register.           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_LOWPOWER_VALUE_Pos (0UL) /*!< Position of VALUE field.                              */
  #define FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_LOWPOWER_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM_LOWPOWER_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


