adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_HSILIM: Trim value for SYSCTRL.VREGMAIN.HSILIM */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_HSILIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of HSILIM register.                */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_HSILIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_HSILIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_HSILIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_ICMP: Trim value for SYSCTRL.VREGMAIN.ICMP */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_ICMP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ICMP register.                    */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_ICMP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_ICMP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_ICMP_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            


/* FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VGND: Trim value for SYSCTRL.VREGMAIN.VGND */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VGND_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VGND register.                    */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VGND_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VGND_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_VGND_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            



/* ============================================ Struct FICR_TRIM_SYSCTRL_VREGMAIN ============================================ */
/**
  * @brief VREGMAIN [FICR_TRIM_SYSCTRL_VREGMAIN] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGMAIN_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                       */
} NRF_FICR_TRIM_SYSCTRL_VREGMAIN_Type;               /*!< Size = 48 (0x030)                                                    */


/* ======================================== Struct FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM ======================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VBG;                               /*!< (@ 0x00000000) Trim value for SYSCTRL.VREGMRAM130.VBG                */
  __IM  uint32_t  BIAS;                              /*!< (@ 0x00000004) Trim value for SYSCTRL.VREGMRAM130.BIAS               */
  __IM  uint32_t  VPR;                               /*!< (@ 0x00000008) Trim value for SYSCTRL.VREGMRAM130.VPR                */
  __IM  uint32_t  VREF;                              /*!< (@ 0x0000000C) Trim value for SYSCTRL.VREGMRAM130.VREF               */
} NRF_FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_Type;       /*!< Size = 16 (0x010)                                                    */

/* FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VBG: Trim value for SYSCTRL.VREGMRAM130.VBG */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VBG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VBG register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VBG_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VBG_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VBG_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_BIAS: Trim value for SYSCTRL.VREGMRAM130.BIAS */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_BIAS_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BIAS register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_BIAS_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_BIAS_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_BIAS_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VPR: Trim value for SYSCTRL.VREGMRAM130.VPR */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VPR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VPR register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VPR_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VPR_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VPR_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VREF: Trim value for SYSCTRL.VREGMRAM130.VREF */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VREF register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_VREF_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* ========================================== Struct FICR_TRIM_SYSCTRL_VREGMRAM130 =========================================== */
/**
  * @brief VREGMRAM130 [FICR_TRIM_SYSCTRL_VREGMRAM130] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                    */
} NRF_FICR_TRIM_SYSCTRL_VREGMRAM130_Type;            /*!< Size = 16 (0x010)                                                    */


