adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ======================================== Struct FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM ======================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VBG;                               /*!< (@ 0x00000000) Trim value for SYSCTRL.VREGMRAM131.VBG                */
  __IM  uint32_t  BIAS;                              /*!< (@ 0x00000004) Trim value for SYSCTRL.VREGMRAM131.BIAS               */
  __IM  uint32_t  VPR;                               /*!< (@ 0x00000008) Trim value for SYSCTRL.VREGMRAM131.VPR                */
  __IM  uint32_t  VREF;                              /*!< (@ 0x0000000C) Trim value for SYSCTRL.VREGMRAM131.VREF               */
} NRF_FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_Type;       /*!< Size = 16 (0x010)                                                    */

/* FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VBG: Trim value for SYSCTRL.VREGMRAM131.VBG */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VBG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VBG register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VBG_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VBG_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VBG_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_BIAS: Trim value for SYSCTRL.VREGMRAM131.BIAS */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_BIAS_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BIAS register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_BIAS_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_BIAS_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_BIAS_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VPR: Trim value for SYSCTRL.VREGMRAM131.VPR */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VPR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VPR register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VPR_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VPR_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VPR_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VREF: Trim value for SYSCTRL.VREGMRAM131.VREF */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VREF register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_VREF_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* ========================================== Struct FICR_TRIM_SYSCTRL_VREGMRAM131 =========================================== */
/**
  * @brief VREGMRAM131 [FICR_TRIM_SYSCTRL_VREGMRAM131] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                    */
} NRF_FICR_TRIM_SYSCTRL_VREGMRAM131_Type;            /*!< Size = 16 (0x010)                                                    */


/* ========================================= Struct FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  IREF;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.VREGVS0V8.IREF                 */
  __IM  uint32_t  HIGHPOWER;                         /*!< (@ 0x00000004) Trim value for SYSCTRL.VREGVS0V8.HIGHPOWER            */
  __IM  uint32_t  LOWPOWER;                          /*!< (@ 0x00000008) Trim value for SYSCTRL.VREGVS0V8.LOWPOWER             */
  __IM  uint32_t  ULPR;                              /*!< (@ 0x0000000C) Trim value for SYSCTRL.VREGVS0V8.ULPR                 */
} NRF_FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_Type;         /*!< Size = 16 (0x010)                                                    */

/* FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_IREF: Trim value for SYSCTRL.VREGVS0V8.IREF */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_IREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of IREF register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_IREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_IREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_IREF_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            


/* FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_HIGHPOWER: Trim value for SYSCTRL.VREGVS0V8.HIGHPOWER */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_HIGHPOWER_ResetValue (0xFFFFFFFFUL) /*!< Reset value of HIGHPOWER register.         */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_HIGHPOWER_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_HIGHPOWER_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_HIGHPOWER_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_LOWPOWER: Trim value for SYSCTRL.VREGVS0V8.LOWPOWER */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_LOWPOWER_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LOWPOWER register.           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_LOWPOWER_VALUE_Pos (0UL) /*!< Position of VALUE field.                              */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_LOWPOWER_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_LOWPOWER_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_ULPR: Trim value for SYSCTRL.VREGVS0V8.ULPR */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_ULPR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ULPR register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_ULPR_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_ULPR_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_ULPR_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            



/* =========================================== Struct FICR_TRIM_SYSCTRL_VREGVS0V8 ============================================ */
/**
  * @brief VREGVS0V8 [FICR_TRIM_SYSCTRL_VREGVS0V8] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                      */
} NRF_FICR_TRIM_SYSCTRL_VREGVS0V8_Type;              /*!< Size = 16 (0x010)                                                    */


/* ========================================== Struct FICR_TRIM_SYSCTRL_VREGUSB_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VREGUSB_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIMVDD;                           /*!< (@ 0x00000000) Trim value for SYSCTRL.VREGUSB.TRIMVDD                */
  __IM  uint32_t  TRIMIBP;                           /*!< (@ 0x00000004) Trim value for SYSCTRL.VREGUSB.TRIMIBP                */
  __IM  uint32_t  TRIM0V8;                           /*!< (@ 0x00000008) Trim value for SYSCTRL.VREGUSB.TRIM0V8                */
  __IM  uint32_t  TRIM3V3;                           /*!< (@ 0x0000000C) Trim value for SYSCTRL.VREGUSB.TRIM3V3                */
} NRF_FICR_TRIM_SYSCTRL_VREGUSB_TRIM_Type;           /*!< Size = 16 (0x010)                                                    */

