adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMVDD: Trim value for SYSCTRL.VREGUSB.TRIMVDD */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMVDD_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIMVDD register.               */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMVDD_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMVDD_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMVDD_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMIBP: Trim value for SYSCTRL.VREGUSB.TRIMIBP */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMIBP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIMIBP register.               */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMIBP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMIBP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIMIBP_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM0V8: Trim value for SYSCTRL.VREGUSB.TRIM0V8 */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM0V8_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM0V8 register.               */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM0V8_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM0V8_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM0V8_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM3V3: Trim value for SYSCTRL.VREGUSB.TRIM3V3 */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM3V3_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM3V3 register.               */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM3V3_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM3V3_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VREGUSB_TRIM_TRIM3V3_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* ============================================ Struct FICR_TRIM_SYSCTRL_VREGUSB ============================================= */
/**
  * @brief VREGUSB [FICR_TRIM_SYSCTRL_VREGUSB] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGUSB_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                        */
} NRF_FICR_TRIM_SYSCTRL_VREGUSB_Type;                /*!< Size = 16 (0x010)                                                    */


/* ========================================= Struct FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  BROWNOUT;                          /*!< (@ 0x00000000) Trim value for SYSCTRL.VDETAO0V8.BROWNOUT             */
  __IM  uint32_t  PWRGOOD;                           /*!< (@ 0x00000004) Trim value for SYSCTRL.VDETAO0V8.PWRGOOD              */
} NRF_FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM_Type;         /*!< Size = 8 (0x008)                                                     */

/* FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM_BROWNOUT: Trim value for SYSCTRL.VDETAO0V8.BROWNOUT */
  #define FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM_BROWNOUT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BROWNOUT register.           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM_BROWNOUT_VALUE_Pos (0UL) /*!< Position of VALUE field.                              */
  #define FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM_BROWNOUT_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM_BROWNOUT_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM_PWRGOOD: Trim value for SYSCTRL.VDETAO0V8.PWRGOOD */
  #define FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM_PWRGOOD_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PWRGOOD register.             */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM_PWRGOOD_VALUE_Pos (0UL) /*!< Position of VALUE field.                               */
  #define FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM_PWRGOOD_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM_PWRGOOD_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* ======================================== Struct FICR_TRIM_SYSCTRL_VDETAO0V8_CONFIG ======================================== */
/**
  * @brief CONFIG [FICR_TRIM_SYSCTRL_VDETAO0V8_CONFIG] (unspecified)
  */
typedef struct {
  __IM  uint32_t  BROWNOUTHP;                        /*!< (@ 0x00000000) Config value for SYSCTRL.VDETAO0V8.CONFIG.BROWNOUTHP  */
} NRF_FICR_TRIM_SYSCTRL_VDETAO0V8_CONFIG_Type;       /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SYSCTRL_VDETAO0V8_CONFIG_BROWNOUTHP: Config value for SYSCTRL.VDETAO0V8.CONFIG.BROWNOUTHP */
  #define FICR_TRIM_SYSCTRL_VDETAO0V8_CONFIG_BROWNOUTHP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BROWNOUTHP register.     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VDETAO0V8_CONFIG_BROWNOUTHP_VALUE_Pos (0UL) /*!< Position of VALUE field.                          */
  #define FICR_TRIM_SYSCTRL_VDETAO0V8_CONFIG_BROWNOUTHP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VDETAO0V8_CONFIG_BROWNOUTHP_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



