adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* =========================================== Struct FICR_TRIM_SYSCTRL_VDETAO0V8 ============================================ */
/**
  * @brief VDETAO0V8 [FICR_TRIM_SYSCTRL_VDETAO0V8] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                      */
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETAO0V8_CONFIG_Type CONFIG; /*!< (@ 0x00000008) (unspecified)                                  */
} NRF_FICR_TRIM_SYSCTRL_VDETAO0V8_Type;              /*!< Size = 12 (0x00C)                                                    */


/* ========================================= Struct FICR_TRIM_SYSCTRL_VDETAO1V8_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VDETAO1V8_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  BROWNOUTLVLHIGH;                   /*!< (@ 0x00000000) Trim value for SYSCTRL.VDETAO1V8.BROWNOUTLVLHIGH      */
  __IM  uint32_t  BROWNOUTLVLLOW;                    /*!< (@ 0x00000004) Trim value for SYSCTRL.VDETAO1V8.BROWNOUTLVLLOW       */
} NRF_FICR_TRIM_SYSCTRL_VDETAO1V8_TRIM_Type;         /*!< Size = 8 (0x008)                                                     */

/* FICR_TRIM_SYSCTRL_VDETAO1V8_TRIM_BROWNOUTLVLHIGH: Trim value for SYSCTRL.VDETAO1V8.BROWNOUTLVLHIGH */
  #define FICR_TRIM_SYSCTRL_VDETAO1V8_TRIM_BROWNOUTLVLHIGH_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BROWNOUTLVLHIGH
                                                                            register.*/                                           

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VDETAO1V8_TRIM_BROWNOUTLVLHIGH_VALUE_Pos (0UL) /*!< Position of VALUE field.                       */
  #define FICR_TRIM_SYSCTRL_VDETAO1V8_TRIM_BROWNOUTLVLHIGH_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VDETAO1V8_TRIM_BROWNOUTLVLHIGH_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VDETAO1V8_TRIM_BROWNOUTLVLLOW: Trim value for SYSCTRL.VDETAO1V8.BROWNOUTLVLLOW */
  #define FICR_TRIM_SYSCTRL_VDETAO1V8_TRIM_BROWNOUTLVLLOW_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BROWNOUTLVLLOW
                                                                            register.*/                                           

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VDETAO1V8_TRIM_BROWNOUTLVLLOW_VALUE_Pos (0UL) /*!< Position of VALUE field.                        */
  #define FICR_TRIM_SYSCTRL_VDETAO1V8_TRIM_BROWNOUTLVLLOW_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VDETAO1V8_TRIM_BROWNOUTLVLLOW_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* =========================================== Struct FICR_TRIM_SYSCTRL_VDETAO1V8 ============================================ */
/**
  * @brief VDETAO1V8 [FICR_TRIM_SYSCTRL_VDETAO1V8] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETAO1V8_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                      */
} NRF_FICR_TRIM_SYSCTRL_VDETAO1V8_Type;              /*!< Size = 8 (0x008)                                                     */


/* ========================================= Struct FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  BROWNOUT;                          /*!< (@ 0x00000000) Trim value for SYSCTRL.VDETVS0V8.BROWNOUT             */
  __IM  uint32_t  PWRGOOD;                           /*!< (@ 0x00000004) Trim value for SYSCTRL.VDETVS0V8.PWRGOOD              */
} NRF_FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM_Type;         /*!< Size = 8 (0x008)                                                     */

/* FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM_BROWNOUT: Trim value for SYSCTRL.VDETVS0V8.BROWNOUT */
  #define FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM_BROWNOUT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BROWNOUT register.           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM_BROWNOUT_VALUE_Pos (0UL) /*!< Position of VALUE field.                              */
  #define FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM_BROWNOUT_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM_BROWNOUT_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM_PWRGOOD: Trim value for SYSCTRL.VDETVS0V8.PWRGOOD */
  #define FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM_PWRGOOD_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PWRGOOD register.             */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM_PWRGOOD_VALUE_Pos (0UL) /*!< Position of VALUE field.                               */
  #define FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM_PWRGOOD_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM_PWRGOOD_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* =========================================== Struct FICR_TRIM_SYSCTRL_VDETVS0V8 ============================================ */
/**
  * @brief VDETVS0V8 [FICR_TRIM_SYSCTRL_VDETVS0V8] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                      */
} NRF_FICR_TRIM_SYSCTRL_VDETVS0V8_Type;              /*!< Size = 8 (0x008)                                                     */


/* ========================================= Struct FICR_TRIM_SYSCTRL_VDETAO5V0_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VDETAO5V0_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  PWRGOOD;                           /*!< (@ 0x00000000) Trim value for SYSCTRL.VDETAO5V0.PWRGOOD              */
} NRF_FICR_TRIM_SYSCTRL_VDETAO5V0_TRIM_Type;         /*!< Size = 4 (0x004)                                                     */

