adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FICR_TRIM_SYSCTRL_VDETAO5V0_TRIM_PWRGOOD: Trim value for SYSCTRL.VDETAO5V0.PWRGOOD */
  #define FICR_TRIM_SYSCTRL_VDETAO5V0_TRIM_PWRGOOD_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PWRGOOD register.             */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VDETAO5V0_TRIM_PWRGOOD_VALUE_Pos (0UL) /*!< Position of VALUE field.                               */
  #define FICR_TRIM_SYSCTRL_VDETAO5V0_TRIM_PWRGOOD_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VDETAO5V0_TRIM_PWRGOOD_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* =========================================== Struct FICR_TRIM_SYSCTRL_VDETAO5V0 ============================================ */
/**
  * @brief VDETAO5V0 [FICR_TRIM_SYSCTRL_VDETAO5V0] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETAO5V0_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                      */
} NRF_FICR_TRIM_SYSCTRL_VDETAO5V0_Type;              /*!< Size = 4 (0x004)                                                     */


/* ========================================== Struct FICR_TRIM_SYSCTRL_VDET1V0_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_VDET1V0_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  PWRGOOD;                           /*!< (@ 0x00000000) Trim value for SYSCTRL.VDET1V0.PWRGOOD                */
} NRF_FICR_TRIM_SYSCTRL_VDET1V0_TRIM_Type;           /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SYSCTRL_VDET1V0_TRIM_PWRGOOD: Trim value for SYSCTRL.VDET1V0.PWRGOOD */
  #define FICR_TRIM_SYSCTRL_VDET1V0_TRIM_PWRGOOD_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PWRGOOD register.               */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_VDET1V0_TRIM_PWRGOOD_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_VDET1V0_TRIM_PWRGOOD_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_VDET1V0_TRIM_PWRGOOD_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* ============================================ Struct FICR_TRIM_SYSCTRL_VDET1V0 ============================================= */
/**
  * @brief VDET1V0 [FICR_TRIM_SYSCTRL_VDET1V0] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_VDET1V0_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                        */
} NRF_FICR_TRIM_SYSCTRL_VDET1V0_Type;                /*!< Size = 4 (0x004)                                                     */


/* ========================================= Struct FICR_TRIM_SYSCTRL_HSFLL120_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_HSFLL120_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.HSFLL120.VSUP                  */
  __IM  uint32_t  COARSE[6];                         /*!< (@ 0x00000004) Trim value for SYSCTRL.HSFLL120.COARSE                */
  __IM  uint32_t  FINE[6];                           /*!< (@ 0x0000001C) Trim value for SYSCTRL.HSFLL120.FINE                  */
} NRF_FICR_TRIM_SYSCTRL_HSFLL120_TRIM_Type;          /*!< Size = 52 (0x034)                                                    */

/* FICR_TRIM_SYSCTRL_HSFLL120_TRIM_VSUP: Trim value for SYSCTRL.HSFLL120.VSUP */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                    */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HSFLL120_TRIM_VSUP_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            


/* FICR_TRIM_SYSCTRL_HSFLL120_TRIM_COARSE: Trim value for SYSCTRL.HSFLL120.COARSE */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_COARSE_MaxCount (6UL) /*!< Max size of COARSE[6] array.                              */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_COARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of COARSE[6] register.             */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_COARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_COARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HSFLL120_TRIM_COARSE_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_HSFLL120_TRIM_FINE: Trim value for SYSCTRL.HSFLL120.FINE */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_FINE_MaxCount (6UL) /*!< Max size of FINE[6] array.                                  */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_FINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FINE[6] register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_FINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define FICR_TRIM_SYSCTRL_HSFLL120_TRIM_FINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HSFLL120_TRIM_FINE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            



/* ============================================ Struct FICR_TRIM_SYSCTRL_HSFLL120 ============================================ */
/**
  * @brief HSFLL120 [FICR_TRIM_SYSCTRL_HSFLL120] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_HSFLL120_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                       */
} NRF_FICR_TRIM_SYSCTRL_HSFLL120_Type;               /*!< Size = 52 (0x034)                                                    */


/* ========================================= Struct FICR_TRIM_SYSCTRL_HSFLL121_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_SYSCTRL_HSFLL121_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.HSFLL121.VSUP                  */
  __IM  uint32_t  COARSE[6];                         /*!< (@ 0x00000004) Trim value for SYSCTRL.HSFLL121.COARSE                */
  __IM  uint32_t  FINE[6];                           /*!< (@ 0x0000001C) Trim value for SYSCTRL.HSFLL121.FINE                  */
} NRF_FICR_TRIM_SYSCTRL_HSFLL121_TRIM_Type;          /*!< Size = 52 (0x034)                                                    */

