adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FICR_TRIM_SYSCTRL_HSFLL121_TRIM_VSUP: Trim value for SYSCTRL.HSFLL121.VSUP */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                    */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HSFLL121_TRIM_VSUP_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            


/* FICR_TRIM_SYSCTRL_HSFLL121_TRIM_COARSE: Trim value for SYSCTRL.HSFLL121.COARSE */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_COARSE_MaxCount (6UL) /*!< Max size of COARSE[6] array.                              */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_COARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of COARSE[6] register.             */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_COARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                 */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_COARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HSFLL121_TRIM_COARSE_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_SYSCTRL_HSFLL121_TRIM_FINE: Trim value for SYSCTRL.HSFLL121.FINE */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_FINE_MaxCount (6UL) /*!< Max size of FINE[6] array.                                  */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_FINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FINE[6] register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_FINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define FICR_TRIM_SYSCTRL_HSFLL121_TRIM_FINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_HSFLL121_TRIM_FINE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            



/* ============================================ Struct FICR_TRIM_SYSCTRL_HSFLL121 ============================================ */
/**
  * @brief HSFLL121 [FICR_TRIM_SYSCTRL_HSFLL121] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_HSFLL121_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                       */
} NRF_FICR_TRIM_SYSCTRL_HSFLL121_Type;               /*!< Size = 52 (0x034)                                                    */


/* ======================================= Struct FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR ======================================== */
/**
  * @brief REPAIR [FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR] (unspecified)
  */
typedef struct {
  __IM  uint32_t  BITLINE;                           /*!< (@ 0x00000000) Trim value for SYSCTRL.MEMCONF120.REPAIR[n].BITLINE   */
} NRF_FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR_Type;      /*!< Size = 4 (0x004)                                                     */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR_MaxCount (36UL) /*!< Max size of REPAIR[36] array.                               */

/* FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR_BITLINE: Trim value for SYSCTRL.MEMCONF120.REPAIR[n].BITLINE */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR_BITLINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BITLINE register.          */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR_BITLINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                            */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR_BITLINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR_BITLINE_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* ====================================== Struct FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE ====================================== */
/**
  * @brief BLOCKTYPE [FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.MEMCONF120.TRIM                */
} NRF_FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE_Type;   /*!< Size = 4 (0x004)                                                     */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE_MaxCount (8UL) /*!< Max size of BLOCKTYPE[8] array.                           */

/* FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE_TRIM: Trim value for SYSCTRL.MEMCONF120.TRIM */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE_TRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM register.             */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE_TRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                            */
  #define FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE_TRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE_TRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* =========================================== Struct FICR_TRIM_SYSCTRL_MEMCONF120 =========================================== */
/**
  * @brief MEMCONF120 [FICR_TRIM_SYSCTRL_MEMCONF120] (unspecified)
  */
typedef struct {
  #if defined(_GNUC_)
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
  #endif
  union {
    __IOM NRF_FICR_TRIM_SYSCTRL_MEMCONF120_REPAIR_Type REPAIR[36]; /*!< (@ 0x00000000) (unspecified)                           */
  };
  #if defined(_GNUC_)
    #pragma GCC diagnostic pop
  #endif
  __IM  uint32_t  RESERVED[8];
  __IOM NRF_FICR_TRIM_SYSCTRL_MEMCONF120_BLOCKTYPE_Type BLOCKTYPE[8]; /*!< (@ 0x000000B0) (unspecified)                        */
} NRF_FICR_TRIM_SYSCTRL_MEMCONF120_Type;             /*!< Size = 208 (0x0D0)                                                   */


