adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ====================================== Struct FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE ====================================== */
/**
  * @brief BLOCKTYPE [FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.MEMCONF130.TRIM                */
} NRF_FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE_Type;   /*!< Size = 4 (0x004)                                                     */
  #define FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE_MaxCount (2UL) /*!< Max size of BLOCKTYPE[2] array.                           */

/* FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE_TRIM: Trim value for SYSCTRL.MEMCONF130.TRIM */
  #define FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE_TRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM register.             */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE_TRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                            */
  #define FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE_TRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE_TRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* =========================================== Struct FICR_TRIM_SYSCTRL_MEMCONF130 =========================================== */
/**
  * @brief MEMCONF130 [FICR_TRIM_SYSCTRL_MEMCONF130] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE_Type BLOCKTYPE[2]; /*!< (@ 0x00000000) (unspecified)                        */
} NRF_FICR_TRIM_SYSCTRL_MEMCONF130_Type;             /*!< Size = 8 (0x008)                                                     */


/* ================================================ Struct FICR_TRIM_SYSCTRL ================================================= */
/**
  * @brief SYSCTRL [FICR_TRIM_SYSCTRL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_FLL16M_Type FLL16M;    /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SYSCTRL_LFRC_Type LFRC;        /*!< (@ 0x00000014) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SYSCTRL_LFXO_Type LFXO;        /*!< (@ 0x00000018) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SYSCTRL_HFXO64M_Type HFXO64M;  /*!< (@ 0x0000002C) (unspecified)                                         */
  #if defined(_GNUC_)
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
  #endif
  union {
    struct {
      __IOM NRF_FICR_TRIM_SYSCTRL_LFLPRC_Type LFLPRC; /*!< (@ 0x00000038) (unspecified)                                        */
      __IOM NRF_FICR_TRIM_SYSCTRL_VDETPOF5V0_Type VDETPOF5V0; /*!< (@ 0x00000048) (unspecified)                                */
      __IOM NRF_FICR_TRIM_SYSCTRL_VDETPOFVBAT_Type VDETPOFVBAT; /*!< (@ 0x0000004C) (unspecified)                              */
    };
  };
  #if defined(_GNUC_)
    #pragma GCC diagnostic pop
  #endif
  __IM  uint32_t  RESERVED;
  __IOM NRF_FICR_TRIM_SYSCTRL_AUDIOPLL_Type AUDIOPLL; /*!< (@ 0x00000054) (unspecified)                                        */
  __IOM NRF_FICR_TRIM_SYSCTRL_USBHSPLL_Type USBHSPLL; /*!< (@ 0x00000058) (unspecified)                                        */
  __IOM NRF_FICR_TRIM_SYSCTRL_MBIAS_Type MBIAS;      /*!< (@ 0x0000005C) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SYSCTRL_OSCRFR_Type OSCRFR;    /*!< (@ 0x00000068) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SYSCTRL_VREG1V0_Type VREG1V0;  /*!< (@ 0x00000070) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGAO0V8_Type VREGAO0V8; /*!< (@ 0x00000084) (unspecified)                                      */
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGAO1V8_Type VREGAO1V8; /*!< (@ 0x00000098) (unspecified)                                      */
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGMAIN_Type VREGMAIN; /*!< (@ 0x000000A8) (unspecified)                                        */
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGMRAM130_Type VREGMRAM130; /*!< (@ 0x000000D8) (unspecified)                                  */
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGMRAM131_Type VREGMRAM131; /*!< (@ 0x000000E8) (unspecified)                                  */
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGVS0V8_Type VREGVS0V8; /*!< (@ 0x000000F8) (unspecified)                                      */
  __IOM NRF_FICR_TRIM_SYSCTRL_VREGUSB_Type VREGUSB;  /*!< (@ 0x00000108) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETAO0V8_Type VDETAO0V8; /*!< (@ 0x00000118) (unspecified)                                      */
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETAO1V8_Type VDETAO1V8; /*!< (@ 0x00000124) (unspecified)                                      */
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETVS0V8_Type VDETVS0V8; /*!< (@ 0x0000012C) (unspecified)                                      */
  __IOM NRF_FICR_TRIM_SYSCTRL_VDETAO5V0_Type VDETAO5V0; /*!< (@ 0x00000134) (unspecified)                                      */
  __IOM NRF_FICR_TRIM_SYSCTRL_VDET1V0_Type VDET1V0;  /*!< (@ 0x00000138) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SYSCTRL_HSFLL120_Type HSFLL120; /*!< (@ 0x0000013C) (unspecified)                                        */
  __IOM NRF_FICR_TRIM_SYSCTRL_HSFLL121_Type HSFLL121; /*!< (@ 0x00000170) (unspecified)                                        */
  __IOM NRF_FICR_TRIM_SYSCTRL_MEMCONF120_Type MEMCONF120; /*!< (@ 0x000001A4) (unspecified)                                    */
  __IOM NRF_FICR_TRIM_SYSCTRL_MEMCONF130_Type MEMCONF130; /*!< (@ 0x00000274) (unspecified)                                    */
} NRF_FICR_TRIM_SYSCTRL_Type;                        /*!< Size = 636 (0x27C)                                                   */


/* ============================================== Struct FICR_TRIM_GLOBAL_SAADC ============================================== */
/**
  * @brief SAADC [FICR_TRIM_GLOBAL_SAADC] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CALVREF;                           /*!< (@ 0x00000000) Trim value for GLOBAL.SAADC.CALVREF                   */
  __IM  uint32_t  CALGAIN[3];                        /*!< (@ 0x00000004) Trim value for GLOBAL.SAADC.CALGAIN                   */
  __IM  uint32_t  CALOFFSET;                         /*!< (@ 0x00000010) Trim value for GLOBAL.SAADC.CALOFFSET                 */
  __IM  uint32_t  LINCALCOEFF[6];                    /*!< (@ 0x00000014) Trim value for GLOBAL.SAADC.LINCALCOEFF               */
  __IM  uint32_t  CALIREF;                           /*!< (@ 0x0000002C) Trim value for GLOBAL.SAADC.CALIREF                   */
} NRF_FICR_TRIM_GLOBAL_SAADC_Type;                   /*!< Size = 48 (0x030)                                                    */

/* FICR_TRIM_GLOBAL_SAADC_CALVREF: Trim value for GLOBAL.SAADC.CALVREF */
  #define FICR_TRIM_GLOBAL_SAADC_CALVREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CALVREF register.                       */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_CALVREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define FICR_TRIM_GLOBAL_SAADC_CALVREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_CALVREF_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/                                        


/* FICR_TRIM_GLOBAL_SAADC_CALGAIN: Trim value for GLOBAL.SAADC.CALGAIN */
  #define FICR_TRIM_GLOBAL_SAADC_CALGAIN_MaxCount (3UL) /*!< Max size of CALGAIN[3] array.                                     */
  #define FICR_TRIM_GLOBAL_SAADC_CALGAIN_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CALGAIN[3] register.                    */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_CALGAIN_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define FICR_TRIM_GLOBAL_SAADC_CALGAIN_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_CALGAIN_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/                                        


