adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FICR_TRIM_GLOBAL_SAADC_CALOFFSET: Trim value for GLOBAL.SAADC.CALOFFSET */
  #define FICR_TRIM_GLOBAL_SAADC_CALOFFSET_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CALOFFSET register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_CALOFFSET_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define FICR_TRIM_GLOBAL_SAADC_CALOFFSET_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_CALOFFSET_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/                                     


/* FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF: Trim value for GLOBAL.SAADC.LINCALCOEFF */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_MaxCount (6UL) /*!< Max size of LINCALCOEFF[6] array.                             */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LINCALCOEFF[6] register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                


/* FICR_TRIM_GLOBAL_SAADC_CALIREF: Trim value for GLOBAL.SAADC.CALIREF */
  #define FICR_TRIM_GLOBAL_SAADC_CALIREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CALIREF register.                       */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_CALIREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define FICR_TRIM_GLOBAL_SAADC_CALIREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_CALIREF_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/                                        



/* ============================================== Struct FICR_TRIM_GLOBAL_TEMP =============================================== */
/**
  * @brief TEMP [FICR_TRIM_GLOBAL_TEMP] (unspecified)
  */
typedef struct {
  __IM  uint32_t  A[6];                              /*!< (@ 0x00000000) Trim value for GLOBAL.TEMP.A                          */
  __IM  uint32_t  B[6];                              /*!< (@ 0x00000018) Trim value for GLOBAL.TEMP.B                          */
  __IM  uint32_t  T[5];                              /*!< (@ 0x00000030) Trim value for GLOBAL.TEMP.T                          */
} NRF_FICR_TRIM_GLOBAL_TEMP_Type;                    /*!< Size = 68 (0x044)                                                    */

/* FICR_TRIM_GLOBAL_TEMP_A: Trim value for GLOBAL.TEMP.A */
  #define FICR_TRIM_GLOBAL_TEMP_A_MaxCount (6UL)     /*!< Max size of A[6] array.                                              */
  #define FICR_TRIM_GLOBAL_TEMP_A_ResetValue (0xFFFFFFFFUL) /*!< Reset value of A[6] register.                                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_TEMP_A_VALUE_Pos (0UL)    /*!< Position of VALUE field.                                             */
  #define FICR_TRIM_GLOBAL_TEMP_A_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_TEMP_A_VALUE_Pos) /*!< Bit mask of VALUE field.  */


/* FICR_TRIM_GLOBAL_TEMP_B: Trim value for GLOBAL.TEMP.B */
  #define FICR_TRIM_GLOBAL_TEMP_B_MaxCount (6UL)     /*!< Max size of B[6] array.                                              */
  #define FICR_TRIM_GLOBAL_TEMP_B_ResetValue (0xFFFFFFFFUL) /*!< Reset value of B[6] register.                                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_TEMP_B_VALUE_Pos (0UL)    /*!< Position of VALUE field.                                             */
  #define FICR_TRIM_GLOBAL_TEMP_B_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_TEMP_B_VALUE_Pos) /*!< Bit mask of VALUE field.  */


/* FICR_TRIM_GLOBAL_TEMP_T: Trim value for GLOBAL.TEMP.T */
  #define FICR_TRIM_GLOBAL_TEMP_T_MaxCount (5UL)     /*!< Max size of T[5] array.                                              */
  #define FICR_TRIM_GLOBAL_TEMP_T_ResetValue (0xFFFFFFFFUL) /*!< Reset value of T[5] register.                                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_TEMP_T_VALUE_Pos (0UL)    /*!< Position of VALUE field.                                             */
  #define FICR_TRIM_GLOBAL_TEMP_T_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_TEMP_T_VALUE_Pos) /*!< Bit mask of VALUE field.  */



/* ============================================== Struct FICR_TRIM_GLOBAL_NFCT =============================================== */
/**
  * @brief NFCT [FICR_TRIM_GLOBAL_NFCT] (unspecified)
  */
typedef struct {
  __IM  uint32_t  BIASCFG;                           /*!< (@ 0x00000000) Trim value for NFCT.BIASCFG                           */
} NRF_FICR_TRIM_GLOBAL_NFCT_Type;                    /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_GLOBAL_NFCT_BIASCFG: Trim value for NFCT.BIASCFG */
  #define FICR_TRIM_GLOBAL_NFCT_BIASCFG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BIASCFG register.                        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_NFCT_BIASCFG_VALUE_Pos (0UL) /*!< Position of VALUE field.                                          */
  #define FICR_TRIM_GLOBAL_NFCT_BIASCFG_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_NFCT_BIASCFG_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/                                        



/* =========================================== Struct FICR_TRIM_GLOBAL_CANPLL_TRIM =========================================== */
/**
  * @brief TRIM [FICR_TRIM_GLOBAL_CANPLL_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CTUNE;                             /*!< (@ 0x00000000) Trim value for GLOBAL.CANPLL.CTUNE                    */
} NRF_FICR_TRIM_GLOBAL_CANPLL_TRIM_Type;             /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE: Trim value for GLOBAL.CANPLL.CTUNE */
  #define FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CTUNE register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                



/* ============================================= Struct FICR_TRIM_GLOBAL_CANPLL ============================================== */
/**
  * @brief CANPLL [FICR_TRIM_GLOBAL_CANPLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_GLOBAL_CANPLL_TRIM_Type TRIM;  /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_FICR_TRIM_GLOBAL_CANPLL_Type;                  /*!< Size = 4 (0x004)                                                     */


/* ===================================== Struct FICR_TRIM_GLOBAL_GPIO_PORTCNF_DRIVECTRL ====================================== */
/**
  * @brief DRIVECTRL [FICR_TRIM_GLOBAL_GPIO_PORTCNF_DRIVECTRL] (unspecified)
  */
typedef struct {
  __IM  uint32_t  P[2];                              /*!< (@ 0x00000000) Trim value for GPIO.Pn.PORTCNF.DRIVECTRL              */
} NRF_FICR_TRIM_GLOBAL_GPIO_PORTCNF_DRIVECTRL_Type;  /*!< Size = 8 (0x008)                                                     */

/* FICR_TRIM_GLOBAL_GPIO_PORTCNF_DRIVECTRL_P: Trim value for GPIO.Pn.PORTCNF.DRIVECTRL */
  #define FICR_TRIM_GLOBAL_GPIO_PORTCNF_DRIVECTRL_P_MaxCount (2UL) /*!< Max size of P[2] array.                                */
  #define FICR_TRIM_GLOBAL_GPIO_PORTCNF_DRIVECTRL_P_ResetValue (0xFFFFFFFFUL) /*!< Reset value of P[2] register.               */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_GPIO_PORTCNF_DRIVECTRL_P_VALUE_Pos (0UL) /*!< Position of VALUE field.                              */
  #define FICR_TRIM_GLOBAL_GPIO_PORTCNF_DRIVECTRL_P_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_GPIO_PORTCNF_DRIVECTRL_P_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* ========================================== Struct FICR_TRIM_GLOBAL_GPIO_PORTCNF =========================================== */
/**
  * @brief PORTCNF [FICR_TRIM_GLOBAL_GPIO_PORTCNF] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_GLOBAL_GPIO_PORTCNF_DRIVECTRL_Type DRIVECTRL; /*!< (@ 0x00000000) (unspecified)                          */
} NRF_FICR_TRIM_GLOBAL_GPIO_PORTCNF_Type;            /*!< Size = 8 (0x008)                                                     */


/* ============================================== Struct FICR_TRIM_GLOBAL_GPIO =============================================== */
/**
  * @brief GPIO [FICR_TRIM_GLOBAL_GPIO] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_GLOBAL_GPIO_PORTCNF_Type PORTCNF; /*!< (@ 0x00000000) (unspecified)                                      */
} NRF_FICR_TRIM_GLOBAL_GPIO_Type;                    /*!< Size = 8 (0x008)                                                     */


/* ================================================= Struct FICR_TRIM_GLOBAL ================================================= */
/**
  * @brief GLOBAL [FICR_TRIM_GLOBAL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_GLOBAL_SAADC_Type SAADC;       /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_GLOBAL_TEMP_Type TEMP;         /*!< (@ 0x00000030) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_GLOBAL_NFCT_Type NFCT;         /*!< (@ 0x00000074) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_GLOBAL_CANPLL_Type CANPLL;     /*!< (@ 0x00000078) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_GLOBAL_GPIO_Type GPIO;         /*!< (@ 0x0000007C) (unspecified)                                         */
} NRF_FICR_TRIM_GLOBAL_Type;                         /*!< Size = 132 (0x084)                                                   */


/* ========================================= Struct FICR_TRIM_APPLICATION_HSFLL_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_APPLICATION_HSFLL_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000000) Trim value for APPLICATION.HSFLL.VSUP                 */
  __IM  uint32_t  COARSE[6];                         /*!< (@ 0x00000004) Trim value for APPLICATION.HSFLL.COARSE               */
  __IM  uint32_t  FINE[6];                           /*!< (@ 0x0000001C) Trim value for APPLICATION.HSFLL.FINE                 */
} NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_Type;         /*!< Size = 52 (0x034)                                                    */

/* FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP: Trim value for APPLICATION.HSFLL.VSUP */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            


/* FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE: Trim value for APPLICATION.HSFLL.COARSE */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_MaxCount (6UL) /*!< Max size of COARSE[6] array.                             */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of COARSE[6] register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


