adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE: Trim value for APPLICATION.HSFLL.FINE */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_MaxCount (6UL) /*!< Max size of FINE[6] array.                                 */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FINE[6] register.                */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            



/* =========================================== Struct FICR_TRIM_APPLICATION_HSFLL ============================================ */
/**
  * @brief HSFLL [FICR_TRIM_APPLICATION_HSFLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                      */
} NRF_FICR_TRIM_APPLICATION_HSFLL_Type;              /*!< Size = 52 (0x034)                                                    */


/* ===================================== Struct FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE ====================================== */
/**
  * @brief BLOCKTYPE [FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim value for APPLICATION.MEMCONF.TRIM               */
} NRF_FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_Type;  /*!< Size = 4 (0x004)                                                     */
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_MaxCount (3UL) /*!< Max size of BLOCKTYPE[3] array.                          */

/* FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_TRIM: Trim value for APPLICATION.MEMCONF.TRIM */
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_TRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                           */
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_TRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* ========================================== Struct FICR_TRIM_APPLICATION_MEMCONF =========================================== */
/**
  * @brief MEMCONF [FICR_TRIM_APPLICATION_MEMCONF] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_Type BLOCKTYPE[3]; /*!< (@ 0x00000000) (unspecified)                       */
} NRF_FICR_TRIM_APPLICATION_MEMCONF_Type;            /*!< Size = 12 (0x00C)                                                    */


/* ============================================== Struct FICR_TRIM_APPLICATION =============================================== */
/**
  * @brief APPLICATION [FICR_TRIM_APPLICATION] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_APPLICATION_HSFLL_Type HSFLL;  /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_APPLICATION_MEMCONF_Type MEMCONF; /*!< (@ 0x00000034) (unspecified)                                      */
} NRF_FICR_TRIM_APPLICATION_Type;                    /*!< Size = 64 (0x040)                                                    */


/* ========================================== Struct FICR_TRIM_RADIOCORE_HSFLL_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_RADIOCORE_HSFLL_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000000) Trim value for RADIOCORE.HSFLL.VSUP                   */
  __IM  uint32_t  COARSE[6];                         /*!< (@ 0x00000004) Trim value for RADIOCORE.HSFLL.COARSE                 */
  __IM  uint32_t  FINE[6];                           /*!< (@ 0x0000001C) Trim value for RADIOCORE.HSFLL.FINE                   */
} NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_Type;           /*!< Size = 52 (0x034)                                                    */

/* FICR_TRIM_RADIOCORE_HSFLL_TRIM_VSUP: Trim value for RADIOCORE.HSFLL.VSUP */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_HSFLL_TRIM_VSUP_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                


/* FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE: Trim value for RADIOCORE.HSFLL.COARSE */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_MaxCount (6UL) /*!< Max size of COARSE[6] array.                               */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of COARSE[6] register.              */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            


/* FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE: Trim value for RADIOCORE.HSFLL.FINE */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_MaxCount (6UL) /*!< Max size of FINE[6] array.                                   */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FINE[6] register.                  */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                



/* ============================================ Struct FICR_TRIM_RADIOCORE_HSFLL ============================================= */
/**
  * @brief HSFLL [FICR_TRIM_RADIOCORE_HSFLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                        */
} NRF_FICR_TRIM_RADIOCORE_HSFLL_Type;                /*!< Size = 52 (0x034)                                                    */


