adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ====================================== Struct FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE ======================================= */
/**
  * @brief BLOCKTYPE [FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim value for RADIOCORE.MEMCONF.TRIM                 */
} NRF_FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_Type;    /*!< Size = 4 (0x004)                                                     */
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_MaxCount (3UL) /*!< Max size of BLOCKTYPE[3] array.                            */

/* FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM: Trim value for RADIOCORE.MEMCONF.TRIM */
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM register.              */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* =========================================== Struct FICR_TRIM_RADIOCORE_MEMCONF ============================================ */
/**
  * @brief MEMCONF [FICR_TRIM_RADIOCORE_MEMCONF] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_Type BLOCKTYPE[3]; /*!< (@ 0x00000000) (unspecified)                         */
} NRF_FICR_TRIM_RADIOCORE_MEMCONF_Type;              /*!< Size = 12 (0x00C)                                                    */


/* ======================================= Struct FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA ======================================== */
/**
  * @brief SPHYNXANA [FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA] (unspecified)
  */
typedef struct {
  __IM  uint32_t  FSCTRL1;                           /*!< (@ 0x00000000) Trim value for RADIOCORE.RADIO.FSCTRL1                */
  __IM  uint32_t  FSCTRL2;                           /*!< (@ 0x00000004) Trim value for RADIOCORE.RADIO.FSCTRL2                */
  __IM  uint32_t  RXCTRL;                            /*!< (@ 0x00000008) Trim value for RADIOCORE.RADIO.RXCTRL                 */
  __IM  uint32_t  TXCTRL;                            /*!< (@ 0x0000000C) Trim value for RADIOCORE.RADIO.TXCTRL                 */
  __IM  uint32_t  OVRRXTRIMCODE;                     /*!< (@ 0x00000010) Trim value for RADIOCORE.RADIO.OVRRXTRIMCODE          */
} NRF_FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_Type;      /*!< Size = 20 (0x014)                                                    */

/* FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL1: Trim value for RADIOCORE.RADIO.FSCTRL1 */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FSCTRL1 register.          */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL1_VALUE_Pos (0UL) /*!< Position of VALUE field.                            */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL1_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL1_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL2: Trim value for RADIOCORE.RADIO.FSCTRL2 */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL2_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FSCTRL2 register.          */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL2_VALUE_Pos (0UL) /*!< Position of VALUE field.                            */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL2_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL2_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_RXCTRL: Trim value for RADIOCORE.RADIO.RXCTRL */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_RXCTRL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RXCTRL register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_RXCTRL_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_RXCTRL_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_RXCTRL_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_TXCTRL: Trim value for RADIOCORE.RADIO.TXCTRL */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_TXCTRL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TXCTRL register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_TXCTRL_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_TXCTRL_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_TXCTRL_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       


/* FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_OVRRXTRIMCODE: Trim value for RADIOCORE.RADIO.OVRRXTRIMCODE */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_OVRRXTRIMCODE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of OVRRXTRIMCODE
                                                                            register.*/                                           

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_OVRRXTRIMCODE_VALUE_Pos (0UL) /*!< Position of VALUE field.                      */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_OVRRXTRIMCODE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_OVRRXTRIMCODE_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* ============================================ Struct FICR_TRIM_RADIOCORE_RADIO ============================================= */
/**
  * @brief RADIO [FICR_TRIM_RADIOCORE_RADIO] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_Type SPHYNXANA; /*!< (@ 0x00000000) (unspecified)                              */
  __IM  uint32_t  RSSIOFFSET;                        /*!< (@ 0x00000014) Trim value for RSSI offset compensation               */
  __IM  uint32_t  EDCAL;                             /*!< (@ 0x00000018) Trim value for EDCAL                                  */
} NRF_FICR_TRIM_RADIOCORE_RADIO_Type;                /*!< Size = 28 (0x01C)                                                    */

