adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FICR_TRIM_RADIOCORE_RADIO_RSSIOFFSET: Trim value for RSSI offset compensation */
  #define FICR_TRIM_RADIOCORE_RADIO_RSSIOFFSET_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RSSIOFFSET register.              */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_RSSIOFFSET_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define FICR_TRIM_RADIOCORE_RADIO_RSSIOFFSET_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_RSSIOFFSET_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            


/* FICR_TRIM_RADIOCORE_RADIO_EDCAL: Trim value for EDCAL */
  #define FICR_TRIM_RADIOCORE_RADIO_EDCAL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of EDCAL register.                        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_EDCAL_VALUE_Pos (0UL) /*!< Position of VALUE field.                                        */
  #define FICR_TRIM_RADIOCORE_RADIO_EDCAL_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_EDCAL_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/                                        



/* =============================================== Struct FICR_TRIM_RADIOCORE ================================================ */
/**
  * @brief RADIOCORE [FICR_TRIM_RADIOCORE] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_RADIOCORE_HSFLL_Type HSFLL;    /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_RADIOCORE_MEMCONF_Type MEMCONF; /*!< (@ 0x00000034) (unspecified)                                        */
  __IOM NRF_FICR_TRIM_RADIOCORE_RADIO_Type RADIO;    /*!< (@ 0x00000040) (unspecified)                                         */
} NRF_FICR_TRIM_RADIOCORE_Type;                      /*!< Size = 92 (0x05C)                                                    */


/* ============================================= Struct FICR_TRIM_BOOT_HSFLL120 ============================================== */
/**
  * @brief HSFLL120 [FICR_TRIM_BOOT_HSFLL120] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000000) Trim value for SYSCTRL.HSFLL120.VSUP                  */
  __IM  uint32_t  COARSE;                            /*!< (@ 0x00000004) Trim value for SYSCTRL.HSFLL120.COARSE                */
  __IM  uint32_t  FINE;                              /*!< (@ 0x00000008) Trim value for SYSCTRL.HSFLL120.FINE                  */
} NRF_FICR_TRIM_BOOT_HSFLL120_Type;                  /*!< Size = 12 (0x00C)                                                    */

/* FICR_TRIM_BOOT_HSFLL120_VSUP: Trim value for SYSCTRL.HSFLL120.VSUP */
  #define FICR_TRIM_BOOT_HSFLL120_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_BOOT_HSFLL120_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                           */
  #define FICR_TRIM_BOOT_HSFLL120_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_BOOT_HSFLL120_VSUP_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/                                              


/* FICR_TRIM_BOOT_HSFLL120_COARSE: Trim value for SYSCTRL.HSFLL120.COARSE */
  #define FICR_TRIM_BOOT_HSFLL120_COARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of COARSE register.                        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_BOOT_HSFLL120_COARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define FICR_TRIM_BOOT_HSFLL120_COARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_BOOT_HSFLL120_COARSE_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/                                        


/* FICR_TRIM_BOOT_HSFLL120_FINE: Trim value for SYSCTRL.HSFLL120.FINE */
  #define FICR_TRIM_BOOT_HSFLL120_FINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FINE register.                            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_BOOT_HSFLL120_FINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                           */
  #define FICR_TRIM_BOOT_HSFLL120_FINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_BOOT_HSFLL120_FINE_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/                                              



/* =============================================== Struct FICR_TRIM_BOOT_OTPC ================================================ */
/**
  * @brief OTPC [FICR_TRIM_BOOT_OTPC] (unspecified)
  */
typedef struct {
  __IM  uint32_t  WAITSTATES;                        /*!< (@ 0x00000000) OTPC waitstates trim when running with
                                                                         TRIM.BOOT.HSFLL120 trims*/                               
  __IM  uint32_t  FREQUENCY;                         /*!< (@ 0x00000004) OTPC frequency tim when running with TRIM.BOOT.HSFLL120
                                                                         trims*/                                                  
} NRF_FICR_TRIM_BOOT_OTPC_Type;                      /*!< Size = 8 (0x008)                                                     */

/* FICR_TRIM_BOOT_OTPC_WAITSTATES: OTPC waitstates trim when running with TRIM.BOOT.HSFLL120 trims */
  #define FICR_TRIM_BOOT_OTPC_WAITSTATES_ResetValue (0xFFFFFFFFUL) /*!< Reset value of WAITSTATES register.                    */

/* WAITSTATES @Bits 0..6 : Waitstates */
  #define FICR_TRIM_BOOT_OTPC_WAITSTATES_WAITSTATES_Pos (0UL) /*!< Position of WAITSTATES field.                               */
  #define FICR_TRIM_BOOT_OTPC_WAITSTATES_WAITSTATES_Msk (0x7FUL << FICR_TRIM_BOOT_OTPC_WAITSTATES_WAITSTATES_Pos) /*!< Bit mask
                                                                            of WAITSTATES field.*/                                


/* FICR_TRIM_BOOT_OTPC_FREQUENCY: OTPC frequency tim when running with TRIM.BOOT.HSFLL120 trims */
  #define FICR_TRIM_BOOT_OTPC_FREQUENCY_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FREQUENCY register.                      */

