adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FREQUENCY @Bits 0..31 : Trim value */
  #define FICR_TRIM_BOOT_OTPC_FREQUENCY_FREQUENCY_Pos (0UL) /*!< Position of FREQUENCY field.                                  */
  #define FICR_TRIM_BOOT_OTPC_FREQUENCY_FREQUENCY_Msk (0xFFFFFFFFUL << FICR_TRIM_BOOT_OTPC_FREQUENCY_FREQUENCY_Pos) /*!< Bit
                                                                            mask of FREQUENCY field.*/                            



/* ================================================== Struct FICR_TRIM_BOOT ================================================== */
/**
  * @brief BOOT [FICR_TRIM_BOOT] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_BOOT_HSFLL120_Type HSFLL120;   /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_BOOT_OTPC_Type OTPC;           /*!< (@ 0x0000000C) (unspecified)                                         */
} NRF_FICR_TRIM_BOOT_Type;                           /*!< Size = 20 (0x014)                                                    */


/* ================================================= Struct FICR_TRIM_COMMON ================================================= */
/**
  * @brief COMMON [FICR_TRIM_COMMON] (unspecified)
  */
typedef struct {
  __IM  uint32_t  ZERO;                              /*!< (@ 0x00000000) Value to be written to MIRROR register in MMIs
                                                                         (MIRROR=0)*/                                             
  __IM  uint32_t  ONE;                               /*!< (@ 0x00000004) Value to be written to MIRROR register in MMIs
                                                                         (MIRROR=1)*/                                             
} NRF_FICR_TRIM_COMMON_Type;                         /*!< Size = 8 (0x008)                                                     */

/* FICR_TRIM_COMMON_ZERO: Value to be written to MIRROR register in MMIs (MIRROR=0) */
  #define FICR_TRIM_COMMON_ZERO_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ZERO register.                                   */

/* ZERO @Bits 0..31 : Mirror register value */
  #define FICR_TRIM_COMMON_ZERO_ZERO_Pos (0UL)       /*!< Position of ZERO field.                                              */
  #define FICR_TRIM_COMMON_ZERO_ZERO_Msk (0xFFFFFFFFUL << FICR_TRIM_COMMON_ZERO_ZERO_Pos) /*!< Bit mask of ZERO field.         */


/* FICR_TRIM_COMMON_ONE: Value to be written to MIRROR register in MMIs (MIRROR=1) */
  #define FICR_TRIM_COMMON_ONE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ONE register.                                     */

/* ONE @Bits 0..31 : Mirror register value */
  #define FICR_TRIM_COMMON_ONE_ONE_Pos (0UL)         /*!< Position of ONE field.                                               */
  #define FICR_TRIM_COMMON_ONE_ONE_Msk (0xFFFFFFFFUL << FICR_TRIM_COMMON_ONE_ONE_Pos) /*!< Bit mask of ONE field.              */



/* =========================================== Struct FICR_TRIM_SECURE_HSFLL_TRIM ============================================ */
/**
  * @brief TRIM [FICR_TRIM_SECURE_HSFLL_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000000) Trim value for SECURE.HSFLL.VSUP                      */
  __IM  uint32_t  COARSE[6];                         /*!< (@ 0x00000004) Trim value for SECURE.HSFLL.COARSE                    */
  __IM  uint32_t  FINE[6];                           /*!< (@ 0x0000001C) Trim value for SECURE.HSFLL.FINE                      */
} NRF_FICR_TRIM_SECURE_HSFLL_TRIM_Type;              /*!< Size = 52 (0x034)                                                    */

/* FICR_TRIM_SECURE_HSFLL_TRIM_VSUP: Trim value for SECURE.HSFLL.VSUP */
  #define FICR_TRIM_SECURE_HSFLL_TRIM_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SECURE_HSFLL_TRIM_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define FICR_TRIM_SECURE_HSFLL_TRIM_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SECURE_HSFLL_TRIM_VSUP_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/                                     


/* FICR_TRIM_SECURE_HSFLL_TRIM_COARSE: Trim value for SECURE.HSFLL.COARSE */
  #define FICR_TRIM_SECURE_HSFLL_TRIM_COARSE_MaxCount (6UL) /*!< Max size of COARSE[6] array.                                  */
  #define FICR_TRIM_SECURE_HSFLL_TRIM_COARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of COARSE[6] register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SECURE_HSFLL_TRIM_COARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_SECURE_HSFLL_TRIM_COARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SECURE_HSFLL_TRIM_COARSE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                


/* FICR_TRIM_SECURE_HSFLL_TRIM_FINE: Trim value for SECURE.HSFLL.FINE */
  #define FICR_TRIM_SECURE_HSFLL_TRIM_FINE_MaxCount (6UL) /*!< Max size of FINE[6] array.                                      */
  #define FICR_TRIM_SECURE_HSFLL_TRIM_FINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FINE[6] register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SECURE_HSFLL_TRIM_FINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define FICR_TRIM_SECURE_HSFLL_TRIM_FINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SECURE_HSFLL_TRIM_FINE_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/                                     



/* ============================================== Struct FICR_TRIM_SECURE_HSFLL ============================================== */
/**
  * @brief HSFLL [FICR_TRIM_SECURE_HSFLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SECURE_HSFLL_TRIM_Type TRIM;   /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_FICR_TRIM_SECURE_HSFLL_Type;                   /*!< Size = 52 (0x034)                                                    */


