adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ========================================== Struct FICR_TRIM_SECURE_HSFLL200_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_SECURE_HSFLL200_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000000) Trim value for SECURE.HSFLL200.VSUP                   */
  __IM  uint32_t  COARSE[4];                         /*!< (@ 0x00000004) Trim value for SECURE.HSFLL200.COARSE                 */
  __IM  uint32_t  FINE[4];                           /*!< (@ 0x00000014) Trim value for SECURE.HSFLL200.FINE                   */
} NRF_FICR_TRIM_SECURE_HSFLL200_TRIM_Type;           /*!< Size = 36 (0x024)                                                    */

/* FICR_TRIM_SECURE_HSFLL200_TRIM_VSUP: Trim value for SECURE.HSFLL200.VSUP */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SECURE_HSFLL200_TRIM_VSUP_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                


/* FICR_TRIM_SECURE_HSFLL200_TRIM_COARSE: Trim value for SECURE.HSFLL200.COARSE */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_COARSE_MaxCount (4UL) /*!< Max size of COARSE[4] array.                               */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_COARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of COARSE[4] register.              */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_COARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_COARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SECURE_HSFLL200_TRIM_COARSE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            


/* FICR_TRIM_SECURE_HSFLL200_TRIM_FINE: Trim value for SECURE.HSFLL200.FINE */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_FINE_MaxCount (4UL) /*!< Max size of FINE[4] array.                                   */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_FINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FINE[4] register.                  */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_FINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_SECURE_HSFLL200_TRIM_FINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SECURE_HSFLL200_TRIM_FINE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                



/* ============================================ Struct FICR_TRIM_SECURE_HSFLL200 ============================================= */
/**
  * @brief HSFLL200 [FICR_TRIM_SECURE_HSFLL200] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SECURE_HSFLL200_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                        */
} NRF_FICR_TRIM_SECURE_HSFLL200_Type;                /*!< Size = 36 (0x024)                                                    */


/* ======================================== Struct FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE ======================================== */
/**
  * @brief BLOCKTYPE [FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim value for SECURE.MEMCONF.BLOCKTYPE[n].TRIM       */
} NRF_FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE_Type;       /*!< Size = 4 (0x004)                                                     */
  #define FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE_MaxCount (7UL) /*!< Max size of BLOCKTYPE[7] array.                               */

/* FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE_TRIM: Trim value for SECURE.MEMCONF.BLOCKTYPE[n].TRIM */
  #define FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE_TRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* ============================================= Struct FICR_TRIM_SECURE_MEMCONF ============================================= */
/**
  * @brief MEMCONF [FICR_TRIM_SECURE_MEMCONF] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE_Type BLOCKTYPE[7]; /*!< (@ 0x00000000) (unspecified)                            */
} NRF_FICR_TRIM_SECURE_MEMCONF_Type;                 /*!< Size = 28 (0x01C)                                                    */


/* ====================================== Struct FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE ======================================= */
/**
  * @brief BLOCKTYPE [FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim value for SECURE.MEMCONF200.TRIM                 */
} NRF_FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE_Type;    /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE_TRIM: Trim value for SECURE.MEMCONF200.TRIM */
  #define FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE_TRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM register.              */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE_TRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE_TRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE_TRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* =========================================== Struct FICR_TRIM_SECURE_MEMCONF200 ============================================ */
/**
  * @brief MEMCONF200 [FICR_TRIM_SECURE_MEMCONF200] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE_Type BLOCKTYPE; /*!< (@ 0x00000000) (unspecified)                            */
} NRF_FICR_TRIM_SECURE_MEMCONF200_Type;              /*!< Size = 4 (0x004)                                                     */


/* ================================================= Struct FICR_TRIM_SECURE ================================================= */
/**
  * @brief SECURE [FICR_TRIM_SECURE] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SECURE_HSFLL_Type HSFLL;       /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SECURE_HSFLL200_Type HSFLL200; /*!< (@ 0x00000034) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SECURE_MEMCONF_Type MEMCONF;   /*!< (@ 0x00000058) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SECURE_MEMCONF200_Type MEMCONF200; /*!< (@ 0x00000074) (unspecified)                                     */
} NRF_FICR_TRIM_SECURE_Type;                         /*!< Size = 120 (0x078)                                                   */


/* ============================================= Struct FICR_TRIM_WIFICORE_HSFLL ============================================= */
/**
  * @brief HSFLL [FICR_TRIM_WIFICORE_HSFLL] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000000) Trim value for WIFICORE.HSFLL.VSUP                    */
  __IM  uint32_t  COARSE;                            /*!< (@ 0x00000004) Trim value for WIFICORE.HSFLL.COARSE                  */
  __IM  uint32_t  FINE;                              /*!< (@ 0x00000008) Trim value for WIFICORE.HSFLL.FINE                    */
} NRF_FICR_TRIM_WIFICORE_HSFLL_Type;                 /*!< Size = 12 (0x00C)                                                    */

/* FICR_TRIM_WIFICORE_HSFLL_VSUP: Trim value for WIFICORE.HSFLL.VSUP */
  #define FICR_TRIM_WIFICORE_HSFLL_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_WIFICORE_HSFLL_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                          */
  #define FICR_TRIM_WIFICORE_HSFLL_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_WIFICORE_HSFLL_VSUP_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/                                        


/* FICR_TRIM_WIFICORE_HSFLL_COARSE: Trim value for WIFICORE.HSFLL.COARSE */
  #define FICR_TRIM_WIFICORE_HSFLL_COARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of COARSE register.                       */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_WIFICORE_HSFLL_COARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                        */
  #define FICR_TRIM_WIFICORE_HSFLL_COARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_WIFICORE_HSFLL_COARSE_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/                                        


