adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FICR_TRIM_WIFICORE_HSFLL_FINE: Trim value for WIFICORE.HSFLL.FINE */
  #define FICR_TRIM_WIFICORE_HSFLL_FINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FINE register.                           */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_WIFICORE_HSFLL_FINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                          */
  #define FICR_TRIM_WIFICORE_HSFLL_FINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_WIFICORE_HSFLL_FINE_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/                                        



/* ======================================== Struct FICR_TRIM_WIFICORE_MEMCONF_REPAIR ========================================= */
/**
  * @brief REPAIR [FICR_TRIM_WIFICORE_MEMCONF_REPAIR] (unspecified)
  */
typedef struct {
  __IM  uint32_t  BITLINE;                           /*!< (@ 0x00000000) Trim value for WIFICORE.MEMCONF.REPAIR[n].BITLINE     */
} NRF_FICR_TRIM_WIFICORE_MEMCONF_REPAIR_Type;        /*!< Size = 4 (0x004)                                                     */
  #define FICR_TRIM_WIFICORE_MEMCONF_REPAIR_MaxCount (23UL) /*!< Max size of REPAIR[23] array.                                 */

/* FICR_TRIM_WIFICORE_MEMCONF_REPAIR_BITLINE: Trim value for WIFICORE.MEMCONF.REPAIR[n].BITLINE */
  #define FICR_TRIM_WIFICORE_MEMCONF_REPAIR_BITLINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BITLINE register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_WIFICORE_MEMCONF_REPAIR_BITLINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                              */
  #define FICR_TRIM_WIFICORE_MEMCONF_REPAIR_BITLINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_WIFICORE_MEMCONF_REPAIR_BITLINE_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* ======================================= Struct FICR_TRIM_WIFICORE_MEMCONF_BLOCKTYPE ======================================= */
/**
  * @brief BLOCKTYPE [FICR_TRIM_WIFICORE_MEMCONF_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim value for WIFICORE.MEMCONF.BLOCKTYPE[n].TRIM     */
} NRF_FICR_TRIM_WIFICORE_MEMCONF_BLOCKTYPE_Type;     /*!< Size = 4 (0x004)                                                     */
  #define FICR_TRIM_WIFICORE_MEMCONF_BLOCKTYPE_MaxCount (4UL) /*!< Max size of BLOCKTYPE[4] array.                             */

/* FICR_TRIM_WIFICORE_MEMCONF_BLOCKTYPE_TRIM: Trim value for WIFICORE.MEMCONF.BLOCKTYPE[n].TRIM */
  #define FICR_TRIM_WIFICORE_MEMCONF_BLOCKTYPE_TRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM register.               */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_WIFICORE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                              */
  #define FICR_TRIM_WIFICORE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_WIFICORE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* ============================================ Struct FICR_TRIM_WIFICORE_MEMCONF ============================================ */
/**
  * @brief MEMCONF [FICR_TRIM_WIFICORE_MEMCONF] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_WIFICORE_MEMCONF_REPAIR_Type REPAIR[23]; /*!< (@ 0x00000000) (unspecified)                               */
  __IOM NRF_FICR_TRIM_WIFICORE_MEMCONF_BLOCKTYPE_Type BLOCKTYPE[4]; /*!< (@ 0x0000005C) (unspecified)                          */
} NRF_FICR_TRIM_WIFICORE_MEMCONF_Type;               /*!< Size = 108 (0x06C)                                                   */


/* ============================================= Struct FICR_TRIM_WIFICORE_RADIO ============================================= */
/**
  * @brief RADIO [FICR_TRIM_WIFICORE_RADIO] (unspecified)
  */
typedef struct {
  __IM  uint32_t  PDADJMCS7;                         /*!< (@ 0x00000000) Power detector adjustment for MCS7 for channel 7, 36,
                                                                         100, 165*/                                               
  __IM  uint32_t  PDADJMCS0;                         /*!< (@ 0x00000004) Power detector adjustment for MCS0 for channel 7, 36,
                                                                         100, 165*/                                               
  __IM  uint32_t  MAXPOW2G4;                         /*!< (@ 0x00000008) Maximum output power 2GHz band, channel 7             */
  __IM  uint32_t  MAXPOW5G0MCS7;                     /*!< (@ 0x0000000C) Maximum output power 5GHz band, MCS7                  */
  __IM  uint32_t  MAXPOW5G0MCS0;                     /*!< (@ 0x00000010) Maximum output power 5GHz band, MCS0                  */
  __IM  uint32_t  RXGAINOFFSET;                      /*!< (@ 0x00000014) RX gain offset for channel 7, 36, 100, 165            */
  __IM  uint32_t  TXPOWBACKOFFT;                     /*!< (@ 0x00000018) TX power backoff versus temperature                   */
  __IM  uint32_t  TXPOWBACKOFFV;                     /*!< (@ 0x0000001C) TX power backoff versus voltage                       */
  __IM  uint32_t  RFTRIMSPARE[16];                   /*!< (@ 0x00000020) Arbitrary RF register trim                            */
} NRF_FICR_TRIM_WIFICORE_RADIO_Type;                 /*!< Size = 96 (0x060)                                                    */

/* FICR_TRIM_WIFICORE_RADIO_PDADJMCS7: Power detector adjustment for MCS7 for channel 7, 36, 100, 165 */
  #define FICR_TRIM_WIFICORE_RADIO_PDADJMCS7_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PDADJMCS7 register.                 */

/* CHANNEL7 @Bits 0..7 : Trim value for channel 7 (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_PDADJMCS7_CHANNEL7_Pos (0UL) /*!< Position of CHANNEL7 field.                               */
  #define FICR_TRIM_WIFICORE_RADIO_PDADJMCS7_CHANNEL7_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_PDADJMCS7_CHANNEL7_Pos) /*!< Bit
                                                                            mask of CHANNEL7 field.*/                             

/* CHANNEL36 @Bits 8..15 : Trim value for channel 36 (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_PDADJMCS7_CHANNEL36_Pos (8UL) /*!< Position of CHANNEL36 field.                             */
  #define FICR_TRIM_WIFICORE_RADIO_PDADJMCS7_CHANNEL36_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_PDADJMCS7_CHANNEL36_Pos) /*!< Bit
                                                                            mask of CHANNEL36 field.*/                            

/* CHANNEL100 @Bits 16..23 : Trim value for channel 100 (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_PDADJMCS7_CHANNEL100_Pos (16UL) /*!< Position of CHANNEL100 field.                          */
  #define FICR_TRIM_WIFICORE_RADIO_PDADJMCS7_CHANNEL100_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_PDADJMCS7_CHANNEL100_Pos) /*!<
                                                                            Bit mask of CHANNEL100 field.*/                       

/* CHANNEL165 @Bits 24..31 : Trim value for channel 165 (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_PDADJMCS7_CHANNEL165_Pos (24UL) /*!< Position of CHANNEL165 field.                          */
  #define FICR_TRIM_WIFICORE_RADIO_PDADJMCS7_CHANNEL165_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_PDADJMCS7_CHANNEL165_Pos) /*!<
                                                                            Bit mask of CHANNEL165 field.*/                       


/* FICR_TRIM_WIFICORE_RADIO_PDADJMCS0: Power detector adjustment for MCS0 for channel 7, 36, 100, 165 */
  #define FICR_TRIM_WIFICORE_RADIO_PDADJMCS0_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PDADJMCS0 register.                 */

/* CHANNEL7 @Bits 0..7 : Trim value for channel 7 (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_PDADJMCS0_CHANNEL7_Pos (0UL) /*!< Position of CHANNEL7 field.                               */
  #define FICR_TRIM_WIFICORE_RADIO_PDADJMCS0_CHANNEL7_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_PDADJMCS0_CHANNEL7_Pos) /*!< Bit
                                                                            mask of CHANNEL7 field.*/                             

/* CHANNEL36 @Bits 8..15 : Trim value for channel 36 (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_PDADJMCS0_CHANNEL36_Pos (8UL) /*!< Position of CHANNEL36 field.                             */
  #define FICR_TRIM_WIFICORE_RADIO_PDADJMCS0_CHANNEL36_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_PDADJMCS0_CHANNEL36_Pos) /*!< Bit
                                                                            mask of CHANNEL36 field.*/                            

/* CHANNEL100 @Bits 16..23 : Trim value for channel 100 (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_PDADJMCS0_CHANNEL100_Pos (16UL) /*!< Position of CHANNEL100 field.                          */
  #define FICR_TRIM_WIFICORE_RADIO_PDADJMCS0_CHANNEL100_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_PDADJMCS0_CHANNEL100_Pos) /*!<
                                                                            Bit mask of CHANNEL100 field.*/                       

/* CHANNEL165 @Bits 24..31 : Trim value for channel 165 (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_PDADJMCS0_CHANNEL165_Pos (24UL) /*!< Position of CHANNEL165 field.                          */
  #define FICR_TRIM_WIFICORE_RADIO_PDADJMCS0_CHANNEL165_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_PDADJMCS0_CHANNEL165_Pos) /*!<
                                                                            Bit mask of CHANNEL165 field.*/                       


/* FICR_TRIM_WIFICORE_RADIO_MAXPOW2G4: Maximum output power 2GHz band, channel 7 */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW2G4_ResetValue (0xFFFFFFFFUL) /*!< Reset value of MAXPOW2G4 register.                 */

/* DSS @Bits 0..7 : Trim value for channel 7 DSS (units of 0.25dBm) */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW2G4_DSS_Pos (0UL) /*!< Position of DSS field.                                         */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW2G4_DSS_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_MAXPOW2G4_DSS_Pos) /*!< Bit mask of DSS
                                                                            field.*/                                              

/* MCS0 @Bits 8..15 : Trim value for channel 7 MCS0 (units of 0.25dBm) */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW2G4_MCS0_Pos (8UL) /*!< Position of MCS0 field.                                       */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW2G4_MCS0_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_MAXPOW2G4_MCS0_Pos) /*!< Bit mask of
                                                                            MCS0 field.*/                                         

