adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* MCS7 @Bits 16..23 : Trim value for channel 7 MCS7 (units of 0.25dBm) */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW2G4_MCS7_Pos (16UL) /*!< Position of MCS7 field.                                      */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW2G4_MCS7_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_MAXPOW2G4_MCS7_Pos) /*!< Bit mask of
                                                                            MCS7 field.*/                                         


/* FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS7: Maximum output power 5GHz band, MCS7 */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS7_ResetValue (0xFFFFFFFFUL) /*!< Reset value of MAXPOW5G0MCS7 register.         */

/* CHANNEL36 @Bits 0..7 : Trim value for channel 36 MCS7 (units of 0.25dBm) */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS7_CHANNEL36_Pos (0UL) /*!< Position of CHANNEL36 field.                         */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS7_CHANNEL36_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS7_CHANNEL36_Pos)
                                                                            /*!< Bit mask of CHANNEL36 field.*/                   

/* CHANNEL100 @Bits 8..15 : Trim value for channel 100 MCS7 (units of 0.25dBm) */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS7_CHANNEL100_Pos (8UL) /*!< Position of CHANNEL100 field.                       */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS7_CHANNEL100_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS7_CHANNEL100_Pos)
                                                                            /*!< Bit mask of CHANNEL100 field.*/                  

/* CHANNEL165 @Bits 16..23 : Trim value for channel 165 MCS7 (units of 0.25dBm) */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS7_CHANNEL165_Pos (16UL) /*!< Position of CHANNEL165 field.                      */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS7_CHANNEL165_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS7_CHANNEL165_Pos)
                                                                            /*!< Bit mask of CHANNEL165 field.*/                  


/* FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS0: Maximum output power 5GHz band, MCS0 */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS0_ResetValue (0xFFFFFFFFUL) /*!< Reset value of MAXPOW5G0MCS0 register.         */

/* CHANNEL36 @Bits 0..7 : Trim value for channel 36 MCS0 (units of 0.25dBm) */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS0_CHANNEL36_Pos (0UL) /*!< Position of CHANNEL36 field.                         */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS0_CHANNEL36_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS0_CHANNEL36_Pos)
                                                                            /*!< Bit mask of CHANNEL36 field.*/                   

/* CHANNEL100 @Bits 8..15 : Trim value for channel 100 MCS0 (units of 0.25dBm) */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS0_CHANNEL100_Pos (8UL) /*!< Position of CHANNEL100 field.                       */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS0_CHANNEL100_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS0_CHANNEL100_Pos)
                                                                            /*!< Bit mask of CHANNEL100 field.*/                  

/* CHANNEL165 @Bits 16..23 : Trim value for channel 165 MCS0 (units of 0.25dBm) */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS0_CHANNEL165_Pos (16UL) /*!< Position of CHANNEL165 field.                      */
  #define FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS0_CHANNEL165_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_MAXPOW5G0MCS0_CHANNEL165_Pos)
                                                                            /*!< Bit mask of CHANNEL165 field.*/                  


/* FICR_TRIM_WIFICORE_RADIO_RXGAINOFFSET: RX gain offset for channel 7, 36, 100, 165 */
  #define FICR_TRIM_WIFICORE_RADIO_RXGAINOFFSET_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RXGAINOFFSET register.           */

/* CHANNEL7 @Bits 0..7 : Trim value for channel 7 (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_RXGAINOFFSET_CHANNEL7_Pos (0UL) /*!< Position of CHANNEL7 field.                            */
  #define FICR_TRIM_WIFICORE_RADIO_RXGAINOFFSET_CHANNEL7_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_RXGAINOFFSET_CHANNEL7_Pos) /*!<
                                                                            Bit mask of CHANNEL7 field.*/                         

/* CHANNEL36 @Bits 8..15 : Trim value for channel 36 (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_RXGAINOFFSET_CHANNEL36_Pos (8UL) /*!< Position of CHANNEL36 field.                          */
  #define FICR_TRIM_WIFICORE_RADIO_RXGAINOFFSET_CHANNEL36_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_RXGAINOFFSET_CHANNEL36_Pos)
                                                                            /*!< Bit mask of CHANNEL36 field.*/                   

/* CHANNEL100 @Bits 16..23 : Trim value for channel 100 (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_RXGAINOFFSET_CHANNEL100_Pos (16UL) /*!< Position of CHANNEL100 field.                       */
  #define FICR_TRIM_WIFICORE_RADIO_RXGAINOFFSET_CHANNEL100_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_RXGAINOFFSET_CHANNEL100_Pos)
                                                                            /*!< Bit mask of CHANNEL100 field.*/                  

/* CHANNEL165 @Bits 24..31 : Trim value for channel 165 (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_RXGAINOFFSET_CHANNEL165_Pos (24UL) /*!< Position of CHANNEL165 field.                       */
  #define FICR_TRIM_WIFICORE_RADIO_RXGAINOFFSET_CHANNEL165_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_RXGAINOFFSET_CHANNEL165_Pos)
                                                                            /*!< Bit mask of CHANNEL165 field.*/                  


/* FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFT: TX power backoff versus temperature */
  #define FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TXPOWBACKOFFT register.         */

/* BAND2GHZ80C @Bits 0..7 : Trim value 2.4GHz band at 80C (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFT_BAND2GHZ80C_Pos (0UL) /*!< Position of BAND2GHZ80C field.                     */
  #define FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFT_BAND2GHZ80C_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFT_BAND2GHZ80C_Pos)
                                                                            /*!< Bit mask of BAND2GHZ80C field.*/                 

