adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* BAND2GHZNEG20C @Bits 8..15 : Trim value 2.4GHz band at -20C (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFT_BAND2GHZNEG20C_Pos (8UL) /*!< Position of BAND2GHZNEG20C field.               */
  #define FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFT_BAND2GHZNEG20C_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFT_BAND2GHZNEG20C_Pos)
                                                                            /*!< Bit mask of BAND2GHZNEG20C field.*/              

/* BAND5GHZ80C @Bits 16..23 : Trim value 5GHz band at 80C (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFT_BAND5GHZ80C_Pos (16UL) /*!< Position of BAND5GHZ80C field.                    */
  #define FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFT_BAND5GHZ80C_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFT_BAND5GHZ80C_Pos)
                                                                            /*!< Bit mask of BAND5GHZ80C field.*/                 

/* BAND5GHZNEG20C @Bits 24..31 : Trim value 5GHz band at -20C (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFT_BAND5GHZNEG20C_Pos (24UL) /*!< Position of BAND5GHZNEG20C field.              */
  #define FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFT_BAND5GHZNEG20C_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFT_BAND5GHZNEG20C_Pos)
                                                                            /*!< Bit mask of BAND5GHZNEG20C field.*/              


/* FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFV: TX power backoff versus voltage */
  #define FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFV_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TXPOWBACKOFFV register.         */

/* BAND2GHZVERYLOWV @Bits 0..7 : Trim value 2.4GHz band at very low voltage (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFV_BAND2GHZVERYLOWV_Pos (0UL) /*!< Position of BAND2GHZVERYLOWV field.           */
  #define FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFV_BAND2GHZVERYLOWV_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFV_BAND2GHZVERYLOWV_Pos)
                                                                            /*!< Bit mask of BAND2GHZVERYLOWV field.*/            

/* BAND2GHZLOWV @Bits 8..15 : Trim value 2.4GHz band at low voltage (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFV_BAND2GHZLOWV_Pos (8UL) /*!< Position of BAND2GHZLOWV field.                   */
  #define FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFV_BAND2GHZLOWV_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFV_BAND2GHZLOWV_Pos)
                                                                            /*!< Bit mask of BAND2GHZLOWV field.*/                

/* BAND5GHZVERYLOWV @Bits 16..23 : Trim value 5GHz band at very low voltage (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFV_BAND5GHZVERYLOWV_Pos (16UL) /*!< Position of BAND5GHZVERYLOWV field.          */
  #define FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFV_BAND5GHZVERYLOWV_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFV_BAND5GHZVERYLOWV_Pos)
                                                                            /*!< Bit mask of BAND5GHZVERYLOWV field.*/            

/* BAND5GHZLOWV @Bits 24..31 : Trim value 5GHz band at low voltage (units of 0.25dB) */
  #define FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFV_BAND5GHZLOWV_Pos (24UL) /*!< Position of BAND5GHZLOWV field.                  */
  #define FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFV_BAND5GHZLOWV_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_TXPOWBACKOFFV_BAND5GHZLOWV_Pos)
                                                                            /*!< Bit mask of BAND5GHZLOWV field.*/                


/* FICR_TRIM_WIFICORE_RADIO_RFTRIMSPARE: Arbitrary RF register trim */
  #define FICR_TRIM_WIFICORE_RADIO_RFTRIMSPARE_MaxCount (16UL) /*!< Max size of RFTRIMSPARE[16] array.                         */
  #define FICR_TRIM_WIFICORE_RADIO_RFTRIMSPARE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RFTRIMSPARE[16] register.         */

/* VALUE @Bits 0..7 : Trim value to apply */
  #define FICR_TRIM_WIFICORE_RADIO_RFTRIMSPARE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define FICR_TRIM_WIFICORE_RADIO_RFTRIMSPARE_VALUE_Msk (0xFFUL << FICR_TRIM_WIFICORE_RADIO_RFTRIMSPARE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                

/* ADDRESS @Bits 8..21 : Register address to apply trim value to. Address 0x3FFF indicates unused trim value. */
  #define FICR_TRIM_WIFICORE_RADIO_RFTRIMSPARE_ADDRESS_Pos (8UL) /*!< Position of ADDRESS field.                               */
  #define FICR_TRIM_WIFICORE_RADIO_RFTRIMSPARE_ADDRESS_Msk (0x3FFFUL << FICR_TRIM_WIFICORE_RADIO_RFTRIMSPARE_ADDRESS_Pos) /*!<
                                                                            Bit mask of ADDRESS field.*/                          



/* ================================================ Struct FICR_TRIM_WIFICORE ================================================ */
/**
  * @brief WIFICORE [FICR_TRIM_WIFICORE] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_WIFICORE_HSFLL_Type HSFLL;     /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_WIFICORE_MEMCONF_Type MEMCONF; /*!< (@ 0x0000000C) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_WIFICORE_RADIO_Type RADIO;     /*!< (@ 0x00000078) (unspecified)                                         */
} NRF_FICR_TRIM_WIFICORE_Type;                       /*!< Size = 216 (0x0D8)                                                   */


/* ========================================== Struct FICR_TRIM_GRAPHICSDOMAIN_HSFLL ========================================== */
/**
  * @brief HSFLL [FICR_TRIM_GRAPHICSDOMAIN_HSFLL] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000000) Trim value for GRAPHICSDOMAIN.HSFLL.VSUP              */
  __IM  uint32_t  COARSE;                            /*!< (@ 0x00000004) Trim value for GRAPHICSDOMAIN.HSFLL.COARSE            */
  __IM  uint32_t  FINE;                              /*!< (@ 0x00000008) Trim value for GRAPHICSDOMAIN.HSFLL.FINE              */
} NRF_FICR_TRIM_GRAPHICSDOMAIN_HSFLL_Type;           /*!< Size = 12 (0x00C)                                                    */

