adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FICR_TRIM_GRAPHICSDOMAIN_HSFLL_VSUP: Trim value for GRAPHICSDOMAIN.HSFLL.VSUP */
  #define FICR_TRIM_GRAPHICSDOMAIN_HSFLL_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GRAPHICSDOMAIN_HSFLL_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_GRAPHICSDOMAIN_HSFLL_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GRAPHICSDOMAIN_HSFLL_VSUP_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                


/* FICR_TRIM_GRAPHICSDOMAIN_HSFLL_COARSE: Trim value for GRAPHICSDOMAIN.HSFLL.COARSE */
  #define FICR_TRIM_GRAPHICSDOMAIN_HSFLL_COARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of COARSE register.                 */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GRAPHICSDOMAIN_HSFLL_COARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_GRAPHICSDOMAIN_HSFLL_COARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GRAPHICSDOMAIN_HSFLL_COARSE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            


/* FICR_TRIM_GRAPHICSDOMAIN_HSFLL_FINE: Trim value for GRAPHICSDOMAIN.HSFLL.FINE */
  #define FICR_TRIM_GRAPHICSDOMAIN_HSFLL_FINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FINE register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GRAPHICSDOMAIN_HSFLL_FINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                    */
  #define FICR_TRIM_GRAPHICSDOMAIN_HSFLL_FINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GRAPHICSDOMAIN_HSFLL_FINE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                



/* ==================================== Struct FICR_TRIM_GRAPHICSDOMAIN_MEMCONF_BLOCKTYPE ==================================== */
/**
  * @brief BLOCKTYPE [FICR_TRIM_GRAPHICSDOMAIN_MEMCONF_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim value for
                                                                         GRAPHICSDOMAIN.MEMCONF.BLOCKTYPE[n].TRIM*/               
} NRF_FICR_TRIM_GRAPHICSDOMAIN_MEMCONF_BLOCKTYPE_Type; /*!< Size = 4 (0x004)                                                   */
  #define FICR_TRIM_GRAPHICSDOMAIN_MEMCONF_BLOCKTYPE_MaxCount (5UL) /*!< Max size of BLOCKTYPE[5] array.                       */

/* FICR_TRIM_GRAPHICSDOMAIN_MEMCONF_BLOCKTYPE_TRIM: Trim value for GRAPHICSDOMAIN.MEMCONF.BLOCKTYPE[n].TRIM */
  #define FICR_TRIM_GRAPHICSDOMAIN_MEMCONF_BLOCKTYPE_TRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM register.         */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GRAPHICSDOMAIN_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                        */
  #define FICR_TRIM_GRAPHICSDOMAIN_MEMCONF_BLOCKTYPE_TRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GRAPHICSDOMAIN_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* ========================================= Struct FICR_TRIM_GRAPHICSDOMAIN_MEMCONF ========================================= */
/**
  * @brief MEMCONF [FICR_TRIM_GRAPHICSDOMAIN_MEMCONF] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_GRAPHICSDOMAIN_MEMCONF_BLOCKTYPE_Type BLOCKTYPE[5]; /*!< (@ 0x00000000) (unspecified)                    */
} NRF_FICR_TRIM_GRAPHICSDOMAIN_MEMCONF_Type;         /*!< Size = 20 (0x014)                                                    */


/* ======================================= Struct FICR_TRIM_GRAPHICSDOMAIN_AUXPLL_TRIM ======================================= */
/**
  * @brief TRIM [FICR_TRIM_GRAPHICSDOMAIN_AUXPLL_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CTUNE;                             /*!< (@ 0x00000000) Trim value for GRAPHICSDOMAIN.AUXPLL.CTUNE            */
} NRF_FICR_TRIM_GRAPHICSDOMAIN_AUXPLL_TRIM_Type;     /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_GRAPHICSDOMAIN_AUXPLL_TRIM_CTUNE: Trim value for GRAPHICSDOMAIN.AUXPLL.CTUNE */
  #define FICR_TRIM_GRAPHICSDOMAIN_AUXPLL_TRIM_CTUNE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CTUNE register.             */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GRAPHICSDOMAIN_AUXPLL_TRIM_CTUNE_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define FICR_TRIM_GRAPHICSDOMAIN_AUXPLL_TRIM_CTUNE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GRAPHICSDOMAIN_AUXPLL_TRIM_CTUNE_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/                       



/* ========================================= Struct FICR_TRIM_GRAPHICSDOMAIN_AUXPLL ========================================== */
/**
  * @brief AUXPLL [FICR_TRIM_GRAPHICSDOMAIN_AUXPLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_GRAPHICSDOMAIN_AUXPLL_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                  */
} NRF_FICR_TRIM_GRAPHICSDOMAIN_AUXPLL_Type;          /*!< Size = 4 (0x004)                                                     */


/* ============================================= Struct FICR_TRIM_GRAPHICSDOMAIN ============================================= */
/**
  * @brief GRAPHICSDOMAIN [FICR_TRIM_GRAPHICSDOMAIN] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_GRAPHICSDOMAIN_HSFLL_Type HSFLL; /*!< (@ 0x00000000) (unspecified)                                       */
  __IOM NRF_FICR_TRIM_GRAPHICSDOMAIN_MEMCONF_Type MEMCONF; /*!< (@ 0x0000000C) (unspecified)                                   */
  __IOM NRF_FICR_TRIM_GRAPHICSDOMAIN_AUXPLL_Type AUXPLL; /*!< (@ 0x00000020) (unspecified)                                     */
} NRF_FICR_TRIM_GRAPHICSDOMAIN_Type;                 /*!< Size = 36 (0x024)                                                    */


/* ==================================================== Struct FICR_TRIM ===================================================== */
/**
  * @brief TRIM [FICR_TRIM] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_SYSCTRL_Type SYSCTRL;          /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_GLOBAL_Type GLOBAL;            /*!< (@ 0x0000027C) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_APPLICATION_Type APPLICATION;  /*!< (@ 0x00000300) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_RADIOCORE_Type RADIOCORE;      /*!< (@ 0x00000340) (unspecified)                                         */
  __IM  uint32_t  RESERVED[17];
  __IOM NRF_FICR_TRIM_BOOT_Type BOOT;                /*!< (@ 0x000003E0) (unspecified)                                         */
  __IM  uint32_t  RESERVED1;
  __IOM NRF_FICR_TRIM_COMMON_Type COMMON;            /*!< (@ 0x000003F8) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_SECURE_Type SECURE;            /*!< (@ 0x00000400) (unspecified)                                         */
  __IM  uint32_t  RESERVED2[34];
  __IOM NRF_FICR_TRIM_WIFICORE_Type WIFICORE;        /*!< (@ 0x00000500) (unspecified)                                         */
  __IM  uint32_t  RESERVED3[10];
  __IOM NRF_FICR_TRIM_GRAPHICSDOMAIN_Type GRAPHICSDOMAIN; /*!< (@ 0x00000600) (unspecified)                                    */
} NRF_FICR_TRIM_Type;                                /*!< Size = 1572 (0x624)                                                  */


