adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ==================================================== Struct FICR_BOOT ===================================================== */
/**
  * @brief BOOT [FICR_BOOT] (unspecified)
  */
typedef struct {
  __IM  uint32_t  SIZE;                              /*!< (@ 0x00000000) Size of DATA group                                    */
  __IM  uint32_t  DATA[192];                         /*!< (@ 0x00000004) Compressed address and data pointer.                  */
} NRF_FICR_BOOT_Type;                                /*!< Size = 772 (0x304)                                                   */

/* FICR_BOOT_SIZE: Size of DATA group */
  #define FICR_BOOT_SIZE_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of SIZE register.                                        */

/* VALUE @Bits 0..31 : Number of trim values stored in DATA. */
  #define FICR_BOOT_SIZE_VALUE_Pos (0UL)             /*!< Position of VALUE field.                                             */
  #define FICR_BOOT_SIZE_VALUE_Msk (0xFFFFFFFFUL << FICR_BOOT_SIZE_VALUE_Pos) /*!< Bit mask of VALUE field.                    */


/* FICR_BOOT_DATA: Compressed address and data pointer. */
  #define FICR_BOOT_DATA_MaxCount (192UL)            /*!< Max size of DATA[192] array.                                         */
  #define FICR_BOOT_DATA_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of DATA[192] register.                                   */

/* REGOFFSET @Bits 0..23 : Address offset to trim register */
  #define FICR_BOOT_DATA_REGOFFSET_Pos (0UL)         /*!< Position of REGOFFSET field.                                         */
  #define FICR_BOOT_DATA_REGOFFSET_Msk (0xFFFFFFUL << FICR_BOOT_DATA_REGOFFSET_Pos) /*!< Bit mask of REGOFFSET field.          */

/* DATAPOINTER @Bits 24..31 : Pointer to location in TRIM group */
  #define FICR_BOOT_DATA_DATAPOINTER_Pos (24UL)      /*!< Position of DATAPOINTER field.                                       */
  #define FICR_BOOT_DATA_DATAPOINTER_Msk (0xFFUL << FICR_BOOT_DATA_DATAPOINTER_Pos) /*!< Bit mask of DATAPOINTER field.        */



/* ==================================================== Struct FICR_SRAM ===================================================== */
/**
  * @brief SRAM [FICR_SRAM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  REPAIR0;                           /*!< (@ 0x00000000) SRAM repair register 0                                */
  __IOM uint32_t  REPAIR1;                           /*!< (@ 0x00000004) SRAM repair register 1                                */
  __IOM uint32_t  REPAIR2;                           /*!< (@ 0x00000008) SRAM repair register 2                                */
  __IOM uint32_t  REPAIR3;                           /*!< (@ 0x0000000C) SRAM repair register 3                                */
  __IOM uint32_t  REPAIR4;                           /*!< (@ 0x00000010) SRAM repair register 4                                */
  __IOM uint32_t  REPAIR5;                           /*!< (@ 0x00000014) SRAM repair register 5                                */
  __IOM uint32_t  REPAIR6;                           /*!< (@ 0x00000018) SRAM repair register 6                                */
  __IOM uint32_t  REPAIR7;                           /*!< (@ 0x0000001C) SRAM repair register 7                                */
  __IOM uint32_t  REPAIR8;                           /*!< (@ 0x00000020) SRAM repair register 8                                */
} NRF_FICR_SRAM_Type;                                /*!< Size = 36 (0x024)                                                    */

/* FICR_SRAM_REPAIR0: SRAM repair register 0 */
  #define FICR_SRAM_REPAIR0_ResetValue (0x00000000UL) /*!< Reset value of REPAIR0 register.                                    */

/* GDRAMCTRL0109 @Bits 0..7 : GD RamController01 Ram 9 */
  #define FICR_SRAM_REPAIR0_GDRAMCTRL0109_Pos (0UL)  /*!< Position of GDRAMCTRL0109 field.                                     */
  #define FICR_SRAM_REPAIR0_GDRAMCTRL0109_Msk (0xFFUL << FICR_SRAM_REPAIR0_GDRAMCTRL0109_Pos) /*!< Bit mask of GDRAMCTRL0109
                                                                            field.*/                                              

/* GDRAMCTRL0108 @Bits 8..15 : GD RamController01 Ram 8 */
  #define FICR_SRAM_REPAIR0_GDRAMCTRL0108_Pos (8UL)  /*!< Position of GDRAMCTRL0108 field.                                     */
  #define FICR_SRAM_REPAIR0_GDRAMCTRL0108_Msk (0xFFUL << FICR_SRAM_REPAIR0_GDRAMCTRL0108_Pos) /*!< Bit mask of GDRAMCTRL0108
                                                                            field.*/                                              

/* GDRAMCTRL0107 @Bits 16..23 : GD RamController01 Ram 7 */
  #define FICR_SRAM_REPAIR0_GDRAMCTRL0107_Pos (16UL) /*!< Position of GDRAMCTRL0107 field.                                     */
  #define FICR_SRAM_REPAIR0_GDRAMCTRL0107_Msk (0xFFUL << FICR_SRAM_REPAIR0_GDRAMCTRL0107_Pos) /*!< Bit mask of GDRAMCTRL0107
                                                                            field.*/                                              

/* GDRAMCTRL0106 @Bits 24..31 : GD RamController01 Ram 6 */
  #define FICR_SRAM_REPAIR0_GDRAMCTRL0106_Pos (24UL) /*!< Position of GDRAMCTRL0106 field.                                     */
  #define FICR_SRAM_REPAIR0_GDRAMCTRL0106_Msk (0xFFUL << FICR_SRAM_REPAIR0_GDRAMCTRL0106_Pos) /*!< Bit mask of GDRAMCTRL0106
                                                                            field.*/                                              


/* FICR_SRAM_REPAIR1: SRAM repair register 1 */
  #define FICR_SRAM_REPAIR1_ResetValue (0x00000000UL) /*!< Reset value of REPAIR1 register.                                    */

/* GDRAMCTRL0105 @Bits 0..7 : GD RamController01 Ram 5 */
  #define FICR_SRAM_REPAIR1_GDRAMCTRL0105_Pos (0UL)  /*!< Position of GDRAMCTRL0105 field.                                     */
  #define FICR_SRAM_REPAIR1_GDRAMCTRL0105_Msk (0xFFUL << FICR_SRAM_REPAIR1_GDRAMCTRL0105_Pos) /*!< Bit mask of GDRAMCTRL0105
                                                                            field.*/                                              

