adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GDRAMCTRL0104 @Bits 8..15 : GD RamController01 Ram 4 */
  #define FICR_SRAM_REPAIR1_GDRAMCTRL0104_Pos (8UL)  /*!< Position of GDRAMCTRL0104 field.                                     */
  #define FICR_SRAM_REPAIR1_GDRAMCTRL0104_Msk (0xFFUL << FICR_SRAM_REPAIR1_GDRAMCTRL0104_Pos) /*!< Bit mask of GDRAMCTRL0104
                                                                            field.*/                                              

/* GDRAMCTRL0103 @Bits 16..23 : GD RamController01 Ram 3 */
  #define FICR_SRAM_REPAIR1_GDRAMCTRL0103_Pos (16UL) /*!< Position of GDRAMCTRL0103 field.                                     */
  #define FICR_SRAM_REPAIR1_GDRAMCTRL0103_Msk (0xFFUL << FICR_SRAM_REPAIR1_GDRAMCTRL0103_Pos) /*!< Bit mask of GDRAMCTRL0103
                                                                            field.*/                                              

/* GDRAMCTRL0102 @Bits 24..31 : GD RamController01 Ram 2 */
  #define FICR_SRAM_REPAIR1_GDRAMCTRL0102_Pos (24UL) /*!< Position of GDRAMCTRL0102 field.                                     */
  #define FICR_SRAM_REPAIR1_GDRAMCTRL0102_Msk (0xFFUL << FICR_SRAM_REPAIR1_GDRAMCTRL0102_Pos) /*!< Bit mask of GDRAMCTRL0102
                                                                            field.*/                                              


/* FICR_SRAM_REPAIR2: SRAM repair register 2 */
  #define FICR_SRAM_REPAIR2_ResetValue (0x00000000UL) /*!< Reset value of REPAIR2 register.                                    */

/* GDRAMCTRL0101 @Bits 0..7 : GD RamController01 Ram 1 */
  #define FICR_SRAM_REPAIR2_GDRAMCTRL0101_Pos (0UL)  /*!< Position of GDRAMCTRL0101 field.                                     */
  #define FICR_SRAM_REPAIR2_GDRAMCTRL0101_Msk (0xFFUL << FICR_SRAM_REPAIR2_GDRAMCTRL0101_Pos) /*!< Bit mask of GDRAMCTRL0101
                                                                            field.*/                                              

/* GDRAMCTRL0111 @Bits 8..15 : GD RamController01 Ram 11 */
  #define FICR_SRAM_REPAIR2_GDRAMCTRL0111_Pos (8UL)  /*!< Position of GDRAMCTRL0111 field.                                     */
  #define FICR_SRAM_REPAIR2_GDRAMCTRL0111_Msk (0xFFUL << FICR_SRAM_REPAIR2_GDRAMCTRL0111_Pos) /*!< Bit mask of GDRAMCTRL0111
                                                                            field.*/                                              

/* GDRAMCTRL0110 @Bits 16..23 : GD RamController01 Ram 10 */
  #define FICR_SRAM_REPAIR2_GDRAMCTRL0110_Pos (16UL) /*!< Position of GDRAMCTRL0110 field.                                     */
  #define FICR_SRAM_REPAIR2_GDRAMCTRL0110_Msk (0xFFUL << FICR_SRAM_REPAIR2_GDRAMCTRL0110_Pos) /*!< Bit mask of GDRAMCTRL0110
                                                                            field.*/                                              

/* GDRAMCTRL0100 @Bits 24..31 : GD RamController01 Ram 0 */
  #define FICR_SRAM_REPAIR2_GDRAMCTRL0100_Pos (24UL) /*!< Position of GDRAMCTRL0100 field.                                     */
  #define FICR_SRAM_REPAIR2_GDRAMCTRL0100_Msk (0xFFUL << FICR_SRAM_REPAIR2_GDRAMCTRL0100_Pos) /*!< Bit mask of GDRAMCTRL0100
                                                                            field.*/                                              


/* FICR_SRAM_REPAIR3: SRAM repair register 3 */
  #define FICR_SRAM_REPAIR3_ResetValue (0x00000000UL) /*!< Reset value of REPAIR3 register.                                    */

/* GDRAMCTRL0009 @Bits 0..7 : GD RamController00 Ram 9 */
  #define FICR_SRAM_REPAIR3_GDRAMCTRL0009_Pos (0UL)  /*!< Position of GDRAMCTRL0009 field.                                     */
  #define FICR_SRAM_REPAIR3_GDRAMCTRL0009_Msk (0xFFUL << FICR_SRAM_REPAIR3_GDRAMCTRL0009_Pos) /*!< Bit mask of GDRAMCTRL0009
                                                                            field.*/                                              

/* GDRAMCTRL0008 @Bits 8..15 : GD RamController00 Ram 8 */
  #define FICR_SRAM_REPAIR3_GDRAMCTRL0008_Pos (8UL)  /*!< Position of GDRAMCTRL0008 field.                                     */
  #define FICR_SRAM_REPAIR3_GDRAMCTRL0008_Msk (0xFFUL << FICR_SRAM_REPAIR3_GDRAMCTRL0008_Pos) /*!< Bit mask of GDRAMCTRL0008
                                                                            field.*/                                              

/* GDRAMCTRL0007 @Bits 16..23 : GD RamController00 Ram 7 */
  #define FICR_SRAM_REPAIR3_GDRAMCTRL0007_Pos (16UL) /*!< Position of GDRAMCTRL0007 field.                                     */
  #define FICR_SRAM_REPAIR3_GDRAMCTRL0007_Msk (0xFFUL << FICR_SRAM_REPAIR3_GDRAMCTRL0007_Pos) /*!< Bit mask of GDRAMCTRL0007
                                                                            field.*/                                              

/* GDRAMCTRL0006 @Bits 24..31 : GD RamController00 Ram 6 */
  #define FICR_SRAM_REPAIR3_GDRAMCTRL0006_Pos (24UL) /*!< Position of GDRAMCTRL0006 field.                                     */
  #define FICR_SRAM_REPAIR3_GDRAMCTRL0006_Msk (0xFFUL << FICR_SRAM_REPAIR3_GDRAMCTRL0006_Pos) /*!< Bit mask of GDRAMCTRL0006
                                                                            field.*/                                              


/* FICR_SRAM_REPAIR4: SRAM repair register 4 */
  #define FICR_SRAM_REPAIR4_ResetValue (0x00000000UL) /*!< Reset value of REPAIR4 register.                                    */

/* GDRAMCTRL0005 @Bits 0..7 : GD RamController00 Ram 5 */
  #define FICR_SRAM_REPAIR4_GDRAMCTRL0005_Pos (0UL)  /*!< Position of GDRAMCTRL0005 field.                                     */
  #define FICR_SRAM_REPAIR4_GDRAMCTRL0005_Msk (0xFFUL << FICR_SRAM_REPAIR4_GDRAMCTRL0005_Pos) /*!< Bit mask of GDRAMCTRL0005
                                                                            field.*/                                              

/* GDRAMCTRL0004 @Bits 8..15 : GD RamController00 Ram 4 */
  #define FICR_SRAM_REPAIR4_GDRAMCTRL0004_Pos (8UL)  /*!< Position of GDRAMCTRL0004 field.                                     */
  #define FICR_SRAM_REPAIR4_GDRAMCTRL0004_Msk (0xFFUL << FICR_SRAM_REPAIR4_GDRAMCTRL0004_Pos) /*!< Bit mask of GDRAMCTRL0004
                                                                            field.*/                                              

