adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GDRAMCTRL0003 @Bits 16..23 : GD RamController00 Ram 3 */
  #define FICR_SRAM_REPAIR4_GDRAMCTRL0003_Pos (16UL) /*!< Position of GDRAMCTRL0003 field.                                     */
  #define FICR_SRAM_REPAIR4_GDRAMCTRL0003_Msk (0xFFUL << FICR_SRAM_REPAIR4_GDRAMCTRL0003_Pos) /*!< Bit mask of GDRAMCTRL0003
                                                                            field.*/                                              

/* GDRAMCTRL0002 @Bits 24..31 : GD RamController00 Ram 2 */
  #define FICR_SRAM_REPAIR4_GDRAMCTRL0002_Pos (24UL) /*!< Position of GDRAMCTRL0002 field.                                     */
  #define FICR_SRAM_REPAIR4_GDRAMCTRL0002_Msk (0xFFUL << FICR_SRAM_REPAIR4_GDRAMCTRL0002_Pos) /*!< Bit mask of GDRAMCTRL0002
                                                                            field.*/                                              


/* FICR_SRAM_REPAIR5: SRAM repair register 5 */
  #define FICR_SRAM_REPAIR5_ResetValue (0x00000000UL) /*!< Reset value of REPAIR5 register.                                    */

/* GDRAMCTRL0001 @Bits 0..7 : GD RamController00 Ram 1 */
  #define FICR_SRAM_REPAIR5_GDRAMCTRL0001_Pos (0UL)  /*!< Position of GDRAMCTRL0001 field.                                     */
  #define FICR_SRAM_REPAIR5_GDRAMCTRL0001_Msk (0xFFUL << FICR_SRAM_REPAIR5_GDRAMCTRL0001_Pos) /*!< Bit mask of GDRAMCTRL0001
                                                                            field.*/                                              

/* GDRAMCTRL0015 @Bits 8..15 : GD RamController00 Ram 15 */
  #define FICR_SRAM_REPAIR5_GDRAMCTRL0015_Pos (8UL)  /*!< Position of GDRAMCTRL0015 field.                                     */
  #define FICR_SRAM_REPAIR5_GDRAMCTRL0015_Msk (0xFFUL << FICR_SRAM_REPAIR5_GDRAMCTRL0015_Pos) /*!< Bit mask of GDRAMCTRL0015
                                                                            field.*/                                              

/* GDRAMCTRL0014 @Bits 16..23 : GD RamController00 Ram 14 */
  #define FICR_SRAM_REPAIR5_GDRAMCTRL0014_Pos (16UL) /*!< Position of GDRAMCTRL0014 field.                                     */
  #define FICR_SRAM_REPAIR5_GDRAMCTRL0014_Msk (0xFFUL << FICR_SRAM_REPAIR5_GDRAMCTRL0014_Pos) /*!< Bit mask of GDRAMCTRL0014
                                                                            field.*/                                              

/* GDRAMCTRL0013 @Bits 24..31 : GD RamController00 Ram 13 */
  #define FICR_SRAM_REPAIR5_GDRAMCTRL0013_Pos (24UL) /*!< Position of GDRAMCTRL0013 field.                                     */
  #define FICR_SRAM_REPAIR5_GDRAMCTRL0013_Msk (0xFFUL << FICR_SRAM_REPAIR5_GDRAMCTRL0013_Pos) /*!< Bit mask of GDRAMCTRL0013
                                                                            field.*/                                              


/* FICR_SRAM_REPAIR6: SRAM repair register 6 */
  #define FICR_SRAM_REPAIR6_ResetValue (0x00000000UL) /*!< Reset value of REPAIR6 register.                                    */

/* GDRAMCTRL0012 @Bits 0..7 : GD RamController00 Ram 12 */
  #define FICR_SRAM_REPAIR6_GDRAMCTRL0012_Pos (0UL)  /*!< Position of GDRAMCTRL0012 field.                                     */
  #define FICR_SRAM_REPAIR6_GDRAMCTRL0012_Msk (0xFFUL << FICR_SRAM_REPAIR6_GDRAMCTRL0012_Pos) /*!< Bit mask of GDRAMCTRL0012
                                                                            field.*/                                              

/* GDRAMCTRL0011 @Bits 8..15 : GD RamController00 Ram 11 */
  #define FICR_SRAM_REPAIR6_GDRAMCTRL0011_Pos (8UL)  /*!< Position of GDRAMCTRL0011 field.                                     */
  #define FICR_SRAM_REPAIR6_GDRAMCTRL0011_Msk (0xFFUL << FICR_SRAM_REPAIR6_GDRAMCTRL0011_Pos) /*!< Bit mask of GDRAMCTRL0011
                                                                            field.*/                                              

/* GDRAMCTRL0010 @Bits 16..23 : GD RamController00 Ram 10 */
  #define FICR_SRAM_REPAIR6_GDRAMCTRL0010_Pos (16UL) /*!< Position of GDRAMCTRL0010 field.                                     */
  #define FICR_SRAM_REPAIR6_GDRAMCTRL0010_Msk (0xFFUL << FICR_SRAM_REPAIR6_GDRAMCTRL0010_Pos) /*!< Bit mask of GDRAMCTRL0010
                                                                            field.*/                                              

/* GDRAMCTRL0000 @Bits 24..31 : GD RamController00 Ram 0 */
  #define FICR_SRAM_REPAIR6_GDRAMCTRL0000_Pos (24UL) /*!< Position of GDRAMCTRL0000 field.                                     */
  #define FICR_SRAM_REPAIR6_GDRAMCTRL0000_Msk (0xFFUL << FICR_SRAM_REPAIR6_GDRAMCTRL0000_Pos) /*!< Bit mask of GDRAMCTRL0000
                                                                            field.*/                                              


/* FICR_SRAM_REPAIR7: SRAM repair register 7 */
  #define FICR_SRAM_REPAIR7_ResetValue (0x00000000UL) /*!< Reset value of REPAIR7 register.                                    */

/* GDCACHERAM07 @Bits 0..7 : GD Cache Data Ram 7 */
  #define FICR_SRAM_REPAIR7_GDCACHERAM07_Pos (0UL)   /*!< Position of GDCACHERAM07 field.                                      */
  #define FICR_SRAM_REPAIR7_GDCACHERAM07_Msk (0xFFUL << FICR_SRAM_REPAIR7_GDCACHERAM07_Pos) /*!< Bit mask of GDCACHERAM07
                                                                            field.*/                                              

/* GDCACHERAM06 @Bits 8..15 : GD Cache Data Ram 6 */
  #define FICR_SRAM_REPAIR7_GDCACHERAM06_Pos (8UL)   /*!< Position of GDCACHERAM06 field.                                      */
  #define FICR_SRAM_REPAIR7_GDCACHERAM06_Msk (0xFFUL << FICR_SRAM_REPAIR7_GDCACHERAM06_Pos) /*!< Bit mask of GDCACHERAM06
                                                                            field.*/                                              

/* GDCACHERAM05 @Bits 16..23 : GD Cache Data Ram 5 */
  #define FICR_SRAM_REPAIR7_GDCACHERAM05_Pos (16UL)  /*!< Position of GDCACHERAM05 field.                                      */
  #define FICR_SRAM_REPAIR7_GDCACHERAM05_Msk (0xFFUL << FICR_SRAM_REPAIR7_GDCACHERAM05_Pos) /*!< Bit mask of GDCACHERAM05
                                                                            field.*/                                              

/* GDCACHERAM04 @Bits 24..31 : GD Cache Data Ram 4 */
  #define FICR_SRAM_REPAIR7_GDCACHERAM04_Pos (24UL)  /*!< Position of GDCACHERAM04 field.                                      */
  #define FICR_SRAM_REPAIR7_GDCACHERAM04_Msk (0xFFUL << FICR_SRAM_REPAIR7_GDCACHERAM04_Pos) /*!< Bit mask of GDCACHERAM04
                                                                            field.*/                                              


