adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FICR_SRAM_REPAIR8: SRAM repair register 8 */
  #define FICR_SRAM_REPAIR8_ResetValue (0x00000000UL) /*!< Reset value of REPAIR8 register.                                    */

/* GDCACHERAM03 @Bits 0..7 : GD Cache Data Ram 3 */
  #define FICR_SRAM_REPAIR8_GDCACHERAM03_Pos (0UL)   /*!< Position of GDCACHERAM03 field.                                      */
  #define FICR_SRAM_REPAIR8_GDCACHERAM03_Msk (0xFFUL << FICR_SRAM_REPAIR8_GDCACHERAM03_Pos) /*!< Bit mask of GDCACHERAM03
                                                                            field.*/                                              

/* GDCACHERAM02 @Bits 8..15 : GD Cache Data Ram 2 */
  #define FICR_SRAM_REPAIR8_GDCACHERAM02_Pos (8UL)   /*!< Position of GDCACHERAM02 field.                                      */
  #define FICR_SRAM_REPAIR8_GDCACHERAM02_Msk (0xFFUL << FICR_SRAM_REPAIR8_GDCACHERAM02_Pos) /*!< Bit mask of GDCACHERAM02
                                                                            field.*/                                              

/* GDCACHERAM01 @Bits 16..23 : GD Cache Data Ram 1 */
  #define FICR_SRAM_REPAIR8_GDCACHERAM01_Pos (16UL)  /*!< Position of GDCACHERAM01 field.                                      */
  #define FICR_SRAM_REPAIR8_GDCACHERAM01_Msk (0xFFUL << FICR_SRAM_REPAIR8_GDCACHERAM01_Pos) /*!< Bit mask of GDCACHERAM01
                                                                            field.*/                                              

/* GDCACHERAM00 @Bits 24..31 : GD Cache Data Ram 0 */
  #define FICR_SRAM_REPAIR8_GDCACHERAM00_Pos (24UL)  /*!< Position of GDCACHERAM00 field.                                      */
  #define FICR_SRAM_REPAIR8_GDCACHERAM00_Msk (0xFFUL << FICR_SRAM_REPAIR8_GDCACHERAM00_Pos) /*!< Bit mask of GDCACHERAM00
                                                                            field.*/                                              


/* ======================================================= Struct FICR ======================================================= */
/**
  * @brief Factory Information Configuration Registers
  */
  typedef struct {                                   /*!< FICR Structure                                                       */
    __IOM NRF_FICR_SOCINFO_Type SOCINFO;             /*!< (@ 0x00000000) (unspecified)                                         */
    __IOM NRF_FICR_BLE_Type BLE;                     /*!< (@ 0x0000000C) (unspecified)                                         */
    __IM uint32_t RESERVED[2];
    __IOM NRF_FICR_NFC_Type NFC;                     /*!< (@ 0x00000040) (unspecified)                                         */
    __IOM NRF_FICR_INFO_Type INFO;                   /*!< (@ 0x00000050) Device info                                           */
    __IM uint32_t RESERVED1[3];
    __IOM NRF_FICR_WIFI_Type WIFI;                   /*!< (@ 0x00000080) (unspecified)                                         */
    __IM uint32_t RESERVED2[9];
    __IOM NRF_FICR_PRODTEST_Type PRODTEST;           /*!< (@ 0x000000C0) (unspecified)                                         */
    __IM uint32_t RESERVED3[9];
    __IOM NRF_FICR_TRIM_Type TRIM;                   /*!< (@ 0x00000100) (unspecified)                                         */
    __IM uint32_t RESERVED4[95];
    __IOM NRF_FICR_BOOT_Type BOOT;                   /*!< (@ 0x000008A0) (unspecified)                                         */
    __IM uint32_t RESERVED5[3];
    __IOM NRF_FICR_SRAM_Type SRAM;                   /*!< (@ 0x00000BB0) (unspecified)                                         */
  } NRF_FICR_Type;                                   /*!< Size = 3028 (0xBD4)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          FLL16M                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct FLL16M_CONFIG =================================================== */
/**
  * @brief CONFIG [FLL16M_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFGDCO16M;                         /*!< (@ 0x00000000) DCO16M configuration                                  */
  __IOM uint32_t  CFGCKSW16M;                        /*!< (@ 0x00000004) CKSW16M configuration                                 */
} NRF_FLL16M_CONFIG_Type;                            /*!< Size = 8 (0x008)                                                     */

/* FLL16M_CONFIG_CFGCKSW16M: CKSW16M configuration */
  #define FLL16M_CONFIG_CFGCKSW16M_ResetValue (0x00000000UL) /*!< Reset value of CFGCKSW16M register.                          */

/* SKEW @Bit 0 : configures the delay used in the phasedetector */
  #define FLL16M_CONFIG_CFGCKSW16M_SKEW_Pos (0UL)    /*!< Position of SKEW field.                                              */
  #define FLL16M_CONFIG_CFGCKSW16M_SKEW_Msk (0x1UL << FLL16M_CONFIG_CFGCKSW16M_SKEW_Pos) /*!< Bit mask of SKEW field.          */
  #define FLL16M_CONFIG_CFGCKSW16M_SKEW_Min (0x0UL)  /*!< Min enumerator value of SKEW field.                                  */
  #define FLL16M_CONFIG_CFGCKSW16M_SKEW_Max (0x1UL)  /*!< Max enumerator value of SKEW field.                                  */
  #define FLL16M_CONFIG_CFGCKSW16M_SKEW_SkewNeg56kHz (0x0UL) /*!< DCO skew = -56 kHz.                                          */
  #define FLL16M_CONFIG_CFGCKSW16M_SKEW_SkewNeg160kHz (0x1UL) /*!< DCO skew = -160 kHz.                                        */

