adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* OVERRIDETRIM @Bit 1 : Enable override trim */
  #define FLL16M_CONFIG_CFGCKSW16M_OVERRIDETRIM_Pos (1UL) /*!< Position of OVERRIDETRIM field.                                 */
  #define FLL16M_CONFIG_CFGCKSW16M_OVERRIDETRIM_Msk (0x1UL << FLL16M_CONFIG_CFGCKSW16M_OVERRIDETRIM_Pos) /*!< Bit mask of
                                                                            OVERRIDETRIM field.*/                                 
  #define FLL16M_CONFIG_CFGCKSW16M_OVERRIDETRIM_Min (0x0UL) /*!< Min enumerator value of OVERRIDETRIM field.                   */
  #define FLL16M_CONFIG_CFGCKSW16M_OVERRIDETRIM_Max (0x1UL) /*!< Max enumerator value of OVERRIDETRIM field.                   */
  #define FLL16M_CONFIG_CFGCKSW16M_OVERRIDETRIM_Disabled (0x0UL) /*!< Override trim is disabled.                               */
  #define FLL16M_CONFIG_CFGCKSW16M_OVERRIDETRIM_Enabled (0x1UL) /*!< Override trim is enabled.                                 */



/* =================================================== Struct FLL16M_FREQM =================================================== */
/**
  * @brief FREQM [FLL16M_FREQM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  DONE;                              /*!< (@ 0x00000000) Frequency measurement done status                     */
  __IM  uint32_t  ERROR;                             /*!< (@ 0x00000004) Frequency measurement error status                    */
  __IM  uint32_t  MEAS;                              /*!< (@ 0x00000008) Frequency measurement                                 */
  __IOM uint32_t  CLOCKSEL;                          /*!< (@ 0x0000000C) Clock select for Frequency measurement                */
} NRF_FLL16M_FREQM_Type;                             /*!< Size = 16 (0x010)                                                    */

/* FLL16M_FREQM_DONE: Frequency measurement done status */
  #define FLL16M_FREQM_DONE_ResetValue (0x00000000UL) /*!< Reset value of DONE register.                                       */

/* DONE @Bit 0 : Measurement done. */
  #define FLL16M_FREQM_DONE_DONE_Pos (0UL)           /*!< Position of DONE field.                                              */
  #define FLL16M_FREQM_DONE_DONE_Msk (0x1UL << FLL16M_FREQM_DONE_DONE_Pos) /*!< Bit mask of DONE field.                        */
  #define FLL16M_FREQM_DONE_DONE_Min (0x0UL)         /*!< Min enumerator value of DONE field.                                  */
  #define FLL16M_FREQM_DONE_DONE_Max (0x1UL)         /*!< Max enumerator value of DONE field.                                  */
  #define FLL16M_FREQM_DONE_DONE_InProgress (0x0UL)  /*!< Frequency measurement is in progress.                                */
  #define FLL16M_FREQM_DONE_DONE_Completed (0x1UL)   /*!< Frequency measurement is completed.                                  */


/* FLL16M_FREQM_ERROR: Frequency measurement error status */
  #define FLL16M_FREQM_ERROR_ResetValue (0x00000000UL) /*!< Reset value of ERROR register.                                     */

/* ERROR @Bit 0 : Error status. */
  #define FLL16M_FREQM_ERROR_ERROR_Pos (0UL)         /*!< Position of ERROR field.                                             */
  #define FLL16M_FREQM_ERROR_ERROR_Msk (0x1UL << FLL16M_FREQM_ERROR_ERROR_Pos) /*!< Bit mask of ERROR field.                   */
  #define FLL16M_FREQM_ERROR_ERROR_Min (0x0UL)       /*!< Min enumerator value of ERROR field.                                 */
  #define FLL16M_FREQM_ERROR_ERROR_Max (0x1UL)       /*!< Max enumerator value of ERROR field.                                 */
  #define FLL16M_FREQM_ERROR_ERROR_OutsideLimit (0x1UL) /*!< Frequency exceeded the accuracy 0.5 percent in closed loop mode.  */
  #define FLL16M_FREQM_ERROR_ERROR_WithinLimit (0x0UL) /*!< Frequency stayed within accuracy 0.5 percent in closed loop mode.  */


/* FLL16M_FREQM_MEAS: Frequency measurement */
  #define FLL16M_FREQM_MEAS_ResetValue (0x00000000UL) /*!< Reset value of MEAS register.                                       */

/* VALUE @Bits 0..10 : Last frequency measurement value. */
  #define FLL16M_FREQM_MEAS_VALUE_Pos (0UL)          /*!< Position of VALUE field.                                             */
  #define FLL16M_FREQM_MEAS_VALUE_Msk (0x7FFUL << FLL16M_FREQM_MEAS_VALUE_Pos) /*!< Bit mask of VALUE field.                   */


/* FLL16M_FREQM_CLOCKSEL: Clock select for Frequency measurement */
  #define FLL16M_FREQM_CLOCKSEL_ResetValue (0x00000000UL) /*!< Reset value of CLOCKSEL register.                               */

/* CLOCKSEL @Bits 0..1 : Clock select */
  #define FLL16M_FREQM_CLOCKSEL_CLOCKSEL_Pos (0UL)   /*!< Position of CLOCKSEL field.                                          */
  #define FLL16M_FREQM_CLOCKSEL_CLOCKSEL_Msk (0x3UL << FLL16M_FREQM_CLOCKSEL_CLOCKSEL_Pos) /*!< Bit mask of CLOCKSEL field.    */
  #define FLL16M_FREQM_CLOCKSEL_CLOCKSEL_Min (0x0UL) /*!< Min enumerator value of CLOCKSEL field.                              */
  #define FLL16M_FREQM_CLOCKSEL_CLOCKSEL_Max (0x3UL) /*!< Max enumerator value of CLOCKSEL field.                              */
  #define FLL16M_FREQM_CLOCKSEL_CLOCKSEL_DCO16M (0x0UL) /*!< Clock from DCO16M selected.                                       */
  #define FLL16M_FREQM_CLOCKSEL_CLOCKSEL_CKSW16M (0x1UL) /*!< Clock from CKSW16M selected.                                     */
  #define FLL16M_FREQM_CLOCKSEL_CLOCKSEL_HFXOBy2 (0x2UL) /*!< Clock from 32MHz HFXO divided by 2 selected.                     */
  #define FLL16M_FREQM_CLOCKSEL_CLOCKSEL_CKSW16MTestOsc (0x3UL) /*!< Clock from CKSW16M TESTOSC selected.                      */



/* =================================================== Struct FLL16M_TRIM ==================================================== */
/**
  * @brief TRIM [FLL16M_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  RCOARSE;                           /*!< (@ 0x00000000) Coarse frequency trimming                             */
  __IOM uint32_t  RFINE;                             /*!< (@ 0x00000004) Fine frequency trimming                               */
  __IOM uint32_t  TCOEF;                             /*!< (@ 0x00000008) Temperature coefficient                               */
  __IOM uint32_t  VSUP;                              /*!< (@ 0x0000000C) DCO16M internal DCO supply                            */
  __IOM uint32_t  CKSW16MTRIM;                       /*!< (@ 0x00000010) CKSW16M trim delay                                    */
} NRF_FLL16M_TRIM_Type;                              /*!< Size = 20 (0x014)                                                    */

