adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FLL16M_TRIM_RCOARSE: Coarse frequency trimming */
  #define FLL16M_TRIM_RCOARSE_ResetValue (0x00000000UL) /*!< Reset value of RCOARSE register.                                  */

/* VALUE @Bits 0..4 : Coarse frequency trimming value. */
  #define FLL16M_TRIM_RCOARSE_VALUE_Pos (0UL)        /*!< Position of VALUE field.                                             */
  #define FLL16M_TRIM_RCOARSE_VALUE_Msk (0x1FUL << FLL16M_TRIM_RCOARSE_VALUE_Pos) /*!< Bit mask of VALUE field.                */


/* FLL16M_TRIM_RFINE: Fine frequency trimming */
  #define FLL16M_TRIM_RFINE_ResetValue (0x00000000UL) /*!< Reset value of RFINE register.                                      */

/* VALUE @Bits 0..7 : Fine frequency trimming value. */
  #define FLL16M_TRIM_RFINE_VALUE_Pos (0UL)          /*!< Position of VALUE field.                                             */
  #define FLL16M_TRIM_RFINE_VALUE_Msk (0xFFUL << FLL16M_TRIM_RFINE_VALUE_Pos) /*!< Bit mask of VALUE field.                    */


/* FLL16M_TRIM_TCOEF: Temperature coefficient */
  #define FLL16M_TRIM_TCOEF_ResetValue (0x00000000UL) /*!< Reset value of TCOEF register.                                      */

/* VALUE @Bits 0..3 : (unspecified) */
  #define FLL16M_TRIM_TCOEF_VALUE_Pos (0UL)          /*!< Position of VALUE field.                                             */
  #define FLL16M_TRIM_TCOEF_VALUE_Msk (0xFUL << FLL16M_TRIM_TCOEF_VALUE_Pos) /*!< Bit mask of VALUE field.                     */


/* FLL16M_TRIM_VSUP: DCO16M internal DCO supply */
  #define FLL16M_TRIM_VSUP_ResetValue (0x00000010UL) /*!< Reset value of VSUP register.                                        */

/* VALUE @Bits 0..4 : (unspecified) */
  #define FLL16M_TRIM_VSUP_VALUE_Pos (0UL)           /*!< Position of VALUE field.                                             */
  #define FLL16M_TRIM_VSUP_VALUE_Msk (0x1FUL << FLL16M_TRIM_VSUP_VALUE_Pos) /*!< Bit mask of VALUE field.                      */


/* FLL16M_TRIM_CKSW16MTRIM: CKSW16M trim delay */
  #define FLL16M_TRIM_CKSW16MTRIM_ResetValue (0x00000000UL) /*!< Reset value of CKSW16MTRIM register.                          */

/* VALUE @Bits 0..3 : (unspecified) */
  #define FLL16M_TRIM_CKSW16MTRIM_VALUE_Pos (0UL)    /*!< Position of VALUE field.                                             */
  #define FLL16M_TRIM_CKSW16MTRIM_VALUE_Msk (0xFUL << FLL16M_TRIM_CKSW16MTRIM_VALUE_Pos) /*!< Bit mask of VALUE field.         */



/* ================================================= Struct FLL16M_CLOCKCTRL ================================================= */
/**
  * @brief CLOCKCTRL [FLL16M_CLOCKCTRL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MODE;                              /*!< (@ 0x00000000) Clock control                                         */
  __IOM uint32_t  DITHERING;                         /*!< (@ 0x00000004) Clock dithering configuration                         */
  __IOM uint32_t  SLEEP;                             /*!< (@ 0x00000008) Sleep configuration                                   */
  __IOM uint32_t  RETAINFINETRIM;                    /*!< (@ 0x0000000C) Fine trim retain control                              */
  __IOM uint32_t  OVERRIDELOCKED;                    /*!< (@ 0x00000010) Override the LOCKED signal                            */
  __IOM uint32_t  REFCLOCK;                          /*!< (@ 0x00000014) Reference clock configuration                         */
  __IOM uint32_t  DEFAULTSLOPE;                      /*!< (@ 0x00000018) Default slope value for FLL16M                        */
  __IOM uint32_t  FREQMEASLIMIT;                     /*!< (@ 0x0000001C) Frequency measurement limit                           */
} NRF_FLL16M_CLOCKCTRL_Type;                         /*!< Size = 32 (0x020)                                                    */

/* FLL16M_CLOCKCTRL_MODE: Clock control */
  #define FLL16M_CLOCKCTRL_MODE_ResetValue (0x00000000UL) /*!< Reset value of MODE register.                                   */

/* MODE @Bits 0..2 : The FLL16M operating mode. */
  #define FLL16M_CLOCKCTRL_MODE_MODE_Pos (0UL)       /*!< Position of MODE field.                                              */
  #define FLL16M_CLOCKCTRL_MODE_MODE_Msk (0x7UL << FLL16M_CLOCKCTRL_MODE_MODE_Pos) /*!< Bit mask of MODE field.                */
  #define FLL16M_CLOCKCTRL_MODE_MODE_Min (0x0UL)     /*!< Min enumerator value of MODE field.                                  */
  #define FLL16M_CLOCKCTRL_MODE_MODE_Max (0x4UL)     /*!< Max enumerator value of MODE field.                                  */
  #define FLL16M_CLOCKCTRL_MODE_MODE_Auto (0x0UL)    /*!< The PCGC controls the mode automatically.                            */
  #define FLL16M_CLOCKCTRL_MODE_MODE_OpenLoop (0x1UL) /*!< Open loop mode.                                                     */
  #define FLL16M_CLOCKCTRL_MODE_MODE_ClosedLoop (0x2UL) /*!< Closed loop mode.                                                 */
  #define FLL16M_CLOCKCTRL_MODE_MODE_Refresh (0x3UL) /*!< Refresh mode.                                                        */
  #define FLL16M_CLOCKCTRL_MODE_MODE_Bypass (0x4UL)  /*!< Bypass mode.                                                         */

/* OVERRIDE @Bit 4 : FLL16M override mode. */
  #define FLL16M_CLOCKCTRL_MODE_OVERRIDE_Pos (4UL)   /*!< Position of OVERRIDE field.                                          */
  #define FLL16M_CLOCKCTRL_MODE_OVERRIDE_Msk (0x1UL << FLL16M_CLOCKCTRL_MODE_OVERRIDE_Pos) /*!< Bit mask of OVERRIDE field.    */
  #define FLL16M_CLOCKCTRL_MODE_OVERRIDE_Min (0x0UL) /*!< Min enumerator value of OVERRIDE field.                              */
  #define FLL16M_CLOCKCTRL_MODE_OVERRIDE_Max (0x1UL) /*!< Max enumerator value of OVERRIDE field.                              */
  #define FLL16M_CLOCKCTRL_MODE_OVERRIDE_Disabled (0x0UL) /*!< Override mode disabled.                                         */
  #define FLL16M_CLOCKCTRL_MODE_OVERRIDE_Enabled (0x1UL) /*!< Override mode enabled.                                           */

/* CLOCKSEL @Bit 8 : Clock select */
  #define FLL16M_CLOCKCTRL_MODE_CLOCKSEL_Pos (8UL)   /*!< Position of CLOCKSEL field.                                          */
  #define FLL16M_CLOCKCTRL_MODE_CLOCKSEL_Msk (0x1UL << FLL16M_CLOCKCTRL_MODE_CLOCKSEL_Pos) /*!< Bit mask of CLOCKSEL field.    */
  #define FLL16M_CLOCKCTRL_MODE_CLOCKSEL_Min (0x0UL) /*!< Min enumerator value of CLOCKSEL field.                              */
  #define FLL16M_CLOCKCTRL_MODE_CLOCKSEL_Max (0x1UL) /*!< Max enumerator value of CLOCKSEL field.                              */
  #define FLL16M_CLOCKCTRL_MODE_CLOCKSEL_DCO16M (0x0UL) /*!< Clock from DCO16M selected.                                       */
  #define FLL16M_CLOCKCTRL_MODE_CLOCKSEL_HFXO (0x1UL) /*!< Clock from HFXO selected.                                           */


