adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FLL16M_CLOCKCTRL_DITHERING: Clock dithering configuration */
  #define FLL16M_CLOCKCTRL_DITHERING_ResetValue (0x00000000UL) /*!< Reset value of DITHERING register.                         */

/* CYCLECOUNT @Bits 0..2 : Cycle count configuration for clock dithering */
  #define FLL16M_CLOCKCTRL_DITHERING_CYCLECOUNT_Pos (0UL) /*!< Position of CYCLECOUNT field.                                   */
  #define FLL16M_CLOCKCTRL_DITHERING_CYCLECOUNT_Msk (0x7UL << FLL16M_CLOCKCTRL_DITHERING_CYCLECOUNT_Pos) /*!< Bit mask of
                                                                            CYCLECOUNT field.*/                                   

/* MAXOFFSET @Bits 4..6 : Maximum offset configuration for clock dithering */
  #define FLL16M_CLOCKCTRL_DITHERING_MAXOFFSET_Pos (4UL) /*!< Position of MAXOFFSET field.                                     */
  #define FLL16M_CLOCKCTRL_DITHERING_MAXOFFSET_Msk (0x7UL << FLL16M_CLOCKCTRL_DITHERING_MAXOFFSET_Pos) /*!< Bit mask of
                                                                            MAXOFFSET field.*/                                    

/* INITVALUE @Bits 8..19 : Initial value for the dithering */
  #define FLL16M_CLOCKCTRL_DITHERING_INITVALUE_Pos (8UL) /*!< Position of INITVALUE field.                                     */
  #define FLL16M_CLOCKCTRL_DITHERING_INITVALUE_Msk (0xFFFUL << FLL16M_CLOCKCTRL_DITHERING_INITVALUE_Pos) /*!< Bit mask of
                                                                            INITVALUE field.*/                                    

/* EN @Bit 31 : Enable the clock dithering */
  #define FLL16M_CLOCKCTRL_DITHERING_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define FLL16M_CLOCKCTRL_DITHERING_EN_Msk (0x1UL << FLL16M_CLOCKCTRL_DITHERING_EN_Pos) /*!< Bit mask of EN field.            */
  #define FLL16M_CLOCKCTRL_DITHERING_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define FLL16M_CLOCKCTRL_DITHERING_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define FLL16M_CLOCKCTRL_DITHERING_EN_Disabled (0x0UL) /*!< Clock dithering is disabled                                      */
  #define FLL16M_CLOCKCTRL_DITHERING_EN_Enabled (0x1UL) /*!< Clock dithering is enabled                                        */


/* FLL16M_CLOCKCTRL_SLEEP: Sleep configuration */
  #define FLL16M_CLOCKCTRL_SLEEP_ResetValue (0x00000000UL) /*!< Reset value of SLEEP register.                                 */

/* MODE @Bit 0 : FLL16M sleep mode. */
  #define FLL16M_CLOCKCTRL_SLEEP_MODE_Pos (0UL)      /*!< Position of MODE field.                                              */
  #define FLL16M_CLOCKCTRL_SLEEP_MODE_Msk (0x1UL << FLL16M_CLOCKCTRL_SLEEP_MODE_Pos) /*!< Bit mask of MODE field.              */
  #define FLL16M_CLOCKCTRL_SLEEP_MODE_Min (0x0UL)    /*!< Min enumerator value of MODE field.                                  */
  #define FLL16M_CLOCKCTRL_SLEEP_MODE_Max (0x1UL)    /*!< Max enumerator value of MODE field.                                  */
  #define FLL16M_CLOCKCTRL_SLEEP_MODE_Normal (0x0UL) /*!< Normal mode operation                                                */
  #define FLL16M_CLOCKCTRL_SLEEP_MODE_Sleep (0x1UL)  /*!< Power down the FLL16M core                                           */

/* RETDCO16M @Bit 1 : Retain DCO16M. */
  #define FLL16M_CLOCKCTRL_SLEEP_RETDCO16M_Pos (1UL) /*!< Position of RETDCO16M field.                                         */
  #define FLL16M_CLOCKCTRL_SLEEP_RETDCO16M_Msk (0x1UL << FLL16M_CLOCKCTRL_SLEEP_RETDCO16M_Pos) /*!< Bit mask of RETDCO16M
                                                                            field.*/                                              
  #define FLL16M_CLOCKCTRL_SLEEP_RETDCO16M_Min (0x0UL) /*!< Min enumerator value of RETDCO16M field.                           */
  #define FLL16M_CLOCKCTRL_SLEEP_RETDCO16M_Max (0x1UL) /*!< Max enumerator value of RETDCO16M field.                           */
  #define FLL16M_CLOCKCTRL_SLEEP_RETDCO16M_Disabled (0x0UL) /*!< No retention while powered down                               */
  #define FLL16M_CLOCKCTRL_SLEEP_RETDCO16M_Enabled (0x1UL) /*!< Retain all inputs while powered down                           */

/* RETCKSW16M @Bit 2 : Retain CKSW16M. */
  #define FLL16M_CLOCKCTRL_SLEEP_RETCKSW16M_Pos (2UL) /*!< Position of RETCKSW16M field.                                       */
  #define FLL16M_CLOCKCTRL_SLEEP_RETCKSW16M_Msk (0x1UL << FLL16M_CLOCKCTRL_SLEEP_RETCKSW16M_Pos) /*!< Bit mask of RETCKSW16M
                                                                            field.*/                                              
  #define FLL16M_CLOCKCTRL_SLEEP_RETCKSW16M_Min (0x0UL) /*!< Min enumerator value of RETCKSW16M field.                         */
  #define FLL16M_CLOCKCTRL_SLEEP_RETCKSW16M_Max (0x1UL) /*!< Max enumerator value of RETCKSW16M field.                         */
  #define FLL16M_CLOCKCTRL_SLEEP_RETCKSW16M_Disabled (0x0UL) /*!< No retention while powered down                              */
  #define FLL16M_CLOCKCTRL_SLEEP_RETCKSW16M_Enabled (0x1UL) /*!< Retain all inputs while powered down                          */


/* FLL16M_CLOCKCTRL_RETAINFINETRIM: Fine trim retain control */
  #define FLL16M_CLOCKCTRL_RETAINFINETRIM_ResetValue (0x00000000UL) /*!< Reset value of RETAINFINETRIM register.               */

/* RETAIN @Bit 0 : Retain control */
  #define FLL16M_CLOCKCTRL_RETAINFINETRIM_RETAIN_Pos (0UL) /*!< Position of RETAIN field.                                      */
  #define FLL16M_CLOCKCTRL_RETAINFINETRIM_RETAIN_Msk (0x1UL << FLL16M_CLOCKCTRL_RETAINFINETRIM_RETAIN_Pos) /*!< Bit mask of
                                                                            RETAIN field.*/                                       
  #define FLL16M_CLOCKCTRL_RETAINFINETRIM_RETAIN_Min (0x0UL) /*!< Min enumerator value of RETAIN field.                        */
  #define FLL16M_CLOCKCTRL_RETAINFINETRIM_RETAIN_Max (0x1UL) /*!< Max enumerator value of RETAIN field.                        */
  #define FLL16M_CLOCKCTRL_RETAINFINETRIM_RETAIN_NoRetain (0x0UL) /*!< No retain.                                              */
  #define FLL16M_CLOCKCTRL_RETAINFINETRIM_RETAIN_Retain (0x1UL) /*!< Retain control when FLL16M goes to open-loop mode.        */


/* FLL16M_CLOCKCTRL_OVERRIDELOCKED: Override the LOCKED signal */
  #define FLL16M_CLOCKCTRL_OVERRIDELOCKED_ResetValue (0x00000000UL) /*!< Reset value of OVERRIDELOCKED register.               */

/* OVERRIDE @Bit 0 : Override */
  #define FLL16M_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Pos (0UL) /*!< Position of OVERRIDE field.                                  */
  #define FLL16M_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Msk (0x1UL << FLL16M_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Pos) /*!< Bit mask of
                                                                            OVERRIDE field.*/                                     
  #define FLL16M_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Min (0x0UL) /*!< Min enumerator value of OVERRIDE field.                    */
  #define FLL16M_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Max (0x1UL) /*!< Max enumerator value of OVERRIDE field.                    */
  #define FLL16M_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_NoOperation (0x0UL) /*!< No Operation.                                      */
  #define FLL16M_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Override (0x1UL) /*!< Override                                              */


/* FLL16M_CLOCKCTRL_REFCLOCK: Reference clock configuration */
  #define FLL16M_CLOCKCTRL_REFCLOCK_ResetValue (0x00000000UL) /*!< Reset value of REFCLOCK register.                           */

/* SELREF @Bit 0 : Selection for the reference clock signal in software controlled mode */
  #define FLL16M_CLOCKCTRL_REFCLOCK_SELREF_Pos (0UL) /*!< Position of SELREF field.                                            */
  #define FLL16M_CLOCKCTRL_REFCLOCK_SELREF_Msk (0x1UL << FLL16M_CLOCKCTRL_REFCLOCK_SELREF_Pos) /*!< Bit mask of SELREF field.  */
  #define FLL16M_CLOCKCTRL_REFCLOCK_SELREF_Min (0x0UL) /*!< Min enumerator value of SELREF field.                              */
  #define FLL16M_CLOCKCTRL_REFCLOCK_SELREF_Max (0x1UL) /*!< Max enumerator value of SELREF field.                              */
  #define FLL16M_CLOCKCTRL_REFCLOCK_SELREF_Clock32Ki (0x0UL) /*!< The 32Ki clock selected                                      */
  #define FLL16M_CLOCKCTRL_REFCLOCK_SELREF_Clock16M (0x1UL) /*!< The 16MHz clock selected                                      */

/* DISABLE32KI @Bit 1 : Disable the 32Ki reference clock */
  #define FLL16M_CLOCKCTRL_REFCLOCK_DISABLE32KI_Pos (1UL) /*!< Position of DISABLE32KI field.                                  */
  #define FLL16M_CLOCKCTRL_REFCLOCK_DISABLE32KI_Msk (0x1UL << FLL16M_CLOCKCTRL_REFCLOCK_DISABLE32KI_Pos) /*!< Bit mask of
                                                                            DISABLE32KI field.*/                                  
  #define FLL16M_CLOCKCTRL_REFCLOCK_DISABLE32KI_Min (0x0UL) /*!< Min enumerator value of DISABLE32KI field.                    */
  #define FLL16M_CLOCKCTRL_REFCLOCK_DISABLE32KI_Max (0x1UL) /*!< Max enumerator value of DISABLE32KI field.                    */
  #define FLL16M_CLOCKCTRL_REFCLOCK_DISABLE32KI_Enable (0x0UL) /*!< The 32Ki reference clock is enabled                        */
  #define FLL16M_CLOCKCTRL_REFCLOCK_DISABLE32KI_Disable (0x1UL) /*!< The 32Ki reference clock is disabled                      */


/* FLL16M_CLOCKCTRL_DEFAULTSLOPE: Default slope value for FLL16M */
  #define FLL16M_CLOCKCTRL_DEFAULTSLOPE_ResetValue (0x00000000UL) /*!< Reset value of DEFAULTSLOPE register.                   */

/* VALUE @Bits 0..8 : Slope value */
  #define FLL16M_CLOCKCTRL_DEFAULTSLOPE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                          */
  #define FLL16M_CLOCKCTRL_DEFAULTSLOPE_VALUE_Msk (0x1FFUL << FLL16M_CLOCKCTRL_DEFAULTSLOPE_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/                                              


/* FLL16M_CLOCKCTRL_FREQMEASLIMIT: Frequency measurement limit */
  #define FLL16M_CLOCKCTRL_FREQMEASLIMIT_ResetValue (0x00000002UL) /*!< Reset value of FREQMEASLIMIT register.                 */

/* VALUE @Bits 0..2 : Value */
  #define FLL16M_CLOCKCTRL_FREQMEASLIMIT_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define FLL16M_CLOCKCTRL_FREQMEASLIMIT_VALUE_Msk (0x7UL << FLL16M_CLOCKCTRL_FREQMEASLIMIT_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/                                              



