adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ============================================== Struct FLL16M_OVERRIDE_DCO16M ============================================== */
/**
  * @brief DCO16M [FLL16M_OVERRIDE_DCO16M] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the DCO16M analog module */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  SLEEP;                             /*!< (@ 0x00000008) Override the SLEEP signal to the DCO16M analog module */
  __IOM uint32_t  READY;                             /*!< (@ 0x0000000C) Override the DCO16M READY signal from the analog
                                                                         module*/                                                 
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x00000010) Override the DCO16M SETTLED signal from the analog
                                                                         module*/                                                 
} NRF_FLL16M_OVERRIDE_DCO16M_Type;                   /*!< Size = 20 (0x014)                                                    */

/* FLL16M_OVERRIDE_DCO16M_PWRUP: Override the PWRUP signal to the DCO16M analog module */
  #define FLL16M_OVERRIDE_DCO16M_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                           */

/* VAL @Bit 0 : Override value for the signal */
  #define FLL16M_OVERRIDE_DCO16M_PWRUP_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define FLL16M_OVERRIDE_DCO16M_PWRUP_VAL_Msk (0x1UL << FLL16M_OVERRIDE_DCO16M_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.     */

/* EN @Bit 31 : Enable the override */
  #define FLL16M_OVERRIDE_DCO16M_PWRUP_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define FLL16M_OVERRIDE_DCO16M_PWRUP_EN_Msk (0x1UL << FLL16M_OVERRIDE_DCO16M_PWRUP_EN_Pos) /*!< Bit mask of EN field.        */
  #define FLL16M_OVERRIDE_DCO16M_PWRUP_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define FLL16M_OVERRIDE_DCO16M_PWRUP_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define FLL16M_OVERRIDE_DCO16M_PWRUP_EN_Disabled (0x0UL) /*!< Override is disabled                                           */
  #define FLL16M_OVERRIDE_DCO16M_PWRUP_EN_Enabled (0x1UL) /*!< Override is enabled                                             */


/* FLL16M_OVERRIDE_DCO16M_RETAIN: Override the RETAIN signal to the analog module */
  #define FLL16M_OVERRIDE_DCO16M_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                         */

/* VAL @Bit 0 : Override value for the signal */
  #define FLL16M_OVERRIDE_DCO16M_RETAIN_VAL_Pos (0UL) /*!< Position of VAL field.                                              */
  #define FLL16M_OVERRIDE_DCO16M_RETAIN_VAL_Msk (0x1UL << FLL16M_OVERRIDE_DCO16M_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.   */

/* EN @Bit 31 : Enable the override */
  #define FLL16M_OVERRIDE_DCO16M_RETAIN_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define FLL16M_OVERRIDE_DCO16M_RETAIN_EN_Msk (0x1UL << FLL16M_OVERRIDE_DCO16M_RETAIN_EN_Pos) /*!< Bit mask of EN field.      */
  #define FLL16M_OVERRIDE_DCO16M_RETAIN_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define FLL16M_OVERRIDE_DCO16M_RETAIN_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define FLL16M_OVERRIDE_DCO16M_RETAIN_EN_Disabled (0x0UL) /*!< Override is disabled                                          */
  #define FLL16M_OVERRIDE_DCO16M_RETAIN_EN_Enabled (0x1UL) /*!< Override is enabled                                            */


/* FLL16M_OVERRIDE_DCO16M_SLEEP: Override the SLEEP signal to the DCO16M analog module */
  #define FLL16M_OVERRIDE_DCO16M_SLEEP_ResetValue (0x00000000UL) /*!< Reset value of SLEEP register.                           */

/* VAL @Bit 0 : Override value for the signal */
  #define FLL16M_OVERRIDE_DCO16M_SLEEP_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define FLL16M_OVERRIDE_DCO16M_SLEEP_VAL_Msk (0x1UL << FLL16M_OVERRIDE_DCO16M_SLEEP_VAL_Pos) /*!< Bit mask of VAL field.     */

/* EN @Bit 31 : Enable the override */
  #define FLL16M_OVERRIDE_DCO16M_SLEEP_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define FLL16M_OVERRIDE_DCO16M_SLEEP_EN_Msk (0x1UL << FLL16M_OVERRIDE_DCO16M_SLEEP_EN_Pos) /*!< Bit mask of EN field.        */
  #define FLL16M_OVERRIDE_DCO16M_SLEEP_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define FLL16M_OVERRIDE_DCO16M_SLEEP_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define FLL16M_OVERRIDE_DCO16M_SLEEP_EN_Disabled (0x0UL) /*!< Override is disabled                                           */
  #define FLL16M_OVERRIDE_DCO16M_SLEEP_EN_Enabled (0x1UL) /*!< Override is enabled                                             */


/* FLL16M_OVERRIDE_DCO16M_READY: Override the DCO16M READY signal from the analog module */
  #define FLL16M_OVERRIDE_DCO16M_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                           */

/* VAL @Bit 0 : Current value of the signal */
  #define FLL16M_OVERRIDE_DCO16M_READY_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define FLL16M_OVERRIDE_DCO16M_READY_VAL_Msk (0x1UL << FLL16M_OVERRIDE_DCO16M_READY_VAL_Pos) /*!< Bit mask of VAL field.     */

/* EN @Bit 31 : Enable the override */
  #define FLL16M_OVERRIDE_DCO16M_READY_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define FLL16M_OVERRIDE_DCO16M_READY_EN_Msk (0x1UL << FLL16M_OVERRIDE_DCO16M_READY_EN_Pos) /*!< Bit mask of EN field.        */
  #define FLL16M_OVERRIDE_DCO16M_READY_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define FLL16M_OVERRIDE_DCO16M_READY_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define FLL16M_OVERRIDE_DCO16M_READY_EN_Disabled (0x0UL) /*!< Override is disabled                                           */
  #define FLL16M_OVERRIDE_DCO16M_READY_EN_Enabled (0x1UL) /*!< Override is enabled                                             */


/* FLL16M_OVERRIDE_DCO16M_SETTLED: Override the DCO16M SETTLED signal from the analog module */
  #define FLL16M_OVERRIDE_DCO16M_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of SETTLED register.                       */

/* VAL @Bit 0 : Current value of the signal */
  #define FLL16M_OVERRIDE_DCO16M_SETTLED_VAL_Pos (0UL) /*!< Position of VAL field.                                             */
  #define FLL16M_OVERRIDE_DCO16M_SETTLED_VAL_Msk (0x1UL << FLL16M_OVERRIDE_DCO16M_SETTLED_VAL_Pos) /*!< Bit mask of VAL field. */

/* EN @Bit 31 : Enable the override */
  #define FLL16M_OVERRIDE_DCO16M_SETTLED_EN_Pos (31UL) /*!< Position of EN field.                                              */
  #define FLL16M_OVERRIDE_DCO16M_SETTLED_EN_Msk (0x1UL << FLL16M_OVERRIDE_DCO16M_SETTLED_EN_Pos) /*!< Bit mask of EN field.    */
  #define FLL16M_OVERRIDE_DCO16M_SETTLED_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                 */
  #define FLL16M_OVERRIDE_DCO16M_SETTLED_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                 */
  #define FLL16M_OVERRIDE_DCO16M_SETTLED_EN_Disabled (0x0UL) /*!< Override is disabled                                         */
  #define FLL16M_OVERRIDE_DCO16M_SETTLED_EN_Enabled (0x1UL) /*!< Override is enabled                                           */



/* ============================================= Struct FLL16M_OVERRIDE_CKSW16M ============================================== */
/**
  * @brief CKSW16M [FLL16M_OVERRIDE_CKSW16M] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the CKSW16M analog module*/
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  CKSEL;                             /*!< (@ 0x00000008) Override the CKSEL signal to the analog module        */
  __IOM uint32_t  READY;                             /*!< (@ 0x0000000C) Override the CKSW16M READY signal from the analog
                                                                         module*/                                                 
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x00000010) Override the CKSW16M SETTLED signal from the analog
                                                                         module*/                                                 
  __IOM uint32_t  CKSELOUT;                          /*!< (@ 0x00000014) Override the CKSW16M CKSEL signal from the analog
                                                                         module*/                                                 
} NRF_FLL16M_OVERRIDE_CKSW16M_Type;                  /*!< Size = 24 (0x018)                                                    */

/* FLL16M_OVERRIDE_CKSW16M_PWRUP: Override the PWRUP signal to the CKSW16M analog module */
  #define FLL16M_OVERRIDE_CKSW16M_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                          */

/* VAL @Bit 0 : Override value for the signal */
  #define FLL16M_OVERRIDE_CKSW16M_PWRUP_VAL_Pos (0UL) /*!< Position of VAL field.                                              */
  #define FLL16M_OVERRIDE_CKSW16M_PWRUP_VAL_Msk (0x1UL << FLL16M_OVERRIDE_CKSW16M_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.   */

/* EN @Bit 31 : Enable the override */
  #define FLL16M_OVERRIDE_CKSW16M_PWRUP_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define FLL16M_OVERRIDE_CKSW16M_PWRUP_EN_Msk (0x1UL << FLL16M_OVERRIDE_CKSW16M_PWRUP_EN_Pos) /*!< Bit mask of EN field.      */
  #define FLL16M_OVERRIDE_CKSW16M_PWRUP_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define FLL16M_OVERRIDE_CKSW16M_PWRUP_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define FLL16M_OVERRIDE_CKSW16M_PWRUP_EN_Disabled (0x0UL) /*!< Override is disabled                                          */
  #define FLL16M_OVERRIDE_CKSW16M_PWRUP_EN_Enabled (0x1UL) /*!< Override is enabled                                            */


/* FLL16M_OVERRIDE_CKSW16M_RETAIN: Override the RETAIN signal to the analog module */
  #define FLL16M_OVERRIDE_CKSW16M_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                        */

/* VAL @Bit 0 : Override value for the signal */
  #define FLL16M_OVERRIDE_CKSW16M_RETAIN_VAL_Pos (0UL) /*!< Position of VAL field.                                             */
  #define FLL16M_OVERRIDE_CKSW16M_RETAIN_VAL_Msk (0x1UL << FLL16M_OVERRIDE_CKSW16M_RETAIN_VAL_Pos) /*!< Bit mask of VAL field. */

/* EN @Bit 31 : Enable the override */
  #define FLL16M_OVERRIDE_CKSW16M_RETAIN_EN_Pos (31UL) /*!< Position of EN field.                                              */
  #define FLL16M_OVERRIDE_CKSW16M_RETAIN_EN_Msk (0x1UL << FLL16M_OVERRIDE_CKSW16M_RETAIN_EN_Pos) /*!< Bit mask of EN field.    */
  #define FLL16M_OVERRIDE_CKSW16M_RETAIN_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                 */
  #define FLL16M_OVERRIDE_CKSW16M_RETAIN_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                 */
  #define FLL16M_OVERRIDE_CKSW16M_RETAIN_EN_Disabled (0x0UL) /*!< Override is disabled                                         */
  #define FLL16M_OVERRIDE_CKSW16M_RETAIN_EN_Enabled (0x1UL) /*!< Override is enabled                                           */


/* FLL16M_OVERRIDE_CKSW16M_CKSEL: Override the CKSEL signal to the analog module */
  #define FLL16M_OVERRIDE_CKSW16M_CKSEL_ResetValue (0x00000000UL) /*!< Reset value of CKSEL register.                          */

/* VAL @Bit 0 : Override value for the signal */
  #define FLL16M_OVERRIDE_CKSW16M_CKSEL_VAL_Pos (0UL) /*!< Position of VAL field.                                              */
  #define FLL16M_OVERRIDE_CKSW16M_CKSEL_VAL_Msk (0x1UL << FLL16M_OVERRIDE_CKSW16M_CKSEL_VAL_Pos) /*!< Bit mask of VAL field.   */

/* EN @Bit 31 : Enable the override */
  #define FLL16M_OVERRIDE_CKSW16M_CKSEL_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define FLL16M_OVERRIDE_CKSW16M_CKSEL_EN_Msk (0x1UL << FLL16M_OVERRIDE_CKSW16M_CKSEL_EN_Pos) /*!< Bit mask of EN field.      */
  #define FLL16M_OVERRIDE_CKSW16M_CKSEL_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define FLL16M_OVERRIDE_CKSW16M_CKSEL_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define FLL16M_OVERRIDE_CKSW16M_CKSEL_EN_Disabled (0x0UL) /*!< Override is disabled                                          */
  #define FLL16M_OVERRIDE_CKSW16M_CKSEL_EN_Enabled (0x1UL) /*!< Override is enabled                                            */


/* FLL16M_OVERRIDE_CKSW16M_READY: Override the CKSW16M READY signal from the analog module */
  #define FLL16M_OVERRIDE_CKSW16M_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                          */

/* VAL @Bit 0 : Current value of the signal */
  #define FLL16M_OVERRIDE_CKSW16M_READY_VAL_Pos (0UL) /*!< Position of VAL field.                                              */
  #define FLL16M_OVERRIDE_CKSW16M_READY_VAL_Msk (0x1UL << FLL16M_OVERRIDE_CKSW16M_READY_VAL_Pos) /*!< Bit mask of VAL field.   */

/* EN @Bit 31 : Enable the override */
  #define FLL16M_OVERRIDE_CKSW16M_READY_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define FLL16M_OVERRIDE_CKSW16M_READY_EN_Msk (0x1UL << FLL16M_OVERRIDE_CKSW16M_READY_EN_Pos) /*!< Bit mask of EN field.      */
  #define FLL16M_OVERRIDE_CKSW16M_READY_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define FLL16M_OVERRIDE_CKSW16M_READY_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define FLL16M_OVERRIDE_CKSW16M_READY_EN_Disabled (0x0UL) /*!< Override is disabled                                          */
  #define FLL16M_OVERRIDE_CKSW16M_READY_EN_Enabled (0x1UL) /*!< Override is enabled                                            */


/* FLL16M_OVERRIDE_CKSW16M_SETTLED: Override the CKSW16M SETTLED signal from the analog module */
  #define FLL16M_OVERRIDE_CKSW16M_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of SETTLED register.                      */

/* VAL @Bit 0 : Current value of the signal */
  #define FLL16M_OVERRIDE_CKSW16M_SETTLED_VAL_Pos (0UL) /*!< Position of VAL field.                                            */
  #define FLL16M_OVERRIDE_CKSW16M_SETTLED_VAL_Msk (0x1UL << FLL16M_OVERRIDE_CKSW16M_SETTLED_VAL_Pos) /*!< Bit mask of VAL
                                                                            field.*/                                              

/* EN @Bit 31 : Enable the override */
  #define FLL16M_OVERRIDE_CKSW16M_SETTLED_EN_Pos (31UL) /*!< Position of EN field.                                             */
  #define FLL16M_OVERRIDE_CKSW16M_SETTLED_EN_Msk (0x1UL << FLL16M_OVERRIDE_CKSW16M_SETTLED_EN_Pos) /*!< Bit mask of EN field.  */
  #define FLL16M_OVERRIDE_CKSW16M_SETTLED_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                */
  #define FLL16M_OVERRIDE_CKSW16M_SETTLED_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                */
  #define FLL16M_OVERRIDE_CKSW16M_SETTLED_EN_Disabled (0x0UL) /*!< Override is disabled                                        */
  #define FLL16M_OVERRIDE_CKSW16M_SETTLED_EN_Enabled (0x1UL) /*!< Override is enabled                                          */


/* FLL16M_OVERRIDE_CKSW16M_CKSELOUT: Override the CKSW16M CKSEL signal from the analog module */
  #define FLL16M_OVERRIDE_CKSW16M_CKSELOUT_ResetValue (0x00000000UL) /*!< Reset value of CKSELOUT register.                    */

/* VAL @Bit 0 : Current value of the signal */
  #define FLL16M_OVERRIDE_CKSW16M_CKSELOUT_VAL_Pos (0UL) /*!< Position of VAL field.                                           */
  #define FLL16M_OVERRIDE_CKSW16M_CKSELOUT_VAL_Msk (0x1UL << FLL16M_OVERRIDE_CKSW16M_CKSELOUT_VAL_Pos) /*!< Bit mask of VAL
                                                                            field.*/                                              

/* EN @Bit 31 : Enable the override */
  #define FLL16M_OVERRIDE_CKSW16M_CKSELOUT_EN_Pos (31UL) /*!< Position of EN field.                                            */
  #define FLL16M_OVERRIDE_CKSW16M_CKSELOUT_EN_Msk (0x1UL << FLL16M_OVERRIDE_CKSW16M_CKSELOUT_EN_Pos) /*!< Bit mask of EN field.*/
  #define FLL16M_OVERRIDE_CKSW16M_CKSELOUT_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                               */
  #define FLL16M_OVERRIDE_CKSW16M_CKSELOUT_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                               */
  #define FLL16M_OVERRIDE_CKSW16M_CKSELOUT_EN_Disabled (0x0UL) /*!< Override is disabled                                       */
  #define FLL16M_OVERRIDE_CKSW16M_CKSELOUT_EN_Enabled (0x1UL) /*!< Override is enabled                                         */



/* ================================================= Struct FLL16M_OVERRIDE ================================================== */
/**
  * @brief OVERRIDE [FLL16M_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM NRF_FLL16M_OVERRIDE_DCO16M_Type DCO16M;      /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FLL16M_OVERRIDE_CKSW16M_Type CKSW16M;    /*!< (@ 0x00000014) (unspecified)                                         */
} NRF_FLL16M_OVERRIDE_Type;                          /*!< Size = 44 (0x02C)                                                    */


/* ================================================ Struct FLL16M_DFT_DCO16M ================================================= */
/**
  * @brief DCO16M [FLL16M_DFT_DCO16M] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
  __IOM uint32_t  DTB2CONFIG;                        /*!< (@ 0x00000018) Digital Test Bus 2 (DTB2) configuration               */
  __IOM uint32_t  DTB3CONFIG;                        /*!< (@ 0x0000001C) Digital Test Bus 3 (DTB3) configuration               */
  __IM  uint32_t  RESERVED1[4];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
} NRF_FLL16M_DFT_DCO16M_Type;                        /*!< Size = 52 (0x034)                                                    */

