adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FLL16M_DFT_DCO16M_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define FLL16M_DFT_DCO16M_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                      */

/* SELMUX @Bits 0..1 : Select multiplexer for ATB0 */
  #define FLL16M_DFT_DCO16M_ATB0CONFIG_SELMUX_Pos (0UL) /*!< Position of SELMUX field.                                         */
  #define FLL16M_DFT_DCO16M_ATB0CONFIG_SELMUX_Msk (0x3UL << FLL16M_DFT_DCO16M_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX
                                                                            field.*/                                              

/* EN @Bit 31 : Enable the analog test bus */
  #define FLL16M_DFT_DCO16M_ATB0CONFIG_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define FLL16M_DFT_DCO16M_ATB0CONFIG_EN_Msk (0x1UL << FLL16M_DFT_DCO16M_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.        */
  #define FLL16M_DFT_DCO16M_ATB0CONFIG_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define FLL16M_DFT_DCO16M_ATB0CONFIG_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define FLL16M_DFT_DCO16M_ATB0CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                    */
  #define FLL16M_DFT_DCO16M_ATB0CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                      */


/* FLL16M_DFT_DCO16M_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define FLL16M_DFT_DCO16M_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                      */

/* SELMUX @Bits 0..1 : Select multiplexer for ATB1 */
  #define FLL16M_DFT_DCO16M_ATB1CONFIG_SELMUX_Pos (0UL) /*!< Position of SELMUX field.                                         */
  #define FLL16M_DFT_DCO16M_ATB1CONFIG_SELMUX_Msk (0x3UL << FLL16M_DFT_DCO16M_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX
                                                                            field.*/                                              

/* EN @Bit 31 : Enable the analog test bus */
  #define FLL16M_DFT_DCO16M_ATB1CONFIG_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define FLL16M_DFT_DCO16M_ATB1CONFIG_EN_Msk (0x1UL << FLL16M_DFT_DCO16M_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.        */
  #define FLL16M_DFT_DCO16M_ATB1CONFIG_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define FLL16M_DFT_DCO16M_ATB1CONFIG_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define FLL16M_DFT_DCO16M_ATB1CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                    */
  #define FLL16M_DFT_DCO16M_ATB1CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                      */


/* FLL16M_DFT_DCO16M_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define FLL16M_DFT_DCO16M_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                      */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB0 */
  #define FLL16M_DFT_DCO16M_DTB0CONFIG_SELMUX_Pos (0UL) /*!< Position of SELMUX field.                                         */
  #define FLL16M_DFT_DCO16M_DTB0CONFIG_SELMUX_Msk (0x3UL << FLL16M_DFT_DCO16M_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX
                                                                            field.*/                                              
  #define FLL16M_DFT_DCO16M_DTB0CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                           */
  #define FLL16M_DFT_DCO16M_DTB0CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                           */
  #define FLL16M_DFT_DCO16M_DTB0CONFIG_SELMUX_VSS (0x0UL) /*!< VSS selected                                                    */
  #define FLL16M_DFT_DCO16M_DTB0CONFIG_SELMUX_OSCDIV32INT (0x1UL) /*!< OSC_DIV32_INT_0V8 selected                              */
  #define FLL16M_DFT_DCO16M_DTB0CONFIG_SELMUX_SETTLEDDCO16M (0x2UL) /*!< SETTLED_DCO16M_AO_0V8 selected                        */
  #define FLL16M_DFT_DCO16M_DTB0CONFIG_SELMUX_PWRUPDCO16M (0x3UL) /*!< PWRUP_DCO16M_AO_0V8 selected                            */

/* EN @Bit 31 : Enable the digital test bus */
  #define FLL16M_DFT_DCO16M_DTB0CONFIG_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define FLL16M_DFT_DCO16M_DTB0CONFIG_EN_Msk (0x1UL << FLL16M_DFT_DCO16M_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.        */
  #define FLL16M_DFT_DCO16M_DTB0CONFIG_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define FLL16M_DFT_DCO16M_DTB0CONFIG_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define FLL16M_DFT_DCO16M_DTB0CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                   */
  #define FLL16M_DFT_DCO16M_DTB0CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                     */


/* FLL16M_DFT_DCO16M_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define FLL16M_DFT_DCO16M_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                      */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB1 */
  #define FLL16M_DFT_DCO16M_DTB1CONFIG_SELMUX_Pos (0UL) /*!< Position of SELMUX field.                                         */
  #define FLL16M_DFT_DCO16M_DTB1CONFIG_SELMUX_Msk (0x3UL << FLL16M_DFT_DCO16M_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX
                                                                            field.*/                                              
  #define FLL16M_DFT_DCO16M_DTB1CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                           */
  #define FLL16M_DFT_DCO16M_DTB1CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                           */
  #define FLL16M_DFT_DCO16M_DTB1CONFIG_SELMUX_VSS (0x0UL) /*!< VSS selected                                                    */
  #define FLL16M_DFT_DCO16M_DTB1CONFIG_SELMUX_RETAINDCO16M (0x1UL) /*!< RETAIN_DCO16M_AO_0V8 selected                          */
  #define FLL16M_DFT_DCO16M_DTB1CONFIG_SELMUX_SETTLEDDCO16M (0x2UL) /*!< SETTLED_DCO16M_AO_0V8 selected                        */
  #define FLL16M_DFT_DCO16M_DTB1CONFIG_SELMUX_OSCDCO16M (0x3UL) /*!< OSC_DCO16M_0V8 selected                                   */

