adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TASKS_ONESHOTLOCK @Bit 0 : Start one-shot locking process in Refresh mode. */
  #define FLL16M_TASKS_ONESHOTLOCK_TASKS_ONESHOTLOCK_Pos (0UL) /*!< Position of TASKS_ONESHOTLOCK field.                       */
  #define FLL16M_TASKS_ONESHOTLOCK_TASKS_ONESHOTLOCK_Msk (0x1UL << FLL16M_TASKS_ONESHOTLOCK_TASKS_ONESHOTLOCK_Pos) /*!< Bit mask
                                                                            of TASKS_ONESHOTLOCK field.*/                         
  #define FLL16M_TASKS_ONESHOTLOCK_TASKS_ONESHOTLOCK_Min (0x1UL) /*!< Min enumerator value of TASKS_ONESHOTLOCK field.         */
  #define FLL16M_TASKS_ONESHOTLOCK_TASKS_ONESHOTLOCK_Max (0x1UL) /*!< Max enumerator value of TASKS_ONESHOTLOCK field.         */
  #define FLL16M_TASKS_ONESHOTLOCK_TASKS_ONESHOTLOCK_Trigger (0x1UL) /*!< Trigger task                                         */


/* FLL16M_TASKS_SLEEP: Enter into FLL16M sleep mode */
  #define FLL16M_TASKS_SLEEP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SLEEP register.                               */

/* TASKS_SLEEP @Bit 0 : Enter into FLL16M sleep mode */
  #define FLL16M_TASKS_SLEEP_TASKS_SLEEP_Pos (0UL)   /*!< Position of TASKS_SLEEP field.                                       */
  #define FLL16M_TASKS_SLEEP_TASKS_SLEEP_Msk (0x1UL << FLL16M_TASKS_SLEEP_TASKS_SLEEP_Pos) /*!< Bit mask of TASKS_SLEEP field. */
  #define FLL16M_TASKS_SLEEP_TASKS_SLEEP_Min (0x1UL) /*!< Min enumerator value of TASKS_SLEEP field.                           */
  #define FLL16M_TASKS_SLEEP_TASKS_SLEEP_Max (0x1UL) /*!< Max enumerator value of TASKS_SLEEP field.                           */
  #define FLL16M_TASKS_SLEEP_TASKS_SLEEP_Trigger (0x1UL) /*!< Trigger task                                                     */


/* FLL16M_TASKS_FREQMEAS: Start frequency measurement in software-controlled mode */
  #define FLL16M_TASKS_FREQMEAS_ResetValue (0x00000000UL) /*!< Reset value of TASKS_FREQMEAS register.                         */

/* TASKS_FREQMEAS @Bit 0 : Start frequency measurement in software-controlled mode */
  #define FLL16M_TASKS_FREQMEAS_TASKS_FREQMEAS_Pos (0UL) /*!< Position of TASKS_FREQMEAS field.                                */
  #define FLL16M_TASKS_FREQMEAS_TASKS_FREQMEAS_Msk (0x1UL << FLL16M_TASKS_FREQMEAS_TASKS_FREQMEAS_Pos) /*!< Bit mask of
                                                                            TASKS_FREQMEAS field.*/                               
  #define FLL16M_TASKS_FREQMEAS_TASKS_FREQMEAS_Min (0x1UL) /*!< Min enumerator value of TASKS_FREQMEAS field.                  */
  #define FLL16M_TASKS_FREQMEAS_TASKS_FREQMEAS_Max (0x1UL) /*!< Max enumerator value of TASKS_FREQMEAS field.                  */
  #define FLL16M_TASKS_FREQMEAS_TASKS_FREQMEAS_Trigger (0x1UL) /*!< Trigger task                                               */


/* FLL16M_TASKS_FREQCHANGE: Trigger frequency change */
  #define FLL16M_TASKS_FREQCHANGE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_FREQCHANGE register.                     */

/* TASKS_FREQCHANGE @Bit 0 : Trigger frequency change */
  #define FLL16M_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Pos (0UL) /*!< Position of TASKS_FREQCHANGE field.                          */
  #define FLL16M_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Msk (0x1UL << FLL16M_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Pos) /*!< Bit mask of
                                                                            TASKS_FREQCHANGE field.*/                             
  #define FLL16M_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Min (0x1UL) /*!< Min enumerator value of TASKS_FREQCHANGE field.            */
  #define FLL16M_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Max (0x1UL) /*!< Max enumerator value of TASKS_FREQCHANGE field.            */
  #define FLL16M_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Trigger (0x1UL) /*!< Trigger task                                           */


/* FLL16M_EVENTS_FREQMDONE: Frequency measurement done */
  #define FLL16M_EVENTS_FREQMDONE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FREQMDONE register.                     */

/* EVENTS_FREQMDONE @Bit 0 : Frequency measurement done */
  #define FLL16M_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Pos (0UL) /*!< Position of EVENTS_FREQMDONE field.                          */
  #define FLL16M_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Msk (0x1UL << FLL16M_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Pos) /*!< Bit mask of
                                                                            EVENTS_FREQMDONE field.*/                             
  #define FLL16M_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Min (0x0UL) /*!< Min enumerator value of EVENTS_FREQMDONE field.            */
  #define FLL16M_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Max (0x1UL) /*!< Max enumerator value of EVENTS_FREQMDONE field.            */
  #define FLL16M_EVENTS_FREQMDONE_EVENTS_FREQMDONE_NotGenerated (0x0UL) /*!< Event not generated                               */
  #define FLL16M_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Generated (0x1UL) /*!< Event generated                                      */


/* FLL16M_EVENTS_FREQMERROR: Frequency measurement error */
  #define FLL16M_EVENTS_FREQMERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FREQMERROR register.                   */

/* EVENTS_FREQMERROR @Bit 0 : Frequency measurement error */
  #define FLL16M_EVENTS_FREQMERROR_EVENTS_FREQMERROR_Pos (0UL) /*!< Position of EVENTS_FREQMERROR field.                       */
  #define FLL16M_EVENTS_FREQMERROR_EVENTS_FREQMERROR_Msk (0x1UL << FLL16M_EVENTS_FREQMERROR_EVENTS_FREQMERROR_Pos) /*!< Bit mask
                                                                            of EVENTS_FREQMERROR field.*/                         
  #define FLL16M_EVENTS_FREQMERROR_EVENTS_FREQMERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_FREQMERROR field.         */
  #define FLL16M_EVENTS_FREQMERROR_EVENTS_FREQMERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_FREQMERROR field.         */
  #define FLL16M_EVENTS_FREQMERROR_EVENTS_FREQMERROR_NotGenerated (0x0UL) /*!< Event not generated                             */
  #define FLL16M_EVENTS_FREQMERROR_EVENTS_FREQMERROR_Generated (0x1UL) /*!< Event generated                                    */


/* FLL16M_EVENTS_FREQCHANGED: Frequency change done */
  #define FLL16M_EVENTS_FREQCHANGED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FREQCHANGED register.                 */

/* EVENTS_FREQCHANGED @Bit 0 : Frequency change done */
  #define FLL16M_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Pos (0UL) /*!< Position of EVENTS_FREQCHANGED field.                    */
  #define FLL16M_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Msk (0x1UL << FLL16M_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Pos) /*!< Bit
                                                                            mask of EVENTS_FREQCHANGED field.*/                   
  #define FLL16M_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Min (0x0UL) /*!< Min enumerator value of EVENTS_FREQCHANGED field.      */
  #define FLL16M_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Max (0x1UL) /*!< Max enumerator value of EVENTS_FREQCHANGED field.      */
  #define FLL16M_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_NotGenerated (0x0UL) /*!< Event not generated                           */
  #define FLL16M_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Generated (0x1UL) /*!< Event generated                                  */


/* FLL16M_INTEN: Enable or disable interrupt */
  #define FLL16M_INTEN_ResetValue (0x00000000UL)     /*!< Reset value of INTEN register.                                       */

/* FREQMDONE @Bit 0 : Enable or disable interrupt for event FREQMDONE */
  #define FLL16M_INTEN_FREQMDONE_Pos (0UL)           /*!< Position of FREQMDONE field.                                         */
  #define FLL16M_INTEN_FREQMDONE_Msk (0x1UL << FLL16M_INTEN_FREQMDONE_Pos) /*!< Bit mask of FREQMDONE field.                   */
  #define FLL16M_INTEN_FREQMDONE_Min (0x0UL)         /*!< Min enumerator value of FREQMDONE field.                             */
  #define FLL16M_INTEN_FREQMDONE_Max (0x1UL)         /*!< Max enumerator value of FREQMDONE field.                             */
  #define FLL16M_INTEN_FREQMDONE_Disabled (0x0UL)    /*!< Disable                                                              */
  #define FLL16M_INTEN_FREQMDONE_Enabled (0x1UL)     /*!< Enable                                                               */

/* FREQMERROR @Bit 1 : Enable or disable interrupt for event FREQMERROR */
  #define FLL16M_INTEN_FREQMERROR_Pos (1UL)          /*!< Position of FREQMERROR field.                                        */
  #define FLL16M_INTEN_FREQMERROR_Msk (0x1UL << FLL16M_INTEN_FREQMERROR_Pos) /*!< Bit mask of FREQMERROR field.                */
  #define FLL16M_INTEN_FREQMERROR_Min (0x0UL)        /*!< Min enumerator value of FREQMERROR field.                            */
  #define FLL16M_INTEN_FREQMERROR_Max (0x1UL)        /*!< Max enumerator value of FREQMERROR field.                            */
  #define FLL16M_INTEN_FREQMERROR_Disabled (0x0UL)   /*!< Disable                                                              */
  #define FLL16M_INTEN_FREQMERROR_Enabled (0x1UL)    /*!< Enable                                                               */

/* FREQCHANGED @Bit 2 : Enable or disable interrupt for event FREQCHANGED */
  #define FLL16M_INTEN_FREQCHANGED_Pos (2UL)         /*!< Position of FREQCHANGED field.                                       */
  #define FLL16M_INTEN_FREQCHANGED_Msk (0x1UL << FLL16M_INTEN_FREQCHANGED_Pos) /*!< Bit mask of FREQCHANGED field.             */
  #define FLL16M_INTEN_FREQCHANGED_Min (0x0UL)       /*!< Min enumerator value of FREQCHANGED field.                           */
  #define FLL16M_INTEN_FREQCHANGED_Max (0x1UL)       /*!< Max enumerator value of FREQCHANGED field.                           */
  #define FLL16M_INTEN_FREQCHANGED_Disabled (0x0UL)  /*!< Disable                                                              */
  #define FLL16M_INTEN_FREQCHANGED_Enabled (0x1UL)   /*!< Enable                                                               */


