adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FLL16M_INTENSET: Enable interrupt */
  #define FLL16M_INTENSET_ResetValue (0x00000000UL)  /*!< Reset value of INTENSET register.                                    */

/* FREQMDONE @Bit 0 : Write '1' to enable interrupt for event FREQMDONE */
  #define FLL16M_INTENSET_FREQMDONE_Pos (0UL)        /*!< Position of FREQMDONE field.                                         */
  #define FLL16M_INTENSET_FREQMDONE_Msk (0x1UL << FLL16M_INTENSET_FREQMDONE_Pos) /*!< Bit mask of FREQMDONE field.             */
  #define FLL16M_INTENSET_FREQMDONE_Min (0x0UL)      /*!< Min enumerator value of FREQMDONE field.                             */
  #define FLL16M_INTENSET_FREQMDONE_Max (0x1UL)      /*!< Max enumerator value of FREQMDONE field.                             */
  #define FLL16M_INTENSET_FREQMDONE_Set (0x1UL)      /*!< Enable                                                               */
  #define FLL16M_INTENSET_FREQMDONE_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define FLL16M_INTENSET_FREQMDONE_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* FREQMERROR @Bit 1 : Write '1' to enable interrupt for event FREQMERROR */
  #define FLL16M_INTENSET_FREQMERROR_Pos (1UL)       /*!< Position of FREQMERROR field.                                        */
  #define FLL16M_INTENSET_FREQMERROR_Msk (0x1UL << FLL16M_INTENSET_FREQMERROR_Pos) /*!< Bit mask of FREQMERROR field.          */
  #define FLL16M_INTENSET_FREQMERROR_Min (0x0UL)     /*!< Min enumerator value of FREQMERROR field.                            */
  #define FLL16M_INTENSET_FREQMERROR_Max (0x1UL)     /*!< Max enumerator value of FREQMERROR field.                            */
  #define FLL16M_INTENSET_FREQMERROR_Set (0x1UL)     /*!< Enable                                                               */
  #define FLL16M_INTENSET_FREQMERROR_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define FLL16M_INTENSET_FREQMERROR_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* FREQCHANGED @Bit 2 : Write '1' to enable interrupt for event FREQCHANGED */
  #define FLL16M_INTENSET_FREQCHANGED_Pos (2UL)      /*!< Position of FREQCHANGED field.                                       */
  #define FLL16M_INTENSET_FREQCHANGED_Msk (0x1UL << FLL16M_INTENSET_FREQCHANGED_Pos) /*!< Bit mask of FREQCHANGED field.       */
  #define FLL16M_INTENSET_FREQCHANGED_Min (0x0UL)    /*!< Min enumerator value of FREQCHANGED field.                           */
  #define FLL16M_INTENSET_FREQCHANGED_Max (0x1UL)    /*!< Max enumerator value of FREQCHANGED field.                           */
  #define FLL16M_INTENSET_FREQCHANGED_Set (0x1UL)    /*!< Enable                                                               */
  #define FLL16M_INTENSET_FREQCHANGED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define FLL16M_INTENSET_FREQCHANGED_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* FLL16M_INTENCLR: Disable interrupt */
  #define FLL16M_INTENCLR_ResetValue (0x00000000UL)  /*!< Reset value of INTENCLR register.                                    */

/* FREQMDONE @Bit 0 : Write '1' to disable interrupt for event FREQMDONE */
  #define FLL16M_INTENCLR_FREQMDONE_Pos (0UL)        /*!< Position of FREQMDONE field.                                         */
  #define FLL16M_INTENCLR_FREQMDONE_Msk (0x1UL << FLL16M_INTENCLR_FREQMDONE_Pos) /*!< Bit mask of FREQMDONE field.             */
  #define FLL16M_INTENCLR_FREQMDONE_Min (0x0UL)      /*!< Min enumerator value of FREQMDONE field.                             */
  #define FLL16M_INTENCLR_FREQMDONE_Max (0x1UL)      /*!< Max enumerator value of FREQMDONE field.                             */
  #define FLL16M_INTENCLR_FREQMDONE_Clear (0x1UL)    /*!< Disable                                                              */
  #define FLL16M_INTENCLR_FREQMDONE_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define FLL16M_INTENCLR_FREQMDONE_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* FREQMERROR @Bit 1 : Write '1' to disable interrupt for event FREQMERROR */
  #define FLL16M_INTENCLR_FREQMERROR_Pos (1UL)       /*!< Position of FREQMERROR field.                                        */
  #define FLL16M_INTENCLR_FREQMERROR_Msk (0x1UL << FLL16M_INTENCLR_FREQMERROR_Pos) /*!< Bit mask of FREQMERROR field.          */
  #define FLL16M_INTENCLR_FREQMERROR_Min (0x0UL)     /*!< Min enumerator value of FREQMERROR field.                            */
  #define FLL16M_INTENCLR_FREQMERROR_Max (0x1UL)     /*!< Max enumerator value of FREQMERROR field.                            */
  #define FLL16M_INTENCLR_FREQMERROR_Clear (0x1UL)   /*!< Disable                                                              */
  #define FLL16M_INTENCLR_FREQMERROR_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define FLL16M_INTENCLR_FREQMERROR_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* FREQCHANGED @Bit 2 : Write '1' to disable interrupt for event FREQCHANGED */
  #define FLL16M_INTENCLR_FREQCHANGED_Pos (2UL)      /*!< Position of FREQCHANGED field.                                       */
  #define FLL16M_INTENCLR_FREQCHANGED_Msk (0x1UL << FLL16M_INTENCLR_FREQCHANGED_Pos) /*!< Bit mask of FREQCHANGED field.       */
  #define FLL16M_INTENCLR_FREQCHANGED_Min (0x0UL)    /*!< Min enumerator value of FREQCHANGED field.                           */
  #define FLL16M_INTENCLR_FREQCHANGED_Max (0x1UL)    /*!< Max enumerator value of FREQCHANGED field.                           */
  #define FLL16M_INTENCLR_FREQCHANGED_Clear (0x1UL)  /*!< Disable                                                              */
  #define FLL16M_INTENCLR_FREQCHANGED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define FLL16M_INTENCLR_FREQCHANGED_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* FLL16M_INTPEND: Pending interrupts */
  #define FLL16M_INTPEND_ResetValue (0x00000000UL)   /*!< Reset value of INTPEND register.                                     */

