adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task GENERICTASK will subscribe to */
  #define GENERIC_SUBSCRIBE_GENERICTASK_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                          */
  #define GENERIC_SUBSCRIBE_GENERICTASK_CHIDX_Msk (0xFFUL << GENERIC_SUBSCRIBE_GENERICTASK_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define GENERIC_SUBSCRIBE_GENERICTASK_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                       */
  #define GENERIC_SUBSCRIBE_GENERICTASK_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                       */

/* EN @Bit 31 : (unspecified) */
  #define GENERIC_SUBSCRIBE_GENERICTASK_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define GENERIC_SUBSCRIBE_GENERICTASK_EN_Msk (0x1UL << GENERIC_SUBSCRIBE_GENERICTASK_EN_Pos) /*!< Bit mask of EN field.      */
  #define GENERIC_SUBSCRIBE_GENERICTASK_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define GENERIC_SUBSCRIBE_GENERICTASK_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define GENERIC_SUBSCRIBE_GENERICTASK_EN_Disabled (0x0UL) /*!< Disable subscription                                          */
  #define GENERIC_SUBSCRIBE_GENERICTASK_EN_Enabled (0x1UL) /*!< Enable subscription                                            */


/* GENERIC_EVENTS_GENERICEVENT: Generic event */
  #define GENERIC_EVENTS_GENERICEVENT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_GENERICEVENT register.              */

/* EVENTS_GENERICEVENT @Bit 0 : Generic event */
  #define GENERIC_EVENTS_GENERICEVENT_EVENTS_GENERICEVENT_Pos (0UL) /*!< Position of EVENTS_GENERICEVENT field.                */
  #define GENERIC_EVENTS_GENERICEVENT_EVENTS_GENERICEVENT_Msk (0x1UL << GENERIC_EVENTS_GENERICEVENT_EVENTS_GENERICEVENT_Pos)
                                                                            /*!< Bit mask of EVENTS_GENERICEVENT field.*/         
  #define GENERIC_EVENTS_GENERICEVENT_EVENTS_GENERICEVENT_Min (0x0UL) /*!< Min enumerator value of EVENTS_GENERICEVENT field.  */
  #define GENERIC_EVENTS_GENERICEVENT_EVENTS_GENERICEVENT_Max (0x1UL) /*!< Max enumerator value of EVENTS_GENERICEVENT field.  */
  #define GENERIC_EVENTS_GENERICEVENT_EVENTS_GENERICEVENT_NotGenerated (0x0UL) /*!< Event not generated                        */
  #define GENERIC_EVENTS_GENERICEVENT_EVENTS_GENERICEVENT_Generated (0x1UL) /*!< Event generated                               */


/* GENERIC_PUBLISH_GENERICEVENT: Publish configuration for event GENERICEVENT */
  #define GENERIC_PUBLISH_GENERICEVENT_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_GENERICEVENT register.            */

/* CHIDX @Bits 0..7 : DPPI channel that event GENERICEVENT will publish to */
  #define GENERIC_PUBLISH_GENERICEVENT_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                           */
  #define GENERIC_PUBLISH_GENERICEVENT_CHIDX_Msk (0xFFUL << GENERIC_PUBLISH_GENERICEVENT_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define GENERIC_PUBLISH_GENERICEVENT_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                        */
  #define GENERIC_PUBLISH_GENERICEVENT_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                        */

/* EN @Bit 31 : (unspecified) */
  #define GENERIC_PUBLISH_GENERICEVENT_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define GENERIC_PUBLISH_GENERICEVENT_EN_Msk (0x1UL << GENERIC_PUBLISH_GENERICEVENT_EN_Pos) /*!< Bit mask of EN field.        */
  #define GENERIC_PUBLISH_GENERICEVENT_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define GENERIC_PUBLISH_GENERICEVENT_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define GENERIC_PUBLISH_GENERICEVENT_EN_Disabled (0x0UL) /*!< Disable publishing                                             */
  #define GENERIC_PUBLISH_GENERICEVENT_EN_Enabled (0x1UL) /*!< Enable publishing                                               */


/* GENERIC_INTEN: Enable or disable interrupt */
  #define GENERIC_INTEN_ResetValue (0x00000000UL)    /*!< Reset value of INTEN register.                                       */

/* GENERICEVENT @Bit 0 : Enable or disable interrupt for event GENERICEVENT */
  #define GENERIC_INTEN_GENERICEVENT_Pos (0UL)       /*!< Position of GENERICEVENT field.                                      */
  #define GENERIC_INTEN_GENERICEVENT_Msk (0x1UL << GENERIC_INTEN_GENERICEVENT_Pos) /*!< Bit mask of GENERICEVENT field.        */
  #define GENERIC_INTEN_GENERICEVENT_Min (0x0UL)     /*!< Min enumerator value of GENERICEVENT field.                          */
  #define GENERIC_INTEN_GENERICEVENT_Max (0x1UL)     /*!< Max enumerator value of GENERICEVENT field.                          */
  #define GENERIC_INTEN_GENERICEVENT_Disabled (0x0UL) /*!< Disable                                                             */
  #define GENERIC_INTEN_GENERICEVENT_Enabled (0x1UL) /*!< Enable                                                               */


/* GENERIC_INTENSET: Enable interrupt */
  #define GENERIC_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                    */

/* GENERICEVENT @Bit 0 : Write '1' to enable interrupt for event GENERICEVENT */
  #define GENERIC_INTENSET_GENERICEVENT_Pos (0UL)    /*!< Position of GENERICEVENT field.                                      */
  #define GENERIC_INTENSET_GENERICEVENT_Msk (0x1UL << GENERIC_INTENSET_GENERICEVENT_Pos) /*!< Bit mask of GENERICEVENT field.  */
  #define GENERIC_INTENSET_GENERICEVENT_Min (0x0UL)  /*!< Min enumerator value of GENERICEVENT field.                          */
  #define GENERIC_INTENSET_GENERICEVENT_Max (0x1UL)  /*!< Max enumerator value of GENERICEVENT field.                          */
  #define GENERIC_INTENSET_GENERICEVENT_Set (0x1UL)  /*!< Enable                                                               */
  #define GENERIC_INTENSET_GENERICEVENT_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define GENERIC_INTENSET_GENERICEVENT_Enabled (0x1UL) /*!< Read: Enabled                                                     */


