adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PIN31 @Bit 31 : Status on whether PIN31 has met criteria set in PIN_CNF[31].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN31_Pos (31UL)                /*!< Position of PIN31 field.                                             */
  #define GPIO_LATCH_PIN31_Msk (0x1UL << GPIO_LATCH_PIN31_Pos) /*!< Bit mask of PIN31 field.                                   */
  #define GPIO_LATCH_PIN31_Min (0x0UL)               /*!< Min enumerator value of PIN31 field.                                 */
  #define GPIO_LATCH_PIN31_Max (0x1UL)               /*!< Max enumerator value of PIN31 field.                                 */
  #define GPIO_LATCH_PIN31_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN31_Latched (0x1UL)           /*!< Criteria has been met                                                */


/* GPIO_DETECTMODE: Select between default DETECT signal behavior and LDETECT mode */
  #define GPIO_DETECTMODE_ResetValue (0x00000000UL)  /*!< Reset value of DETECTMODE register.                                  */

/* DETECTMODE @Bit 0 : Select between default DETECT signal behavior and LDETECT mode */
  #define GPIO_DETECTMODE_DETECTMODE_Pos (0UL)       /*!< Position of DETECTMODE field.                                        */
  #define GPIO_DETECTMODE_DETECTMODE_Msk (0x1UL << GPIO_DETECTMODE_DETECTMODE_Pos) /*!< Bit mask of DETECTMODE field.          */
  #define GPIO_DETECTMODE_DETECTMODE_Min (0x0UL)     /*!< Min enumerator value of DETECTMODE field.                            */
  #define GPIO_DETECTMODE_DETECTMODE_Max (0x1UL)     /*!< Max enumerator value of DETECTMODE field.                            */
  #define GPIO_DETECTMODE_DETECTMODE_Default (0x0UL) /*!< DETECT directly connected to PIN DETECT signals                      */
  #define GPIO_DETECTMODE_DETECTMODE_LDETECT (0x1UL) /*!< Use the latched LDETECT behavior                                     */


/* GPIO_RETAIN: Enable retention for those GPIO registers marked as retained */
  #define GPIO_RETAIN_ResetValue (0x00004FFFUL)      /*!< Reset value of RETAIN register.                                      */

/* SECURE @Bit 1 : Enable retention for GPIO registers for Secure domain */
  #define GPIO_RETAIN_SECURE_Pos (1UL)               /*!< Position of SECURE field.                                            */
  #define GPIO_RETAIN_SECURE_Msk (0x1UL << GPIO_RETAIN_SECURE_Pos) /*!< Bit mask of SECURE field.                              */
  #define GPIO_RETAIN_SECURE_Min (0x0UL)             /*!< Min enumerator value of SECURE field.                                */
  #define GPIO_RETAIN_SECURE_Max (0x1UL)             /*!< Max enumerator value of SECURE field.                                */
  #define GPIO_RETAIN_SECURE_Disabled (0x0UL)        /*!< Retention disabled                                                   */
  #define GPIO_RETAIN_SECURE_Enabled (0x1UL)         /*!< Retention enabled                                                    */

/* APPLICAION @Bit 2 : Enable retention for GPIO registers for Application domain */
  #define GPIO_RETAIN_APPLICAION_Pos (2UL)           /*!< Position of APPLICAION field.                                        */
  #define GPIO_RETAIN_APPLICAION_Msk (0x1UL << GPIO_RETAIN_APPLICAION_Pos) /*!< Bit mask of APPLICAION field.                  */
  #define GPIO_RETAIN_APPLICAION_Min (0x0UL)         /*!< Min enumerator value of APPLICAION field.                            */
  #define GPIO_RETAIN_APPLICAION_Max (0x1UL)         /*!< Max enumerator value of APPLICAION field.                            */
  #define GPIO_RETAIN_APPLICAION_Disabled (0x0UL)    /*!< Retention disabled                                                   */
  #define GPIO_RETAIN_APPLICAION_Enabled (0x1UL)     /*!< Retention enabled                                                    */

/* RADIOCORE @Bit 3 : Enable retention for GPIO registers for Radio core */
  #define GPIO_RETAIN_RADIOCORE_Pos (3UL)            /*!< Position of RADIOCORE field.                                         */
  #define GPIO_RETAIN_RADIOCORE_Msk (0x1UL << GPIO_RETAIN_RADIOCORE_Pos) /*!< Bit mask of RADIOCORE field.                     */
  #define GPIO_RETAIN_RADIOCORE_Min (0x0UL)          /*!< Min enumerator value of RADIOCORE field.                             */
  #define GPIO_RETAIN_RADIOCORE_Max (0x1UL)          /*!< Max enumerator value of RADIOCORE field.                             */
  #define GPIO_RETAIN_RADIOCORE_Disabled (0x0UL)     /*!< Retention disabled                                                   */
  #define GPIO_RETAIN_RADIOCORE_Enabled (0x1UL)      /*!< Retention enabled                                                    */

/* CELLCORE @Bit 4 : Enable retention for GPIO registers for Cellular core */
  #define GPIO_RETAIN_CELLCORE_Pos (4UL)             /*!< Position of CELLCORE field.                                          */
  #define GPIO_RETAIN_CELLCORE_Msk (0x1UL << GPIO_RETAIN_CELLCORE_Pos) /*!< Bit mask of CELLCORE field.                        */
  #define GPIO_RETAIN_CELLCORE_Min (0x0UL)           /*!< Min enumerator value of CELLCORE field.                              */
  #define GPIO_RETAIN_CELLCORE_Max (0x1UL)           /*!< Max enumerator value of CELLCORE field.                              */
  #define GPIO_RETAIN_CELLCORE_Disabled (0x0UL)      /*!< Retention disabled                                                   */
  #define GPIO_RETAIN_CELLCORE_Enabled (0x1UL)       /*!< Retention enabled                                                    */

/* CELLDSP @Bit 5 : Enable retention for GPIO registers for Cellular DSP */
  #define GPIO_RETAIN_CELLDSP_Pos (5UL)              /*!< Position of CELLDSP field.                                           */
  #define GPIO_RETAIN_CELLDSP_Msk (0x1UL << GPIO_RETAIN_CELLDSP_Pos) /*!< Bit mask of CELLDSP field.                           */
  #define GPIO_RETAIN_CELLDSP_Min (0x0UL)            /*!< Min enumerator value of CELLDSP field.                               */
  #define GPIO_RETAIN_CELLDSP_Max (0x1UL)            /*!< Max enumerator value of CELLDSP field.                               */
  #define GPIO_RETAIN_CELLDSP_Disabled (0x0UL)       /*!< Retention disabled                                                   */
  #define GPIO_RETAIN_CELLDSP_Enabled (0x1UL)        /*!< Retention enabled                                                    */

