adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CELLRF @Bit 6 : Enable retention for GPIO registers for Cellular RF */
  #define GPIO_RETAIN_CELLRF_Pos (6UL)               /*!< Position of CELLRF field.                                            */
  #define GPIO_RETAIN_CELLRF_Msk (0x1UL << GPIO_RETAIN_CELLRF_Pos) /*!< Bit mask of CELLRF field.                              */
  #define GPIO_RETAIN_CELLRF_Min (0x0UL)             /*!< Min enumerator value of CELLRF field.                                */
  #define GPIO_RETAIN_CELLRF_Max (0x1UL)             /*!< Max enumerator value of CELLRF field.                                */
  #define GPIO_RETAIN_CELLRF_Disabled (0x0UL)        /*!< Retention disabled                                                   */
  #define GPIO_RETAIN_CELLRF_Enabled (0x1UL)         /*!< Retention enabled                                                    */

/* DISPLAYSS @Bit 7 : Enable retention for GPIO registers for Dispaly Sub System */
  #define GPIO_RETAIN_DISPLAYSS_Pos (7UL)            /*!< Position of DISPLAYSS field.                                         */
  #define GPIO_RETAIN_DISPLAYSS_Msk (0x1UL << GPIO_RETAIN_DISPLAYSS_Pos) /*!< Bit mask of DISPLAYSS field.                     */
  #define GPIO_RETAIN_DISPLAYSS_Min (0x0UL)          /*!< Min enumerator value of DISPLAYSS field.                             */
  #define GPIO_RETAIN_DISPLAYSS_Max (0x1UL)          /*!< Max enumerator value of DISPLAYSS field.                             */
  #define GPIO_RETAIN_DISPLAYSS_Disabled (0x0UL)     /*!< Retention disabled                                                   */
  #define GPIO_RETAIN_DISPLAYSS_Enabled (0x1UL)      /*!< Retention enabled                                                    */

/* GDMAINSLOW @Bit 8 : Enable retention for GPIO registers for Main slow power domain in Global domain */
  #define GPIO_RETAIN_GDMAINSLOW_Pos (8UL)           /*!< Position of GDMAINSLOW field.                                        */
  #define GPIO_RETAIN_GDMAINSLOW_Msk (0x1UL << GPIO_RETAIN_GDMAINSLOW_Pos) /*!< Bit mask of GDMAINSLOW field.                  */
  #define GPIO_RETAIN_GDMAINSLOW_Min (0x0UL)         /*!< Min enumerator value of GDMAINSLOW field.                            */
  #define GPIO_RETAIN_GDMAINSLOW_Max (0x1UL)         /*!< Max enumerator value of GDMAINSLOW field.                            */
  #define GPIO_RETAIN_GDMAINSLOW_Disabled (0x0UL)    /*!< Retention disabled                                                   */
  #define GPIO_RETAIN_GDMAINSLOW_Enabled (0x1UL)     /*!< Retention enabled                                                    */

/* GDACTIVECORE3 @Bit 9 : Enable retention for GPIO registers for Active Core 3 power domain in Global domain */
  #define GPIO_RETAIN_GDACTIVECORE3_Pos (9UL)        /*!< Position of GDACTIVECORE3 field.                                     */
  #define GPIO_RETAIN_GDACTIVECORE3_Msk (0x1UL << GPIO_RETAIN_GDACTIVECORE3_Pos) /*!< Bit mask of GDACTIVECORE3 field.         */
  #define GPIO_RETAIN_GDACTIVECORE3_Min (0x0UL)      /*!< Min enumerator value of GDACTIVECORE3 field.                         */
  #define GPIO_RETAIN_GDACTIVECORE3_Max (0x1UL)      /*!< Max enumerator value of GDACTIVECORE3 field.                         */
  #define GPIO_RETAIN_GDACTIVECORE3_Disabled (0x0UL) /*!< Retention disabled                                                   */
  #define GPIO_RETAIN_GDACTIVECORE3_Enabled (0x1UL)  /*!< Retention enabled                                                    */

/* GDMAINFAST @Bit 10 : Enable retention for GPIO registers for Main fast power domain in Global domain */
  #define GPIO_RETAIN_GDMAINFAST_Pos (10UL)          /*!< Position of GDMAINFAST field.                                        */
  #define GPIO_RETAIN_GDMAINFAST_Msk (0x1UL << GPIO_RETAIN_GDMAINFAST_Pos) /*!< Bit mask of GDMAINFAST field.                  */
  #define GPIO_RETAIN_GDMAINFAST_Min (0x0UL)         /*!< Min enumerator value of GDMAINFAST field.                            */
  #define GPIO_RETAIN_GDMAINFAST_Max (0x1UL)         /*!< Max enumerator value of GDMAINFAST field.                            */
  #define GPIO_RETAIN_GDMAINFAST_Disabled (0x0UL)    /*!< Retention disabled                                                   */
  #define GPIO_RETAIN_GDMAINFAST_Enabled (0x1UL)     /*!< Retention enabled                                                    */

/* GDACTIVECORE2 @Bit 11 : Enable retention for GPIO registers for Active Core 2 power domain in Global domain */
  #define GPIO_RETAIN_GDACTIVECORE2_Pos (11UL)       /*!< Position of GDACTIVECORE2 field.                                     */
  #define GPIO_RETAIN_GDACTIVECORE2_Msk (0x1UL << GPIO_RETAIN_GDACTIVECORE2_Pos) /*!< Bit mask of GDACTIVECORE2 field.         */
  #define GPIO_RETAIN_GDACTIVECORE2_Min (0x0UL)      /*!< Min enumerator value of GDACTIVECORE2 field.                         */
  #define GPIO_RETAIN_GDACTIVECORE2_Max (0x1UL)      /*!< Max enumerator value of GDACTIVECORE2 field.                         */
  #define GPIO_RETAIN_GDACTIVECORE2_Disabled (0x0UL) /*!< Retention disabled                                                   */
  #define GPIO_RETAIN_GDACTIVECORE2_Enabled (0x1UL)  /*!< Retention enabled                                                    */

/* GDACTIVECORE1 @Bit 12 : Enable retention for GPIO registers for Active Core 1 power domain in Global domain */
  #define GPIO_RETAIN_GDACTIVECORE1_Pos (12UL)       /*!< Position of GDACTIVECORE1 field.                                     */
  #define GPIO_RETAIN_GDACTIVECORE1_Msk (0x1UL << GPIO_RETAIN_GDACTIVECORE1_Pos) /*!< Bit mask of GDACTIVECORE1 field.         */
  #define GPIO_RETAIN_GDACTIVECORE1_Min (0x0UL)      /*!< Min enumerator value of GDACTIVECORE1 field.                         */
  #define GPIO_RETAIN_GDACTIVECORE1_Max (0x1UL)      /*!< Max enumerator value of GDACTIVECORE1 field.                         */
  #define GPIO_RETAIN_GDACTIVECORE1_Disabled (0x0UL) /*!< Retention disabled                                                   */
  #define GPIO_RETAIN_GDACTIVECORE1_Enabled (0x1UL)  /*!< Retention enabled                                                    */

/* TDD @Bit 15 : Enable retention for GPIO registers for TDD */
  #define GPIO_RETAIN_TDD_Pos (15UL)                 /*!< Position of TDD field.                                               */
  #define GPIO_RETAIN_TDD_Msk (0x1UL << GPIO_RETAIN_TDD_Pos) /*!< Bit mask of TDD field.                                       */
  #define GPIO_RETAIN_TDD_Min (0x0UL)                /*!< Min enumerator value of TDD field.                                   */
  #define GPIO_RETAIN_TDD_Max (0x1UL)                /*!< Max enumerator value of TDD field.                                   */
  #define GPIO_RETAIN_TDD_Disabled (0x0UL)           /*!< Retention disabled                                                   */
  #define GPIO_RETAIN_TDD_Enabled (0x1UL)            /*!< Retention enabled                                                    */


/* GPIO_PIN_CNF: Pin n configuration of GPIO pin */
  #define GPIO_PIN_CNF_MaxCount (32UL)               /*!< Max size of PIN_CNF[32] array.                                       */
  #define GPIO_PIN_CNF_ResetValue (0x00000002UL)     /*!< Reset value of PIN_CNF[32] register.                                 */

