adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ANAEN1 @Bit 21 : Control of analog slices for pads with ATB functionality. LSB in ANAEN control slice 0, and so on. */
  #define GPIO_PIN_CNF_ANAEN1_Pos (21UL)             /*!< Position of ANAEN1 field.                                            */
  #define GPIO_PIN_CNF_ANAEN1_Msk (0x1UL << GPIO_PIN_CNF_ANAEN1_Pos) /*!< Bit mask of ANAEN1 field.                            */
  #define GPIO_PIN_CNF_ANAEN1_Min (0x0UL)            /*!< Min enumerator value of ANAEN1 field.                                */
  #define GPIO_PIN_CNF_ANAEN1_Max (0x1UL)            /*!< Max enumerator value of ANAEN1 field.                                */
  #define GPIO_PIN_CNF_ANAEN1_Disabled (0x0UL)       /*!< Slice disabled                                                       */
  #define GPIO_PIN_CNF_ANAEN1_Enabled (0x1UL)        /*!< Slice enabled                                                        */

/* ANAEN2 @Bit 22 : Control of analog slices for pads with ATB functionality. LSB in ANAEN control slice 0, and so on. */
  #define GPIO_PIN_CNF_ANAEN2_Pos (22UL)             /*!< Position of ANAEN2 field.                                            */
  #define GPIO_PIN_CNF_ANAEN2_Msk (0x1UL << GPIO_PIN_CNF_ANAEN2_Pos) /*!< Bit mask of ANAEN2 field.                            */
  #define GPIO_PIN_CNF_ANAEN2_Min (0x0UL)            /*!< Min enumerator value of ANAEN2 field.                                */
  #define GPIO_PIN_CNF_ANAEN2_Max (0x1UL)            /*!< Max enumerator value of ANAEN2 field.                                */
  #define GPIO_PIN_CNF_ANAEN2_Disabled (0x0UL)       /*!< Slice disabled                                                       */
  #define GPIO_PIN_CNF_ANAEN2_Enabled (0x1UL)        /*!< Slice enabled                                                        */

/* ANAEN3 @Bit 23 : Control of analog slices for pads with ATB functionality. LSB in ANAEN control slice 0, and so on. */
  #define GPIO_PIN_CNF_ANAEN3_Pos (23UL)             /*!< Position of ANAEN3 field.                                            */
  #define GPIO_PIN_CNF_ANAEN3_Msk (0x1UL << GPIO_PIN_CNF_ANAEN3_Pos) /*!< Bit mask of ANAEN3 field.                            */
  #define GPIO_PIN_CNF_ANAEN3_Min (0x0UL)            /*!< Min enumerator value of ANAEN3 field.                                */
  #define GPIO_PIN_CNF_ANAEN3_Max (0x1UL)            /*!< Max enumerator value of ANAEN3 field.                                */
  #define GPIO_PIN_CNF_ANAEN3_Disabled (0x0UL)       /*!< Slice disabled                                                       */
  #define GPIO_PIN_CNF_ANAEN3_Enabled (0x1UL)        /*!< Slice enabled                                                        */

/* ANAEN4 @Bit 24 : Control of analog slices for pads with ATB functionality. LSB in ANAEN control slice 0, and so on. */
  #define GPIO_PIN_CNF_ANAEN4_Pos (24UL)             /*!< Position of ANAEN4 field.                                            */
  #define GPIO_PIN_CNF_ANAEN4_Msk (0x1UL << GPIO_PIN_CNF_ANAEN4_Pos) /*!< Bit mask of ANAEN4 field.                            */
  #define GPIO_PIN_CNF_ANAEN4_Min (0x0UL)            /*!< Min enumerator value of ANAEN4 field.                                */
  #define GPIO_PIN_CNF_ANAEN4_Max (0x1UL)            /*!< Max enumerator value of ANAEN4 field.                                */
  #define GPIO_PIN_CNF_ANAEN4_Disabled (0x0UL)       /*!< Slice disabled                                                       */
  #define GPIO_PIN_CNF_ANAEN4_Enabled (0x1UL)        /*!< Slice enabled                                                        */

/* ANAEN5 @Bit 25 : Control of analog slices for pads with ATB functionality. LSB in ANAEN control slice 0, and so on. */
  #define GPIO_PIN_CNF_ANAEN5_Pos (25UL)             /*!< Position of ANAEN5 field.                                            */
  #define GPIO_PIN_CNF_ANAEN5_Msk (0x1UL << GPIO_PIN_CNF_ANAEN5_Pos) /*!< Bit mask of ANAEN5 field.                            */
  #define GPIO_PIN_CNF_ANAEN5_Min (0x0UL)            /*!< Min enumerator value of ANAEN5 field.                                */
  #define GPIO_PIN_CNF_ANAEN5_Max (0x1UL)            /*!< Max enumerator value of ANAEN5 field.                                */
  #define GPIO_PIN_CNF_ANAEN5_Disabled (0x0UL)       /*!< Slice disabled                                                       */
  #define GPIO_PIN_CNF_ANAEN5_Enabled (0x1UL)        /*!< Slice enabled                                                        */

/* ANAEN6 @Bit 26 : Control of analog slices for pads with ATB functionality. LSB in ANAEN control slice 0, and so on. */
  #define GPIO_PIN_CNF_ANAEN6_Pos (26UL)             /*!< Position of ANAEN6 field.                                            */
  #define GPIO_PIN_CNF_ANAEN6_Msk (0x1UL << GPIO_PIN_CNF_ANAEN6_Pos) /*!< Bit mask of ANAEN6 field.                            */
  #define GPIO_PIN_CNF_ANAEN6_Min (0x0UL)            /*!< Min enumerator value of ANAEN6 field.                                */
  #define GPIO_PIN_CNF_ANAEN6_Max (0x1UL)            /*!< Max enumerator value of ANAEN6 field.                                */
  #define GPIO_PIN_CNF_ANAEN6_Disabled (0x0UL)       /*!< Slice disabled                                                       */
  #define GPIO_PIN_CNF_ANAEN6_Enabled (0x1UL)        /*!< Slice enabled                                                        */

/* ANAEN7 @Bit 27 : Control of analog slices for pads with ATB functionality. LSB in ANAEN control slice 0, and so on. */
  #define GPIO_PIN_CNF_ANAEN7_Pos (27UL)             /*!< Position of ANAEN7 field.                                            */
  #define GPIO_PIN_CNF_ANAEN7_Msk (0x1UL << GPIO_PIN_CNF_ANAEN7_Pos) /*!< Bit mask of ANAEN7 field.                            */
  #define GPIO_PIN_CNF_ANAEN7_Min (0x0UL)            /*!< Min enumerator value of ANAEN7 field.                                */
  #define GPIO_PIN_CNF_ANAEN7_Max (0x1UL)            /*!< Max enumerator value of ANAEN7 field.                                */
  #define GPIO_PIN_CNF_ANAEN7_Disabled (0x0UL)       /*!< Slice disabled                                                       */
  #define GPIO_PIN_CNF_ANAEN7_Enabled (0x1UL)        /*!< Slice enabled                                                        */

/* CTRLSEL @Bits 28..30 : Select which MCU/Subsystem controls this pin */
  #define GPIO_PIN_CNF_CTRLSEL_Pos (28UL)            /*!< Position of CTRLSEL field.                                           */
  #define GPIO_PIN_CNF_CTRLSEL_Msk (0x7UL << GPIO_PIN_CNF_CTRLSEL_Pos) /*!< Bit mask of CTRLSEL field.                         */
  #define GPIO_PIN_CNF_CTRLSEL_Min (0x0UL)           /*!< Min enumerator value of CTRLSEL field.                               */
  #define GPIO_PIN_CNF_CTRLSEL_Max (0x7UL)           /*!< Max enumerator value of CTRLSEL field.                               */
  #define GPIO_PIN_CNF_CTRLSEL_GPIO (0x0UL)          /*!< GPIO peripheral                                                      */
  #define GPIO_PIN_CNF_CTRLSEL_VPR (0x1UL)           /*!< VPR processor                                                        */
  #define GPIO_PIN_CNF_CTRLSEL_GRC (0x1UL)           /*!< GRC system                                                           */
  #define GPIO_PIN_CNF_CTRLSEL_SecureDomain (0x2UL)  /*!< Secure Domain                                                        */
  #define GPIO_PIN_CNF_CTRLSEL_PWM (0x2UL)           /*!< PWM peripheral                                                       */
  #define GPIO_PIN_CNF_CTRLSEL_I3C (0x2UL)           /*!< I3C peripheral                                                       */
  #define GPIO_PIN_CNF_CTRLSEL_Serial (0x3UL)        /*!< SPIM/SPIS/TWIM/TWIS/UARTE peripheral                                 */
  #define GPIO_PIN_CNF_CTRLSEL_HSSPI (0x3UL)         /*!< High-speed SPI peripheral                                            */
  #define GPIO_PIN_CNF_CTRLSEL_RadioCore (0x4UL)     /*!< Radio Core                                                           */
  #define GPIO_PIN_CNF_CTRLSEL_EXMIF (0x4UL)         /*!< EXMIF peripheral                                                     */
  #define GPIO_PIN_CNF_CTRLSEL_CELL (0x4UL)          /*!< Cellular specific (Halti-only)                                       */
  #define GPIO_PIN_CNF_CTRLSEL_DTB (0x6UL)           /*!< Digital Test Bus                                                     */
  #define GPIO_PIN_CNF_CTRLSEL_TND (0x7UL)           /*!< Trace and Debug Subsystem                                            */

/* CLOCKPIN @Bit 31 : Enable clock on the pin. */
  #define GPIO_PIN_CNF_CLOCKPIN_Pos (31UL)           /*!< Position of CLOCKPIN field.                                          */
  #define GPIO_PIN_CNF_CLOCKPIN_Msk (0x1UL << GPIO_PIN_CNF_CLOCKPIN_Pos) /*!< Bit mask of CLOCKPIN field.                      */
  #define GPIO_PIN_CNF_CLOCKPIN_Min (0x0UL)          /*!< Min enumerator value of CLOCKPIN field.                              */
  #define GPIO_PIN_CNF_CLOCKPIN_Max (0x1UL)          /*!< Max enumerator value of CLOCKPIN field.                              */
  #define GPIO_PIN_CNF_CLOCKPIN_Disabled (0x0UL)     /*!< Clock disabled                                                       */
  #define GPIO_PIN_CNF_CLOCKPIN_Enabled (0x1UL)      /*!< Clock enabled                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                       GPIOINTERNAL                                       ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

