adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ================================================ Struct GPIOINTERNAL_PCGC ================================================= */
/**
  * @brief PCGC [GPIOINTERNAL_PCGC] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIGZEROPENALTY;                   /*!< (@ 0x00000000) Trigger zero penalty                                  */
  __IM  uint32_t  TRIGFULLPENALTY;                   /*!< (@ 0x00000004) Trigger full penalty                                  */
  __IM  uint32_t  PENALTY[2];                        /*!< (@ 0x00000008) Penalty level for power/clock pair n                  */
  __IM  uint32_t  FORCEOVERRIDE[2];                  /*!< (@ 0x00000010) Force override of power/clock pair n                  */
} NRF_GPIOINTERNAL_PCGC_Type;                        /*!< Size = 24 (0x018)                                                    */

/* GPIOINTERNAL_PCGC_TRIGZEROPENALTY: Trigger zero penalty */
  #define GPIOINTERNAL_PCGC_TRIGZEROPENALTY_ResetValue (0x00000000UL) /*!< Reset value of TRIGZEROPENALTY register.            */

/* TRIGGER @Bit 0 : TRIGGER */
  #define GPIOINTERNAL_PCGC_TRIGZEROPENALTY_TRIGGER_Pos (0UL) /*!< Position of TRIGGER field.                                  */
  #define GPIOINTERNAL_PCGC_TRIGZEROPENALTY_TRIGGER_Msk (0x1UL << GPIOINTERNAL_PCGC_TRIGZEROPENALTY_TRIGGER_Pos) /*!< Bit mask
                                                                            of TRIGGER field.*/                                   
  #define GPIOINTERNAL_PCGC_TRIGZEROPENALTY_TRIGGER_Min (0x1UL) /*!< Min enumerator value of TRIGGER field.                    */
  #define GPIOINTERNAL_PCGC_TRIGZEROPENALTY_TRIGGER_Max (0x1UL) /*!< Max enumerator value of TRIGGER field.                    */
  #define GPIOINTERNAL_PCGC_TRIGZEROPENALTY_TRIGGER_Enable (0x1UL) /*!< Trigger zero penalty                                   */


/* GPIOINTERNAL_PCGC_TRIGFULLPENALTY: Trigger full penalty */
  #define GPIOINTERNAL_PCGC_TRIGFULLPENALTY_ResetValue (0x00000000UL) /*!< Reset value of TRIGFULLPENALTY register.            */

/* TRIGGER @Bit 0 : TRIGGER */
  #define GPIOINTERNAL_PCGC_TRIGFULLPENALTY_TRIGGER_Pos (0UL) /*!< Position of TRIGGER field.                                  */
  #define GPIOINTERNAL_PCGC_TRIGFULLPENALTY_TRIGGER_Msk (0x1UL << GPIOINTERNAL_PCGC_TRIGFULLPENALTY_TRIGGER_Pos) /*!< Bit mask
                                                                            of TRIGGER field.*/                                   
  #define GPIOINTERNAL_PCGC_TRIGFULLPENALTY_TRIGGER_Min (0x1UL) /*!< Min enumerator value of TRIGGER field.                    */
  #define GPIOINTERNAL_PCGC_TRIGFULLPENALTY_TRIGGER_Max (0x1UL) /*!< Max enumerator value of TRIGGER field.                    */
  #define GPIOINTERNAL_PCGC_TRIGFULLPENALTY_TRIGGER_Enable (0x1UL) /*!< Trigger full penalty                                   */


/* GPIOINTERNAL_PCGC_PENALTY: Penalty level for power/clock pair n */
  #define GPIOINTERNAL_PCGC_PENALTY_MaxCount (2UL)   /*!< Max size of PENALTY[2] array.                                        */
  #define GPIOINTERNAL_PCGC_PENALTY_ResetValue (0x00000000UL) /*!< Reset value of PENALTY[2] register.                         */

/* PENALTY @Bits 0..7 : Penalty level */
  #define GPIOINTERNAL_PCGC_PENALTY_PENALTY_Pos (0UL) /*!< Position of PENALTY field.                                          */
  #define GPIOINTERNAL_PCGC_PENALTY_PENALTY_Msk (0xFFUL << GPIOINTERNAL_PCGC_PENALTY_PENALTY_Pos) /*!< Bit mask of PENALTY
                                                                            field.*/                                              


/* GPIOINTERNAL_PCGC_FORCEOVERRIDE: Force override of power/clock pair n */
  #define GPIOINTERNAL_PCGC_FORCEOVERRIDE_MaxCount (2UL) /*!< Max size of FORCEOVERRIDE[2] array.                              */
  #define GPIOINTERNAL_PCGC_FORCEOVERRIDE_ResetValue (0x00000000UL) /*!< Reset value of FORCEOVERRIDE[2] register.             */

/* CLOCKFORCINGPRE @Bits 0..3 : CLOCKFORCINGPRE */
  #define GPIOINTERNAL_PCGC_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos (0UL) /*!< Position of CLOCKFORCINGPRE field.                    */
  #define GPIOINTERNAL_PCGC_FORCEOVERRIDE_CLOCKFORCINGPRE_Msk (0xFUL << GPIOINTERNAL_PCGC_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos)
                                                                            /*!< Bit mask of CLOCKFORCINGPRE field.*/             

/* DOFORCECLOCKPRE @Bit 7 : DOFORCECLOCKPRE */
  #define GPIOINTERNAL_PCGC_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos (7UL) /*!< Position of DOFORCECLOCKPRE field.                    */
  #define GPIOINTERNAL_PCGC_FORCEOVERRIDE_DOFORCECLOCKPRE_Msk (0x1UL << GPIOINTERNAL_PCGC_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos)
                                                                            /*!< Bit mask of DOFORCECLOCKPRE field.*/             

/* POWERFORCINGPRE @Bits 8..9 : POWERFORCINGPRE */
  #define GPIOINTERNAL_PCGC_FORCEOVERRIDE_POWERFORCINGPRE_Pos (8UL) /*!< Position of POWERFORCINGPRE field.                    */
  #define GPIOINTERNAL_PCGC_FORCEOVERRIDE_POWERFORCINGPRE_Msk (0x3UL << GPIOINTERNAL_PCGC_FORCEOVERRIDE_POWERFORCINGPRE_Pos)
                                                                            /*!< Bit mask of POWERFORCINGPRE field.*/             

/* DOFORCEPOWERPRE @Bit 15 : DOFORCEPOWERPRE */
  #define GPIOINTERNAL_PCGC_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos (15UL) /*!< Position of DOFORCEPOWERPRE field.                   */
  #define GPIOINTERNAL_PCGC_FORCEOVERRIDE_DOFORCEPOWERPRE_Msk (0x1UL << GPIOINTERNAL_PCGC_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos)
                                                                            /*!< Bit mask of DOFORCEPOWERPRE field.*/             


/* =================================================== Struct GPIOINTERNAL =================================================== */
/**
  * @brief GPIO Internal
  */
  typedef struct {                                   /*!< GPIOINTERNAL Structure                                               */
    __IM uint32_t RESERVED[16];
    __IOM uint32_t LATCHCLRWAITCNT;                  /*!< (@ 0x00000040) Select the number of wait cycles inserted on the bus
                                                                         when a LATCH register is cleared.*/                      
    __IOM uint32_t FORCELDETECTLOWCNT;               /*!< (@ 0x00000044) Select the number of cycles that LDETECT is forced low
                                                                         after clearing a LATCH register.*/                       
    __IOM uint32_t RESET;                            /*!< (@ 0x00000048) Reset all GPIO registers.                             */
    __IOM uint32_t SENSECONFIGCHANGECNT;             /*!< (@ 0x0000004C) Selects the number of cycles before the SENSE
                                                                         configuration takes effect when it is changed. Setting
                                                                         this register lower than the reset value can lead to
                                                                         unwanted LATCH set when SENSE and INPUT fields
                                                                         (PIN[n].CNF) are changed simultaneously.*/               
    __IOM NRF_GPIOINTERNAL_PCGC_Type PCGC;           /*!< (@ 0x00000050) (unspecified)                                         */
  } NRF_GPIOINTERNAL_Type;                           /*!< Size = 104 (0x068)                                                   */

/* GPIOINTERNAL_LATCHCLRWAITCNT: Select the number of wait cycles inserted on the bus when a LATCH register is cleared. */
  #define GPIOINTERNAL_LATCHCLRWAITCNT_ResetValue (0x00000002UL) /*!< Reset value of LATCHCLRWAITCNT register.                 */

