adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LATCHCLRWAITCNT @Bits 0..1 : Select the number of wait cycles inserted on the bus when a LATCH register is cleared. */
  #define GPIOINTERNAL_LATCHCLRWAITCNT_LATCHCLRWAITCNT_Pos (0UL) /*!< Position of LATCHCLRWAITCNT field.                       */
  #define GPIOINTERNAL_LATCHCLRWAITCNT_LATCHCLRWAITCNT_Msk (0x3UL << GPIOINTERNAL_LATCHCLRWAITCNT_LATCHCLRWAITCNT_Pos) /*!< Bit
                                                                            mask of LATCHCLRWAITCNT field.*/                      
  #define GPIOINTERNAL_LATCHCLRWAITCNT_LATCHCLRWAITCNT_Min (0x0UL) /*!< Min value of LATCHCLRWAITCNT field.                    */
  #define GPIOINTERNAL_LATCHCLRWAITCNT_LATCHCLRWAITCNT_Max (0x3UL) /*!< Max size of LATCHCLRWAITCNT field.                     */


/* GPIOINTERNAL_FORCELDETECTLOWCNT: Select the number of cycles that LDETECT is forced low after clearing a LATCH register. */
  #define GPIOINTERNAL_FORCELDETECTLOWCNT_ResetValue (0x00000008UL) /*!< Reset value of FORCELDETECTLOWCNT register.           */

/* FORCELDETECTLOWCNT @Bits 0..3 : Select the number of cycles that LDETECT is forced low after clearing a LATCH register. */
  #define GPIOINTERNAL_FORCELDETECTLOWCNT_FORCELDETECTLOWCNT_Pos (0UL) /*!< Position of FORCELDETECTLOWCNT field.              */
  #define GPIOINTERNAL_FORCELDETECTLOWCNT_FORCELDETECTLOWCNT_Msk (0xFUL << GPIOINTERNAL_FORCELDETECTLOWCNT_FORCELDETECTLOWCNT_Pos)
                                                                            /*!< Bit mask of FORCELDETECTLOWCNT field.*/          
  #define GPIOINTERNAL_FORCELDETECTLOWCNT_FORCELDETECTLOWCNT_Min (0x0UL) /*!< Min value of FORCELDETECTLOWCNT field.           */
  #define GPIOINTERNAL_FORCELDETECTLOWCNT_FORCELDETECTLOWCNT_Max (0xFUL) /*!< Max size of FORCELDETECTLOWCNT field.            */


/* GPIOINTERNAL_RESET: Reset all GPIO registers. */
  #define GPIOINTERNAL_RESET_ResetValue (0x00000000UL) /*!< Reset value of RESET register.                                     */

/* RESET @Bit 0 : Reset all GPIO registers. */
  #define GPIOINTERNAL_RESET_RESET_Pos (0UL)         /*!< Position of RESET field.                                             */
  #define GPIOINTERNAL_RESET_RESET_Msk (0x1UL << GPIOINTERNAL_RESET_RESET_Pos) /*!< Bit mask of RESET field.                   */
  #define GPIOINTERNAL_RESET_RESET_Min (0x0UL)       /*!< Min enumerator value of RESET field.                                 */
  #define GPIOINTERNAL_RESET_RESET_Max (0x1UL)       /*!< Max enumerator value of RESET field.                                 */
  #define GPIOINTERNAL_RESET_RESET_RESET (0x1UL)     /*!< Trigger reset                                                        */
  #define GPIOINTERNAL_RESET_RESET_NA (0x0UL)        /*!< No effect                                                            */


/* GPIOINTERNAL_SENSECONFIGCHANGECNT: Selects the number of cycles before the SENSE configuration takes effect when it is
                                       changed. Setting this register lower than the reset value can lead to unwanted LATCH set
                                       when SENSE and INPUT fields (PIN[n].CNF) are changed simultaneously. */                    
                                                                                                                                  
  #define GPIOINTERNAL_SENSECONFIGCHANGECNT_ResetValue (0x00000003UL) /*!< Reset value of SENSECONFIGCHANGECNT register.       */

/* SENSECONFIGCHANGECNT @Bits 0..2 : Selects the number of cycles before the SENSE configuration takes effect when it is
                                     changed. */                                                                                  
                                                                                                                                  
  #define GPIOINTERNAL_SENSECONFIGCHANGECNT_SENSECONFIGCHANGECNT_Pos (0UL) /*!< Position of SENSECONFIGCHANGECNT field.        */
  #define GPIOINTERNAL_SENSECONFIGCHANGECNT_SENSECONFIGCHANGECNT_Msk (0x7UL << GPIOINTERNAL_SENSECONFIGCHANGECNT_SENSECONFIGCHANGECNT_Pos)
                                                                            /*!< Bit mask of SENSECONFIGCHANGECNT field.*/        
  #define GPIOINTERNAL_SENSECONFIGCHANGECNT_SENSECONFIGCHANGECNT_Min (0x0UL) /*!< Min value of SENSECONFIGCHANGECNT field.     */
  #define GPIOINTERNAL_SENSECONFIGCHANGECNT_SENSECONFIGCHANGECNT_Max (0x7UL) /*!< Max size of SENSECONFIGCHANGECNT field.      */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          GPIOTE                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct GPIOTE ====================================================== */
/**
  * @brief GPIO Tasks and Events
  */
  typedef struct {                                   /*!< GPIOTE Structure                                                     */
    __OM uint32_t TASKS_OUT[8];                      /*!< (@ 0x00000000) Task for writing to pin specified in CONFIG[n].PSEL.
                                                                         Action on pin is configured in CONFIG[n].POLARITY.*/     
    __IM uint32_t RESERVED[4];
    __OM uint32_t TASKS_SET[8];                      /*!< (@ 0x00000030) Task for writing to pin specified in CONFIG[n].PSEL.
                                                                         Action on pin is to set it high.*/                       
    __IM uint32_t RESERVED1[4];
    __OM uint32_t TASKS_CLR[8];                      /*!< (@ 0x00000060) Task for writing to pin specified in CONFIG[n].PSEL.
                                                                         Action on pin is to set it low.*/                        
    __IOM uint32_t SUBSCRIBE_OUT[8];                 /*!< (@ 0x00000080) Subscribe configuration for task OUT[n]               */
    __IM uint32_t RESERVED2[4];
    __IOM uint32_t SUBSCRIBE_SET[8];                 /*!< (@ 0x000000B0) Subscribe configuration for task SET[n]               */
    __IM uint32_t RESERVED3[4];
    __IOM uint32_t SUBSCRIBE_CLR[8];                 /*!< (@ 0x000000E0) Subscribe configuration for task CLR[n]               */
    __IOM uint32_t EVENTS_IN[8];                     /*!< (@ 0x00000100) Event generated from pin specified in CONFIG[n].PSEL  */
    __IM uint32_t RESERVED4[8];
    __IOM uint32_t EVENTS_PORT[16];                  /*!< (@ 0x00000140) Event generated from multiple input GPIO pins with
                                                                         SENSE mechanism enabled*/                                
    __IOM uint32_t PUBLISH_IN[8];                    /*!< (@ 0x00000180) Publish configuration for event IN[n]                 */
    __IM uint32_t RESERVED5[8];
    __IOM uint32_t PUBLISH_PORT[16];                 /*!< (@ 0x000001C0) Publish configuration for event PORT[n]               */
    __IM uint32_t RESERVED6[64];
    __IOM uint32_t INTEN0;                           /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET0;                        /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR0;                        /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED7;
    __IOM uint32_t INTEN1;                           /*!< (@ 0x00000310) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET1;                        /*!< (@ 0x00000314) Enable interrupt                                      */
    __IOM uint32_t INTENCLR1;                        /*!< (@ 0x00000318) Disable interrupt                                     */
    __IM uint32_t RESERVED8;
    __IOM uint32_t INTEN2;                           /*!< (@ 0x00000320) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET2;                        /*!< (@ 0x00000324) Enable interrupt                                      */
    __IOM uint32_t INTENCLR2;                        /*!< (@ 0x00000328) Disable interrupt                                     */
    __IM uint32_t RESERVED9;
    __IOM uint32_t INTEN3;                           /*!< (@ 0x00000330) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET3;                        /*!< (@ 0x00000334) Enable interrupt                                      */
    __IOM uint32_t INTENCLR3;                        /*!< (@ 0x00000338) Disable interrupt                                     */
    __IM uint32_t RESERVED10;
    __IOM uint32_t INTEN4;                           /*!< (@ 0x00000340) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET4;                        /*!< (@ 0x00000344) Enable interrupt                                      */
    __IOM uint32_t INTENCLR4;                        /*!< (@ 0x00000348) Disable interrupt                                     */
    __IM uint32_t RESERVED11;
    __IOM uint32_t INTEN5;                           /*!< (@ 0x00000350) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET5;                        /*!< (@ 0x00000354) Enable interrupt                                      */
    __IOM uint32_t INTENCLR5;                        /*!< (@ 0x00000358) Disable interrupt                                     */
    __IM uint32_t RESERVED12;
    __IOM uint32_t INTEN6;                           /*!< (@ 0x00000360) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET6;                        /*!< (@ 0x00000364) Enable interrupt                                      */
    __IOM uint32_t INTENCLR6;                        /*!< (@ 0x00000368) Disable interrupt                                     */
    __IM uint32_t RESERVED13[102];
    __IOM uint32_t LATENCY;                          /*!< (@ 0x00000504) Latency selection for Event mode (MODE=Event) with
                                                                         rising or falling edge detection on the pin.*/           
    __IM uint32_t RESERVED14[2];
    __IOM uint32_t CONFIG[8];                        /*!< (@ 0x00000510) Configuration for OUT[n], SET[n], and CLR[n] tasks and
                                                                         IN[n] event*/                                            
    __IM uint32_t RESERVED15[52];
    __IOM uint32_t DEBOUNCE[8];                      /*!< (@ 0x00000600) Debounce mode for GPIOTE channel n                    */
  } NRF_GPIOTE_Type;                                 /*!< Size = 1568 (0x620)                                                  */

/* GPIOTE_TASKS_OUT: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is configured in CONFIG[n].POLARITY. */
  #define GPIOTE_TASKS_OUT_MaxCount (8UL)            /*!< Max size of TASKS_OUT[8] array.                                      */
  #define GPIOTE_TASKS_OUT_ResetValue (0x00000000UL) /*!< Reset value of TASKS_OUT[8] register.                                */

/* TASKS_OUT @Bit 0 : Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is configured in CONFIG[n].POLARITY. */
  #define GPIOTE_TASKS_OUT_TASKS_OUT_Pos (0UL)       /*!< Position of TASKS_OUT field.                                         */
  #define GPIOTE_TASKS_OUT_TASKS_OUT_Msk (0x1UL << GPIOTE_TASKS_OUT_TASKS_OUT_Pos) /*!< Bit mask of TASKS_OUT field.           */
  #define GPIOTE_TASKS_OUT_TASKS_OUT_Min (0x1UL)     /*!< Min enumerator value of TASKS_OUT field.                             */
  #define GPIOTE_TASKS_OUT_TASKS_OUT_Max (0x1UL)     /*!< Max enumerator value of TASKS_OUT field.                             */
  #define GPIOTE_TASKS_OUT_TASKS_OUT_Trigger (0x1UL) /*!< Trigger task                                                         */


/* GPIOTE_TASKS_SET: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it high. */
  #define GPIOTE_TASKS_SET_MaxCount (8UL)            /*!< Max size of TASKS_SET[8] array.                                      */
  #define GPIOTE_TASKS_SET_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SET[8] register.                                */

/* TASKS_SET @Bit 0 : Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it high. */
  #define GPIOTE_TASKS_SET_TASKS_SET_Pos (0UL)       /*!< Position of TASKS_SET field.                                         */
  #define GPIOTE_TASKS_SET_TASKS_SET_Msk (0x1UL << GPIOTE_TASKS_SET_TASKS_SET_Pos) /*!< Bit mask of TASKS_SET field.           */
  #define GPIOTE_TASKS_SET_TASKS_SET_Min (0x1UL)     /*!< Min enumerator value of TASKS_SET field.                             */
  #define GPIOTE_TASKS_SET_TASKS_SET_Max (0x1UL)     /*!< Max enumerator value of TASKS_SET field.                             */
  #define GPIOTE_TASKS_SET_TASKS_SET_Trigger (0x1UL) /*!< Trigger task                                                         */


/* GPIOTE_TASKS_CLR: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it low. */
  #define GPIOTE_TASKS_CLR_MaxCount (8UL)            /*!< Max size of TASKS_CLR[8] array.                                      */
  #define GPIOTE_TASKS_CLR_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CLR[8] register.                                */

/* TASKS_CLR @Bit 0 : Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it low. */
  #define GPIOTE_TASKS_CLR_TASKS_CLR_Pos (0UL)       /*!< Position of TASKS_CLR field.                                         */
  #define GPIOTE_TASKS_CLR_TASKS_CLR_Msk (0x1UL << GPIOTE_TASKS_CLR_TASKS_CLR_Pos) /*!< Bit mask of TASKS_CLR field.           */
  #define GPIOTE_TASKS_CLR_TASKS_CLR_Min (0x1UL)     /*!< Min enumerator value of TASKS_CLR field.                             */
  #define GPIOTE_TASKS_CLR_TASKS_CLR_Max (0x1UL)     /*!< Max enumerator value of TASKS_CLR field.                             */
  #define GPIOTE_TASKS_CLR_TASKS_CLR_Trigger (0x1UL) /*!< Trigger task                                                         */


/* GPIOTE_SUBSCRIBE_OUT: Subscribe configuration for task OUT[n] */
  #define GPIOTE_SUBSCRIBE_OUT_MaxCount (8UL)        /*!< Max size of SUBSCRIBE_OUT[8] array.                                  */
  #define GPIOTE_SUBSCRIBE_OUT_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_OUT[8] register.                        */

