adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GPIOTE_PUBLISH_PORT: Publish configuration for event PORT[n] */
  #define GPIOTE_PUBLISH_PORT_MaxCount (16UL)        /*!< Max size of PUBLISH_PORT[16] array.                                  */
  #define GPIOTE_PUBLISH_PORT_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_PORT[16] register.                         */

/* CHIDX @Bits 0..7 : DPPI channel that event PORT[n] will publish to */
  #define GPIOTE_PUBLISH_PORT_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define GPIOTE_PUBLISH_PORT_CHIDX_Msk (0xFFUL << GPIOTE_PUBLISH_PORT_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define GPIOTE_PUBLISH_PORT_CHIDX_Min (0x0UL)      /*!< Min value of CHIDX field.                                            */
  #define GPIOTE_PUBLISH_PORT_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define GPIOTE_PUBLISH_PORT_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define GPIOTE_PUBLISH_PORT_EN_Msk (0x1UL << GPIOTE_PUBLISH_PORT_EN_Pos) /*!< Bit mask of EN field.                          */
  #define GPIOTE_PUBLISH_PORT_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define GPIOTE_PUBLISH_PORT_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define GPIOTE_PUBLISH_PORT_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define GPIOTE_PUBLISH_PORT_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* GPIOTE_INTEN0: Enable or disable interrupt */
  #define GPIOTE_INTEN0_ResetValue (0x00000000UL)    /*!< Reset value of INTEN0 register.                                      */

/* IN0 @Bit 0 : Enable or disable interrupt for event IN[0] */
  #define GPIOTE_INTEN0_IN0_Pos (0UL)                /*!< Position of IN0 field.                                               */
  #define GPIOTE_INTEN0_IN0_Msk (0x1UL << GPIOTE_INTEN0_IN0_Pos) /*!< Bit mask of IN0 field.                                   */
  #define GPIOTE_INTEN0_IN0_Min (0x0UL)              /*!< Min enumerator value of IN0 field.                                   */
  #define GPIOTE_INTEN0_IN0_Max (0x1UL)              /*!< Max enumerator value of IN0 field.                                   */
  #define GPIOTE_INTEN0_IN0_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN0_IN0_Enabled (0x1UL)          /*!< Enable                                                               */

/* IN1 @Bit 1 : Enable or disable interrupt for event IN[1] */
  #define GPIOTE_INTEN0_IN1_Pos (1UL)                /*!< Position of IN1 field.                                               */
  #define GPIOTE_INTEN0_IN1_Msk (0x1UL << GPIOTE_INTEN0_IN1_Pos) /*!< Bit mask of IN1 field.                                   */
  #define GPIOTE_INTEN0_IN1_Min (0x0UL)              /*!< Min enumerator value of IN1 field.                                   */
  #define GPIOTE_INTEN0_IN1_Max (0x1UL)              /*!< Max enumerator value of IN1 field.                                   */
  #define GPIOTE_INTEN0_IN1_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN0_IN1_Enabled (0x1UL)          /*!< Enable                                                               */

/* IN2 @Bit 2 : Enable or disable interrupt for event IN[2] */
  #define GPIOTE_INTEN0_IN2_Pos (2UL)                /*!< Position of IN2 field.                                               */
  #define GPIOTE_INTEN0_IN2_Msk (0x1UL << GPIOTE_INTEN0_IN2_Pos) /*!< Bit mask of IN2 field.                                   */
  #define GPIOTE_INTEN0_IN2_Min (0x0UL)              /*!< Min enumerator value of IN2 field.                                   */
  #define GPIOTE_INTEN0_IN2_Max (0x1UL)              /*!< Max enumerator value of IN2 field.                                   */
  #define GPIOTE_INTEN0_IN2_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN0_IN2_Enabled (0x1UL)          /*!< Enable                                                               */

/* IN3 @Bit 3 : Enable or disable interrupt for event IN[3] */
  #define GPIOTE_INTEN0_IN3_Pos (3UL)                /*!< Position of IN3 field.                                               */
  #define GPIOTE_INTEN0_IN3_Msk (0x1UL << GPIOTE_INTEN0_IN3_Pos) /*!< Bit mask of IN3 field.                                   */
  #define GPIOTE_INTEN0_IN3_Min (0x0UL)              /*!< Min enumerator value of IN3 field.                                   */
  #define GPIOTE_INTEN0_IN3_Max (0x1UL)              /*!< Max enumerator value of IN3 field.                                   */
  #define GPIOTE_INTEN0_IN3_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN0_IN3_Enabled (0x1UL)          /*!< Enable                                                               */

/* IN4 @Bit 4 : Enable or disable interrupt for event IN[4] */
  #define GPIOTE_INTEN0_IN4_Pos (4UL)                /*!< Position of IN4 field.                                               */
  #define GPIOTE_INTEN0_IN4_Msk (0x1UL << GPIOTE_INTEN0_IN4_Pos) /*!< Bit mask of IN4 field.                                   */
  #define GPIOTE_INTEN0_IN4_Min (0x0UL)              /*!< Min enumerator value of IN4 field.                                   */
  #define GPIOTE_INTEN0_IN4_Max (0x1UL)              /*!< Max enumerator value of IN4 field.                                   */
  #define GPIOTE_INTEN0_IN4_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN0_IN4_Enabled (0x1UL)          /*!< Enable                                                               */

