adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* IN5 @Bit 5 : Enable or disable interrupt for event IN[5] */
  #define GPIOTE_INTEN0_IN5_Pos (5UL)                /*!< Position of IN5 field.                                               */
  #define GPIOTE_INTEN0_IN5_Msk (0x1UL << GPIOTE_INTEN0_IN5_Pos) /*!< Bit mask of IN5 field.                                   */
  #define GPIOTE_INTEN0_IN5_Min (0x0UL)              /*!< Min enumerator value of IN5 field.                                   */
  #define GPIOTE_INTEN0_IN5_Max (0x1UL)              /*!< Max enumerator value of IN5 field.                                   */
  #define GPIOTE_INTEN0_IN5_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN0_IN5_Enabled (0x1UL)          /*!< Enable                                                               */

/* IN6 @Bit 6 : Enable or disable interrupt for event IN[6] */
  #define GPIOTE_INTEN0_IN6_Pos (6UL)                /*!< Position of IN6 field.                                               */
  #define GPIOTE_INTEN0_IN6_Msk (0x1UL << GPIOTE_INTEN0_IN6_Pos) /*!< Bit mask of IN6 field.                                   */
  #define GPIOTE_INTEN0_IN6_Min (0x0UL)              /*!< Min enumerator value of IN6 field.                                   */
  #define GPIOTE_INTEN0_IN6_Max (0x1UL)              /*!< Max enumerator value of IN6 field.                                   */
  #define GPIOTE_INTEN0_IN6_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN0_IN6_Enabled (0x1UL)          /*!< Enable                                                               */

/* IN7 @Bit 7 : Enable or disable interrupt for event IN[7] */
  #define GPIOTE_INTEN0_IN7_Pos (7UL)                /*!< Position of IN7 field.                                               */
  #define GPIOTE_INTEN0_IN7_Msk (0x1UL << GPIOTE_INTEN0_IN7_Pos) /*!< Bit mask of IN7 field.                                   */
  #define GPIOTE_INTEN0_IN7_Min (0x0UL)              /*!< Min enumerator value of IN7 field.                                   */
  #define GPIOTE_INTEN0_IN7_Max (0x1UL)              /*!< Max enumerator value of IN7 field.                                   */
  #define GPIOTE_INTEN0_IN7_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN0_IN7_Enabled (0x1UL)          /*!< Enable                                                               */

/* PORT0 @Bit 16 : Enable or disable interrupt for event PORT[0] */
  #define GPIOTE_INTEN0_PORT0_Pos (16UL)             /*!< Position of PORT0 field.                                             */
  #define GPIOTE_INTEN0_PORT0_Msk (0x1UL << GPIOTE_INTEN0_PORT0_Pos) /*!< Bit mask of PORT0 field.                             */
  #define GPIOTE_INTEN0_PORT0_Min (0x0UL)            /*!< Min enumerator value of PORT0 field.                                 */
  #define GPIOTE_INTEN0_PORT0_Max (0x1UL)            /*!< Max enumerator value of PORT0 field.                                 */
  #define GPIOTE_INTEN0_PORT0_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN0_PORT0_Enabled (0x1UL)        /*!< Enable                                                               */

/* PORT1 @Bit 17 : Enable or disable interrupt for event PORT[1] */
  #define GPIOTE_INTEN0_PORT1_Pos (17UL)             /*!< Position of PORT1 field.                                             */
  #define GPIOTE_INTEN0_PORT1_Msk (0x1UL << GPIOTE_INTEN0_PORT1_Pos) /*!< Bit mask of PORT1 field.                             */
  #define GPIOTE_INTEN0_PORT1_Min (0x0UL)            /*!< Min enumerator value of PORT1 field.                                 */
  #define GPIOTE_INTEN0_PORT1_Max (0x1UL)            /*!< Max enumerator value of PORT1 field.                                 */
  #define GPIOTE_INTEN0_PORT1_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN0_PORT1_Enabled (0x1UL)        /*!< Enable                                                               */

/* PORT2 @Bit 18 : Enable or disable interrupt for event PORT[2] */
  #define GPIOTE_INTEN0_PORT2_Pos (18UL)             /*!< Position of PORT2 field.                                             */
  #define GPIOTE_INTEN0_PORT2_Msk (0x1UL << GPIOTE_INTEN0_PORT2_Pos) /*!< Bit mask of PORT2 field.                             */
  #define GPIOTE_INTEN0_PORT2_Min (0x0UL)            /*!< Min enumerator value of PORT2 field.                                 */
  #define GPIOTE_INTEN0_PORT2_Max (0x1UL)            /*!< Max enumerator value of PORT2 field.                                 */
  #define GPIOTE_INTEN0_PORT2_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN0_PORT2_Enabled (0x1UL)        /*!< Enable                                                               */

/* PORT3 @Bit 19 : Enable or disable interrupt for event PORT[3] */
  #define GPIOTE_INTEN0_PORT3_Pos (19UL)             /*!< Position of PORT3 field.                                             */
  #define GPIOTE_INTEN0_PORT3_Msk (0x1UL << GPIOTE_INTEN0_PORT3_Pos) /*!< Bit mask of PORT3 field.                             */
  #define GPIOTE_INTEN0_PORT3_Min (0x0UL)            /*!< Min enumerator value of PORT3 field.                                 */
  #define GPIOTE_INTEN0_PORT3_Max (0x1UL)            /*!< Max enumerator value of PORT3 field.                                 */
  #define GPIOTE_INTEN0_PORT3_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN0_PORT3_Enabled (0x1UL)        /*!< Enable                                                               */

/* PORT4 @Bit 20 : Enable or disable interrupt for event PORT[4] */
  #define GPIOTE_INTEN0_PORT4_Pos (20UL)             /*!< Position of PORT4 field.                                             */
  #define GPIOTE_INTEN0_PORT4_Msk (0x1UL << GPIOTE_INTEN0_PORT4_Pos) /*!< Bit mask of PORT4 field.                             */
  #define GPIOTE_INTEN0_PORT4_Min (0x0UL)            /*!< Min enumerator value of PORT4 field.                                 */
  #define GPIOTE_INTEN0_PORT4_Max (0x1UL)            /*!< Max enumerator value of PORT4 field.                                 */
  #define GPIOTE_INTEN0_PORT4_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN0_PORT4_Enabled (0x1UL)        /*!< Enable                                                               */

