adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PORT5 @Bit 21 : Enable or disable interrupt for event PORT[5] */
  #define GPIOTE_INTEN0_PORT5_Pos (21UL)             /*!< Position of PORT5 field.                                             */
  #define GPIOTE_INTEN0_PORT5_Msk (0x1UL << GPIOTE_INTEN0_PORT5_Pos) /*!< Bit mask of PORT5 field.                             */
  #define GPIOTE_INTEN0_PORT5_Min (0x0UL)            /*!< Min enumerator value of PORT5 field.                                 */
  #define GPIOTE_INTEN0_PORT5_Max (0x1UL)            /*!< Max enumerator value of PORT5 field.                                 */
  #define GPIOTE_INTEN0_PORT5_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN0_PORT5_Enabled (0x1UL)        /*!< Enable                                                               */

/* PORT6 @Bit 22 : Enable or disable interrupt for event PORT[6] */
  #define GPIOTE_INTEN0_PORT6_Pos (22UL)             /*!< Position of PORT6 field.                                             */
  #define GPIOTE_INTEN0_PORT6_Msk (0x1UL << GPIOTE_INTEN0_PORT6_Pos) /*!< Bit mask of PORT6 field.                             */
  #define GPIOTE_INTEN0_PORT6_Min (0x0UL)            /*!< Min enumerator value of PORT6 field.                                 */
  #define GPIOTE_INTEN0_PORT6_Max (0x1UL)            /*!< Max enumerator value of PORT6 field.                                 */
  #define GPIOTE_INTEN0_PORT6_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN0_PORT6_Enabled (0x1UL)        /*!< Enable                                                               */

/* PORT7 @Bit 23 : Enable or disable interrupt for event PORT[7] */
  #define GPIOTE_INTEN0_PORT7_Pos (23UL)             /*!< Position of PORT7 field.                                             */
  #define GPIOTE_INTEN0_PORT7_Msk (0x1UL << GPIOTE_INTEN0_PORT7_Pos) /*!< Bit mask of PORT7 field.                             */
  #define GPIOTE_INTEN0_PORT7_Min (0x0UL)            /*!< Min enumerator value of PORT7 field.                                 */
  #define GPIOTE_INTEN0_PORT7_Max (0x1UL)            /*!< Max enumerator value of PORT7 field.                                 */
  #define GPIOTE_INTEN0_PORT7_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN0_PORT7_Enabled (0x1UL)        /*!< Enable                                                               */

/* PORT8 @Bit 24 : Enable or disable interrupt for event PORT[8] */
  #define GPIOTE_INTEN0_PORT8_Pos (24UL)             /*!< Position of PORT8 field.                                             */
  #define GPIOTE_INTEN0_PORT8_Msk (0x1UL << GPIOTE_INTEN0_PORT8_Pos) /*!< Bit mask of PORT8 field.                             */
  #define GPIOTE_INTEN0_PORT8_Min (0x0UL)            /*!< Min enumerator value of PORT8 field.                                 */
  #define GPIOTE_INTEN0_PORT8_Max (0x1UL)            /*!< Max enumerator value of PORT8 field.                                 */
  #define GPIOTE_INTEN0_PORT8_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN0_PORT8_Enabled (0x1UL)        /*!< Enable                                                               */

/* PORT9 @Bit 25 : Enable or disable interrupt for event PORT[9] */
  #define GPIOTE_INTEN0_PORT9_Pos (25UL)             /*!< Position of PORT9 field.                                             */
  #define GPIOTE_INTEN0_PORT9_Msk (0x1UL << GPIOTE_INTEN0_PORT9_Pos) /*!< Bit mask of PORT9 field.                             */
  #define GPIOTE_INTEN0_PORT9_Min (0x0UL)            /*!< Min enumerator value of PORT9 field.                                 */
  #define GPIOTE_INTEN0_PORT9_Max (0x1UL)            /*!< Max enumerator value of PORT9 field.                                 */
  #define GPIOTE_INTEN0_PORT9_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN0_PORT9_Enabled (0x1UL)        /*!< Enable                                                               */

/* PORT10 @Bit 26 : Enable or disable interrupt for event PORT[10] */
  #define GPIOTE_INTEN0_PORT10_Pos (26UL)            /*!< Position of PORT10 field.                                            */
  #define GPIOTE_INTEN0_PORT10_Msk (0x1UL << GPIOTE_INTEN0_PORT10_Pos) /*!< Bit mask of PORT10 field.                          */
  #define GPIOTE_INTEN0_PORT10_Min (0x0UL)           /*!< Min enumerator value of PORT10 field.                                */
  #define GPIOTE_INTEN0_PORT10_Max (0x1UL)           /*!< Max enumerator value of PORT10 field.                                */
  #define GPIOTE_INTEN0_PORT10_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GPIOTE_INTEN0_PORT10_Enabled (0x1UL)       /*!< Enable                                                               */

/* PORT11 @Bit 27 : Enable or disable interrupt for event PORT[11] */
  #define GPIOTE_INTEN0_PORT11_Pos (27UL)            /*!< Position of PORT11 field.                                            */
  #define GPIOTE_INTEN0_PORT11_Msk (0x1UL << GPIOTE_INTEN0_PORT11_Pos) /*!< Bit mask of PORT11 field.                          */
  #define GPIOTE_INTEN0_PORT11_Min (0x0UL)           /*!< Min enumerator value of PORT11 field.                                */
  #define GPIOTE_INTEN0_PORT11_Max (0x1UL)           /*!< Max enumerator value of PORT11 field.                                */
  #define GPIOTE_INTEN0_PORT11_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GPIOTE_INTEN0_PORT11_Enabled (0x1UL)       /*!< Enable                                                               */

/* PORT12 @Bit 28 : Enable or disable interrupt for event PORT[12] */
  #define GPIOTE_INTEN0_PORT12_Pos (28UL)            /*!< Position of PORT12 field.                                            */
  #define GPIOTE_INTEN0_PORT12_Msk (0x1UL << GPIOTE_INTEN0_PORT12_Pos) /*!< Bit mask of PORT12 field.                          */
  #define GPIOTE_INTEN0_PORT12_Min (0x0UL)           /*!< Min enumerator value of PORT12 field.                                */
  #define GPIOTE_INTEN0_PORT12_Max (0x1UL)           /*!< Max enumerator value of PORT12 field.                                */
  #define GPIOTE_INTEN0_PORT12_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GPIOTE_INTEN0_PORT12_Enabled (0x1UL)       /*!< Enable                                                               */

/* PORT13 @Bit 29 : Enable or disable interrupt for event PORT[13] */
  #define GPIOTE_INTEN0_PORT13_Pos (29UL)            /*!< Position of PORT13 field.                                            */
  #define GPIOTE_INTEN0_PORT13_Msk (0x1UL << GPIOTE_INTEN0_PORT13_Pos) /*!< Bit mask of PORT13 field.                          */
  #define GPIOTE_INTEN0_PORT13_Min (0x0UL)           /*!< Min enumerator value of PORT13 field.                                */
  #define GPIOTE_INTEN0_PORT13_Max (0x1UL)           /*!< Max enumerator value of PORT13 field.                                */
  #define GPIOTE_INTEN0_PORT13_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GPIOTE_INTEN0_PORT13_Enabled (0x1UL)       /*!< Enable                                                               */

