adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PORT8 @Bit 24 : Write '1' to enable interrupt for event PORT[8] */
  #define GPIOTE_INTENSET0_PORT8_Pos (24UL)          /*!< Position of PORT8 field.                                             */
  #define GPIOTE_INTENSET0_PORT8_Msk (0x1UL << GPIOTE_INTENSET0_PORT8_Pos) /*!< Bit mask of PORT8 field.                       */
  #define GPIOTE_INTENSET0_PORT8_Min (0x0UL)         /*!< Min enumerator value of PORT8 field.                                 */
  #define GPIOTE_INTENSET0_PORT8_Max (0x1UL)         /*!< Max enumerator value of PORT8 field.                                 */
  #define GPIOTE_INTENSET0_PORT8_Set (0x1UL)         /*!< Enable                                                               */
  #define GPIOTE_INTENSET0_PORT8_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET0_PORT8_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PORT9 @Bit 25 : Write '1' to enable interrupt for event PORT[9] */
  #define GPIOTE_INTENSET0_PORT9_Pos (25UL)          /*!< Position of PORT9 field.                                             */
  #define GPIOTE_INTENSET0_PORT9_Msk (0x1UL << GPIOTE_INTENSET0_PORT9_Pos) /*!< Bit mask of PORT9 field.                       */
  #define GPIOTE_INTENSET0_PORT9_Min (0x0UL)         /*!< Min enumerator value of PORT9 field.                                 */
  #define GPIOTE_INTENSET0_PORT9_Max (0x1UL)         /*!< Max enumerator value of PORT9 field.                                 */
  #define GPIOTE_INTENSET0_PORT9_Set (0x1UL)         /*!< Enable                                                               */
  #define GPIOTE_INTENSET0_PORT9_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET0_PORT9_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PORT10 @Bit 26 : Write '1' to enable interrupt for event PORT[10] */
  #define GPIOTE_INTENSET0_PORT10_Pos (26UL)         /*!< Position of PORT10 field.                                            */
  #define GPIOTE_INTENSET0_PORT10_Msk (0x1UL << GPIOTE_INTENSET0_PORT10_Pos) /*!< Bit mask of PORT10 field.                    */
  #define GPIOTE_INTENSET0_PORT10_Min (0x0UL)        /*!< Min enumerator value of PORT10 field.                                */
  #define GPIOTE_INTENSET0_PORT10_Max (0x1UL)        /*!< Max enumerator value of PORT10 field.                                */
  #define GPIOTE_INTENSET0_PORT10_Set (0x1UL)        /*!< Enable                                                               */
  #define GPIOTE_INTENSET0_PORT10_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET0_PORT10_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* PORT11 @Bit 27 : Write '1' to enable interrupt for event PORT[11] */
  #define GPIOTE_INTENSET0_PORT11_Pos (27UL)         /*!< Position of PORT11 field.                                            */
  #define GPIOTE_INTENSET0_PORT11_Msk (0x1UL << GPIOTE_INTENSET0_PORT11_Pos) /*!< Bit mask of PORT11 field.                    */
  #define GPIOTE_INTENSET0_PORT11_Min (0x0UL)        /*!< Min enumerator value of PORT11 field.                                */
  #define GPIOTE_INTENSET0_PORT11_Max (0x1UL)        /*!< Max enumerator value of PORT11 field.                                */
  #define GPIOTE_INTENSET0_PORT11_Set (0x1UL)        /*!< Enable                                                               */
  #define GPIOTE_INTENSET0_PORT11_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET0_PORT11_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* PORT12 @Bit 28 : Write '1' to enable interrupt for event PORT[12] */
  #define GPIOTE_INTENSET0_PORT12_Pos (28UL)         /*!< Position of PORT12 field.                                            */
  #define GPIOTE_INTENSET0_PORT12_Msk (0x1UL << GPIOTE_INTENSET0_PORT12_Pos) /*!< Bit mask of PORT12 field.                    */
  #define GPIOTE_INTENSET0_PORT12_Min (0x0UL)        /*!< Min enumerator value of PORT12 field.                                */
  #define GPIOTE_INTENSET0_PORT12_Max (0x1UL)        /*!< Max enumerator value of PORT12 field.                                */
  #define GPIOTE_INTENSET0_PORT12_Set (0x1UL)        /*!< Enable                                                               */
  #define GPIOTE_INTENSET0_PORT12_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET0_PORT12_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* PORT13 @Bit 29 : Write '1' to enable interrupt for event PORT[13] */
  #define GPIOTE_INTENSET0_PORT13_Pos (29UL)         /*!< Position of PORT13 field.                                            */
  #define GPIOTE_INTENSET0_PORT13_Msk (0x1UL << GPIOTE_INTENSET0_PORT13_Pos) /*!< Bit mask of PORT13 field.                    */
  #define GPIOTE_INTENSET0_PORT13_Min (0x0UL)        /*!< Min enumerator value of PORT13 field.                                */
  #define GPIOTE_INTENSET0_PORT13_Max (0x1UL)        /*!< Max enumerator value of PORT13 field.                                */
  #define GPIOTE_INTENSET0_PORT13_Set (0x1UL)        /*!< Enable                                                               */
  #define GPIOTE_INTENSET0_PORT13_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET0_PORT13_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* PORT14 @Bit 30 : Write '1' to enable interrupt for event PORT[14] */
  #define GPIOTE_INTENSET0_PORT14_Pos (30UL)         /*!< Position of PORT14 field.                                            */
  #define GPIOTE_INTENSET0_PORT14_Msk (0x1UL << GPIOTE_INTENSET0_PORT14_Pos) /*!< Bit mask of PORT14 field.                    */
  #define GPIOTE_INTENSET0_PORT14_Min (0x0UL)        /*!< Min enumerator value of PORT14 field.                                */
  #define GPIOTE_INTENSET0_PORT14_Max (0x1UL)        /*!< Max enumerator value of PORT14 field.                                */
  #define GPIOTE_INTENSET0_PORT14_Set (0x1UL)        /*!< Enable                                                               */
  #define GPIOTE_INTENSET0_PORT14_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET0_PORT14_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* PORT15 @Bit 31 : Write '1' to enable interrupt for event PORT[15] */
  #define GPIOTE_INTENSET0_PORT15_Pos (31UL)         /*!< Position of PORT15 field.                                            */
  #define GPIOTE_INTENSET0_PORT15_Msk (0x1UL << GPIOTE_INTENSET0_PORT15_Pos) /*!< Bit mask of PORT15 field.                    */
  #define GPIOTE_INTENSET0_PORT15_Min (0x0UL)        /*!< Min enumerator value of PORT15 field.                                */
  #define GPIOTE_INTENSET0_PORT15_Max (0x1UL)        /*!< Max enumerator value of PORT15 field.                                */
  #define GPIOTE_INTENSET0_PORT15_Set (0x1UL)        /*!< Enable                                                               */
  #define GPIOTE_INTENSET0_PORT15_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET0_PORT15_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* GPIOTE_INTENCLR0: Disable interrupt */
  #define GPIOTE_INTENCLR0_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR0 register.                                   */

/* IN0 @Bit 0 : Write '1' to disable interrupt for event IN[0] */
  #define GPIOTE_INTENCLR0_IN0_Pos (0UL)             /*!< Position of IN0 field.                                               */
  #define GPIOTE_INTENCLR0_IN0_Msk (0x1UL << GPIOTE_INTENCLR0_IN0_Pos) /*!< Bit mask of IN0 field.                             */
  #define GPIOTE_INTENCLR0_IN0_Min (0x0UL)           /*!< Min enumerator value of IN0 field.                                   */
  #define GPIOTE_INTENCLR0_IN0_Max (0x1UL)           /*!< Max enumerator value of IN0 field.                                   */
  #define GPIOTE_INTENCLR0_IN0_Clear (0x1UL)         /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_IN0_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR0_IN0_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN1 @Bit 1 : Write '1' to disable interrupt for event IN[1] */
  #define GPIOTE_INTENCLR0_IN1_Pos (1UL)             /*!< Position of IN1 field.                                               */
  #define GPIOTE_INTENCLR0_IN1_Msk (0x1UL << GPIOTE_INTENCLR0_IN1_Pos) /*!< Bit mask of IN1 field.                             */
  #define GPIOTE_INTENCLR0_IN1_Min (0x0UL)           /*!< Min enumerator value of IN1 field.                                   */
  #define GPIOTE_INTENCLR0_IN1_Max (0x1UL)           /*!< Max enumerator value of IN1 field.                                   */
  #define GPIOTE_INTENCLR0_IN1_Clear (0x1UL)         /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_IN1_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR0_IN1_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

