adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PORT8 @Bit 24 : Write '1' to disable interrupt for event PORT[8] */
  #define GPIOTE_INTENCLR0_PORT8_Pos (24UL)          /*!< Position of PORT8 field.                                             */
  #define GPIOTE_INTENCLR0_PORT8_Msk (0x1UL << GPIOTE_INTENCLR0_PORT8_Pos) /*!< Bit mask of PORT8 field.                       */
  #define GPIOTE_INTENCLR0_PORT8_Min (0x0UL)         /*!< Min enumerator value of PORT8 field.                                 */
  #define GPIOTE_INTENCLR0_PORT8_Max (0x1UL)         /*!< Max enumerator value of PORT8 field.                                 */
  #define GPIOTE_INTENCLR0_PORT8_Clear (0x1UL)       /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_PORT8_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR0_PORT8_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PORT9 @Bit 25 : Write '1' to disable interrupt for event PORT[9] */
  #define GPIOTE_INTENCLR0_PORT9_Pos (25UL)          /*!< Position of PORT9 field.                                             */
  #define GPIOTE_INTENCLR0_PORT9_Msk (0x1UL << GPIOTE_INTENCLR0_PORT9_Pos) /*!< Bit mask of PORT9 field.                       */
  #define GPIOTE_INTENCLR0_PORT9_Min (0x0UL)         /*!< Min enumerator value of PORT9 field.                                 */
  #define GPIOTE_INTENCLR0_PORT9_Max (0x1UL)         /*!< Max enumerator value of PORT9 field.                                 */
  #define GPIOTE_INTENCLR0_PORT9_Clear (0x1UL)       /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_PORT9_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR0_PORT9_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PORT10 @Bit 26 : Write '1' to disable interrupt for event PORT[10] */
  #define GPIOTE_INTENCLR0_PORT10_Pos (26UL)         /*!< Position of PORT10 field.                                            */
  #define GPIOTE_INTENCLR0_PORT10_Msk (0x1UL << GPIOTE_INTENCLR0_PORT10_Pos) /*!< Bit mask of PORT10 field.                    */
  #define GPIOTE_INTENCLR0_PORT10_Min (0x0UL)        /*!< Min enumerator value of PORT10 field.                                */
  #define GPIOTE_INTENCLR0_PORT10_Max (0x1UL)        /*!< Max enumerator value of PORT10 field.                                */
  #define GPIOTE_INTENCLR0_PORT10_Clear (0x1UL)      /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_PORT10_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR0_PORT10_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* PORT11 @Bit 27 : Write '1' to disable interrupt for event PORT[11] */
  #define GPIOTE_INTENCLR0_PORT11_Pos (27UL)         /*!< Position of PORT11 field.                                            */
  #define GPIOTE_INTENCLR0_PORT11_Msk (0x1UL << GPIOTE_INTENCLR0_PORT11_Pos) /*!< Bit mask of PORT11 field.                    */
  #define GPIOTE_INTENCLR0_PORT11_Min (0x0UL)        /*!< Min enumerator value of PORT11 field.                                */
  #define GPIOTE_INTENCLR0_PORT11_Max (0x1UL)        /*!< Max enumerator value of PORT11 field.                                */
  #define GPIOTE_INTENCLR0_PORT11_Clear (0x1UL)      /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_PORT11_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR0_PORT11_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* PORT12 @Bit 28 : Write '1' to disable interrupt for event PORT[12] */
  #define GPIOTE_INTENCLR0_PORT12_Pos (28UL)         /*!< Position of PORT12 field.                                            */
  #define GPIOTE_INTENCLR0_PORT12_Msk (0x1UL << GPIOTE_INTENCLR0_PORT12_Pos) /*!< Bit mask of PORT12 field.                    */
  #define GPIOTE_INTENCLR0_PORT12_Min (0x0UL)        /*!< Min enumerator value of PORT12 field.                                */
  #define GPIOTE_INTENCLR0_PORT12_Max (0x1UL)        /*!< Max enumerator value of PORT12 field.                                */
  #define GPIOTE_INTENCLR0_PORT12_Clear (0x1UL)      /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_PORT12_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR0_PORT12_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* PORT13 @Bit 29 : Write '1' to disable interrupt for event PORT[13] */
  #define GPIOTE_INTENCLR0_PORT13_Pos (29UL)         /*!< Position of PORT13 field.                                            */
  #define GPIOTE_INTENCLR0_PORT13_Msk (0x1UL << GPIOTE_INTENCLR0_PORT13_Pos) /*!< Bit mask of PORT13 field.                    */
  #define GPIOTE_INTENCLR0_PORT13_Min (0x0UL)        /*!< Min enumerator value of PORT13 field.                                */
  #define GPIOTE_INTENCLR0_PORT13_Max (0x1UL)        /*!< Max enumerator value of PORT13 field.                                */
  #define GPIOTE_INTENCLR0_PORT13_Clear (0x1UL)      /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_PORT13_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR0_PORT13_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* PORT14 @Bit 30 : Write '1' to disable interrupt for event PORT[14] */
  #define GPIOTE_INTENCLR0_PORT14_Pos (30UL)         /*!< Position of PORT14 field.                                            */
  #define GPIOTE_INTENCLR0_PORT14_Msk (0x1UL << GPIOTE_INTENCLR0_PORT14_Pos) /*!< Bit mask of PORT14 field.                    */
  #define GPIOTE_INTENCLR0_PORT14_Min (0x0UL)        /*!< Min enumerator value of PORT14 field.                                */
  #define GPIOTE_INTENCLR0_PORT14_Max (0x1UL)        /*!< Max enumerator value of PORT14 field.                                */
  #define GPIOTE_INTENCLR0_PORT14_Clear (0x1UL)      /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_PORT14_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR0_PORT14_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

