adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PORT15 @Bit 31 : Write '1' to disable interrupt for event PORT[15] */
  #define GPIOTE_INTENCLR0_PORT15_Pos (31UL)         /*!< Position of PORT15 field.                                            */
  #define GPIOTE_INTENCLR0_PORT15_Msk (0x1UL << GPIOTE_INTENCLR0_PORT15_Pos) /*!< Bit mask of PORT15 field.                    */
  #define GPIOTE_INTENCLR0_PORT15_Min (0x0UL)        /*!< Min enumerator value of PORT15 field.                                */
  #define GPIOTE_INTENCLR0_PORT15_Max (0x1UL)        /*!< Max enumerator value of PORT15 field.                                */
  #define GPIOTE_INTENCLR0_PORT15_Clear (0x1UL)      /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_PORT15_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR0_PORT15_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* GPIOTE_INTEN1: Enable or disable interrupt */
  #define GPIOTE_INTEN1_ResetValue (0x00000000UL)    /*!< Reset value of INTEN1 register.                                      */

/* IN0 @Bit 0 : Enable or disable interrupt for event IN[0] */
  #define GPIOTE_INTEN1_IN0_Pos (0UL)                /*!< Position of IN0 field.                                               */
  #define GPIOTE_INTEN1_IN0_Msk (0x1UL << GPIOTE_INTEN1_IN0_Pos) /*!< Bit mask of IN0 field.                                   */
  #define GPIOTE_INTEN1_IN0_Min (0x0UL)              /*!< Min enumerator value of IN0 field.                                   */
  #define GPIOTE_INTEN1_IN0_Max (0x1UL)              /*!< Max enumerator value of IN0 field.                                   */
  #define GPIOTE_INTEN1_IN0_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN1_IN0_Enabled (0x1UL)          /*!< Enable                                                               */

/* IN1 @Bit 1 : Enable or disable interrupt for event IN[1] */
  #define GPIOTE_INTEN1_IN1_Pos (1UL)                /*!< Position of IN1 field.                                               */
  #define GPIOTE_INTEN1_IN1_Msk (0x1UL << GPIOTE_INTEN1_IN1_Pos) /*!< Bit mask of IN1 field.                                   */
  #define GPIOTE_INTEN1_IN1_Min (0x0UL)              /*!< Min enumerator value of IN1 field.                                   */
  #define GPIOTE_INTEN1_IN1_Max (0x1UL)              /*!< Max enumerator value of IN1 field.                                   */
  #define GPIOTE_INTEN1_IN1_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN1_IN1_Enabled (0x1UL)          /*!< Enable                                                               */

/* IN2 @Bit 2 : Enable or disable interrupt for event IN[2] */
  #define GPIOTE_INTEN1_IN2_Pos (2UL)                /*!< Position of IN2 field.                                               */
  #define GPIOTE_INTEN1_IN2_Msk (0x1UL << GPIOTE_INTEN1_IN2_Pos) /*!< Bit mask of IN2 field.                                   */
  #define GPIOTE_INTEN1_IN2_Min (0x0UL)              /*!< Min enumerator value of IN2 field.                                   */
  #define GPIOTE_INTEN1_IN2_Max (0x1UL)              /*!< Max enumerator value of IN2 field.                                   */
  #define GPIOTE_INTEN1_IN2_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN1_IN2_Enabled (0x1UL)          /*!< Enable                                                               */

/* IN3 @Bit 3 : Enable or disable interrupt for event IN[3] */
  #define GPIOTE_INTEN1_IN3_Pos (3UL)                /*!< Position of IN3 field.                                               */
  #define GPIOTE_INTEN1_IN3_Msk (0x1UL << GPIOTE_INTEN1_IN3_Pos) /*!< Bit mask of IN3 field.                                   */
  #define GPIOTE_INTEN1_IN3_Min (0x0UL)              /*!< Min enumerator value of IN3 field.                                   */
  #define GPIOTE_INTEN1_IN3_Max (0x1UL)              /*!< Max enumerator value of IN3 field.                                   */
  #define GPIOTE_INTEN1_IN3_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN1_IN3_Enabled (0x1UL)          /*!< Enable                                                               */

/* IN4 @Bit 4 : Enable or disable interrupt for event IN[4] */
  #define GPIOTE_INTEN1_IN4_Pos (4UL)                /*!< Position of IN4 field.                                               */
  #define GPIOTE_INTEN1_IN4_Msk (0x1UL << GPIOTE_INTEN1_IN4_Pos) /*!< Bit mask of IN4 field.                                   */
  #define GPIOTE_INTEN1_IN4_Min (0x0UL)              /*!< Min enumerator value of IN4 field.                                   */
  #define GPIOTE_INTEN1_IN4_Max (0x1UL)              /*!< Max enumerator value of IN4 field.                                   */
  #define GPIOTE_INTEN1_IN4_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN1_IN4_Enabled (0x1UL)          /*!< Enable                                                               */

/* IN5 @Bit 5 : Enable or disable interrupt for event IN[5] */
  #define GPIOTE_INTEN1_IN5_Pos (5UL)                /*!< Position of IN5 field.                                               */
  #define GPIOTE_INTEN1_IN5_Msk (0x1UL << GPIOTE_INTEN1_IN5_Pos) /*!< Bit mask of IN5 field.                                   */
  #define GPIOTE_INTEN1_IN5_Min (0x0UL)              /*!< Min enumerator value of IN5 field.                                   */
  #define GPIOTE_INTEN1_IN5_Max (0x1UL)              /*!< Max enumerator value of IN5 field.                                   */
  #define GPIOTE_INTEN1_IN5_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN1_IN5_Enabled (0x1UL)          /*!< Enable                                                               */

/* IN6 @Bit 6 : Enable or disable interrupt for event IN[6] */
  #define GPIOTE_INTEN1_IN6_Pos (6UL)                /*!< Position of IN6 field.                                               */
  #define GPIOTE_INTEN1_IN6_Msk (0x1UL << GPIOTE_INTEN1_IN6_Pos) /*!< Bit mask of IN6 field.                                   */
  #define GPIOTE_INTEN1_IN6_Min (0x0UL)              /*!< Min enumerator value of IN6 field.                                   */
  #define GPIOTE_INTEN1_IN6_Max (0x1UL)              /*!< Max enumerator value of IN6 field.                                   */
  #define GPIOTE_INTEN1_IN6_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN1_IN6_Enabled (0x1UL)          /*!< Enable                                                               */

/* IN7 @Bit 7 : Enable or disable interrupt for event IN[7] */
  #define GPIOTE_INTEN1_IN7_Pos (7UL)                /*!< Position of IN7 field.                                               */
  #define GPIOTE_INTEN1_IN7_Msk (0x1UL << GPIOTE_INTEN1_IN7_Pos) /*!< Bit mask of IN7 field.                                   */
  #define GPIOTE_INTEN1_IN7_Min (0x0UL)              /*!< Min enumerator value of IN7 field.                                   */
  #define GPIOTE_INTEN1_IN7_Max (0x1UL)              /*!< Max enumerator value of IN7 field.                                   */
  #define GPIOTE_INTEN1_IN7_Disabled (0x0UL)         /*!< Disable                                                              */
  #define GPIOTE_INTEN1_IN7_Enabled (0x1UL)          /*!< Enable                                                               */

