adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PORT10 @Bit 26 : Enable or disable interrupt for event PORT[10] */
  #define GPIOTE_INTEN1_PORT10_Pos (26UL)            /*!< Position of PORT10 field.                                            */
  #define GPIOTE_INTEN1_PORT10_Msk (0x1UL << GPIOTE_INTEN1_PORT10_Pos) /*!< Bit mask of PORT10 field.                          */
  #define GPIOTE_INTEN1_PORT10_Min (0x0UL)           /*!< Min enumerator value of PORT10 field.                                */
  #define GPIOTE_INTEN1_PORT10_Max (0x1UL)           /*!< Max enumerator value of PORT10 field.                                */
  #define GPIOTE_INTEN1_PORT10_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GPIOTE_INTEN1_PORT10_Enabled (0x1UL)       /*!< Enable                                                               */

/* PORT11 @Bit 27 : Enable or disable interrupt for event PORT[11] */
  #define GPIOTE_INTEN1_PORT11_Pos (27UL)            /*!< Position of PORT11 field.                                            */
  #define GPIOTE_INTEN1_PORT11_Msk (0x1UL << GPIOTE_INTEN1_PORT11_Pos) /*!< Bit mask of PORT11 field.                          */
  #define GPIOTE_INTEN1_PORT11_Min (0x0UL)           /*!< Min enumerator value of PORT11 field.                                */
  #define GPIOTE_INTEN1_PORT11_Max (0x1UL)           /*!< Max enumerator value of PORT11 field.                                */
  #define GPIOTE_INTEN1_PORT11_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GPIOTE_INTEN1_PORT11_Enabled (0x1UL)       /*!< Enable                                                               */

/* PORT12 @Bit 28 : Enable or disable interrupt for event PORT[12] */
  #define GPIOTE_INTEN1_PORT12_Pos (28UL)            /*!< Position of PORT12 field.                                            */
  #define GPIOTE_INTEN1_PORT12_Msk (0x1UL << GPIOTE_INTEN1_PORT12_Pos) /*!< Bit mask of PORT12 field.                          */
  #define GPIOTE_INTEN1_PORT12_Min (0x0UL)           /*!< Min enumerator value of PORT12 field.                                */
  #define GPIOTE_INTEN1_PORT12_Max (0x1UL)           /*!< Max enumerator value of PORT12 field.                                */
  #define GPIOTE_INTEN1_PORT12_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GPIOTE_INTEN1_PORT12_Enabled (0x1UL)       /*!< Enable                                                               */

/* PORT13 @Bit 29 : Enable or disable interrupt for event PORT[13] */
  #define GPIOTE_INTEN1_PORT13_Pos (29UL)            /*!< Position of PORT13 field.                                            */
  #define GPIOTE_INTEN1_PORT13_Msk (0x1UL << GPIOTE_INTEN1_PORT13_Pos) /*!< Bit mask of PORT13 field.                          */
  #define GPIOTE_INTEN1_PORT13_Min (0x0UL)           /*!< Min enumerator value of PORT13 field.                                */
  #define GPIOTE_INTEN1_PORT13_Max (0x1UL)           /*!< Max enumerator value of PORT13 field.                                */
  #define GPIOTE_INTEN1_PORT13_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GPIOTE_INTEN1_PORT13_Enabled (0x1UL)       /*!< Enable                                                               */

/* PORT14 @Bit 30 : Enable or disable interrupt for event PORT[14] */
  #define GPIOTE_INTEN1_PORT14_Pos (30UL)            /*!< Position of PORT14 field.                                            */
  #define GPIOTE_INTEN1_PORT14_Msk (0x1UL << GPIOTE_INTEN1_PORT14_Pos) /*!< Bit mask of PORT14 field.                          */
  #define GPIOTE_INTEN1_PORT14_Min (0x0UL)           /*!< Min enumerator value of PORT14 field.                                */
  #define GPIOTE_INTEN1_PORT14_Max (0x1UL)           /*!< Max enumerator value of PORT14 field.                                */
  #define GPIOTE_INTEN1_PORT14_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GPIOTE_INTEN1_PORT14_Enabled (0x1UL)       /*!< Enable                                                               */

/* PORT15 @Bit 31 : Enable or disable interrupt for event PORT[15] */
  #define GPIOTE_INTEN1_PORT15_Pos (31UL)            /*!< Position of PORT15 field.                                            */
  #define GPIOTE_INTEN1_PORT15_Msk (0x1UL << GPIOTE_INTEN1_PORT15_Pos) /*!< Bit mask of PORT15 field.                          */
  #define GPIOTE_INTEN1_PORT15_Min (0x0UL)           /*!< Min enumerator value of PORT15 field.                                */
  #define GPIOTE_INTEN1_PORT15_Max (0x1UL)           /*!< Max enumerator value of PORT15 field.                                */
  #define GPIOTE_INTEN1_PORT15_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GPIOTE_INTEN1_PORT15_Enabled (0x1UL)       /*!< Enable                                                               */


/* GPIOTE_INTENSET1: Enable interrupt */
  #define GPIOTE_INTENSET1_ResetValue (0x00000000UL) /*!< Reset value of INTENSET1 register.                                   */

/* IN0 @Bit 0 : Write '1' to enable interrupt for event IN[0] */
  #define GPIOTE_INTENSET1_IN0_Pos (0UL)             /*!< Position of IN0 field.                                               */
  #define GPIOTE_INTENSET1_IN0_Msk (0x1UL << GPIOTE_INTENSET1_IN0_Pos) /*!< Bit mask of IN0 field.                             */
  #define GPIOTE_INTENSET1_IN0_Min (0x0UL)           /*!< Min enumerator value of IN0 field.                                   */
  #define GPIOTE_INTENSET1_IN0_Max (0x1UL)           /*!< Max enumerator value of IN0 field.                                   */
  #define GPIOTE_INTENSET1_IN0_Set (0x1UL)           /*!< Enable                                                               */
  #define GPIOTE_INTENSET1_IN0_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET1_IN0_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN1 @Bit 1 : Write '1' to enable interrupt for event IN[1] */
  #define GPIOTE_INTENSET1_IN1_Pos (1UL)             /*!< Position of IN1 field.                                               */
  #define GPIOTE_INTENSET1_IN1_Msk (0x1UL << GPIOTE_INTENSET1_IN1_Pos) /*!< Bit mask of IN1 field.                             */
  #define GPIOTE_INTENSET1_IN1_Min (0x0UL)           /*!< Min enumerator value of IN1 field.                                   */
  #define GPIOTE_INTENSET1_IN1_Max (0x1UL)           /*!< Max enumerator value of IN1 field.                                   */
  #define GPIOTE_INTENSET1_IN1_Set (0x1UL)           /*!< Enable                                                               */
  #define GPIOTE_INTENSET1_IN1_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET1_IN1_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN2 @Bit 2 : Write '1' to enable interrupt for event IN[2] */
  #define GPIOTE_INTENSET1_IN2_Pos (2UL)             /*!< Position of IN2 field.                                               */
  #define GPIOTE_INTENSET1_IN2_Msk (0x1UL << GPIOTE_INTENSET1_IN2_Pos) /*!< Bit mask of IN2 field.                             */
  #define GPIOTE_INTENSET1_IN2_Min (0x0UL)           /*!< Min enumerator value of IN2 field.                                   */
  #define GPIOTE_INTENSET1_IN2_Max (0x1UL)           /*!< Max enumerator value of IN2 field.                                   */
  #define GPIOTE_INTENSET1_IN2_Set (0x1UL)           /*!< Enable                                                               */
  #define GPIOTE_INTENSET1_IN2_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET1_IN2_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN3 @Bit 3 : Write '1' to enable interrupt for event IN[3] */
  #define GPIOTE_INTENSET1_IN3_Pos (3UL)             /*!< Position of IN3 field.                                               */
  #define GPIOTE_INTENSET1_IN3_Msk (0x1UL << GPIOTE_INTENSET1_IN3_Pos) /*!< Bit mask of IN3 field.                             */
  #define GPIOTE_INTENSET1_IN3_Min (0x0UL)           /*!< Min enumerator value of IN3 field.                                   */
  #define GPIOTE_INTENSET1_IN3_Max (0x1UL)           /*!< Max enumerator value of IN3 field.                                   */
  #define GPIOTE_INTENSET1_IN3_Set (0x1UL)           /*!< Enable                                                               */
  #define GPIOTE_INTENSET1_IN3_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET1_IN3_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN4 @Bit 4 : Write '1' to enable interrupt for event IN[4] */
  #define GPIOTE_INTENSET1_IN4_Pos (4UL)             /*!< Position of IN4 field.                                               */
  #define GPIOTE_INTENSET1_IN4_Msk (0x1UL << GPIOTE_INTENSET1_IN4_Pos) /*!< Bit mask of IN4 field.                             */
  #define GPIOTE_INTENSET1_IN4_Min (0x0UL)           /*!< Min enumerator value of IN4 field.                                   */
  #define GPIOTE_INTENSET1_IN4_Max (0x1UL)           /*!< Max enumerator value of IN4 field.                                   */
  #define GPIOTE_INTENSET1_IN4_Set (0x1UL)           /*!< Enable                                                               */
  #define GPIOTE_INTENSET1_IN4_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET1_IN4_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN5 @Bit 5 : Write '1' to enable interrupt for event IN[5] */
  #define GPIOTE_INTENSET1_IN5_Pos (5UL)             /*!< Position of IN5 field.                                               */
  #define GPIOTE_INTENSET1_IN5_Msk (0x1UL << GPIOTE_INTENSET1_IN5_Pos) /*!< Bit mask of IN5 field.                             */
  #define GPIOTE_INTENSET1_IN5_Min (0x0UL)           /*!< Min enumerator value of IN5 field.                                   */
  #define GPIOTE_INTENSET1_IN5_Max (0x1UL)           /*!< Max enumerator value of IN5 field.                                   */
  #define GPIOTE_INTENSET1_IN5_Set (0x1UL)           /*!< Enable                                                               */
  #define GPIOTE_INTENSET1_IN5_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET1_IN5_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN6 @Bit 6 : Write '1' to enable interrupt for event IN[6] */
  #define GPIOTE_INTENSET1_IN6_Pos (6UL)             /*!< Position of IN6 field.                                               */
  #define GPIOTE_INTENSET1_IN6_Msk (0x1UL << GPIOTE_INTENSET1_IN6_Pos) /*!< Bit mask of IN6 field.                             */
  #define GPIOTE_INTENSET1_IN6_Min (0x0UL)           /*!< Min enumerator value of IN6 field.                                   */
  #define GPIOTE_INTENSET1_IN6_Max (0x1UL)           /*!< Max enumerator value of IN6 field.                                   */
  #define GPIOTE_INTENSET1_IN6_Set (0x1UL)           /*!< Enable                                                               */
  #define GPIOTE_INTENSET1_IN6_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET1_IN6_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN7 @Bit 7 : Write '1' to enable interrupt for event IN[7] */
  #define GPIOTE_INTENSET1_IN7_Pos (7UL)             /*!< Position of IN7 field.                                               */
  #define GPIOTE_INTENSET1_IN7_Msk (0x1UL << GPIOTE_INTENSET1_IN7_Pos) /*!< Bit mask of IN7 field.                             */
  #define GPIOTE_INTENSET1_IN7_Min (0x0UL)           /*!< Min enumerator value of IN7 field.                                   */
  #define GPIOTE_INTENSET1_IN7_Max (0x1UL)           /*!< Max enumerator value of IN7 field.                                   */
  #define GPIOTE_INTENSET1_IN7_Set (0x1UL)           /*!< Enable                                                               */
  #define GPIOTE_INTENSET1_IN7_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET1_IN7_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* PORT0 @Bit 16 : Write '1' to enable interrupt for event PORT[0] */
  #define GPIOTE_INTENSET1_PORT0_Pos (16UL)          /*!< Position of PORT0 field.                                             */
  #define GPIOTE_INTENSET1_PORT0_Msk (0x1UL << GPIOTE_INTENSET1_PORT0_Pos) /*!< Bit mask of PORT0 field.                       */
  #define GPIOTE_INTENSET1_PORT0_Min (0x0UL)         /*!< Min enumerator value of PORT0 field.                                 */
  #define GPIOTE_INTENSET1_PORT0_Max (0x1UL)         /*!< Max enumerator value of PORT0 field.                                 */
  #define GPIOTE_INTENSET1_PORT0_Set (0x1UL)         /*!< Enable                                                               */
  #define GPIOTE_INTENSET1_PORT0_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET1_PORT0_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

