adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PORT0 @Bit 16 : Enable or disable interrupt for event PORT[0] */
  #define GPIOTE_INTEN3_PORT0_Pos (16UL)             /*!< Position of PORT0 field.                                             */
  #define GPIOTE_INTEN3_PORT0_Msk (0x1UL << GPIOTE_INTEN3_PORT0_Pos) /*!< Bit mask of PORT0 field.                             */
  #define GPIOTE_INTEN3_PORT0_Min (0x0UL)            /*!< Min enumerator value of PORT0 field.                                 */
  #define GPIOTE_INTEN3_PORT0_Max (0x1UL)            /*!< Max enumerator value of PORT0 field.                                 */
  #define GPIOTE_INTEN3_PORT0_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN3_PORT0_Enabled (0x1UL)        /*!< Enable                                                               */

/* PORT1 @Bit 17 : Enable or disable interrupt for event PORT[1] */
  #define GPIOTE_INTEN3_PORT1_Pos (17UL)             /*!< Position of PORT1 field.                                             */
  #define GPIOTE_INTEN3_PORT1_Msk (0x1UL << GPIOTE_INTEN3_PORT1_Pos) /*!< Bit mask of PORT1 field.                             */
  #define GPIOTE_INTEN3_PORT1_Min (0x0UL)            /*!< Min enumerator value of PORT1 field.                                 */
  #define GPIOTE_INTEN3_PORT1_Max (0x1UL)            /*!< Max enumerator value of PORT1 field.                                 */
  #define GPIOTE_INTEN3_PORT1_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN3_PORT1_Enabled (0x1UL)        /*!< Enable                                                               */

/* PORT2 @Bit 18 : Enable or disable interrupt for event PORT[2] */
  #define GPIOTE_INTEN3_PORT2_Pos (18UL)             /*!< Position of PORT2 field.                                             */
  #define GPIOTE_INTEN3_PORT2_Msk (0x1UL << GPIOTE_INTEN3_PORT2_Pos) /*!< Bit mask of PORT2 field.                             */
  #define GPIOTE_INTEN3_PORT2_Min (0x0UL)            /*!< Min enumerator value of PORT2 field.                                 */
  #define GPIOTE_INTEN3_PORT2_Max (0x1UL)            /*!< Max enumerator value of PORT2 field.                                 */
  #define GPIOTE_INTEN3_PORT2_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN3_PORT2_Enabled (0x1UL)        /*!< Enable                                                               */

/* PORT3 @Bit 19 : Enable or disable interrupt for event PORT[3] */
  #define GPIOTE_INTEN3_PORT3_Pos (19UL)             /*!< Position of PORT3 field.                                             */
  #define GPIOTE_INTEN3_PORT3_Msk (0x1UL << GPIOTE_INTEN3_PORT3_Pos) /*!< Bit mask of PORT3 field.                             */
  #define GPIOTE_INTEN3_PORT3_Min (0x0UL)            /*!< Min enumerator value of PORT3 field.                                 */
  #define GPIOTE_INTEN3_PORT3_Max (0x1UL)            /*!< Max enumerator value of PORT3 field.                                 */
  #define GPIOTE_INTEN3_PORT3_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN3_PORT3_Enabled (0x1UL)        /*!< Enable                                                               */

/* PORT4 @Bit 20 : Enable or disable interrupt for event PORT[4] */
  #define GPIOTE_INTEN3_PORT4_Pos (20UL)             /*!< Position of PORT4 field.                                             */
  #define GPIOTE_INTEN3_PORT4_Msk (0x1UL << GPIOTE_INTEN3_PORT4_Pos) /*!< Bit mask of PORT4 field.                             */
  #define GPIOTE_INTEN3_PORT4_Min (0x0UL)            /*!< Min enumerator value of PORT4 field.                                 */
  #define GPIOTE_INTEN3_PORT4_Max (0x1UL)            /*!< Max enumerator value of PORT4 field.                                 */
  #define GPIOTE_INTEN3_PORT4_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN3_PORT4_Enabled (0x1UL)        /*!< Enable                                                               */

/* PORT5 @Bit 21 : Enable or disable interrupt for event PORT[5] */
  #define GPIOTE_INTEN3_PORT5_Pos (21UL)             /*!< Position of PORT5 field.                                             */
  #define GPIOTE_INTEN3_PORT5_Msk (0x1UL << GPIOTE_INTEN3_PORT5_Pos) /*!< Bit mask of PORT5 field.                             */
  #define GPIOTE_INTEN3_PORT5_Min (0x0UL)            /*!< Min enumerator value of PORT5 field.                                 */
  #define GPIOTE_INTEN3_PORT5_Max (0x1UL)            /*!< Max enumerator value of PORT5 field.                                 */
  #define GPIOTE_INTEN3_PORT5_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN3_PORT5_Enabled (0x1UL)        /*!< Enable                                                               */

/* PORT6 @Bit 22 : Enable or disable interrupt for event PORT[6] */
  #define GPIOTE_INTEN3_PORT6_Pos (22UL)             /*!< Position of PORT6 field.                                             */
  #define GPIOTE_INTEN3_PORT6_Msk (0x1UL << GPIOTE_INTEN3_PORT6_Pos) /*!< Bit mask of PORT6 field.                             */
  #define GPIOTE_INTEN3_PORT6_Min (0x0UL)            /*!< Min enumerator value of PORT6 field.                                 */
  #define GPIOTE_INTEN3_PORT6_Max (0x1UL)            /*!< Max enumerator value of PORT6 field.                                 */
  #define GPIOTE_INTEN3_PORT6_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN3_PORT6_Enabled (0x1UL)        /*!< Enable                                                               */

/* PORT7 @Bit 23 : Enable or disable interrupt for event PORT[7] */
  #define GPIOTE_INTEN3_PORT7_Pos (23UL)             /*!< Position of PORT7 field.                                             */
  #define GPIOTE_INTEN3_PORT7_Msk (0x1UL << GPIOTE_INTEN3_PORT7_Pos) /*!< Bit mask of PORT7 field.                             */
  #define GPIOTE_INTEN3_PORT7_Min (0x0UL)            /*!< Min enumerator value of PORT7 field.                                 */
  #define GPIOTE_INTEN3_PORT7_Max (0x1UL)            /*!< Max enumerator value of PORT7 field.                                 */
  #define GPIOTE_INTEN3_PORT7_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN3_PORT7_Enabled (0x1UL)        /*!< Enable                                                               */

/* PORT8 @Bit 24 : Enable or disable interrupt for event PORT[8] */
  #define GPIOTE_INTEN3_PORT8_Pos (24UL)             /*!< Position of PORT8 field.                                             */
  #define GPIOTE_INTEN3_PORT8_Msk (0x1UL << GPIOTE_INTEN3_PORT8_Pos) /*!< Bit mask of PORT8 field.                             */
  #define GPIOTE_INTEN3_PORT8_Min (0x0UL)            /*!< Min enumerator value of PORT8 field.                                 */
  #define GPIOTE_INTEN3_PORT8_Max (0x1UL)            /*!< Max enumerator value of PORT8 field.                                 */
  #define GPIOTE_INTEN3_PORT8_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN3_PORT8_Enabled (0x1UL)        /*!< Enable                                                               */

/* PORT9 @Bit 25 : Enable or disable interrupt for event PORT[9] */
  #define GPIOTE_INTEN3_PORT9_Pos (25UL)             /*!< Position of PORT9 field.                                             */
  #define GPIOTE_INTEN3_PORT9_Msk (0x1UL << GPIOTE_INTEN3_PORT9_Pos) /*!< Bit mask of PORT9 field.                             */
  #define GPIOTE_INTEN3_PORT9_Min (0x0UL)            /*!< Min enumerator value of PORT9 field.                                 */
  #define GPIOTE_INTEN3_PORT9_Max (0x1UL)            /*!< Max enumerator value of PORT9 field.                                 */
  #define GPIOTE_INTEN3_PORT9_Disabled (0x0UL)       /*!< Disable                                                              */
  #define GPIOTE_INTEN3_PORT9_Enabled (0x1UL)        /*!< Enable                                                               */

