adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PORT1 @Bit 17 : Write '1' to enable interrupt for event PORT[1] */
  #define GPIOTE_INTENSET5_PORT1_Pos (17UL)          /*!< Position of PORT1 field.                                             */
  #define GPIOTE_INTENSET5_PORT1_Msk (0x1UL << GPIOTE_INTENSET5_PORT1_Pos) /*!< Bit mask of PORT1 field.                       */
  #define GPIOTE_INTENSET5_PORT1_Min (0x0UL)         /*!< Min enumerator value of PORT1 field.                                 */
  #define GPIOTE_INTENSET5_PORT1_Max (0x1UL)         /*!< Max enumerator value of PORT1 field.                                 */
  #define GPIOTE_INTENSET5_PORT1_Set (0x1UL)         /*!< Enable                                                               */
  #define GPIOTE_INTENSET5_PORT1_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET5_PORT1_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PORT2 @Bit 18 : Write '1' to enable interrupt for event PORT[2] */
  #define GPIOTE_INTENSET5_PORT2_Pos (18UL)          /*!< Position of PORT2 field.                                             */
  #define GPIOTE_INTENSET5_PORT2_Msk (0x1UL << GPIOTE_INTENSET5_PORT2_Pos) /*!< Bit mask of PORT2 field.                       */
  #define GPIOTE_INTENSET5_PORT2_Min (0x0UL)         /*!< Min enumerator value of PORT2 field.                                 */
  #define GPIOTE_INTENSET5_PORT2_Max (0x1UL)         /*!< Max enumerator value of PORT2 field.                                 */
  #define GPIOTE_INTENSET5_PORT2_Set (0x1UL)         /*!< Enable                                                               */
  #define GPIOTE_INTENSET5_PORT2_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET5_PORT2_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PORT3 @Bit 19 : Write '1' to enable interrupt for event PORT[3] */
  #define GPIOTE_INTENSET5_PORT3_Pos (19UL)          /*!< Position of PORT3 field.                                             */
  #define GPIOTE_INTENSET5_PORT3_Msk (0x1UL << GPIOTE_INTENSET5_PORT3_Pos) /*!< Bit mask of PORT3 field.                       */
  #define GPIOTE_INTENSET5_PORT3_Min (0x0UL)         /*!< Min enumerator value of PORT3 field.                                 */
  #define GPIOTE_INTENSET5_PORT3_Max (0x1UL)         /*!< Max enumerator value of PORT3 field.                                 */
  #define GPIOTE_INTENSET5_PORT3_Set (0x1UL)         /*!< Enable                                                               */
  #define GPIOTE_INTENSET5_PORT3_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET5_PORT3_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PORT4 @Bit 20 : Write '1' to enable interrupt for event PORT[4] */
  #define GPIOTE_INTENSET5_PORT4_Pos (20UL)          /*!< Position of PORT4 field.                                             */
  #define GPIOTE_INTENSET5_PORT4_Msk (0x1UL << GPIOTE_INTENSET5_PORT4_Pos) /*!< Bit mask of PORT4 field.                       */
  #define GPIOTE_INTENSET5_PORT4_Min (0x0UL)         /*!< Min enumerator value of PORT4 field.                                 */
  #define GPIOTE_INTENSET5_PORT4_Max (0x1UL)         /*!< Max enumerator value of PORT4 field.                                 */
  #define GPIOTE_INTENSET5_PORT4_Set (0x1UL)         /*!< Enable                                                               */
  #define GPIOTE_INTENSET5_PORT4_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET5_PORT4_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PORT5 @Bit 21 : Write '1' to enable interrupt for event PORT[5] */
  #define GPIOTE_INTENSET5_PORT5_Pos (21UL)          /*!< Position of PORT5 field.                                             */
  #define GPIOTE_INTENSET5_PORT5_Msk (0x1UL << GPIOTE_INTENSET5_PORT5_Pos) /*!< Bit mask of PORT5 field.                       */
  #define GPIOTE_INTENSET5_PORT5_Min (0x0UL)         /*!< Min enumerator value of PORT5 field.                                 */
  #define GPIOTE_INTENSET5_PORT5_Max (0x1UL)         /*!< Max enumerator value of PORT5 field.                                 */
  #define GPIOTE_INTENSET5_PORT5_Set (0x1UL)         /*!< Enable                                                               */
  #define GPIOTE_INTENSET5_PORT5_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET5_PORT5_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PORT6 @Bit 22 : Write '1' to enable interrupt for event PORT[6] */
  #define GPIOTE_INTENSET5_PORT6_Pos (22UL)          /*!< Position of PORT6 field.                                             */
  #define GPIOTE_INTENSET5_PORT6_Msk (0x1UL << GPIOTE_INTENSET5_PORT6_Pos) /*!< Bit mask of PORT6 field.                       */
  #define GPIOTE_INTENSET5_PORT6_Min (0x0UL)         /*!< Min enumerator value of PORT6 field.                                 */
  #define GPIOTE_INTENSET5_PORT6_Max (0x1UL)         /*!< Max enumerator value of PORT6 field.                                 */
  #define GPIOTE_INTENSET5_PORT6_Set (0x1UL)         /*!< Enable                                                               */
  #define GPIOTE_INTENSET5_PORT6_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET5_PORT6_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PORT7 @Bit 23 : Write '1' to enable interrupt for event PORT[7] */
  #define GPIOTE_INTENSET5_PORT7_Pos (23UL)          /*!< Position of PORT7 field.                                             */
  #define GPIOTE_INTENSET5_PORT7_Msk (0x1UL << GPIOTE_INTENSET5_PORT7_Pos) /*!< Bit mask of PORT7 field.                       */
  #define GPIOTE_INTENSET5_PORT7_Min (0x0UL)         /*!< Min enumerator value of PORT7 field.                                 */
  #define GPIOTE_INTENSET5_PORT7_Max (0x1UL)         /*!< Max enumerator value of PORT7 field.                                 */
  #define GPIOTE_INTENSET5_PORT7_Set (0x1UL)         /*!< Enable                                                               */
  #define GPIOTE_INTENSET5_PORT7_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET5_PORT7_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

