adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GPIOTE_INTENCLR5: Disable interrupt */
  #define GPIOTE_INTENCLR5_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR5 register.                                   */

/* IN0 @Bit 0 : Write '1' to disable interrupt for event IN[0] */
  #define GPIOTE_INTENCLR5_IN0_Pos (0UL)             /*!< Position of IN0 field.                                               */
  #define GPIOTE_INTENCLR5_IN0_Msk (0x1UL << GPIOTE_INTENCLR5_IN0_Pos) /*!< Bit mask of IN0 field.                             */
  #define GPIOTE_INTENCLR5_IN0_Min (0x0UL)           /*!< Min enumerator value of IN0 field.                                   */
  #define GPIOTE_INTENCLR5_IN0_Max (0x1UL)           /*!< Max enumerator value of IN0 field.                                   */
  #define GPIOTE_INTENCLR5_IN0_Clear (0x1UL)         /*!< Disable                                                              */
  #define GPIOTE_INTENCLR5_IN0_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR5_IN0_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN1 @Bit 1 : Write '1' to disable interrupt for event IN[1] */
  #define GPIOTE_INTENCLR5_IN1_Pos (1UL)             /*!< Position of IN1 field.                                               */
  #define GPIOTE_INTENCLR5_IN1_Msk (0x1UL << GPIOTE_INTENCLR5_IN1_Pos) /*!< Bit mask of IN1 field.                             */
  #define GPIOTE_INTENCLR5_IN1_Min (0x0UL)           /*!< Min enumerator value of IN1 field.                                   */
  #define GPIOTE_INTENCLR5_IN1_Max (0x1UL)           /*!< Max enumerator value of IN1 field.                                   */
  #define GPIOTE_INTENCLR5_IN1_Clear (0x1UL)         /*!< Disable                                                              */
  #define GPIOTE_INTENCLR5_IN1_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR5_IN1_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN2 @Bit 2 : Write '1' to disable interrupt for event IN[2] */
  #define GPIOTE_INTENCLR5_IN2_Pos (2UL)             /*!< Position of IN2 field.                                               */
  #define GPIOTE_INTENCLR5_IN2_Msk (0x1UL << GPIOTE_INTENCLR5_IN2_Pos) /*!< Bit mask of IN2 field.                             */
  #define GPIOTE_INTENCLR5_IN2_Min (0x0UL)           /*!< Min enumerator value of IN2 field.                                   */
  #define GPIOTE_INTENCLR5_IN2_Max (0x1UL)           /*!< Max enumerator value of IN2 field.                                   */
  #define GPIOTE_INTENCLR5_IN2_Clear (0x1UL)         /*!< Disable                                                              */
  #define GPIOTE_INTENCLR5_IN2_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR5_IN2_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN3 @Bit 3 : Write '1' to disable interrupt for event IN[3] */
  #define GPIOTE_INTENCLR5_IN3_Pos (3UL)             /*!< Position of IN3 field.                                               */
  #define GPIOTE_INTENCLR5_IN3_Msk (0x1UL << GPIOTE_INTENCLR5_IN3_Pos) /*!< Bit mask of IN3 field.                             */
  #define GPIOTE_INTENCLR5_IN3_Min (0x0UL)           /*!< Min enumerator value of IN3 field.                                   */
  #define GPIOTE_INTENCLR5_IN3_Max (0x1UL)           /*!< Max enumerator value of IN3 field.                                   */
  #define GPIOTE_INTENCLR5_IN3_Clear (0x1UL)         /*!< Disable                                                              */
  #define GPIOTE_INTENCLR5_IN3_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR5_IN3_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN4 @Bit 4 : Write '1' to disable interrupt for event IN[4] */
  #define GPIOTE_INTENCLR5_IN4_Pos (4UL)             /*!< Position of IN4 field.                                               */
  #define GPIOTE_INTENCLR5_IN4_Msk (0x1UL << GPIOTE_INTENCLR5_IN4_Pos) /*!< Bit mask of IN4 field.                             */
  #define GPIOTE_INTENCLR5_IN4_Min (0x0UL)           /*!< Min enumerator value of IN4 field.                                   */
  #define GPIOTE_INTENCLR5_IN4_Max (0x1UL)           /*!< Max enumerator value of IN4 field.                                   */
  #define GPIOTE_INTENCLR5_IN4_Clear (0x1UL)         /*!< Disable                                                              */
  #define GPIOTE_INTENCLR5_IN4_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR5_IN4_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN5 @Bit 5 : Write '1' to disable interrupt for event IN[5] */
  #define GPIOTE_INTENCLR5_IN5_Pos (5UL)             /*!< Position of IN5 field.                                               */
  #define GPIOTE_INTENCLR5_IN5_Msk (0x1UL << GPIOTE_INTENCLR5_IN5_Pos) /*!< Bit mask of IN5 field.                             */
  #define GPIOTE_INTENCLR5_IN5_Min (0x0UL)           /*!< Min enumerator value of IN5 field.                                   */
  #define GPIOTE_INTENCLR5_IN5_Max (0x1UL)           /*!< Max enumerator value of IN5 field.                                   */
  #define GPIOTE_INTENCLR5_IN5_Clear (0x1UL)         /*!< Disable                                                              */
  #define GPIOTE_INTENCLR5_IN5_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR5_IN5_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN6 @Bit 6 : Write '1' to disable interrupt for event IN[6] */
  #define GPIOTE_INTENCLR5_IN6_Pos (6UL)             /*!< Position of IN6 field.                                               */
  #define GPIOTE_INTENCLR5_IN6_Msk (0x1UL << GPIOTE_INTENCLR5_IN6_Pos) /*!< Bit mask of IN6 field.                             */
  #define GPIOTE_INTENCLR5_IN6_Min (0x0UL)           /*!< Min enumerator value of IN6 field.                                   */
  #define GPIOTE_INTENCLR5_IN6_Max (0x1UL)           /*!< Max enumerator value of IN6 field.                                   */
  #define GPIOTE_INTENCLR5_IN6_Clear (0x1UL)         /*!< Disable                                                              */
  #define GPIOTE_INTENCLR5_IN6_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR5_IN6_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN7 @Bit 7 : Write '1' to disable interrupt for event IN[7] */
  #define GPIOTE_INTENCLR5_IN7_Pos (7UL)             /*!< Position of IN7 field.                                               */
  #define GPIOTE_INTENCLR5_IN7_Msk (0x1UL << GPIOTE_INTENCLR5_IN7_Pos) /*!< Bit mask of IN7 field.                             */
  #define GPIOTE_INTENCLR5_IN7_Min (0x0UL)           /*!< Min enumerator value of IN7 field.                                   */
  #define GPIOTE_INTENCLR5_IN7_Max (0x1UL)           /*!< Max enumerator value of IN7 field.                                   */
  #define GPIOTE_INTENCLR5_IN7_Clear (0x1UL)         /*!< Disable                                                              */
  #define GPIOTE_INTENCLR5_IN7_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR5_IN7_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* PORT0 @Bit 16 : Write '1' to disable interrupt for event PORT[0] */
  #define GPIOTE_INTENCLR5_PORT0_Pos (16UL)          /*!< Position of PORT0 field.                                             */
  #define GPIOTE_INTENCLR5_PORT0_Msk (0x1UL << GPIOTE_INTENCLR5_PORT0_Pos) /*!< Bit mask of PORT0 field.                       */
  #define GPIOTE_INTENCLR5_PORT0_Min (0x0UL)         /*!< Min enumerator value of PORT0 field.                                 */
  #define GPIOTE_INTENCLR5_PORT0_Max (0x1UL)         /*!< Max enumerator value of PORT0 field.                                 */
  #define GPIOTE_INTENCLR5_PORT0_Clear (0x1UL)       /*!< Disable                                                              */
  #define GPIOTE_INTENCLR5_PORT0_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR5_PORT0_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PORT1 @Bit 17 : Write '1' to disable interrupt for event PORT[1] */
  #define GPIOTE_INTENCLR5_PORT1_Pos (17UL)          /*!< Position of PORT1 field.                                             */
  #define GPIOTE_INTENCLR5_PORT1_Msk (0x1UL << GPIOTE_INTENCLR5_PORT1_Pos) /*!< Bit mask of PORT1 field.                       */
  #define GPIOTE_INTENCLR5_PORT1_Min (0x0UL)         /*!< Min enumerator value of PORT1 field.                                 */
  #define GPIOTE_INTENCLR5_PORT1_Max (0x1UL)         /*!< Max enumerator value of PORT1 field.                                 */
  #define GPIOTE_INTENCLR5_PORT1_Clear (0x1UL)       /*!< Disable                                                              */
  #define GPIOTE_INTENCLR5_PORT1_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR5_PORT1_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PORT2 @Bit 18 : Write '1' to disable interrupt for event PORT[2] */
  #define GPIOTE_INTENCLR5_PORT2_Pos (18UL)          /*!< Position of PORT2 field.                                             */
  #define GPIOTE_INTENCLR5_PORT2_Msk (0x1UL << GPIOTE_INTENCLR5_PORT2_Pos) /*!< Bit mask of PORT2 field.                       */
  #define GPIOTE_INTENCLR5_PORT2_Min (0x0UL)         /*!< Min enumerator value of PORT2 field.                                 */
  #define GPIOTE_INTENCLR5_PORT2_Max (0x1UL)         /*!< Max enumerator value of PORT2 field.                                 */
  #define GPIOTE_INTENCLR5_PORT2_Clear (0x1UL)       /*!< Disable                                                              */
  #define GPIOTE_INTENCLR5_PORT2_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR5_PORT2_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PORT3 @Bit 19 : Write '1' to disable interrupt for event PORT[3] */
  #define GPIOTE_INTENCLR5_PORT3_Pos (19UL)          /*!< Position of PORT3 field.                                             */
  #define GPIOTE_INTENCLR5_PORT3_Msk (0x1UL << GPIOTE_INTENCLR5_PORT3_Pos) /*!< Bit mask of PORT3 field.                       */
  #define GPIOTE_INTENCLR5_PORT3_Min (0x0UL)         /*!< Min enumerator value of PORT3 field.                                 */
  #define GPIOTE_INTENCLR5_PORT3_Max (0x1UL)         /*!< Max enumerator value of PORT3 field.                                 */
  #define GPIOTE_INTENCLR5_PORT3_Clear (0x1UL)       /*!< Disable                                                              */
  #define GPIOTE_INTENCLR5_PORT3_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR5_PORT3_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PORT4 @Bit 20 : Write '1' to disable interrupt for event PORT[4] */
  #define GPIOTE_INTENCLR5_PORT4_Pos (20UL)          /*!< Position of PORT4 field.                                             */
  #define GPIOTE_INTENCLR5_PORT4_Msk (0x1UL << GPIOTE_INTENCLR5_PORT4_Pos) /*!< Bit mask of PORT4 field.                       */
  #define GPIOTE_INTENCLR5_PORT4_Min (0x0UL)         /*!< Min enumerator value of PORT4 field.                                 */
  #define GPIOTE_INTENCLR5_PORT4_Max (0x1UL)         /*!< Max enumerator value of PORT4 field.                                 */
  #define GPIOTE_INTENCLR5_PORT4_Clear (0x1UL)       /*!< Disable                                                              */
  #define GPIOTE_INTENCLR5_PORT4_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR5_PORT4_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PORT5 @Bit 21 : Write '1' to disable interrupt for event PORT[5] */
  #define GPIOTE_INTENCLR5_PORT5_Pos (21UL)          /*!< Position of PORT5 field.                                             */
  #define GPIOTE_INTENCLR5_PORT5_Msk (0x1UL << GPIOTE_INTENCLR5_PORT5_Pos) /*!< Bit mask of PORT5 field.                       */
  #define GPIOTE_INTENCLR5_PORT5_Min (0x0UL)         /*!< Min enumerator value of PORT5 field.                                 */
  #define GPIOTE_INTENCLR5_PORT5_Max (0x1UL)         /*!< Max enumerator value of PORT5 field.                                 */
  #define GPIOTE_INTENCLR5_PORT5_Clear (0x1UL)       /*!< Disable                                                              */
  #define GPIOTE_INTENCLR5_PORT5_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR5_PORT5_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PORT6 @Bit 22 : Write '1' to disable interrupt for event PORT[6] */
  #define GPIOTE_INTENCLR5_PORT6_Pos (22UL)          /*!< Position of PORT6 field.                                             */
  #define GPIOTE_INTENCLR5_PORT6_Msk (0x1UL << GPIOTE_INTENCLR5_PORT6_Pos) /*!< Bit mask of PORT6 field.                       */
  #define GPIOTE_INTENCLR5_PORT6_Min (0x0UL)         /*!< Min enumerator value of PORT6 field.                                 */
  #define GPIOTE_INTENCLR5_PORT6_Max (0x1UL)         /*!< Max enumerator value of PORT6 field.                                 */
  #define GPIOTE_INTENCLR5_PORT6_Clear (0x1UL)       /*!< Disable                                                              */
  #define GPIOTE_INTENCLR5_PORT6_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR5_PORT6_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PORT7 @Bit 23 : Write '1' to disable interrupt for event PORT[7] */
  #define GPIOTE_INTENCLR5_PORT7_Pos (23UL)          /*!< Position of PORT7 field.                                             */
  #define GPIOTE_INTENCLR5_PORT7_Msk (0x1UL << GPIOTE_INTENCLR5_PORT7_Pos) /*!< Bit mask of PORT7 field.                       */
  #define GPIOTE_INTENCLR5_PORT7_Min (0x0UL)         /*!< Min enumerator value of PORT7 field.                                 */
  #define GPIOTE_INTENCLR5_PORT7_Max (0x1UL)         /*!< Max enumerator value of PORT7 field.                                 */
  #define GPIOTE_INTENCLR5_PORT7_Clear (0x1UL)       /*!< Disable                                                              */
  #define GPIOTE_INTENCLR5_PORT7_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR5_PORT7_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

