adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PORT15 @Bit 31 : Write '1' to disable interrupt for event PORT[15] */
  #define GPIOTE_INTENCLR6_PORT15_Pos (31UL)         /*!< Position of PORT15 field.                                            */
  #define GPIOTE_INTENCLR6_PORT15_Msk (0x1UL << GPIOTE_INTENCLR6_PORT15_Pos) /*!< Bit mask of PORT15 field.                    */
  #define GPIOTE_INTENCLR6_PORT15_Min (0x0UL)        /*!< Min enumerator value of PORT15 field.                                */
  #define GPIOTE_INTENCLR6_PORT15_Max (0x1UL)        /*!< Max enumerator value of PORT15 field.                                */
  #define GPIOTE_INTENCLR6_PORT15_Clear (0x1UL)      /*!< Disable                                                              */
  #define GPIOTE_INTENCLR6_PORT15_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR6_PORT15_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* GPIOTE_LATENCY: Latency selection for Event mode (MODE=Event) with rising or falling edge detection on the pin. */
  #define GPIOTE_LATENCY_ResetValue (0x00000001UL)   /*!< Reset value of LATENCY register.                                     */

/* LATENCY @Bit 0 : Latency setting */
  #define GPIOTE_LATENCY_LATENCY_Pos (0UL)           /*!< Position of LATENCY field.                                           */
  #define GPIOTE_LATENCY_LATENCY_Msk (0x1UL << GPIOTE_LATENCY_LATENCY_Pos) /*!< Bit mask of LATENCY field.                     */
  #define GPIOTE_LATENCY_LATENCY_Min (0x0UL)         /*!< Min enumerator value of LATENCY field.                               */
  #define GPIOTE_LATENCY_LATENCY_Max (0x1UL)         /*!< Max enumerator value of LATENCY field.                               */
  #define GPIOTE_LATENCY_LATENCY_LowPower (0x0UL)    /*!< Low power setting, for signals with minimum hold time tGPIOTE,HOLD,LP;
                                                          refer to Electrical specification section*/                             
  #define GPIOTE_LATENCY_LATENCY_LowLatency (0x1UL)  /*!< Low latency setting, for signals with minimum hold time
                                                          tGPIOTE,HOLD,LL; refer to Electrical specification section*/            


/* GPIOTE_CONFIG: Configuration for OUT[n], SET[n], and CLR[n] tasks and IN[n] event */
  #define GPIOTE_CONFIG_MaxCount (8UL)               /*!< Max size of CONFIG[8] array.                                         */
  #define GPIOTE_CONFIG_ResetValue (0x00000000UL)    /*!< Reset value of CONFIG[8] register.                                   */

/* MODE @Bits 0..1 : Mode */
  #define GPIOTE_CONFIG_MODE_Pos (0UL)               /*!< Position of MODE field.                                              */
  #define GPIOTE_CONFIG_MODE_Msk (0x3UL << GPIOTE_CONFIG_MODE_Pos) /*!< Bit mask of MODE field.                                */
  #define GPIOTE_CONFIG_MODE_Min (0x0UL)             /*!< Min enumerator value of MODE field.                                  */
  #define GPIOTE_CONFIG_MODE_Max (0x3UL)             /*!< Max enumerator value of MODE field.                                  */
  #define GPIOTE_CONFIG_MODE_Disabled (0x0UL)        /*!< Disabled. Pin specified by PSEL will not be acquired by the GPIOTE
                                                          module.*/                                                               
  #define GPIOTE_CONFIG_MODE_Event (0x1UL)           /*!< Event mode                                                           */
  #define GPIOTE_CONFIG_MODE_Task (0x3UL)            /*!< Task mode                                                            */

/* PSEL @Bits 4..8 : GPIO number associated with SET[n], CLR[n], and OUT[n] tasks and IN[n] event */
  #define GPIOTE_CONFIG_PSEL_Pos (4UL)               /*!< Position of PSEL field.                                              */
  #define GPIOTE_CONFIG_PSEL_Msk (0x1FUL << GPIOTE_CONFIG_PSEL_Pos) /*!< Bit mask of PSEL field.                               */
  #define GPIOTE_CONFIG_PSEL_Min (0x0UL)             /*!< Min value of PSEL field.                                             */
  #define GPIOTE_CONFIG_PSEL_Max (0x1FUL)            /*!< Max size of PSEL field.                                              */

/* PORT @Bits 9..12 : Port number */
  #define GPIOTE_CONFIG_PORT_Pos (9UL)               /*!< Position of PORT field.                                              */
  #define GPIOTE_CONFIG_PORT_Msk (0xFUL << GPIOTE_CONFIG_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define GPIOTE_CONFIG_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define GPIOTE_CONFIG_PORT_Max (0xFUL)             /*!< Max size of PORT field.                                              */

/* POLARITY @Bits 16..17 : When In task mode: Operation to be performed on output when OUT[n] task is triggered. When In event
                           mode: Operation on input that shall trigger IN[n] event. */                                            
                                                                                                                                  
  #define GPIOTE_CONFIG_POLARITY_Pos (16UL)          /*!< Position of POLARITY field.                                          */
  #define GPIOTE_CONFIG_POLARITY_Msk (0x3UL << GPIOTE_CONFIG_POLARITY_Pos) /*!< Bit mask of POLARITY field.                    */
  #define GPIOTE_CONFIG_POLARITY_Min (0x0UL)         /*!< Min enumerator value of POLARITY field.                              */
  #define GPIOTE_CONFIG_POLARITY_Max (0x3UL)         /*!< Max enumerator value of POLARITY field.                              */
  #define GPIOTE_CONFIG_POLARITY_None (0x0UL)        /*!< Task mode: No effect on pin from OUT[n] task. Event mode: no IN[n]
                                                          event generated on pin activity.*/                                      
  #define GPIOTE_CONFIG_POLARITY_LoToHi (0x1UL)      /*!< Task mode: Set pin from OUT[n] task. Event mode: Generate IN[n] event
                                                          when rising edge on pin.*/                                              
  #define GPIOTE_CONFIG_POLARITY_HiToLo (0x2UL)      /*!< Task mode: Clear pin from OUT[n] task. Event mode: Generate IN[n]
                                                          event when falling edge on pin.*/                                       
  #define GPIOTE_CONFIG_POLARITY_Toggle (0x3UL)      /*!< Task mode: Toggle pin from OUT[n]. Event mode: Generate IN[n] when any
                                                          change on pin.*/                                                        

/* OUTINIT @Bit 20 : When in task mode: Initial value of the output when the GPIOTE channel is configured. When in event mode:
                     No effect. */                                                                                                
                                                                                                                                  
  #define GPIOTE_CONFIG_OUTINIT_Pos (20UL)           /*!< Position of OUTINIT field.                                           */
  #define GPIOTE_CONFIG_OUTINIT_Msk (0x1UL << GPIOTE_CONFIG_OUTINIT_Pos) /*!< Bit mask of OUTINIT field.                       */
  #define GPIOTE_CONFIG_OUTINIT_Min (0x0UL)          /*!< Min enumerator value of OUTINIT field.                               */
  #define GPIOTE_CONFIG_OUTINIT_Max (0x1UL)          /*!< Max enumerator value of OUTINIT field.                               */
  #define GPIOTE_CONFIG_OUTINIT_Low (0x0UL)          /*!< Task mode: Initial value of pin before task triggering is low        */
  #define GPIOTE_CONFIG_OUTINIT_High (0x1UL)         /*!< Task mode: Initial value of pin before task triggering is high       */


/* GPIOTE_DEBOUNCE: Debounce mode for GPIOTE channel n */
  #define GPIOTE_DEBOUNCE_MaxCount (8UL)             /*!< Max size of DEBOUNCE[8] array.                                       */
  #define GPIOTE_DEBOUNCE_ResetValue (0x00000000UL)  /*!< Reset value of DEBOUNCE[8] register.                                 */

/* MODE @Bit 0 : Mode */
  #define GPIOTE_DEBOUNCE_MODE_Pos (0UL)             /*!< Position of MODE field.                                              */
  #define GPIOTE_DEBOUNCE_MODE_Msk (0x1UL << GPIOTE_DEBOUNCE_MODE_Pos) /*!< Bit mask of MODE field.                            */
  #define GPIOTE_DEBOUNCE_MODE_Min (0x0UL)           /*!< Min enumerator value of MODE field.                                  */
  #define GPIOTE_DEBOUNCE_MODE_Max (0x1UL)           /*!< Max enumerator value of MODE field.                                  */
  #define GPIOTE_DEBOUNCE_MODE_Mode0 (0x0UL)         /*!< Mode 0: nRF52 debounce method                                        */
  #define GPIOTE_DEBOUNCE_MODE_Mode1 (0x1UL)         /*!< Mode 1: nRF51 legacy debounce method                                 */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          GRCCONF                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct GRCCONF_GRCFORCEON ================================================ */
/**
  * @brief GRCFORCEON [GRCCONF_GRCFORCEON] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MASK0;                             /*!< (@ 0x00000000) Mask the interrupt from GRC peripheral identifier
                                                                         [31:0]*/                                                 
  __IOM uint32_t  MASK1;                             /*!< (@ 0x00000004) Mask the interrupt from GRC peripheral identifier [63 :
                                                                         32]*/                                                    
} NRF_GRCCONF_GRCFORCEON_Type;                       /*!< Size = 8 (0x008)                                                     */

