adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GRCCONF_GRCFORCEON_MASK0: Mask the interrupt from GRC peripheral identifier [31:0] */
  #define GRCCONF_GRCFORCEON_MASK0_ResetValue (0x00000000UL) /*!< Reset value of MASK0 register.                               */

/* PERIPHID0 @Bit 0 : Interrupt status of the GRC peripheral identifier [0] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID0_Pos (0UL) /*!< Position of PERIPHID0 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID0_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID0_Pos) /*!< Bit mask of PERIPHID0
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID0_Min (0x0UL) /*!< Min enumerator value of PERIPHID0 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID0_Max (0x1UL) /*!< Max enumerator value of PERIPHID0 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID0_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [0] is unmasked             */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID0_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [0] is masked                 */

/* PERIPHID1 @Bit 1 : Interrupt status of the GRC peripheral identifier [1] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID1_Pos (1UL) /*!< Position of PERIPHID1 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID1_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID1_Pos) /*!< Bit mask of PERIPHID1
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID1_Min (0x0UL) /*!< Min enumerator value of PERIPHID1 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID1_Max (0x1UL) /*!< Max enumerator value of PERIPHID1 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID1_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [1] is unmasked             */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID1_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [1] is masked                 */

/* PERIPHID2 @Bit 2 : Interrupt status of the GRC peripheral identifier [2] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID2_Pos (2UL) /*!< Position of PERIPHID2 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID2_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID2_Pos) /*!< Bit mask of PERIPHID2
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID2_Min (0x0UL) /*!< Min enumerator value of PERIPHID2 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID2_Max (0x1UL) /*!< Max enumerator value of PERIPHID2 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID2_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [2] is unmasked             */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID2_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [2] is masked                 */

/* PERIPHID3 @Bit 3 : Interrupt status of the GRC peripheral identifier [3] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID3_Pos (3UL) /*!< Position of PERIPHID3 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID3_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID3_Pos) /*!< Bit mask of PERIPHID3
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID3_Min (0x0UL) /*!< Min enumerator value of PERIPHID3 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID3_Max (0x1UL) /*!< Max enumerator value of PERIPHID3 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID3_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [3] is unmasked             */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID3_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [3] is masked                 */

/* PERIPHID4 @Bit 4 : Interrupt status of the GRC peripheral identifier [4] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID4_Pos (4UL) /*!< Position of PERIPHID4 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID4_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID4_Pos) /*!< Bit mask of PERIPHID4
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID4_Min (0x0UL) /*!< Min enumerator value of PERIPHID4 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID4_Max (0x1UL) /*!< Max enumerator value of PERIPHID4 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID4_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [4] is unmasked             */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID4_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [4] is masked                 */

/* PERIPHID5 @Bit 5 : Interrupt status of the GRC peripheral identifier [5] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID5_Pos (5UL) /*!< Position of PERIPHID5 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID5_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID5_Pos) /*!< Bit mask of PERIPHID5
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID5_Min (0x0UL) /*!< Min enumerator value of PERIPHID5 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID5_Max (0x1UL) /*!< Max enumerator value of PERIPHID5 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID5_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [5] is unmasked             */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID5_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [5] is masked                 */

/* PERIPHID6 @Bit 6 : Interrupt status of the GRC peripheral identifier [6] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID6_Pos (6UL) /*!< Position of PERIPHID6 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID6_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID6_Pos) /*!< Bit mask of PERIPHID6
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID6_Min (0x0UL) /*!< Min enumerator value of PERIPHID6 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID6_Max (0x1UL) /*!< Max enumerator value of PERIPHID6 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID6_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [6] is unmasked             */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID6_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [6] is masked                 */

/* PERIPHID7 @Bit 7 : Interrupt status of the GRC peripheral identifier [7] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID7_Pos (7UL) /*!< Position of PERIPHID7 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID7_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID7_Pos) /*!< Bit mask of PERIPHID7
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID7_Min (0x0UL) /*!< Min enumerator value of PERIPHID7 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID7_Max (0x1UL) /*!< Max enumerator value of PERIPHID7 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID7_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [7] is unmasked             */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID7_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [7] is masked                 */

