adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PERIPHID8 @Bit 8 : Interrupt status of the GRC peripheral identifier [8] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID8_Pos (8UL) /*!< Position of PERIPHID8 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID8_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID8_Pos) /*!< Bit mask of PERIPHID8
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID8_Min (0x0UL) /*!< Min enumerator value of PERIPHID8 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID8_Max (0x1UL) /*!< Max enumerator value of PERIPHID8 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID8_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [8] is unmasked             */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID8_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [8] is masked                 */

/* PERIPHID9 @Bit 9 : Interrupt status of the GRC peripheral identifier [9] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID9_Pos (9UL) /*!< Position of PERIPHID9 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID9_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID9_Pos) /*!< Bit mask of PERIPHID9
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID9_Min (0x0UL) /*!< Min enumerator value of PERIPHID9 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID9_Max (0x1UL) /*!< Max enumerator value of PERIPHID9 field.                         */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID9_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [9] is unmasked             */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID9_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [9] is masked                 */

/* PERIPHID10 @Bit 10 : Interrupt status of the GRC peripheral identifier [10] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID10_Pos (10UL) /*!< Position of PERIPHID10 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID10_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID10_Pos) /*!< Bit mask of PERIPHID10
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID10_Min (0x0UL) /*!< Min enumerator value of PERIPHID10 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID10_Max (0x1UL) /*!< Max enumerator value of PERIPHID10 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID10_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [10] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID10_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [10] is masked               */

/* PERIPHID11 @Bit 11 : Interrupt status of the GRC peripheral identifier [11] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID11_Pos (11UL) /*!< Position of PERIPHID11 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID11_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID11_Pos) /*!< Bit mask of PERIPHID11
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID11_Min (0x0UL) /*!< Min enumerator value of PERIPHID11 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID11_Max (0x1UL) /*!< Max enumerator value of PERIPHID11 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID11_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [11] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID11_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [11] is masked               */

/* PERIPHID12 @Bit 12 : Interrupt status of the GRC peripheral identifier [12] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID12_Pos (12UL) /*!< Position of PERIPHID12 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID12_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID12_Pos) /*!< Bit mask of PERIPHID12
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID12_Min (0x0UL) /*!< Min enumerator value of PERIPHID12 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID12_Max (0x1UL) /*!< Max enumerator value of PERIPHID12 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID12_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [12] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID12_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [12] is masked               */

/* PERIPHID13 @Bit 13 : Interrupt status of the GRC peripheral identifier [13] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID13_Pos (13UL) /*!< Position of PERIPHID13 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID13_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID13_Pos) /*!< Bit mask of PERIPHID13
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID13_Min (0x0UL) /*!< Min enumerator value of PERIPHID13 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID13_Max (0x1UL) /*!< Max enumerator value of PERIPHID13 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID13_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [13] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID13_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [13] is masked               */

/* PERIPHID14 @Bit 14 : Interrupt status of the GRC peripheral identifier [14] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID14_Pos (14UL) /*!< Position of PERIPHID14 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID14_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID14_Pos) /*!< Bit mask of PERIPHID14
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID14_Min (0x0UL) /*!< Min enumerator value of PERIPHID14 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID14_Max (0x1UL) /*!< Max enumerator value of PERIPHID14 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID14_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [14] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID14_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [14] is masked               */

/* PERIPHID15 @Bit 15 : Interrupt status of the GRC peripheral identifier [15] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID15_Pos (15UL) /*!< Position of PERIPHID15 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID15_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID15_Pos) /*!< Bit mask of PERIPHID15
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID15_Min (0x0UL) /*!< Min enumerator value of PERIPHID15 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID15_Max (0x1UL) /*!< Max enumerator value of PERIPHID15 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID15_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [15] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID15_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [15] is masked               */

/* PERIPHID16 @Bit 16 : Interrupt status of the GRC peripheral identifier [16] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID16_Pos (16UL) /*!< Position of PERIPHID16 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID16_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID16_Pos) /*!< Bit mask of PERIPHID16
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID16_Min (0x0UL) /*!< Min enumerator value of PERIPHID16 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID16_Max (0x1UL) /*!< Max enumerator value of PERIPHID16 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID16_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [16] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID16_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [16] is masked               */

