adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PERIPHID17 @Bit 17 : Interrupt status of the GRC peripheral identifier [17] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID17_Pos (17UL) /*!< Position of PERIPHID17 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID17_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID17_Pos) /*!< Bit mask of PERIPHID17
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID17_Min (0x0UL) /*!< Min enumerator value of PERIPHID17 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID17_Max (0x1UL) /*!< Max enumerator value of PERIPHID17 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID17_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [17] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID17_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [17] is masked               */

/* PERIPHID18 @Bit 18 : Interrupt status of the GRC peripheral identifier [18] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID18_Pos (18UL) /*!< Position of PERIPHID18 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID18_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID18_Pos) /*!< Bit mask of PERIPHID18
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID18_Min (0x0UL) /*!< Min enumerator value of PERIPHID18 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID18_Max (0x1UL) /*!< Max enumerator value of PERIPHID18 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID18_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [18] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID18_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [18] is masked               */

/* PERIPHID19 @Bit 19 : Interrupt status of the GRC peripheral identifier [19] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID19_Pos (19UL) /*!< Position of PERIPHID19 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID19_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID19_Pos) /*!< Bit mask of PERIPHID19
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID19_Min (0x0UL) /*!< Min enumerator value of PERIPHID19 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID19_Max (0x1UL) /*!< Max enumerator value of PERIPHID19 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID19_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [19] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID19_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [19] is masked               */

/* PERIPHID20 @Bit 20 : Interrupt status of the GRC peripheral identifier [20] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID20_Pos (20UL) /*!< Position of PERIPHID20 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID20_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID20_Pos) /*!< Bit mask of PERIPHID20
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID20_Min (0x0UL) /*!< Min enumerator value of PERIPHID20 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID20_Max (0x1UL) /*!< Max enumerator value of PERIPHID20 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID20_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [20] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID20_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [20] is masked               */

/* PERIPHID21 @Bit 21 : Interrupt status of the GRC peripheral identifier [21] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID21_Pos (21UL) /*!< Position of PERIPHID21 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID21_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID21_Pos) /*!< Bit mask of PERIPHID21
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID21_Min (0x0UL) /*!< Min enumerator value of PERIPHID21 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID21_Max (0x1UL) /*!< Max enumerator value of PERIPHID21 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID21_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [21] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID21_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [21] is masked               */

/* PERIPHID22 @Bit 22 : Interrupt status of the GRC peripheral identifier [22] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID22_Pos (22UL) /*!< Position of PERIPHID22 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID22_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID22_Pos) /*!< Bit mask of PERIPHID22
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID22_Min (0x0UL) /*!< Min enumerator value of PERIPHID22 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID22_Max (0x1UL) /*!< Max enumerator value of PERIPHID22 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID22_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [22] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID22_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [22] is masked               */

/* PERIPHID23 @Bit 23 : Interrupt status of the GRC peripheral identifier [23] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID23_Pos (23UL) /*!< Position of PERIPHID23 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID23_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID23_Pos) /*!< Bit mask of PERIPHID23
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID23_Min (0x0UL) /*!< Min enumerator value of PERIPHID23 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID23_Max (0x1UL) /*!< Max enumerator value of PERIPHID23 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID23_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [23] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID23_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [23] is masked               */

/* PERIPHID24 @Bit 24 : Interrupt status of the GRC peripheral identifier [24] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID24_Pos (24UL) /*!< Position of PERIPHID24 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID24_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID24_Pos) /*!< Bit mask of PERIPHID24
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID24_Min (0x0UL) /*!< Min enumerator value of PERIPHID24 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID24_Max (0x1UL) /*!< Max enumerator value of PERIPHID24 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID24_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [24] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID24_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [24] is masked               */

/* PERIPHID25 @Bit 25 : Interrupt status of the GRC peripheral identifier [25] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID25_Pos (25UL) /*!< Position of PERIPHID25 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID25_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID25_Pos) /*!< Bit mask of PERIPHID25
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID25_Min (0x0UL) /*!< Min enumerator value of PERIPHID25 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID25_Max (0x1UL) /*!< Max enumerator value of PERIPHID25 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID25_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [25] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID25_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [25] is masked               */

/* PERIPHID26 @Bit 26 : Interrupt status of the GRC peripheral identifier [26] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID26_Pos (26UL) /*!< Position of PERIPHID26 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID26_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID26_Pos) /*!< Bit mask of PERIPHID26
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID26_Min (0x0UL) /*!< Min enumerator value of PERIPHID26 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID26_Max (0x1UL) /*!< Max enumerator value of PERIPHID26 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID26_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [26] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID26_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [26] is masked               */

/* PERIPHID27 @Bit 27 : Interrupt status of the GRC peripheral identifier [27] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID27_Pos (27UL) /*!< Position of PERIPHID27 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID27_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID27_Pos) /*!< Bit mask of PERIPHID27
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID27_Min (0x0UL) /*!< Min enumerator value of PERIPHID27 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID27_Max (0x1UL) /*!< Max enumerator value of PERIPHID27 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID27_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [27] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID27_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [27] is masked               */

/* PERIPHID28 @Bit 28 : Interrupt status of the GRC peripheral identifier [28] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID28_Pos (28UL) /*!< Position of PERIPHID28 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID28_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID28_Pos) /*!< Bit mask of PERIPHID28
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID28_Min (0x0UL) /*!< Min enumerator value of PERIPHID28 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID28_Max (0x1UL) /*!< Max enumerator value of PERIPHID28 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID28_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [28] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID28_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [28] is masked               */

