adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PERIPHID29 @Bit 29 : Interrupt status of the GRC peripheral identifier [29] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID29_Pos (29UL) /*!< Position of PERIPHID29 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID29_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID29_Pos) /*!< Bit mask of PERIPHID29
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID29_Min (0x0UL) /*!< Min enumerator value of PERIPHID29 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID29_Max (0x1UL) /*!< Max enumerator value of PERIPHID29 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID29_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [29] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID29_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [29] is masked               */

/* PERIPHID30 @Bit 30 : Interrupt status of the GRC peripheral identifier [30] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID30_Pos (30UL) /*!< Position of PERIPHID30 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID30_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID30_Pos) /*!< Bit mask of PERIPHID30
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID30_Min (0x0UL) /*!< Min enumerator value of PERIPHID30 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID30_Max (0x1UL) /*!< Max enumerator value of PERIPHID30 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID30_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [30] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID30_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [30] is masked               */

/* PERIPHID31 @Bit 31 : Interrupt status of the GRC peripheral identifier [31] */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID31_Pos (31UL) /*!< Position of PERIPHID31 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID31_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK0_PERIPHID31_Pos) /*!< Bit mask of PERIPHID31
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID31_Min (0x0UL) /*!< Min enumerator value of PERIPHID31 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID31_Max (0x1UL) /*!< Max enumerator value of PERIPHID31 field.                       */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID31_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [31] is unmasked           */
  #define GRCCONF_GRCFORCEON_MASK0_PERIPHID31_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [31] is masked               */


/* GRCCONF_GRCFORCEON_MASK1: Mask the interrupt from GRC peripheral identifier [63 : 32] */
  #define GRCCONF_GRCFORCEON_MASK1_ResetValue (0x00000000UL) /*!< Reset value of MASK1 register.                               */

/* PERIPHID0 @Bit 0 : Interrupt status of the GRC peripheral identifier [32 + 0] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID0_Pos (0UL) /*!< Position of PERIPHID0 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID0_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID0_Pos) /*!< Bit mask of PERIPHID0
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID0_Min (0x0UL) /*!< Min enumerator value of PERIPHID0 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID0_Max (0x1UL) /*!< Max enumerator value of PERIPHID0 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID0_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 0] is unmasked        */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID0_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 0] is masked            */

/* PERIPHID1 @Bit 1 : Interrupt status of the GRC peripheral identifier [32 + 1] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID1_Pos (1UL) /*!< Position of PERIPHID1 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID1_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID1_Pos) /*!< Bit mask of PERIPHID1
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID1_Min (0x0UL) /*!< Min enumerator value of PERIPHID1 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID1_Max (0x1UL) /*!< Max enumerator value of PERIPHID1 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID1_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 1] is unmasked        */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID1_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 1] is masked            */

/* PERIPHID2 @Bit 2 : Interrupt status of the GRC peripheral identifier [32 + 2] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID2_Pos (2UL) /*!< Position of PERIPHID2 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID2_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID2_Pos) /*!< Bit mask of PERIPHID2
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID2_Min (0x0UL) /*!< Min enumerator value of PERIPHID2 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID2_Max (0x1UL) /*!< Max enumerator value of PERIPHID2 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID2_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 2] is unmasked        */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID2_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 2] is masked            */

