adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PERIPHID3 @Bit 3 : Interrupt status of the GRC peripheral identifier [32 + 3] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID3_Pos (3UL) /*!< Position of PERIPHID3 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID3_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID3_Pos) /*!< Bit mask of PERIPHID3
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID3_Min (0x0UL) /*!< Min enumerator value of PERIPHID3 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID3_Max (0x1UL) /*!< Max enumerator value of PERIPHID3 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID3_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 3] is unmasked        */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID3_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 3] is masked            */

/* PERIPHID4 @Bit 4 : Interrupt status of the GRC peripheral identifier [32 + 4] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID4_Pos (4UL) /*!< Position of PERIPHID4 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID4_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID4_Pos) /*!< Bit mask of PERIPHID4
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID4_Min (0x0UL) /*!< Min enumerator value of PERIPHID4 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID4_Max (0x1UL) /*!< Max enumerator value of PERIPHID4 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID4_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 4] is unmasked        */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID4_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 4] is masked            */

/* PERIPHID5 @Bit 5 : Interrupt status of the GRC peripheral identifier [32 + 5] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID5_Pos (5UL) /*!< Position of PERIPHID5 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID5_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID5_Pos) /*!< Bit mask of PERIPHID5
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID5_Min (0x0UL) /*!< Min enumerator value of PERIPHID5 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID5_Max (0x1UL) /*!< Max enumerator value of PERIPHID5 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID5_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 5] is unmasked        */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID5_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 5] is masked            */

/* PERIPHID6 @Bit 6 : Interrupt status of the GRC peripheral identifier [32 + 6] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID6_Pos (6UL) /*!< Position of PERIPHID6 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID6_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID6_Pos) /*!< Bit mask of PERIPHID6
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID6_Min (0x0UL) /*!< Min enumerator value of PERIPHID6 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID6_Max (0x1UL) /*!< Max enumerator value of PERIPHID6 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID6_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 6] is unmasked        */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID6_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 6] is masked            */

/* PERIPHID7 @Bit 7 : Interrupt status of the GRC peripheral identifier [32 + 7] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID7_Pos (7UL) /*!< Position of PERIPHID7 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID7_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID7_Pos) /*!< Bit mask of PERIPHID7
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID7_Min (0x0UL) /*!< Min enumerator value of PERIPHID7 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID7_Max (0x1UL) /*!< Max enumerator value of PERIPHID7 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID7_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 7] is unmasked        */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID7_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 7] is masked            */

/* PERIPHID8 @Bit 8 : Interrupt status of the GRC peripheral identifier [32 + 8] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID8_Pos (8UL) /*!< Position of PERIPHID8 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID8_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID8_Pos) /*!< Bit mask of PERIPHID8
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID8_Min (0x0UL) /*!< Min enumerator value of PERIPHID8 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID8_Max (0x1UL) /*!< Max enumerator value of PERIPHID8 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID8_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 8] is unmasked        */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID8_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 8] is masked            */

/* PERIPHID9 @Bit 9 : Interrupt status of the GRC peripheral identifier [32 + 9] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID9_Pos (9UL) /*!< Position of PERIPHID9 field.                                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID9_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID9_Pos) /*!< Bit mask of PERIPHID9
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID9_Min (0x0UL) /*!< Min enumerator value of PERIPHID9 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID9_Max (0x1UL) /*!< Max enumerator value of PERIPHID9 field.                         */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID9_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 9] is unmasked        */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID9_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 9] is masked            */

/* PERIPHID10 @Bit 10 : Interrupt status of the GRC peripheral identifier [32 + 10] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID10_Pos (10UL) /*!< Position of PERIPHID10 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID10_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID10_Pos) /*!< Bit mask of PERIPHID10
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID10_Min (0x0UL) /*!< Min enumerator value of PERIPHID10 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID10_Max (0x1UL) /*!< Max enumerator value of PERIPHID10 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID10_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 10] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID10_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 10] is masked          */

/* PERIPHID11 @Bit 11 : Interrupt status of the GRC peripheral identifier [32 + 11] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID11_Pos (11UL) /*!< Position of PERIPHID11 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID11_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID11_Pos) /*!< Bit mask of PERIPHID11
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID11_Min (0x0UL) /*!< Min enumerator value of PERIPHID11 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID11_Max (0x1UL) /*!< Max enumerator value of PERIPHID11 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID11_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 11] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID11_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 11] is masked          */

/* PERIPHID12 @Bit 12 : Interrupt status of the GRC peripheral identifier [32 + 12] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID12_Pos (12UL) /*!< Position of PERIPHID12 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID12_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID12_Pos) /*!< Bit mask of PERIPHID12
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID12_Min (0x0UL) /*!< Min enumerator value of PERIPHID12 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID12_Max (0x1UL) /*!< Max enumerator value of PERIPHID12 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID12_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 12] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID12_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 12] is masked          */

/* PERIPHID13 @Bit 13 : Interrupt status of the GRC peripheral identifier [32 + 13] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID13_Pos (13UL) /*!< Position of PERIPHID13 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID13_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID13_Pos) /*!< Bit mask of PERIPHID13
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID13_Min (0x0UL) /*!< Min enumerator value of PERIPHID13 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID13_Max (0x1UL) /*!< Max enumerator value of PERIPHID13 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID13_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 13] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID13_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 13] is masked          */

