adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PERIPHID14 @Bit 14 : Interrupt status of the GRC peripheral identifier [32 + 14] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID14_Pos (14UL) /*!< Position of PERIPHID14 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID14_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID14_Pos) /*!< Bit mask of PERIPHID14
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID14_Min (0x0UL) /*!< Min enumerator value of PERIPHID14 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID14_Max (0x1UL) /*!< Max enumerator value of PERIPHID14 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID14_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 14] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID14_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 14] is masked          */

/* PERIPHID15 @Bit 15 : Interrupt status of the GRC peripheral identifier [32 + 15] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID15_Pos (15UL) /*!< Position of PERIPHID15 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID15_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID15_Pos) /*!< Bit mask of PERIPHID15
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID15_Min (0x0UL) /*!< Min enumerator value of PERIPHID15 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID15_Max (0x1UL) /*!< Max enumerator value of PERIPHID15 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID15_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 15] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID15_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 15] is masked          */

/* PERIPHID16 @Bit 16 : Interrupt status of the GRC peripheral identifier [32 + 16] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID16_Pos (16UL) /*!< Position of PERIPHID16 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID16_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID16_Pos) /*!< Bit mask of PERIPHID16
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID16_Min (0x0UL) /*!< Min enumerator value of PERIPHID16 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID16_Max (0x1UL) /*!< Max enumerator value of PERIPHID16 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID16_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 16] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID16_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 16] is masked          */

/* PERIPHID17 @Bit 17 : Interrupt status of the GRC peripheral identifier [32 + 17] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID17_Pos (17UL) /*!< Position of PERIPHID17 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID17_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID17_Pos) /*!< Bit mask of PERIPHID17
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID17_Min (0x0UL) /*!< Min enumerator value of PERIPHID17 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID17_Max (0x1UL) /*!< Max enumerator value of PERIPHID17 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID17_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 17] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID17_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 17] is masked          */

/* PERIPHID18 @Bit 18 : Interrupt status of the GRC peripheral identifier [32 + 18] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID18_Pos (18UL) /*!< Position of PERIPHID18 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID18_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID18_Pos) /*!< Bit mask of PERIPHID18
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID18_Min (0x0UL) /*!< Min enumerator value of PERIPHID18 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID18_Max (0x1UL) /*!< Max enumerator value of PERIPHID18 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID18_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 18] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID18_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 18] is masked          */

/* PERIPHID19 @Bit 19 : Interrupt status of the GRC peripheral identifier [32 + 19] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID19_Pos (19UL) /*!< Position of PERIPHID19 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID19_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID19_Pos) /*!< Bit mask of PERIPHID19
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID19_Min (0x0UL) /*!< Min enumerator value of PERIPHID19 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID19_Max (0x1UL) /*!< Max enumerator value of PERIPHID19 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID19_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 19] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID19_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 19] is masked          */

/* PERIPHID20 @Bit 20 : Interrupt status of the GRC peripheral identifier [32 + 20] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID20_Pos (20UL) /*!< Position of PERIPHID20 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID20_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID20_Pos) /*!< Bit mask of PERIPHID20
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID20_Min (0x0UL) /*!< Min enumerator value of PERIPHID20 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID20_Max (0x1UL) /*!< Max enumerator value of PERIPHID20 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID20_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 20] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID20_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 20] is masked          */

/* PERIPHID21 @Bit 21 : Interrupt status of the GRC peripheral identifier [32 + 21] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID21_Pos (21UL) /*!< Position of PERIPHID21 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID21_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID21_Pos) /*!< Bit mask of PERIPHID21
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID21_Min (0x0UL) /*!< Min enumerator value of PERIPHID21 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID21_Max (0x1UL) /*!< Max enumerator value of PERIPHID21 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID21_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 21] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID21_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 21] is masked          */

/* PERIPHID22 @Bit 22 : Interrupt status of the GRC peripheral identifier [32 + 22] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID22_Pos (22UL) /*!< Position of PERIPHID22 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID22_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID22_Pos) /*!< Bit mask of PERIPHID22
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID22_Min (0x0UL) /*!< Min enumerator value of PERIPHID22 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID22_Max (0x1UL) /*!< Max enumerator value of PERIPHID22 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID22_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 22] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID22_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 22] is masked          */

/* PERIPHID23 @Bit 23 : Interrupt status of the GRC peripheral identifier [32 + 23] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID23_Pos (23UL) /*!< Position of PERIPHID23 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID23_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID23_Pos) /*!< Bit mask of PERIPHID23
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID23_Min (0x0UL) /*!< Min enumerator value of PERIPHID23 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID23_Max (0x1UL) /*!< Max enumerator value of PERIPHID23 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID23_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 23] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID23_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 23] is masked          */

/* PERIPHID24 @Bit 24 : Interrupt status of the GRC peripheral identifier [32 + 24] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID24_Pos (24UL) /*!< Position of PERIPHID24 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID24_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID24_Pos) /*!< Bit mask of PERIPHID24
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID24_Min (0x0UL) /*!< Min enumerator value of PERIPHID24 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID24_Max (0x1UL) /*!< Max enumerator value of PERIPHID24 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID24_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 24] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID24_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 24] is masked          */

/* PERIPHID25 @Bit 25 : Interrupt status of the GRC peripheral identifier [32 + 25] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID25_Pos (25UL) /*!< Position of PERIPHID25 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID25_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID25_Pos) /*!< Bit mask of PERIPHID25
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID25_Min (0x0UL) /*!< Min enumerator value of PERIPHID25 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID25_Max (0x1UL) /*!< Max enumerator value of PERIPHID25 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID25_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 25] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID25_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 25] is masked          */

