adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PERIPHID26 @Bit 26 : Interrupt status of the GRC peripheral identifier [32 + 26] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID26_Pos (26UL) /*!< Position of PERIPHID26 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID26_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID26_Pos) /*!< Bit mask of PERIPHID26
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID26_Min (0x0UL) /*!< Min enumerator value of PERIPHID26 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID26_Max (0x1UL) /*!< Max enumerator value of PERIPHID26 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID26_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 26] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID26_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 26] is masked          */

/* PERIPHID27 @Bit 27 : Interrupt status of the GRC peripheral identifier [32 + 27] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID27_Pos (27UL) /*!< Position of PERIPHID27 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID27_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID27_Pos) /*!< Bit mask of PERIPHID27
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID27_Min (0x0UL) /*!< Min enumerator value of PERIPHID27 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID27_Max (0x1UL) /*!< Max enumerator value of PERIPHID27 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID27_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 27] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID27_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 27] is masked          */

/* PERIPHID28 @Bit 28 : Interrupt status of the GRC peripheral identifier [32 + 28] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID28_Pos (28UL) /*!< Position of PERIPHID28 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID28_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID28_Pos) /*!< Bit mask of PERIPHID28
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID28_Min (0x0UL) /*!< Min enumerator value of PERIPHID28 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID28_Max (0x1UL) /*!< Max enumerator value of PERIPHID28 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID28_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 28] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID28_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 28] is masked          */

/* PERIPHID29 @Bit 29 : Interrupt status of the GRC peripheral identifier [32 + 29] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID29_Pos (29UL) /*!< Position of PERIPHID29 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID29_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID29_Pos) /*!< Bit mask of PERIPHID29
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID29_Min (0x0UL) /*!< Min enumerator value of PERIPHID29 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID29_Max (0x1UL) /*!< Max enumerator value of PERIPHID29 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID29_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 29] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID29_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 29] is masked          */

/* PERIPHID30 @Bit 30 : Interrupt status of the GRC peripheral identifier [32 + 30] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID30_Pos (30UL) /*!< Position of PERIPHID30 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID30_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID30_Pos) /*!< Bit mask of PERIPHID30
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID30_Min (0x0UL) /*!< Min enumerator value of PERIPHID30 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID30_Max (0x1UL) /*!< Max enumerator value of PERIPHID30 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID30_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 30] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID30_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 30] is masked          */

/* PERIPHID31 @Bit 31 : Interrupt status of the GRC peripheral identifier [32 + 31] */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID31_Pos (31UL) /*!< Position of PERIPHID31 field.                                    */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID31_Msk (0x1UL << GRCCONF_GRCFORCEON_MASK1_PERIPHID31_Pos) /*!< Bit mask of PERIPHID31
                                                                            field.*/                                              
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID31_Min (0x0UL) /*!< Min enumerator value of PERIPHID31 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID31_Max (0x1UL) /*!< Max enumerator value of PERIPHID31 field.                       */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID31_Unmask (0x0UL) /*!< Interrupt from the GRC peripheral [32 + 31] is unmasked      */
  #define GRCCONF_GRCFORCEON_MASK1_PERIPHID31_Mask (0x1UL) /*!< Interrupt from the GRC peripheral [32 + 31] is masked          */



/* ================================================= Struct GRCCONF_METALFIX ================================================= */
/**
  * @brief METALFIX [GRCCONF_METALFIX] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PDMAIN;                            /*!< (@ 0x00000000) Register for possible metal-fix in GRC MAIN power
                                                                         domain*/                                                 
  __IOM uint32_t  PDACT;                             /*!< (@ 0x00000004) Register for possible metal-fix in GRC ACT power
                                                                         domain*/                                                 
} NRF_GRCCONF_METALFIX_Type;                         /*!< Size = 8 (0x008)                                                     */

/* GRCCONF_METALFIX_PDMAIN: Register for possible metal-fix in GRC MAIN power domain */
  #define GRCCONF_METALFIX_PDMAIN_ResetValue (0x00000000UL) /*!< Reset value of PDMAIN register.                               */

/* VAL @Bits 0..3 : Value */
  #define GRCCONF_METALFIX_PDMAIN_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define GRCCONF_METALFIX_PDMAIN_VAL_Msk (0xFUL << GRCCONF_METALFIX_PDMAIN_VAL_Pos) /*!< Bit mask of VAL field.               */
  #define GRCCONF_METALFIX_PDMAIN_VAL_Min (0x0UL)    /*!< Min value of VAL field.                                              */
  #define GRCCONF_METALFIX_PDMAIN_VAL_Max (0xFUL)    /*!< Max size of VAL field.                                               */


/* GRCCONF_METALFIX_PDACT: Register for possible metal-fix in GRC ACT power domain */
  #define GRCCONF_METALFIX_PDACT_ResetValue (0x00000000UL) /*!< Reset value of PDACT register.                                 */

