adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VAL @Bits 0..31 : Value */
  #define GRCCONF_METALFIX_PDACT_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define GRCCONF_METALFIX_PDACT_VAL_Msk (0xFFFFFFFFUL << GRCCONF_METALFIX_PDACT_VAL_Pos) /*!< Bit mask of VAL field.          */
  #define GRCCONF_METALFIX_PDACT_VAL_Min (0x0UL)     /*!< Min value of VAL field.                                              */
  #define GRCCONF_METALFIX_PDACT_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                            */


/* ===================================================== Struct GRCCONF ====================================================== */
/**
  * @brief GRCCONF
  */
  typedef struct {                                   /*!< GRCCONF Structure                                                    */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_GRCPERIPH0[32];            /*!< (@ 0x00000100) Event indicating that interrupt triggered for GRC
                                                                         peripheral identifier [n]*/                              
    __IOM uint32_t EVENTS_GRCPERIPH1[32];            /*!< (@ 0x00000180) Event indicating that interrupt triggered for GRC
                                                                         peripheral identifier [32 + n]*/                         
    __IOM uint32_t EVENTS_SYSTEMOFFREADY;            /*!< (@ 0x00000200) Event indicating that the device is ready to go to
                                                                         System OFF*/                                             
    __IOM uint32_t EVENTS_SYSTEMOFFNOTREADY;         /*!< (@ 0x00000204) Event indicating that the device is not ready to go to
                                                                         System OFF*/                                             
    __IM uint32_t RESERVED1[126];
    __IOM uint32_t INTEN00;                          /*!< (@ 0x00000400) Enable or disable interrupt                           */
    __IOM uint32_t INTEN01;                          /*!< (@ 0x00000404) Enable or disable interrupt                           */
    __IOM uint32_t INTEN02;                          /*!< (@ 0x00000408) Enable or disable interrupt                           */
    __IOM uint32_t INTEN03;                          /*!< (@ 0x0000040C) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET00;                       /*!< (@ 0x00000410) Enable interrupt                                      */
    __IOM uint32_t INTENSET01;                       /*!< (@ 0x00000414) Enable interrupt                                      */
    __IOM uint32_t INTENSET02;                       /*!< (@ 0x00000418) Enable interrupt                                      */
    __IOM uint32_t INTENSET03;                       /*!< (@ 0x0000041C) Enable interrupt                                      */
    __IOM uint32_t INTENCLR00;                       /*!< (@ 0x00000420) Disable interrupt                                     */
    __IOM uint32_t INTENCLR01;                       /*!< (@ 0x00000424) Disable interrupt                                     */
    __IOM uint32_t INTENCLR02;                       /*!< (@ 0x00000428) Disable interrupt                                     */
    __IOM uint32_t INTENCLR03;                       /*!< (@ 0x0000042C) Disable interrupt                                     */
    __IM uint32_t INTPEND00;                         /*!< (@ 0x00000430) Pending interrupts                                    */
    __IM uint32_t INTPEND01;                         /*!< (@ 0x00000434) Pending interrupts                                    */
    __IM uint32_t INTPEND02;                         /*!< (@ 0x00000438) Pending interrupts                                    */
    __IM uint32_t INTPEND03;                         /*!< (@ 0x0000043C) Pending interrupts                                    */
    __IOM uint32_t INTEN10;                          /*!< (@ 0x00000440) Enable or disable interrupt                           */
    __IOM uint32_t INTEN11;                          /*!< (@ 0x00000444) Enable or disable interrupt                           */
    __IOM uint32_t INTEN12;                          /*!< (@ 0x00000448) Enable or disable interrupt                           */
    __IOM uint32_t INTEN13;                          /*!< (@ 0x0000044C) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET10;                       /*!< (@ 0x00000450) Enable interrupt                                      */
    __IOM uint32_t INTENSET11;                       /*!< (@ 0x00000454) Enable interrupt                                      */
    __IOM uint32_t INTENSET12;                       /*!< (@ 0x00000458) Enable interrupt                                      */
    __IOM uint32_t INTENSET13;                       /*!< (@ 0x0000045C) Enable interrupt                                      */
    __IOM uint32_t INTENCLR10;                       /*!< (@ 0x00000460) Disable interrupt                                     */
    __IOM uint32_t INTENCLR11;                       /*!< (@ 0x00000464) Disable interrupt                                     */
    __IOM uint32_t INTENCLR12;                       /*!< (@ 0x00000468) Disable interrupt                                     */
    __IOM uint32_t INTENCLR13;                       /*!< (@ 0x0000046C) Disable interrupt                                     */
    __IM uint32_t INTPEND10;                         /*!< (@ 0x00000470) Pending interrupts                                    */
    __IM uint32_t INTPEND11;                         /*!< (@ 0x00000474) Pending interrupts                                    */
    __IM uint32_t INTPEND12;                         /*!< (@ 0x00000478) Pending interrupts                                    */
    __IM uint32_t INTPEND13;                         /*!< (@ 0x0000047C) Pending interrupts                                    */
    __IOM uint32_t INTEN20;                          /*!< (@ 0x00000480) Enable or disable interrupt                           */
    __IOM uint32_t INTEN21;                          /*!< (@ 0x00000484) Enable or disable interrupt                           */
    __IOM uint32_t INTEN22;                          /*!< (@ 0x00000488) Enable or disable interrupt                           */
    __IOM uint32_t INTEN23;                          /*!< (@ 0x0000048C) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET20;                       /*!< (@ 0x00000490) Enable interrupt                                      */
    __IOM uint32_t INTENSET21;                       /*!< (@ 0x00000494) Enable interrupt                                      */
    __IOM uint32_t INTENSET22;                       /*!< (@ 0x00000498) Enable interrupt                                      */
    __IOM uint32_t INTENSET23;                       /*!< (@ 0x0000049C) Enable interrupt                                      */
    __IOM uint32_t INTENCLR20;                       /*!< (@ 0x000004A0) Disable interrupt                                     */
    __IOM uint32_t INTENCLR21;                       /*!< (@ 0x000004A4) Disable interrupt                                     */
    __IOM uint32_t INTENCLR22;                       /*!< (@ 0x000004A8) Disable interrupt                                     */
    __IOM uint32_t INTENCLR23;                       /*!< (@ 0x000004AC) Disable interrupt                                     */
    __IM uint32_t INTPEND20;                         /*!< (@ 0x000004B0) Pending interrupts                                    */
    __IM uint32_t INTPEND21;                         /*!< (@ 0x000004B4) Pending interrupts                                    */
    __IM uint32_t INTPEND22;                         /*!< (@ 0x000004B8) Pending interrupts                                    */
    __IM uint32_t INTPEND23;                         /*!< (@ 0x000004BC) Pending interrupts                                    */
    __IM uint32_t RESERVED2[16];
    __IOM uint32_t CHIPCONF;                         /*!< (@ 0x00000500) Chip configuration                                    */
    __OM uint32_t SYSTEMOFF;                         /*!< (@ 0x00000504) System OFF register                                   */
    __IOM uint32_t SYSTEMOFFSTAT;                    /*!< (@ 0x00000508) System OFF status                                     */
    __IOM NRF_GRCCONF_GRCFORCEON_Type GRCFORCEON;    /*!< (@ 0x0000050C) (unspecified)                                         */
    __IOM uint32_t PDREQSTATUS;                      /*!< (@ 0x00000514) Power domain request status                           */
    __IOM NRF_GRCCONF_METALFIX_Type METALFIX;        /*!< (@ 0x00000518) (unspecified)                                         */
  } NRF_GRCCONF_Type;                                /*!< Size = 1312 (0x520)                                                  */

/* GRCCONF_EVENTS_GRCPERIPH0: Event indicating that interrupt triggered for GRC peripheral identifier [n] */
  #define GRCCONF_EVENTS_GRCPERIPH0_MaxCount (32UL)  /*!< Max size of EVENTS_GRCPERIPH0[32] array.                             */
  #define GRCCONF_EVENTS_GRCPERIPH0_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_GRCPERIPH0[32] register.              */

/* EVENTS_GRCPERIPH0 @Bit 0 : Event indicating that interrupt triggered for GRC peripheral identifier [n] */
  #define GRCCONF_EVENTS_GRCPERIPH0_EVENTS_GRCPERIPH0_Pos (0UL) /*!< Position of EVENTS_GRCPERIPH0 field.                      */
  #define GRCCONF_EVENTS_GRCPERIPH0_EVENTS_GRCPERIPH0_Msk (0x1UL << GRCCONF_EVENTS_GRCPERIPH0_EVENTS_GRCPERIPH0_Pos) /*!< Bit
                                                                            mask of EVENTS_GRCPERIPH0 field.*/                    
  #define GRCCONF_EVENTS_GRCPERIPH0_EVENTS_GRCPERIPH0_Min (0x0UL) /*!< Min enumerator value of EVENTS_GRCPERIPH0 field.        */
  #define GRCCONF_EVENTS_GRCPERIPH0_EVENTS_GRCPERIPH0_Max (0x1UL) /*!< Max enumerator value of EVENTS_GRCPERIPH0 field.        */
  #define GRCCONF_EVENTS_GRCPERIPH0_EVENTS_GRCPERIPH0_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define GRCCONF_EVENTS_GRCPERIPH0_EVENTS_GRCPERIPH0_Generated (0x1UL) /*!< Event generated                                   */


/* GRCCONF_EVENTS_GRCPERIPH1: Event indicating that interrupt triggered for GRC peripheral identifier [32 + n] */
  #define GRCCONF_EVENTS_GRCPERIPH1_MaxCount (32UL)  /*!< Max size of EVENTS_GRCPERIPH1[32] array.                             */
  #define GRCCONF_EVENTS_GRCPERIPH1_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_GRCPERIPH1[32] register.              */

/* EVENTS_GRCPERIPH1 @Bit 0 : Event indicating that interrupt triggered for GRC peripheral identifier [32 + n] */
  #define GRCCONF_EVENTS_GRCPERIPH1_EVENTS_GRCPERIPH1_Pos (0UL) /*!< Position of EVENTS_GRCPERIPH1 field.                      */
  #define GRCCONF_EVENTS_GRCPERIPH1_EVENTS_GRCPERIPH1_Msk (0x1UL << GRCCONF_EVENTS_GRCPERIPH1_EVENTS_GRCPERIPH1_Pos) /*!< Bit
                                                                            mask of EVENTS_GRCPERIPH1 field.*/                    
  #define GRCCONF_EVENTS_GRCPERIPH1_EVENTS_GRCPERIPH1_Min (0x0UL) /*!< Min enumerator value of EVENTS_GRCPERIPH1 field.        */
  #define GRCCONF_EVENTS_GRCPERIPH1_EVENTS_GRCPERIPH1_Max (0x1UL) /*!< Max enumerator value of EVENTS_GRCPERIPH1 field.        */
  #define GRCCONF_EVENTS_GRCPERIPH1_EVENTS_GRCPERIPH1_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define GRCCONF_EVENTS_GRCPERIPH1_EVENTS_GRCPERIPH1_Generated (0x1UL) /*!< Event generated                                   */


/* GRCCONF_EVENTS_SYSTEMOFFREADY: Event indicating that the device is ready to go to System OFF */
  #define GRCCONF_EVENTS_SYSTEMOFFREADY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SYSTEMOFFREADY register.          */

/* EVENTS_SYSTEMOFFREADY @Bit 0 : Event indicating that the device is ready to go to System OFF */
  #define GRCCONF_EVENTS_SYSTEMOFFREADY_EVENTS_SYSTEMOFFREADY_Pos (0UL) /*!< Position of EVENTS_SYSTEMOFFREADY field.          */
  #define GRCCONF_EVENTS_SYSTEMOFFREADY_EVENTS_SYSTEMOFFREADY_Msk (0x1UL << GRCCONF_EVENTS_SYSTEMOFFREADY_EVENTS_SYSTEMOFFREADY_Pos)
                                                                            /*!< Bit mask of EVENTS_SYSTEMOFFREADY field.*/       
  #define GRCCONF_EVENTS_SYSTEMOFFREADY_EVENTS_SYSTEMOFFREADY_Min (0x0UL) /*!< Min enumerator value of EVENTS_SYSTEMOFFREADY
                                                                            field.*/                                              
  #define GRCCONF_EVENTS_SYSTEMOFFREADY_EVENTS_SYSTEMOFFREADY_Max (0x1UL) /*!< Max enumerator value of EVENTS_SYSTEMOFFREADY
                                                                            field.*/                                              
  #define GRCCONF_EVENTS_SYSTEMOFFREADY_EVENTS_SYSTEMOFFREADY_NotGenerated (0x0UL) /*!< Event not generated                    */
  #define GRCCONF_EVENTS_SYSTEMOFFREADY_EVENTS_SYSTEMOFFREADY_Generated (0x1UL) /*!< Event generated                           */


/* GRCCONF_EVENTS_SYSTEMOFFNOTREADY: Event indicating that the device is not ready to go to System OFF */
  #define GRCCONF_EVENTS_SYSTEMOFFNOTREADY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SYSTEMOFFNOTREADY register.    */

