adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EVENTS_SYSTEMOFFNOTREADY @Bit 0 : Event indicating that the device is not ready to go to System OFF */
  #define GRCCONF_EVENTS_SYSTEMOFFNOTREADY_EVENTS_SYSTEMOFFNOTREADY_Pos (0UL) /*!< Position of EVENTS_SYSTEMOFFNOTREADY field. */
  #define GRCCONF_EVENTS_SYSTEMOFFNOTREADY_EVENTS_SYSTEMOFFNOTREADY_Msk (0x1UL << GRCCONF_EVENTS_SYSTEMOFFNOTREADY_EVENTS_SYSTEMOFFNOTREADY_Pos)
                                                                            /*!< Bit mask of EVENTS_SYSTEMOFFNOTREADY field.*/    
  #define GRCCONF_EVENTS_SYSTEMOFFNOTREADY_EVENTS_SYSTEMOFFNOTREADY_Min (0x0UL) /*!< Min enumerator value of
                                                                            EVENTS_SYSTEMOFFNOTREADY field.*/                     
  #define GRCCONF_EVENTS_SYSTEMOFFNOTREADY_EVENTS_SYSTEMOFFNOTREADY_Max (0x1UL) /*!< Max enumerator value of
                                                                            EVENTS_SYSTEMOFFNOTREADY field.*/                     
  #define GRCCONF_EVENTS_SYSTEMOFFNOTREADY_EVENTS_SYSTEMOFFNOTREADY_NotGenerated (0x0UL) /*!< Event not generated              */
  #define GRCCONF_EVENTS_SYSTEMOFFNOTREADY_EVENTS_SYSTEMOFFNOTREADY_Generated (0x1UL) /*!< Event generated                     */


/* GRCCONF_INTEN00: Enable or disable interrupt */
  #define GRCCONF_INTEN00_ResetValue (0x00000000UL)  /*!< Reset value of INTEN00 register.                                     */

/* GRCPERIPH00 @Bit 0 : Enable or disable interrupt for event GRCPERIPH0[0] */
  #define GRCCONF_INTEN00_GRCPERIPH00_Pos (0UL)      /*!< Position of GRCPERIPH00 field.                                       */
  #define GRCCONF_INTEN00_GRCPERIPH00_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH00_Pos) /*!< Bit mask of GRCPERIPH00 field.       */
  #define GRCCONF_INTEN00_GRCPERIPH00_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH00 field.                           */
  #define GRCCONF_INTEN00_GRCPERIPH00_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH00 field.                           */
  #define GRCCONF_INTEN00_GRCPERIPH00_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN00_GRCPERIPH00_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH01 @Bit 1 : Enable or disable interrupt for event GRCPERIPH0[1] */
  #define GRCCONF_INTEN00_GRCPERIPH01_Pos (1UL)      /*!< Position of GRCPERIPH01 field.                                       */
  #define GRCCONF_INTEN00_GRCPERIPH01_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH01_Pos) /*!< Bit mask of GRCPERIPH01 field.       */
  #define GRCCONF_INTEN00_GRCPERIPH01_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH01 field.                           */
  #define GRCCONF_INTEN00_GRCPERIPH01_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH01 field.                           */
  #define GRCCONF_INTEN00_GRCPERIPH01_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN00_GRCPERIPH01_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH02 @Bit 2 : Enable or disable interrupt for event GRCPERIPH0[2] */
  #define GRCCONF_INTEN00_GRCPERIPH02_Pos (2UL)      /*!< Position of GRCPERIPH02 field.                                       */
  #define GRCCONF_INTEN00_GRCPERIPH02_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH02_Pos) /*!< Bit mask of GRCPERIPH02 field.       */
  #define GRCCONF_INTEN00_GRCPERIPH02_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH02 field.                           */
  #define GRCCONF_INTEN00_GRCPERIPH02_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH02 field.                           */
  #define GRCCONF_INTEN00_GRCPERIPH02_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN00_GRCPERIPH02_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH03 @Bit 3 : Enable or disable interrupt for event GRCPERIPH0[3] */
  #define GRCCONF_INTEN00_GRCPERIPH03_Pos (3UL)      /*!< Position of GRCPERIPH03 field.                                       */
  #define GRCCONF_INTEN00_GRCPERIPH03_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH03_Pos) /*!< Bit mask of GRCPERIPH03 field.       */
  #define GRCCONF_INTEN00_GRCPERIPH03_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH03 field.                           */
  #define GRCCONF_INTEN00_GRCPERIPH03_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH03 field.                           */
  #define GRCCONF_INTEN00_GRCPERIPH03_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN00_GRCPERIPH03_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH04 @Bit 4 : Enable or disable interrupt for event GRCPERIPH0[4] */
  #define GRCCONF_INTEN00_GRCPERIPH04_Pos (4UL)      /*!< Position of GRCPERIPH04 field.                                       */
  #define GRCCONF_INTEN00_GRCPERIPH04_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH04_Pos) /*!< Bit mask of GRCPERIPH04 field.       */
  #define GRCCONF_INTEN00_GRCPERIPH04_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH04 field.                           */
  #define GRCCONF_INTEN00_GRCPERIPH04_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH04 field.                           */
  #define GRCCONF_INTEN00_GRCPERIPH04_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN00_GRCPERIPH04_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH05 @Bit 5 : Enable or disable interrupt for event GRCPERIPH0[5] */
  #define GRCCONF_INTEN00_GRCPERIPH05_Pos (5UL)      /*!< Position of GRCPERIPH05 field.                                       */
  #define GRCCONF_INTEN00_GRCPERIPH05_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH05_Pos) /*!< Bit mask of GRCPERIPH05 field.       */
  #define GRCCONF_INTEN00_GRCPERIPH05_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH05 field.                           */
  #define GRCCONF_INTEN00_GRCPERIPH05_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH05 field.                           */
  #define GRCCONF_INTEN00_GRCPERIPH05_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN00_GRCPERIPH05_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH06 @Bit 6 : Enable or disable interrupt for event GRCPERIPH0[6] */
  #define GRCCONF_INTEN00_GRCPERIPH06_Pos (6UL)      /*!< Position of GRCPERIPH06 field.                                       */
  #define GRCCONF_INTEN00_GRCPERIPH06_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH06_Pos) /*!< Bit mask of GRCPERIPH06 field.       */
  #define GRCCONF_INTEN00_GRCPERIPH06_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH06 field.                           */
  #define GRCCONF_INTEN00_GRCPERIPH06_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH06 field.                           */
  #define GRCCONF_INTEN00_GRCPERIPH06_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN00_GRCPERIPH06_Enabled (0x1UL) /*!< Enable                                                              */

