adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GRCPERIPH016 @Bit 16 : Enable or disable interrupt for event GRCPERIPH0[16] */
  #define GRCCONF_INTEN00_GRCPERIPH016_Pos (16UL)    /*!< Position of GRCPERIPH016 field.                                      */
  #define GRCCONF_INTEN00_GRCPERIPH016_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH016_Pos) /*!< Bit mask of GRCPERIPH016 field.    */
  #define GRCCONF_INTEN00_GRCPERIPH016_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH016 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH016_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH016 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH016_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN00_GRCPERIPH016_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH017 @Bit 17 : Enable or disable interrupt for event GRCPERIPH0[17] */
  #define GRCCONF_INTEN00_GRCPERIPH017_Pos (17UL)    /*!< Position of GRCPERIPH017 field.                                      */
  #define GRCCONF_INTEN00_GRCPERIPH017_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH017_Pos) /*!< Bit mask of GRCPERIPH017 field.    */
  #define GRCCONF_INTEN00_GRCPERIPH017_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH017 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH017_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH017 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH017_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN00_GRCPERIPH017_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH018 @Bit 18 : Enable or disable interrupt for event GRCPERIPH0[18] */
  #define GRCCONF_INTEN00_GRCPERIPH018_Pos (18UL)    /*!< Position of GRCPERIPH018 field.                                      */
  #define GRCCONF_INTEN00_GRCPERIPH018_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH018_Pos) /*!< Bit mask of GRCPERIPH018 field.    */
  #define GRCCONF_INTEN00_GRCPERIPH018_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH018 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH018_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH018 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH018_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN00_GRCPERIPH018_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH019 @Bit 19 : Enable or disable interrupt for event GRCPERIPH0[19] */
  #define GRCCONF_INTEN00_GRCPERIPH019_Pos (19UL)    /*!< Position of GRCPERIPH019 field.                                      */
  #define GRCCONF_INTEN00_GRCPERIPH019_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH019_Pos) /*!< Bit mask of GRCPERIPH019 field.    */
  #define GRCCONF_INTEN00_GRCPERIPH019_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH019 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH019_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH019 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH019_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN00_GRCPERIPH019_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH020 @Bit 20 : Enable or disable interrupt for event GRCPERIPH0[20] */
  #define GRCCONF_INTEN00_GRCPERIPH020_Pos (20UL)    /*!< Position of GRCPERIPH020 field.                                      */
  #define GRCCONF_INTEN00_GRCPERIPH020_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH020_Pos) /*!< Bit mask of GRCPERIPH020 field.    */
  #define GRCCONF_INTEN00_GRCPERIPH020_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH020 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH020_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH020 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH020_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN00_GRCPERIPH020_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH021 @Bit 21 : Enable or disable interrupt for event GRCPERIPH0[21] */
  #define GRCCONF_INTEN00_GRCPERIPH021_Pos (21UL)    /*!< Position of GRCPERIPH021 field.                                      */
  #define GRCCONF_INTEN00_GRCPERIPH021_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH021_Pos) /*!< Bit mask of GRCPERIPH021 field.    */
  #define GRCCONF_INTEN00_GRCPERIPH021_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH021 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH021_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH021 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH021_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN00_GRCPERIPH021_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH022 @Bit 22 : Enable or disable interrupt for event GRCPERIPH0[22] */
  #define GRCCONF_INTEN00_GRCPERIPH022_Pos (22UL)    /*!< Position of GRCPERIPH022 field.                                      */
  #define GRCCONF_INTEN00_GRCPERIPH022_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH022_Pos) /*!< Bit mask of GRCPERIPH022 field.    */
  #define GRCCONF_INTEN00_GRCPERIPH022_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH022 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH022_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH022 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH022_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN00_GRCPERIPH022_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH023 @Bit 23 : Enable or disable interrupt for event GRCPERIPH0[23] */
  #define GRCCONF_INTEN00_GRCPERIPH023_Pos (23UL)    /*!< Position of GRCPERIPH023 field.                                      */
  #define GRCCONF_INTEN00_GRCPERIPH023_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH023_Pos) /*!< Bit mask of GRCPERIPH023 field.    */
  #define GRCCONF_INTEN00_GRCPERIPH023_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH023 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH023_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH023 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH023_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN00_GRCPERIPH023_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH024 @Bit 24 : Enable or disable interrupt for event GRCPERIPH0[24] */
  #define GRCCONF_INTEN00_GRCPERIPH024_Pos (24UL)    /*!< Position of GRCPERIPH024 field.                                      */
  #define GRCCONF_INTEN00_GRCPERIPH024_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH024_Pos) /*!< Bit mask of GRCPERIPH024 field.    */
  #define GRCCONF_INTEN00_GRCPERIPH024_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH024 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH024_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH024 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH024_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN00_GRCPERIPH024_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH025 @Bit 25 : Enable or disable interrupt for event GRCPERIPH0[25] */
  #define GRCCONF_INTEN00_GRCPERIPH025_Pos (25UL)    /*!< Position of GRCPERIPH025 field.                                      */
  #define GRCCONF_INTEN00_GRCPERIPH025_Msk (0x1UL << GRCCONF_INTEN00_GRCPERIPH025_Pos) /*!< Bit mask of GRCPERIPH025 field.    */
  #define GRCCONF_INTEN00_GRCPERIPH025_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH025 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH025_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH025 field.                          */
  #define GRCCONF_INTEN00_GRCPERIPH025_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN00_GRCPERIPH025_Enabled (0x1UL) /*!< Enable                                                             */

