adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GRCPERIPH128 @Bit 28 : Write '1' to enable interrupt for event GRCPERIPH1[28] */
  #define GRCCONF_INTENSET01_GRCPERIPH128_Pos (28UL) /*!< Position of GRCPERIPH128 field.                                      */
  #define GRCCONF_INTENSET01_GRCPERIPH128_Msk (0x1UL << GRCCONF_INTENSET01_GRCPERIPH128_Pos) /*!< Bit mask of GRCPERIPH128
                                                                            field.*/                                              
  #define GRCCONF_INTENSET01_GRCPERIPH128_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH128 field.                         */
  #define GRCCONF_INTENSET01_GRCPERIPH128_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH128 field.                         */
  #define GRCCONF_INTENSET01_GRCPERIPH128_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET01_GRCPERIPH128_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET01_GRCPERIPH128_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH129 @Bit 29 : Write '1' to enable interrupt for event GRCPERIPH1[29] */
  #define GRCCONF_INTENSET01_GRCPERIPH129_Pos (29UL) /*!< Position of GRCPERIPH129 field.                                      */
  #define GRCCONF_INTENSET01_GRCPERIPH129_Msk (0x1UL << GRCCONF_INTENSET01_GRCPERIPH129_Pos) /*!< Bit mask of GRCPERIPH129
                                                                            field.*/                                              
  #define GRCCONF_INTENSET01_GRCPERIPH129_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH129 field.                         */
  #define GRCCONF_INTENSET01_GRCPERIPH129_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH129 field.                         */
  #define GRCCONF_INTENSET01_GRCPERIPH129_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET01_GRCPERIPH129_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET01_GRCPERIPH129_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH130 @Bit 30 : Write '1' to enable interrupt for event GRCPERIPH1[30] */
  #define GRCCONF_INTENSET01_GRCPERIPH130_Pos (30UL) /*!< Position of GRCPERIPH130 field.                                      */
  #define GRCCONF_INTENSET01_GRCPERIPH130_Msk (0x1UL << GRCCONF_INTENSET01_GRCPERIPH130_Pos) /*!< Bit mask of GRCPERIPH130
                                                                            field.*/                                              
  #define GRCCONF_INTENSET01_GRCPERIPH130_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH130 field.                         */
  #define GRCCONF_INTENSET01_GRCPERIPH130_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH130 field.                         */
  #define GRCCONF_INTENSET01_GRCPERIPH130_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET01_GRCPERIPH130_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET01_GRCPERIPH130_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH131 @Bit 31 : Write '1' to enable interrupt for event GRCPERIPH1[31] */
  #define GRCCONF_INTENSET01_GRCPERIPH131_Pos (31UL) /*!< Position of GRCPERIPH131 field.                                      */
  #define GRCCONF_INTENSET01_GRCPERIPH131_Msk (0x1UL << GRCCONF_INTENSET01_GRCPERIPH131_Pos) /*!< Bit mask of GRCPERIPH131
                                                                            field.*/                                              
  #define GRCCONF_INTENSET01_GRCPERIPH131_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH131 field.                         */
  #define GRCCONF_INTENSET01_GRCPERIPH131_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH131 field.                         */
  #define GRCCONF_INTENSET01_GRCPERIPH131_Set (0x1UL) /*!< Enable                                                              */
  #define GRCCONF_INTENSET01_GRCPERIPH131_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENSET01_GRCPERIPH131_Enabled (0x1UL) /*!< Read: Enabled                                                   */


/* GRCCONF_INTENSET02: Enable interrupt */
  #define GRCCONF_INTENSET02_ResetValue (0x00000000UL) /*!< Reset value of INTENSET02 register.                                */

/* SYSTEMOFFREADY @Bit 0 : Write '1' to enable interrupt for event SYSTEMOFFREADY */
  #define GRCCONF_INTENSET02_SYSTEMOFFREADY_Pos (0UL) /*!< Position of SYSTEMOFFREADY field.                                   */
  #define GRCCONF_INTENSET02_SYSTEMOFFREADY_Msk (0x1UL << GRCCONF_INTENSET02_SYSTEMOFFREADY_Pos) /*!< Bit mask of SYSTEMOFFREADY
                                                                            field.*/                                              
  #define GRCCONF_INTENSET02_SYSTEMOFFREADY_Min (0x0UL) /*!< Min enumerator value of SYSTEMOFFREADY field.                     */
  #define GRCCONF_INTENSET02_SYSTEMOFFREADY_Max (0x1UL) /*!< Max enumerator value of SYSTEMOFFREADY field.                     */
  #define GRCCONF_INTENSET02_SYSTEMOFFREADY_Set (0x1UL) /*!< Enable                                                            */
  #define GRCCONF_INTENSET02_SYSTEMOFFREADY_Disabled (0x0UL) /*!< Read: Disabled                                               */
  #define GRCCONF_INTENSET02_SYSTEMOFFREADY_Enabled (0x1UL) /*!< Read: Enabled                                                 */

/* SYSTEMOFFNOTREADY @Bit 1 : Write '1' to enable interrupt for event SYSTEMOFFNOTREADY */
  #define GRCCONF_INTENSET02_SYSTEMOFFNOTREADY_Pos (1UL) /*!< Position of SYSTEMOFFNOTREADY field.                             */
  #define GRCCONF_INTENSET02_SYSTEMOFFNOTREADY_Msk (0x1UL << GRCCONF_INTENSET02_SYSTEMOFFNOTREADY_Pos) /*!< Bit mask of
                                                                            SYSTEMOFFNOTREADY field.*/                            
  #define GRCCONF_INTENSET02_SYSTEMOFFNOTREADY_Min (0x0UL) /*!< Min enumerator value of SYSTEMOFFNOTREADY field.               */
  #define GRCCONF_INTENSET02_SYSTEMOFFNOTREADY_Max (0x1UL) /*!< Max enumerator value of SYSTEMOFFNOTREADY field.               */
  #define GRCCONF_INTENSET02_SYSTEMOFFNOTREADY_Set (0x1UL) /*!< Enable                                                         */
  #define GRCCONF_INTENSET02_SYSTEMOFFNOTREADY_Disabled (0x0UL) /*!< Read: Disabled                                            */
  #define GRCCONF_INTENSET02_SYSTEMOFFNOTREADY_Enabled (0x1UL) /*!< Read: Enabled                                              */


/* GRCCONF_INTENCLR00: Disable interrupt */
  #define GRCCONF_INTENCLR00_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR00 register.                                */

