adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GRCPERIPH09 @Bit 9 : Write '1' to disable interrupt for event GRCPERIPH0[9] */
  #define GRCCONF_INTENCLR00_GRCPERIPH09_Pos (9UL)   /*!< Position of GRCPERIPH09 field.                                       */
  #define GRCCONF_INTENCLR00_GRCPERIPH09_Msk (0x1UL << GRCCONF_INTENCLR00_GRCPERIPH09_Pos) /*!< Bit mask of GRCPERIPH09 field. */
  #define GRCCONF_INTENCLR00_GRCPERIPH09_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH09 field.                           */
  #define GRCCONF_INTENCLR00_GRCPERIPH09_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH09 field.                           */
  #define GRCCONF_INTENCLR00_GRCPERIPH09_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR00_GRCPERIPH09_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR00_GRCPERIPH09_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH010 @Bit 10 : Write '1' to disable interrupt for event GRCPERIPH0[10] */
  #define GRCCONF_INTENCLR00_GRCPERIPH010_Pos (10UL) /*!< Position of GRCPERIPH010 field.                                      */
  #define GRCCONF_INTENCLR00_GRCPERIPH010_Msk (0x1UL << GRCCONF_INTENCLR00_GRCPERIPH010_Pos) /*!< Bit mask of GRCPERIPH010
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR00_GRCPERIPH010_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH010 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH010_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH010 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH010_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR00_GRCPERIPH010_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR00_GRCPERIPH010_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH011 @Bit 11 : Write '1' to disable interrupt for event GRCPERIPH0[11] */
  #define GRCCONF_INTENCLR00_GRCPERIPH011_Pos (11UL) /*!< Position of GRCPERIPH011 field.                                      */
  #define GRCCONF_INTENCLR00_GRCPERIPH011_Msk (0x1UL << GRCCONF_INTENCLR00_GRCPERIPH011_Pos) /*!< Bit mask of GRCPERIPH011
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR00_GRCPERIPH011_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH011 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH011_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH011 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH011_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR00_GRCPERIPH011_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR00_GRCPERIPH011_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH012 @Bit 12 : Write '1' to disable interrupt for event GRCPERIPH0[12] */
  #define GRCCONF_INTENCLR00_GRCPERIPH012_Pos (12UL) /*!< Position of GRCPERIPH012 field.                                      */
  #define GRCCONF_INTENCLR00_GRCPERIPH012_Msk (0x1UL << GRCCONF_INTENCLR00_GRCPERIPH012_Pos) /*!< Bit mask of GRCPERIPH012
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR00_GRCPERIPH012_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH012 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH012_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH012 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH012_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR00_GRCPERIPH012_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR00_GRCPERIPH012_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH013 @Bit 13 : Write '1' to disable interrupt for event GRCPERIPH0[13] */
  #define GRCCONF_INTENCLR00_GRCPERIPH013_Pos (13UL) /*!< Position of GRCPERIPH013 field.                                      */
  #define GRCCONF_INTENCLR00_GRCPERIPH013_Msk (0x1UL << GRCCONF_INTENCLR00_GRCPERIPH013_Pos) /*!< Bit mask of GRCPERIPH013
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR00_GRCPERIPH013_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH013 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH013_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH013 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH013_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR00_GRCPERIPH013_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR00_GRCPERIPH013_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH014 @Bit 14 : Write '1' to disable interrupt for event GRCPERIPH0[14] */
  #define GRCCONF_INTENCLR00_GRCPERIPH014_Pos (14UL) /*!< Position of GRCPERIPH014 field.                                      */
  #define GRCCONF_INTENCLR00_GRCPERIPH014_Msk (0x1UL << GRCCONF_INTENCLR00_GRCPERIPH014_Pos) /*!< Bit mask of GRCPERIPH014
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR00_GRCPERIPH014_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH014 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH014_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH014 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH014_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR00_GRCPERIPH014_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR00_GRCPERIPH014_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH015 @Bit 15 : Write '1' to disable interrupt for event GRCPERIPH0[15] */
  #define GRCCONF_INTENCLR00_GRCPERIPH015_Pos (15UL) /*!< Position of GRCPERIPH015 field.                                      */
  #define GRCCONF_INTENCLR00_GRCPERIPH015_Msk (0x1UL << GRCCONF_INTENCLR00_GRCPERIPH015_Pos) /*!< Bit mask of GRCPERIPH015
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR00_GRCPERIPH015_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH015 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH015_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH015 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH015_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR00_GRCPERIPH015_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR00_GRCPERIPH015_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH016 @Bit 16 : Write '1' to disable interrupt for event GRCPERIPH0[16] */
  #define GRCCONF_INTENCLR00_GRCPERIPH016_Pos (16UL) /*!< Position of GRCPERIPH016 field.                                      */
  #define GRCCONF_INTENCLR00_GRCPERIPH016_Msk (0x1UL << GRCCONF_INTENCLR00_GRCPERIPH016_Pos) /*!< Bit mask of GRCPERIPH016
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR00_GRCPERIPH016_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH016 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH016_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH016 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH016_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR00_GRCPERIPH016_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR00_GRCPERIPH016_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH017 @Bit 17 : Write '1' to disable interrupt for event GRCPERIPH0[17] */
  #define GRCCONF_INTENCLR00_GRCPERIPH017_Pos (17UL) /*!< Position of GRCPERIPH017 field.                                      */
  #define GRCCONF_INTENCLR00_GRCPERIPH017_Msk (0x1UL << GRCCONF_INTENCLR00_GRCPERIPH017_Pos) /*!< Bit mask of GRCPERIPH017
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR00_GRCPERIPH017_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH017 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH017_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH017 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH017_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR00_GRCPERIPH017_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR00_GRCPERIPH017_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH018 @Bit 18 : Write '1' to disable interrupt for event GRCPERIPH0[18] */
  #define GRCCONF_INTENCLR00_GRCPERIPH018_Pos (18UL) /*!< Position of GRCPERIPH018 field.                                      */
  #define GRCCONF_INTENCLR00_GRCPERIPH018_Msk (0x1UL << GRCCONF_INTENCLR00_GRCPERIPH018_Pos) /*!< Bit mask of GRCPERIPH018
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR00_GRCPERIPH018_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH018 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH018_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH018 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH018_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR00_GRCPERIPH018_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR00_GRCPERIPH018_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH019 @Bit 19 : Write '1' to disable interrupt for event GRCPERIPH0[19] */
  #define GRCCONF_INTENCLR00_GRCPERIPH019_Pos (19UL) /*!< Position of GRCPERIPH019 field.                                      */
  #define GRCCONF_INTENCLR00_GRCPERIPH019_Msk (0x1UL << GRCCONF_INTENCLR00_GRCPERIPH019_Pos) /*!< Bit mask of GRCPERIPH019
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR00_GRCPERIPH019_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH019 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH019_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH019 field.                         */
  #define GRCCONF_INTENCLR00_GRCPERIPH019_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR00_GRCPERIPH019_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR00_GRCPERIPH019_Enabled (0x1UL) /*!< Read: Enabled                                                   */

