adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GRCPERIPH19 @Bit 9 : Write '1' to disable interrupt for event GRCPERIPH1[9] */
  #define GRCCONF_INTENCLR01_GRCPERIPH19_Pos (9UL)   /*!< Position of GRCPERIPH19 field.                                       */
  #define GRCCONF_INTENCLR01_GRCPERIPH19_Msk (0x1UL << GRCCONF_INTENCLR01_GRCPERIPH19_Pos) /*!< Bit mask of GRCPERIPH19 field. */
  #define GRCCONF_INTENCLR01_GRCPERIPH19_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH19 field.                           */
  #define GRCCONF_INTENCLR01_GRCPERIPH19_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH19 field.                           */
  #define GRCCONF_INTENCLR01_GRCPERIPH19_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR01_GRCPERIPH19_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR01_GRCPERIPH19_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH110 @Bit 10 : Write '1' to disable interrupt for event GRCPERIPH1[10] */
  #define GRCCONF_INTENCLR01_GRCPERIPH110_Pos (10UL) /*!< Position of GRCPERIPH110 field.                                      */
  #define GRCCONF_INTENCLR01_GRCPERIPH110_Msk (0x1UL << GRCCONF_INTENCLR01_GRCPERIPH110_Pos) /*!< Bit mask of GRCPERIPH110
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR01_GRCPERIPH110_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH110 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH110_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH110 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH110_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR01_GRCPERIPH110_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR01_GRCPERIPH110_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH111 @Bit 11 : Write '1' to disable interrupt for event GRCPERIPH1[11] */
  #define GRCCONF_INTENCLR01_GRCPERIPH111_Pos (11UL) /*!< Position of GRCPERIPH111 field.                                      */
  #define GRCCONF_INTENCLR01_GRCPERIPH111_Msk (0x1UL << GRCCONF_INTENCLR01_GRCPERIPH111_Pos) /*!< Bit mask of GRCPERIPH111
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR01_GRCPERIPH111_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH111 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH111_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH111 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH111_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR01_GRCPERIPH111_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR01_GRCPERIPH111_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH112 @Bit 12 : Write '1' to disable interrupt for event GRCPERIPH1[12] */
  #define GRCCONF_INTENCLR01_GRCPERIPH112_Pos (12UL) /*!< Position of GRCPERIPH112 field.                                      */
  #define GRCCONF_INTENCLR01_GRCPERIPH112_Msk (0x1UL << GRCCONF_INTENCLR01_GRCPERIPH112_Pos) /*!< Bit mask of GRCPERIPH112
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR01_GRCPERIPH112_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH112 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH112_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH112 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH112_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR01_GRCPERIPH112_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR01_GRCPERIPH112_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH113 @Bit 13 : Write '1' to disable interrupt for event GRCPERIPH1[13] */
  #define GRCCONF_INTENCLR01_GRCPERIPH113_Pos (13UL) /*!< Position of GRCPERIPH113 field.                                      */
  #define GRCCONF_INTENCLR01_GRCPERIPH113_Msk (0x1UL << GRCCONF_INTENCLR01_GRCPERIPH113_Pos) /*!< Bit mask of GRCPERIPH113
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR01_GRCPERIPH113_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH113 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH113_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH113 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH113_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR01_GRCPERIPH113_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR01_GRCPERIPH113_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH114 @Bit 14 : Write '1' to disable interrupt for event GRCPERIPH1[14] */
  #define GRCCONF_INTENCLR01_GRCPERIPH114_Pos (14UL) /*!< Position of GRCPERIPH114 field.                                      */
  #define GRCCONF_INTENCLR01_GRCPERIPH114_Msk (0x1UL << GRCCONF_INTENCLR01_GRCPERIPH114_Pos) /*!< Bit mask of GRCPERIPH114
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR01_GRCPERIPH114_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH114 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH114_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH114 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH114_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR01_GRCPERIPH114_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR01_GRCPERIPH114_Enabled (0x1UL) /*!< Read: Enabled                                                   */

