adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GRCPERIPH131 @Bit 31 : Write '1' to disable interrupt for event GRCPERIPH1[31] */
  #define GRCCONF_INTENCLR01_GRCPERIPH131_Pos (31UL) /*!< Position of GRCPERIPH131 field.                                      */
  #define GRCCONF_INTENCLR01_GRCPERIPH131_Msk (0x1UL << GRCCONF_INTENCLR01_GRCPERIPH131_Pos) /*!< Bit mask of GRCPERIPH131
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR01_GRCPERIPH131_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH131 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH131_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH131 field.                         */
  #define GRCCONF_INTENCLR01_GRCPERIPH131_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR01_GRCPERIPH131_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR01_GRCPERIPH131_Enabled (0x1UL) /*!< Read: Enabled                                                   */


/* GRCCONF_INTENCLR02: Disable interrupt */
  #define GRCCONF_INTENCLR02_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR02 register.                                */

/* SYSTEMOFFREADY @Bit 0 : Write '1' to disable interrupt for event SYSTEMOFFREADY */
  #define GRCCONF_INTENCLR02_SYSTEMOFFREADY_Pos (0UL) /*!< Position of SYSTEMOFFREADY field.                                   */
  #define GRCCONF_INTENCLR02_SYSTEMOFFREADY_Msk (0x1UL << GRCCONF_INTENCLR02_SYSTEMOFFREADY_Pos) /*!< Bit mask of SYSTEMOFFREADY
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR02_SYSTEMOFFREADY_Min (0x0UL) /*!< Min enumerator value of SYSTEMOFFREADY field.                     */
  #define GRCCONF_INTENCLR02_SYSTEMOFFREADY_Max (0x1UL) /*!< Max enumerator value of SYSTEMOFFREADY field.                     */
  #define GRCCONF_INTENCLR02_SYSTEMOFFREADY_Clear (0x1UL) /*!< Disable                                                         */
  #define GRCCONF_INTENCLR02_SYSTEMOFFREADY_Disabled (0x0UL) /*!< Read: Disabled                                               */
  #define GRCCONF_INTENCLR02_SYSTEMOFFREADY_Enabled (0x1UL) /*!< Read: Enabled                                                 */

/* SYSTEMOFFNOTREADY @Bit 1 : Write '1' to disable interrupt for event SYSTEMOFFNOTREADY */
  #define GRCCONF_INTENCLR02_SYSTEMOFFNOTREADY_Pos (1UL) /*!< Position of SYSTEMOFFNOTREADY field.                             */
  #define GRCCONF_INTENCLR02_SYSTEMOFFNOTREADY_Msk (0x1UL << GRCCONF_INTENCLR02_SYSTEMOFFNOTREADY_Pos) /*!< Bit mask of
                                                                            SYSTEMOFFNOTREADY field.*/                            
  #define GRCCONF_INTENCLR02_SYSTEMOFFNOTREADY_Min (0x0UL) /*!< Min enumerator value of SYSTEMOFFNOTREADY field.               */
  #define GRCCONF_INTENCLR02_SYSTEMOFFNOTREADY_Max (0x1UL) /*!< Max enumerator value of SYSTEMOFFNOTREADY field.               */
  #define GRCCONF_INTENCLR02_SYSTEMOFFNOTREADY_Clear (0x1UL) /*!< Disable                                                      */
  #define GRCCONF_INTENCLR02_SYSTEMOFFNOTREADY_Disabled (0x0UL) /*!< Read: Disabled                                            */
  #define GRCCONF_INTENCLR02_SYSTEMOFFNOTREADY_Enabled (0x1UL) /*!< Read: Enabled                                              */


/* GRCCONF_INTPEND00: Pending interrupts */
  #define GRCCONF_INTPEND00_ResetValue (0x00000000UL) /*!< Reset value of INTPEND00 register.                                  */

/* GRCPERIPH00 @Bit 0 : Read pending status of interrupt for event GRCPERIPH0[0] */
  #define GRCCONF_INTPEND00_GRCPERIPH00_Pos (0UL)    /*!< Position of GRCPERIPH00 field.                                       */
  #define GRCCONF_INTPEND00_GRCPERIPH00_Msk (0x1UL << GRCCONF_INTPEND00_GRCPERIPH00_Pos) /*!< Bit mask of GRCPERIPH00 field.   */
  #define GRCCONF_INTPEND00_GRCPERIPH00_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH00 field.                           */
  #define GRCCONF_INTPEND00_GRCPERIPH00_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH00 field.                           */
  #define GRCCONF_INTPEND00_GRCPERIPH00_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND00_GRCPERIPH00_Pending (0x1UL) /*!< Read: Pending                                                     */

/* GRCPERIPH01 @Bit 1 : Read pending status of interrupt for event GRCPERIPH0[1] */
  #define GRCCONF_INTPEND00_GRCPERIPH01_Pos (1UL)    /*!< Position of GRCPERIPH01 field.                                       */
  #define GRCCONF_INTPEND00_GRCPERIPH01_Msk (0x1UL << GRCCONF_INTPEND00_GRCPERIPH01_Pos) /*!< Bit mask of GRCPERIPH01 field.   */
  #define GRCCONF_INTPEND00_GRCPERIPH01_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH01 field.                           */
  #define GRCCONF_INTPEND00_GRCPERIPH01_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH01 field.                           */
  #define GRCCONF_INTPEND00_GRCPERIPH01_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND00_GRCPERIPH01_Pending (0x1UL) /*!< Read: Pending                                                     */

/* GRCPERIPH02 @Bit 2 : Read pending status of interrupt for event GRCPERIPH0[2] */
  #define GRCCONF_INTPEND00_GRCPERIPH02_Pos (2UL)    /*!< Position of GRCPERIPH02 field.                                       */
  #define GRCCONF_INTPEND00_GRCPERIPH02_Msk (0x1UL << GRCCONF_INTPEND00_GRCPERIPH02_Pos) /*!< Bit mask of GRCPERIPH02 field.   */
  #define GRCCONF_INTPEND00_GRCPERIPH02_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH02 field.                           */
  #define GRCCONF_INTPEND00_GRCPERIPH02_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH02 field.                           */
  #define GRCCONF_INTPEND00_GRCPERIPH02_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND00_GRCPERIPH02_Pending (0x1UL) /*!< Read: Pending                                                     */

/* GRCPERIPH03 @Bit 3 : Read pending status of interrupt for event GRCPERIPH0[3] */
  #define GRCCONF_INTPEND00_GRCPERIPH03_Pos (3UL)    /*!< Position of GRCPERIPH03 field.                                       */
  #define GRCCONF_INTPEND00_GRCPERIPH03_Msk (0x1UL << GRCCONF_INTPEND00_GRCPERIPH03_Pos) /*!< Bit mask of GRCPERIPH03 field.   */
  #define GRCCONF_INTPEND00_GRCPERIPH03_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH03 field.                           */
  #define GRCCONF_INTPEND00_GRCPERIPH03_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH03 field.                           */
  #define GRCCONF_INTPEND00_GRCPERIPH03_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND00_GRCPERIPH03_Pending (0x1UL) /*!< Read: Pending                                                     */

/* GRCPERIPH04 @Bit 4 : Read pending status of interrupt for event GRCPERIPH0[4] */
  #define GRCCONF_INTPEND00_GRCPERIPH04_Pos (4UL)    /*!< Position of GRCPERIPH04 field.                                       */
  #define GRCCONF_INTPEND00_GRCPERIPH04_Msk (0x1UL << GRCCONF_INTPEND00_GRCPERIPH04_Pos) /*!< Bit mask of GRCPERIPH04 field.   */
  #define GRCCONF_INTPEND00_GRCPERIPH04_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH04 field.                           */
  #define GRCCONF_INTPEND00_GRCPERIPH04_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH04 field.                           */
  #define GRCCONF_INTPEND00_GRCPERIPH04_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND00_GRCPERIPH04_Pending (0x1UL) /*!< Read: Pending                                                     */

