adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GRCPERIPH028 @Bit 28 : Read pending status of interrupt for event GRCPERIPH0[28] */
  #define GRCCONF_INTPEND00_GRCPERIPH028_Pos (28UL)  /*!< Position of GRCPERIPH028 field.                                      */
  #define GRCCONF_INTPEND00_GRCPERIPH028_Msk (0x1UL << GRCCONF_INTPEND00_GRCPERIPH028_Pos) /*!< Bit mask of GRCPERIPH028 field.*/
  #define GRCCONF_INTPEND00_GRCPERIPH028_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH028 field.                          */
  #define GRCCONF_INTPEND00_GRCPERIPH028_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH028 field.                          */
  #define GRCCONF_INTPEND00_GRCPERIPH028_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND00_GRCPERIPH028_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH029 @Bit 29 : Read pending status of interrupt for event GRCPERIPH0[29] */
  #define GRCCONF_INTPEND00_GRCPERIPH029_Pos (29UL)  /*!< Position of GRCPERIPH029 field.                                      */
  #define GRCCONF_INTPEND00_GRCPERIPH029_Msk (0x1UL << GRCCONF_INTPEND00_GRCPERIPH029_Pos) /*!< Bit mask of GRCPERIPH029 field.*/
  #define GRCCONF_INTPEND00_GRCPERIPH029_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH029 field.                          */
  #define GRCCONF_INTPEND00_GRCPERIPH029_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH029 field.                          */
  #define GRCCONF_INTPEND00_GRCPERIPH029_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND00_GRCPERIPH029_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH030 @Bit 30 : Read pending status of interrupt for event GRCPERIPH0[30] */
  #define GRCCONF_INTPEND00_GRCPERIPH030_Pos (30UL)  /*!< Position of GRCPERIPH030 field.                                      */
  #define GRCCONF_INTPEND00_GRCPERIPH030_Msk (0x1UL << GRCCONF_INTPEND00_GRCPERIPH030_Pos) /*!< Bit mask of GRCPERIPH030 field.*/
  #define GRCCONF_INTPEND00_GRCPERIPH030_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH030 field.                          */
  #define GRCCONF_INTPEND00_GRCPERIPH030_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH030 field.                          */
  #define GRCCONF_INTPEND00_GRCPERIPH030_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND00_GRCPERIPH030_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH031 @Bit 31 : Read pending status of interrupt for event GRCPERIPH0[31] */
  #define GRCCONF_INTPEND00_GRCPERIPH031_Pos (31UL)  /*!< Position of GRCPERIPH031 field.                                      */
  #define GRCCONF_INTPEND00_GRCPERIPH031_Msk (0x1UL << GRCCONF_INTPEND00_GRCPERIPH031_Pos) /*!< Bit mask of GRCPERIPH031 field.*/
  #define GRCCONF_INTPEND00_GRCPERIPH031_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH031 field.                          */
  #define GRCCONF_INTPEND00_GRCPERIPH031_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH031 field.                          */
  #define GRCCONF_INTPEND00_GRCPERIPH031_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND00_GRCPERIPH031_Pending (0x1UL) /*!< Read: Pending                                                    */


/* GRCCONF_INTPEND01: Pending interrupts */
  #define GRCCONF_INTPEND01_ResetValue (0x00000000UL) /*!< Reset value of INTPEND01 register.                                  */

/* GRCPERIPH10 @Bit 0 : Read pending status of interrupt for event GRCPERIPH1[0] */
  #define GRCCONF_INTPEND01_GRCPERIPH10_Pos (0UL)    /*!< Position of GRCPERIPH10 field.                                       */
  #define GRCCONF_INTPEND01_GRCPERIPH10_Msk (0x1UL << GRCCONF_INTPEND01_GRCPERIPH10_Pos) /*!< Bit mask of GRCPERIPH10 field.   */
  #define GRCCONF_INTPEND01_GRCPERIPH10_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH10 field.                           */
  #define GRCCONF_INTPEND01_GRCPERIPH10_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH10 field.                           */
  #define GRCCONF_INTPEND01_GRCPERIPH10_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND01_GRCPERIPH10_Pending (0x1UL) /*!< Read: Pending                                                     */

/* GRCPERIPH11 @Bit 1 : Read pending status of interrupt for event GRCPERIPH1[1] */
  #define GRCCONF_INTPEND01_GRCPERIPH11_Pos (1UL)    /*!< Position of GRCPERIPH11 field.                                       */
  #define GRCCONF_INTPEND01_GRCPERIPH11_Msk (0x1UL << GRCCONF_INTPEND01_GRCPERIPH11_Pos) /*!< Bit mask of GRCPERIPH11 field.   */
  #define GRCCONF_INTPEND01_GRCPERIPH11_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH11 field.                           */
  #define GRCCONF_INTPEND01_GRCPERIPH11_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH11 field.                           */
  #define GRCCONF_INTPEND01_GRCPERIPH11_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND01_GRCPERIPH11_Pending (0x1UL) /*!< Read: Pending                                                     */

/* GRCPERIPH12 @Bit 2 : Read pending status of interrupt for event GRCPERIPH1[2] */
  #define GRCCONF_INTPEND01_GRCPERIPH12_Pos (2UL)    /*!< Position of GRCPERIPH12 field.                                       */
  #define GRCCONF_INTPEND01_GRCPERIPH12_Msk (0x1UL << GRCCONF_INTPEND01_GRCPERIPH12_Pos) /*!< Bit mask of GRCPERIPH12 field.   */
  #define GRCCONF_INTPEND01_GRCPERIPH12_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH12 field.                           */
  #define GRCCONF_INTPEND01_GRCPERIPH12_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH12 field.                           */
  #define GRCCONF_INTPEND01_GRCPERIPH12_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND01_GRCPERIPH12_Pending (0x1UL) /*!< Read: Pending                                                     */

/* GRCPERIPH13 @Bit 3 : Read pending status of interrupt for event GRCPERIPH1[3] */
  #define GRCCONF_INTPEND01_GRCPERIPH13_Pos (3UL)    /*!< Position of GRCPERIPH13 field.                                       */
  #define GRCCONF_INTPEND01_GRCPERIPH13_Msk (0x1UL << GRCCONF_INTPEND01_GRCPERIPH13_Pos) /*!< Bit mask of GRCPERIPH13 field.   */
  #define GRCCONF_INTPEND01_GRCPERIPH13_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH13 field.                           */
  #define GRCCONF_INTPEND01_GRCPERIPH13_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH13 field.                           */
  #define GRCCONF_INTPEND01_GRCPERIPH13_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND01_GRCPERIPH13_Pending (0x1UL) /*!< Read: Pending                                                     */

/* GRCPERIPH14 @Bit 4 : Read pending status of interrupt for event GRCPERIPH1[4] */
  #define GRCCONF_INTPEND01_GRCPERIPH14_Pos (4UL)    /*!< Position of GRCPERIPH14 field.                                       */
  #define GRCCONF_INTPEND01_GRCPERIPH14_Msk (0x1UL << GRCCONF_INTPEND01_GRCPERIPH14_Pos) /*!< Bit mask of GRCPERIPH14 field.   */
  #define GRCCONF_INTPEND01_GRCPERIPH14_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH14 field.                           */
  #define GRCCONF_INTPEND01_GRCPERIPH14_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH14 field.                           */
  #define GRCCONF_INTPEND01_GRCPERIPH14_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND01_GRCPERIPH14_Pending (0x1UL) /*!< Read: Pending                                                     */

