adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GRCPERIPH07 @Bit 7 : Enable or disable interrupt for event GRCPERIPH0[7] */
  #define GRCCONF_INTEN10_GRCPERIPH07_Pos (7UL)      /*!< Position of GRCPERIPH07 field.                                       */
  #define GRCCONF_INTEN10_GRCPERIPH07_Msk (0x1UL << GRCCONF_INTEN10_GRCPERIPH07_Pos) /*!< Bit mask of GRCPERIPH07 field.       */
  #define GRCCONF_INTEN10_GRCPERIPH07_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH07 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH07_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH07 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH07_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN10_GRCPERIPH07_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH08 @Bit 8 : Enable or disable interrupt for event GRCPERIPH0[8] */
  #define GRCCONF_INTEN10_GRCPERIPH08_Pos (8UL)      /*!< Position of GRCPERIPH08 field.                                       */
  #define GRCCONF_INTEN10_GRCPERIPH08_Msk (0x1UL << GRCCONF_INTEN10_GRCPERIPH08_Pos) /*!< Bit mask of GRCPERIPH08 field.       */
  #define GRCCONF_INTEN10_GRCPERIPH08_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH08 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH08_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH08 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH08_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN10_GRCPERIPH08_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH09 @Bit 9 : Enable or disable interrupt for event GRCPERIPH0[9] */
  #define GRCCONF_INTEN10_GRCPERIPH09_Pos (9UL)      /*!< Position of GRCPERIPH09 field.                                       */
  #define GRCCONF_INTEN10_GRCPERIPH09_Msk (0x1UL << GRCCONF_INTEN10_GRCPERIPH09_Pos) /*!< Bit mask of GRCPERIPH09 field.       */
  #define GRCCONF_INTEN10_GRCPERIPH09_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH09 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH09_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH09 field.                           */
  #define GRCCONF_INTEN10_GRCPERIPH09_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN10_GRCPERIPH09_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH010 @Bit 10 : Enable or disable interrupt for event GRCPERIPH0[10] */
  #define GRCCONF_INTEN10_GRCPERIPH010_Pos (10UL)    /*!< Position of GRCPERIPH010 field.                                      */
  #define GRCCONF_INTEN10_GRCPERIPH010_Msk (0x1UL << GRCCONF_INTEN10_GRCPERIPH010_Pos) /*!< Bit mask of GRCPERIPH010 field.    */
  #define GRCCONF_INTEN10_GRCPERIPH010_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH010 field.                          */
  #define GRCCONF_INTEN10_GRCPERIPH010_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH010 field.                          */
  #define GRCCONF_INTEN10_GRCPERIPH010_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN10_GRCPERIPH010_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH011 @Bit 11 : Enable or disable interrupt for event GRCPERIPH0[11] */
  #define GRCCONF_INTEN10_GRCPERIPH011_Pos (11UL)    /*!< Position of GRCPERIPH011 field.                                      */
  #define GRCCONF_INTEN10_GRCPERIPH011_Msk (0x1UL << GRCCONF_INTEN10_GRCPERIPH011_Pos) /*!< Bit mask of GRCPERIPH011 field.    */
  #define GRCCONF_INTEN10_GRCPERIPH011_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH011 field.                          */
  #define GRCCONF_INTEN10_GRCPERIPH011_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH011 field.                          */
  #define GRCCONF_INTEN10_GRCPERIPH011_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN10_GRCPERIPH011_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH012 @Bit 12 : Enable or disable interrupt for event GRCPERIPH0[12] */
  #define GRCCONF_INTEN10_GRCPERIPH012_Pos (12UL)    /*!< Position of GRCPERIPH012 field.                                      */
  #define GRCCONF_INTEN10_GRCPERIPH012_Msk (0x1UL << GRCCONF_INTEN10_GRCPERIPH012_Pos) /*!< Bit mask of GRCPERIPH012 field.    */
  #define GRCCONF_INTEN10_GRCPERIPH012_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH012 field.                          */
  #define GRCCONF_INTEN10_GRCPERIPH012_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH012 field.                          */
  #define GRCCONF_INTEN10_GRCPERIPH012_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN10_GRCPERIPH012_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH013 @Bit 13 : Enable or disable interrupt for event GRCPERIPH0[13] */
  #define GRCCONF_INTEN10_GRCPERIPH013_Pos (13UL)    /*!< Position of GRCPERIPH013 field.                                      */
  #define GRCCONF_INTEN10_GRCPERIPH013_Msk (0x1UL << GRCCONF_INTEN10_GRCPERIPH013_Pos) /*!< Bit mask of GRCPERIPH013 field.    */
  #define GRCCONF_INTEN10_GRCPERIPH013_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH013 field.                          */
  #define GRCCONF_INTEN10_GRCPERIPH013_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH013 field.                          */
  #define GRCCONF_INTEN10_GRCPERIPH013_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN10_GRCPERIPH013_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH014 @Bit 14 : Enable or disable interrupt for event GRCPERIPH0[14] */
  #define GRCCONF_INTEN10_GRCPERIPH014_Pos (14UL)    /*!< Position of GRCPERIPH014 field.                                      */
  #define GRCCONF_INTEN10_GRCPERIPH014_Msk (0x1UL << GRCCONF_INTEN10_GRCPERIPH014_Pos) /*!< Bit mask of GRCPERIPH014 field.    */
  #define GRCCONF_INTEN10_GRCPERIPH014_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH014 field.                          */
  #define GRCCONF_INTEN10_GRCPERIPH014_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH014 field.                          */
  #define GRCCONF_INTEN10_GRCPERIPH014_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN10_GRCPERIPH014_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH015 @Bit 15 : Enable or disable interrupt for event GRCPERIPH0[15] */
  #define GRCCONF_INTEN10_GRCPERIPH015_Pos (15UL)    /*!< Position of GRCPERIPH015 field.                                      */
  #define GRCCONF_INTEN10_GRCPERIPH015_Msk (0x1UL << GRCCONF_INTEN10_GRCPERIPH015_Pos) /*!< Bit mask of GRCPERIPH015 field.    */
  #define GRCCONF_INTEN10_GRCPERIPH015_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH015 field.                          */
  #define GRCCONF_INTEN10_GRCPERIPH015_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH015 field.                          */
  #define GRCCONF_INTEN10_GRCPERIPH015_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN10_GRCPERIPH015_Enabled (0x1UL) /*!< Enable                                                             */

