adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GRCCONF_INTENCLR10: Disable interrupt */
  #define GRCCONF_INTENCLR10_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR10 register.                                */

/* GRCPERIPH00 @Bit 0 : Write '1' to disable interrupt for event GRCPERIPH0[0] */
  #define GRCCONF_INTENCLR10_GRCPERIPH00_Pos (0UL)   /*!< Position of GRCPERIPH00 field.                                       */
  #define GRCCONF_INTENCLR10_GRCPERIPH00_Msk (0x1UL << GRCCONF_INTENCLR10_GRCPERIPH00_Pos) /*!< Bit mask of GRCPERIPH00 field. */
  #define GRCCONF_INTENCLR10_GRCPERIPH00_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH00 field.                           */
  #define GRCCONF_INTENCLR10_GRCPERIPH00_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH00 field.                           */
  #define GRCCONF_INTENCLR10_GRCPERIPH00_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR10_GRCPERIPH00_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR10_GRCPERIPH00_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH01 @Bit 1 : Write '1' to disable interrupt for event GRCPERIPH0[1] */
  #define GRCCONF_INTENCLR10_GRCPERIPH01_Pos (1UL)   /*!< Position of GRCPERIPH01 field.                                       */
  #define GRCCONF_INTENCLR10_GRCPERIPH01_Msk (0x1UL << GRCCONF_INTENCLR10_GRCPERIPH01_Pos) /*!< Bit mask of GRCPERIPH01 field. */
  #define GRCCONF_INTENCLR10_GRCPERIPH01_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH01 field.                           */
  #define GRCCONF_INTENCLR10_GRCPERIPH01_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH01 field.                           */
  #define GRCCONF_INTENCLR10_GRCPERIPH01_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR10_GRCPERIPH01_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR10_GRCPERIPH01_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH02 @Bit 2 : Write '1' to disable interrupt for event GRCPERIPH0[2] */
  #define GRCCONF_INTENCLR10_GRCPERIPH02_Pos (2UL)   /*!< Position of GRCPERIPH02 field.                                       */
  #define GRCCONF_INTENCLR10_GRCPERIPH02_Msk (0x1UL << GRCCONF_INTENCLR10_GRCPERIPH02_Pos) /*!< Bit mask of GRCPERIPH02 field. */
  #define GRCCONF_INTENCLR10_GRCPERIPH02_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH02 field.                           */
  #define GRCCONF_INTENCLR10_GRCPERIPH02_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH02 field.                           */
  #define GRCCONF_INTENCLR10_GRCPERIPH02_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR10_GRCPERIPH02_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR10_GRCPERIPH02_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH03 @Bit 3 : Write '1' to disable interrupt for event GRCPERIPH0[3] */
  #define GRCCONF_INTENCLR10_GRCPERIPH03_Pos (3UL)   /*!< Position of GRCPERIPH03 field.                                       */
  #define GRCCONF_INTENCLR10_GRCPERIPH03_Msk (0x1UL << GRCCONF_INTENCLR10_GRCPERIPH03_Pos) /*!< Bit mask of GRCPERIPH03 field. */
  #define GRCCONF_INTENCLR10_GRCPERIPH03_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH03 field.                           */
  #define GRCCONF_INTENCLR10_GRCPERIPH03_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH03 field.                           */
  #define GRCCONF_INTENCLR10_GRCPERIPH03_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR10_GRCPERIPH03_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR10_GRCPERIPH03_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH04 @Bit 4 : Write '1' to disable interrupt for event GRCPERIPH0[4] */
  #define GRCCONF_INTENCLR10_GRCPERIPH04_Pos (4UL)   /*!< Position of GRCPERIPH04 field.                                       */
  #define GRCCONF_INTENCLR10_GRCPERIPH04_Msk (0x1UL << GRCCONF_INTENCLR10_GRCPERIPH04_Pos) /*!< Bit mask of GRCPERIPH04 field. */
  #define GRCCONF_INTENCLR10_GRCPERIPH04_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH04 field.                           */
  #define GRCCONF_INTENCLR10_GRCPERIPH04_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH04 field.                           */
  #define GRCCONF_INTENCLR10_GRCPERIPH04_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR10_GRCPERIPH04_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR10_GRCPERIPH04_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH05 @Bit 5 : Write '1' to disable interrupt for event GRCPERIPH0[5] */
  #define GRCCONF_INTENCLR10_GRCPERIPH05_Pos (5UL)   /*!< Position of GRCPERIPH05 field.                                       */
  #define GRCCONF_INTENCLR10_GRCPERIPH05_Msk (0x1UL << GRCCONF_INTENCLR10_GRCPERIPH05_Pos) /*!< Bit mask of GRCPERIPH05 field. */
  #define GRCCONF_INTENCLR10_GRCPERIPH05_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH05 field.                           */
  #define GRCCONF_INTENCLR10_GRCPERIPH05_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH05 field.                           */
  #define GRCCONF_INTENCLR10_GRCPERIPH05_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR10_GRCPERIPH05_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR10_GRCPERIPH05_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH06 @Bit 6 : Write '1' to disable interrupt for event GRCPERIPH0[6] */
  #define GRCCONF_INTENCLR10_GRCPERIPH06_Pos (6UL)   /*!< Position of GRCPERIPH06 field.                                       */
  #define GRCCONF_INTENCLR10_GRCPERIPH06_Msk (0x1UL << GRCCONF_INTENCLR10_GRCPERIPH06_Pos) /*!< Bit mask of GRCPERIPH06 field. */
  #define GRCCONF_INTENCLR10_GRCPERIPH06_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH06 field.                           */
  #define GRCCONF_INTENCLR10_GRCPERIPH06_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH06 field.                           */
  #define GRCCONF_INTENCLR10_GRCPERIPH06_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR10_GRCPERIPH06_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR10_GRCPERIPH06_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH07 @Bit 7 : Write '1' to disable interrupt for event GRCPERIPH0[7] */
  #define GRCCONF_INTENCLR10_GRCPERIPH07_Pos (7UL)   /*!< Position of GRCPERIPH07 field.                                       */
  #define GRCCONF_INTENCLR10_GRCPERIPH07_Msk (0x1UL << GRCCONF_INTENCLR10_GRCPERIPH07_Pos) /*!< Bit mask of GRCPERIPH07 field. */
  #define GRCCONF_INTENCLR10_GRCPERIPH07_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH07 field.                           */
  #define GRCCONF_INTENCLR10_GRCPERIPH07_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH07 field.                           */
  #define GRCCONF_INTENCLR10_GRCPERIPH07_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR10_GRCPERIPH07_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR10_GRCPERIPH07_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* GRCPERIPH08 @Bit 8 : Write '1' to disable interrupt for event GRCPERIPH0[8] */
  #define GRCCONF_INTENCLR10_GRCPERIPH08_Pos (8UL)   /*!< Position of GRCPERIPH08 field.                                       */
  #define GRCCONF_INTENCLR10_GRCPERIPH08_Msk (0x1UL << GRCCONF_INTENCLR10_GRCPERIPH08_Pos) /*!< Bit mask of GRCPERIPH08 field. */
  #define GRCCONF_INTENCLR10_GRCPERIPH08_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH08 field.                           */
  #define GRCCONF_INTENCLR10_GRCPERIPH08_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH08 field.                           */
  #define GRCCONF_INTENCLR10_GRCPERIPH08_Clear (0x1UL) /*!< Disable                                                            */
  #define GRCCONF_INTENCLR10_GRCPERIPH08_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define GRCCONF_INTENCLR10_GRCPERIPH08_Enabled (0x1UL) /*!< Read: Enabled                                                    */

