adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GRCPERIPH05 @Bit 5 : Read pending status of interrupt for event GRCPERIPH0[5] */
  #define GRCCONF_INTPEND10_GRCPERIPH05_Pos (5UL)    /*!< Position of GRCPERIPH05 field.                                       */
  #define GRCCONF_INTPEND10_GRCPERIPH05_Msk (0x1UL << GRCCONF_INTPEND10_GRCPERIPH05_Pos) /*!< Bit mask of GRCPERIPH05 field.   */
  #define GRCCONF_INTPEND10_GRCPERIPH05_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH05 field.                           */
  #define GRCCONF_INTPEND10_GRCPERIPH05_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH05 field.                           */
  #define GRCCONF_INTPEND10_GRCPERIPH05_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND10_GRCPERIPH05_Pending (0x1UL) /*!< Read: Pending                                                     */

/* GRCPERIPH06 @Bit 6 : Read pending status of interrupt for event GRCPERIPH0[6] */
  #define GRCCONF_INTPEND10_GRCPERIPH06_Pos (6UL)    /*!< Position of GRCPERIPH06 field.                                       */
  #define GRCCONF_INTPEND10_GRCPERIPH06_Msk (0x1UL << GRCCONF_INTPEND10_GRCPERIPH06_Pos) /*!< Bit mask of GRCPERIPH06 field.   */
  #define GRCCONF_INTPEND10_GRCPERIPH06_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH06 field.                           */
  #define GRCCONF_INTPEND10_GRCPERIPH06_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH06 field.                           */
  #define GRCCONF_INTPEND10_GRCPERIPH06_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND10_GRCPERIPH06_Pending (0x1UL) /*!< Read: Pending                                                     */

/* GRCPERIPH07 @Bit 7 : Read pending status of interrupt for event GRCPERIPH0[7] */
  #define GRCCONF_INTPEND10_GRCPERIPH07_Pos (7UL)    /*!< Position of GRCPERIPH07 field.                                       */
  #define GRCCONF_INTPEND10_GRCPERIPH07_Msk (0x1UL << GRCCONF_INTPEND10_GRCPERIPH07_Pos) /*!< Bit mask of GRCPERIPH07 field.   */
  #define GRCCONF_INTPEND10_GRCPERIPH07_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH07 field.                           */
  #define GRCCONF_INTPEND10_GRCPERIPH07_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH07 field.                           */
  #define GRCCONF_INTPEND10_GRCPERIPH07_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND10_GRCPERIPH07_Pending (0x1UL) /*!< Read: Pending                                                     */

/* GRCPERIPH08 @Bit 8 : Read pending status of interrupt for event GRCPERIPH0[8] */
  #define GRCCONF_INTPEND10_GRCPERIPH08_Pos (8UL)    /*!< Position of GRCPERIPH08 field.                                       */
  #define GRCCONF_INTPEND10_GRCPERIPH08_Msk (0x1UL << GRCCONF_INTPEND10_GRCPERIPH08_Pos) /*!< Bit mask of GRCPERIPH08 field.   */
  #define GRCCONF_INTPEND10_GRCPERIPH08_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH08 field.                           */
  #define GRCCONF_INTPEND10_GRCPERIPH08_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH08 field.                           */
  #define GRCCONF_INTPEND10_GRCPERIPH08_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND10_GRCPERIPH08_Pending (0x1UL) /*!< Read: Pending                                                     */

/* GRCPERIPH09 @Bit 9 : Read pending status of interrupt for event GRCPERIPH0[9] */
  #define GRCCONF_INTPEND10_GRCPERIPH09_Pos (9UL)    /*!< Position of GRCPERIPH09 field.                                       */
  #define GRCCONF_INTPEND10_GRCPERIPH09_Msk (0x1UL << GRCCONF_INTPEND10_GRCPERIPH09_Pos) /*!< Bit mask of GRCPERIPH09 field.   */
  #define GRCCONF_INTPEND10_GRCPERIPH09_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH09 field.                           */
  #define GRCCONF_INTPEND10_GRCPERIPH09_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH09 field.                           */
  #define GRCCONF_INTPEND10_GRCPERIPH09_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND10_GRCPERIPH09_Pending (0x1UL) /*!< Read: Pending                                                     */

/* GRCPERIPH010 @Bit 10 : Read pending status of interrupt for event GRCPERIPH0[10] */
  #define GRCCONF_INTPEND10_GRCPERIPH010_Pos (10UL)  /*!< Position of GRCPERIPH010 field.                                      */
  #define GRCCONF_INTPEND10_GRCPERIPH010_Msk (0x1UL << GRCCONF_INTPEND10_GRCPERIPH010_Pos) /*!< Bit mask of GRCPERIPH010 field.*/
  #define GRCCONF_INTPEND10_GRCPERIPH010_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH010 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH010_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH010 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH010_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND10_GRCPERIPH010_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH011 @Bit 11 : Read pending status of interrupt for event GRCPERIPH0[11] */
  #define GRCCONF_INTPEND10_GRCPERIPH011_Pos (11UL)  /*!< Position of GRCPERIPH011 field.                                      */
  #define GRCCONF_INTPEND10_GRCPERIPH011_Msk (0x1UL << GRCCONF_INTPEND10_GRCPERIPH011_Pos) /*!< Bit mask of GRCPERIPH011 field.*/
  #define GRCCONF_INTPEND10_GRCPERIPH011_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH011 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH011_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH011 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH011_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND10_GRCPERIPH011_Pending (0x1UL) /*!< Read: Pending                                                    */

