adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GRCPERIPH020 @Bit 20 : Read pending status of interrupt for event GRCPERIPH0[20] */
  #define GRCCONF_INTPEND10_GRCPERIPH020_Pos (20UL)  /*!< Position of GRCPERIPH020 field.                                      */
  #define GRCCONF_INTPEND10_GRCPERIPH020_Msk (0x1UL << GRCCONF_INTPEND10_GRCPERIPH020_Pos) /*!< Bit mask of GRCPERIPH020 field.*/
  #define GRCCONF_INTPEND10_GRCPERIPH020_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH020 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH020_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH020 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH020_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND10_GRCPERIPH020_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH021 @Bit 21 : Read pending status of interrupt for event GRCPERIPH0[21] */
  #define GRCCONF_INTPEND10_GRCPERIPH021_Pos (21UL)  /*!< Position of GRCPERIPH021 field.                                      */
  #define GRCCONF_INTPEND10_GRCPERIPH021_Msk (0x1UL << GRCCONF_INTPEND10_GRCPERIPH021_Pos) /*!< Bit mask of GRCPERIPH021 field.*/
  #define GRCCONF_INTPEND10_GRCPERIPH021_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH021 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH021_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH021 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH021_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND10_GRCPERIPH021_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH022 @Bit 22 : Read pending status of interrupt for event GRCPERIPH0[22] */
  #define GRCCONF_INTPEND10_GRCPERIPH022_Pos (22UL)  /*!< Position of GRCPERIPH022 field.                                      */
  #define GRCCONF_INTPEND10_GRCPERIPH022_Msk (0x1UL << GRCCONF_INTPEND10_GRCPERIPH022_Pos) /*!< Bit mask of GRCPERIPH022 field.*/
  #define GRCCONF_INTPEND10_GRCPERIPH022_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH022 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH022_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH022 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH022_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND10_GRCPERIPH022_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH023 @Bit 23 : Read pending status of interrupt for event GRCPERIPH0[23] */
  #define GRCCONF_INTPEND10_GRCPERIPH023_Pos (23UL)  /*!< Position of GRCPERIPH023 field.                                      */
  #define GRCCONF_INTPEND10_GRCPERIPH023_Msk (0x1UL << GRCCONF_INTPEND10_GRCPERIPH023_Pos) /*!< Bit mask of GRCPERIPH023 field.*/
  #define GRCCONF_INTPEND10_GRCPERIPH023_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH023 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH023_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH023 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH023_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND10_GRCPERIPH023_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH024 @Bit 24 : Read pending status of interrupt for event GRCPERIPH0[24] */
  #define GRCCONF_INTPEND10_GRCPERIPH024_Pos (24UL)  /*!< Position of GRCPERIPH024 field.                                      */
  #define GRCCONF_INTPEND10_GRCPERIPH024_Msk (0x1UL << GRCCONF_INTPEND10_GRCPERIPH024_Pos) /*!< Bit mask of GRCPERIPH024 field.*/
  #define GRCCONF_INTPEND10_GRCPERIPH024_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH024 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH024_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH024 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH024_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND10_GRCPERIPH024_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH025 @Bit 25 : Read pending status of interrupt for event GRCPERIPH0[25] */
  #define GRCCONF_INTPEND10_GRCPERIPH025_Pos (25UL)  /*!< Position of GRCPERIPH025 field.                                      */
  #define GRCCONF_INTPEND10_GRCPERIPH025_Msk (0x1UL << GRCCONF_INTPEND10_GRCPERIPH025_Pos) /*!< Bit mask of GRCPERIPH025 field.*/
  #define GRCCONF_INTPEND10_GRCPERIPH025_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH025 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH025_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH025 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH025_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND10_GRCPERIPH025_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH026 @Bit 26 : Read pending status of interrupt for event GRCPERIPH0[26] */
  #define GRCCONF_INTPEND10_GRCPERIPH026_Pos (26UL)  /*!< Position of GRCPERIPH026 field.                                      */
  #define GRCCONF_INTPEND10_GRCPERIPH026_Msk (0x1UL << GRCCONF_INTPEND10_GRCPERIPH026_Pos) /*!< Bit mask of GRCPERIPH026 field.*/
  #define GRCCONF_INTPEND10_GRCPERIPH026_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH026 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH026_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH026 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH026_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND10_GRCPERIPH026_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH027 @Bit 27 : Read pending status of interrupt for event GRCPERIPH0[27] */
  #define GRCCONF_INTPEND10_GRCPERIPH027_Pos (27UL)  /*!< Position of GRCPERIPH027 field.                                      */
  #define GRCCONF_INTPEND10_GRCPERIPH027_Msk (0x1UL << GRCCONF_INTPEND10_GRCPERIPH027_Pos) /*!< Bit mask of GRCPERIPH027 field.*/
  #define GRCCONF_INTPEND10_GRCPERIPH027_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH027 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH027_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH027 field.                          */
  #define GRCCONF_INTPEND10_GRCPERIPH027_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND10_GRCPERIPH027_Pending (0x1UL) /*!< Read: Pending                                                    */

