adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GRCPERIPH121 @Bit 21 : Read pending status of interrupt for event GRCPERIPH1[21] */
  #define GRCCONF_INTPEND11_GRCPERIPH121_Pos (21UL)  /*!< Position of GRCPERIPH121 field.                                      */
  #define GRCCONF_INTPEND11_GRCPERIPH121_Msk (0x1UL << GRCCONF_INTPEND11_GRCPERIPH121_Pos) /*!< Bit mask of GRCPERIPH121 field.*/
  #define GRCCONF_INTPEND11_GRCPERIPH121_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH121 field.                          */
  #define GRCCONF_INTPEND11_GRCPERIPH121_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH121 field.                          */
  #define GRCCONF_INTPEND11_GRCPERIPH121_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND11_GRCPERIPH121_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH122 @Bit 22 : Read pending status of interrupt for event GRCPERIPH1[22] */
  #define GRCCONF_INTPEND11_GRCPERIPH122_Pos (22UL)  /*!< Position of GRCPERIPH122 field.                                      */
  #define GRCCONF_INTPEND11_GRCPERIPH122_Msk (0x1UL << GRCCONF_INTPEND11_GRCPERIPH122_Pos) /*!< Bit mask of GRCPERIPH122 field.*/
  #define GRCCONF_INTPEND11_GRCPERIPH122_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH122 field.                          */
  #define GRCCONF_INTPEND11_GRCPERIPH122_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH122 field.                          */
  #define GRCCONF_INTPEND11_GRCPERIPH122_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND11_GRCPERIPH122_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH123 @Bit 23 : Read pending status of interrupt for event GRCPERIPH1[23] */
  #define GRCCONF_INTPEND11_GRCPERIPH123_Pos (23UL)  /*!< Position of GRCPERIPH123 field.                                      */
  #define GRCCONF_INTPEND11_GRCPERIPH123_Msk (0x1UL << GRCCONF_INTPEND11_GRCPERIPH123_Pos) /*!< Bit mask of GRCPERIPH123 field.*/
  #define GRCCONF_INTPEND11_GRCPERIPH123_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH123 field.                          */
  #define GRCCONF_INTPEND11_GRCPERIPH123_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH123 field.                          */
  #define GRCCONF_INTPEND11_GRCPERIPH123_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND11_GRCPERIPH123_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH124 @Bit 24 : Read pending status of interrupt for event GRCPERIPH1[24] */
  #define GRCCONF_INTPEND11_GRCPERIPH124_Pos (24UL)  /*!< Position of GRCPERIPH124 field.                                      */
  #define GRCCONF_INTPEND11_GRCPERIPH124_Msk (0x1UL << GRCCONF_INTPEND11_GRCPERIPH124_Pos) /*!< Bit mask of GRCPERIPH124 field.*/
  #define GRCCONF_INTPEND11_GRCPERIPH124_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH124 field.                          */
  #define GRCCONF_INTPEND11_GRCPERIPH124_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH124 field.                          */
  #define GRCCONF_INTPEND11_GRCPERIPH124_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND11_GRCPERIPH124_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH125 @Bit 25 : Read pending status of interrupt for event GRCPERIPH1[25] */
  #define GRCCONF_INTPEND11_GRCPERIPH125_Pos (25UL)  /*!< Position of GRCPERIPH125 field.                                      */
  #define GRCCONF_INTPEND11_GRCPERIPH125_Msk (0x1UL << GRCCONF_INTPEND11_GRCPERIPH125_Pos) /*!< Bit mask of GRCPERIPH125 field.*/
  #define GRCCONF_INTPEND11_GRCPERIPH125_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH125 field.                          */
  #define GRCCONF_INTPEND11_GRCPERIPH125_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH125 field.                          */
  #define GRCCONF_INTPEND11_GRCPERIPH125_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND11_GRCPERIPH125_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH126 @Bit 26 : Read pending status of interrupt for event GRCPERIPH1[26] */
  #define GRCCONF_INTPEND11_GRCPERIPH126_Pos (26UL)  /*!< Position of GRCPERIPH126 field.                                      */
  #define GRCCONF_INTPEND11_GRCPERIPH126_Msk (0x1UL << GRCCONF_INTPEND11_GRCPERIPH126_Pos) /*!< Bit mask of GRCPERIPH126 field.*/
  #define GRCCONF_INTPEND11_GRCPERIPH126_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH126 field.                          */
  #define GRCCONF_INTPEND11_GRCPERIPH126_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH126 field.                          */
  #define GRCCONF_INTPEND11_GRCPERIPH126_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND11_GRCPERIPH126_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH127 @Bit 27 : Read pending status of interrupt for event GRCPERIPH1[27] */
  #define GRCCONF_INTPEND11_GRCPERIPH127_Pos (27UL)  /*!< Position of GRCPERIPH127 field.                                      */
  #define GRCCONF_INTPEND11_GRCPERIPH127_Msk (0x1UL << GRCCONF_INTPEND11_GRCPERIPH127_Pos) /*!< Bit mask of GRCPERIPH127 field.*/
  #define GRCCONF_INTPEND11_GRCPERIPH127_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH127 field.                          */
  #define GRCCONF_INTPEND11_GRCPERIPH127_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH127 field.                          */
  #define GRCCONF_INTPEND11_GRCPERIPH127_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND11_GRCPERIPH127_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH128 @Bit 28 : Read pending status of interrupt for event GRCPERIPH1[28] */
  #define GRCCONF_INTPEND11_GRCPERIPH128_Pos (28UL)  /*!< Position of GRCPERIPH128 field.                                      */
  #define GRCCONF_INTPEND11_GRCPERIPH128_Msk (0x1UL << GRCCONF_INTPEND11_GRCPERIPH128_Pos) /*!< Bit mask of GRCPERIPH128 field.*/
  #define GRCCONF_INTPEND11_GRCPERIPH128_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH128 field.                          */
  #define GRCCONF_INTPEND11_GRCPERIPH128_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH128 field.                          */
  #define GRCCONF_INTPEND11_GRCPERIPH128_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND11_GRCPERIPH128_Pending (0x1UL) /*!< Read: Pending                                                    */

