adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GRCPERIPH12 @Bit 2 : Enable or disable interrupt for event GRCPERIPH1[2] */
  #define GRCCONF_INTEN21_GRCPERIPH12_Pos (2UL)      /*!< Position of GRCPERIPH12 field.                                       */
  #define GRCCONF_INTEN21_GRCPERIPH12_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH12_Pos) /*!< Bit mask of GRCPERIPH12 field.       */
  #define GRCCONF_INTEN21_GRCPERIPH12_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH12 field.                           */
  #define GRCCONF_INTEN21_GRCPERIPH12_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH12 field.                           */
  #define GRCCONF_INTEN21_GRCPERIPH12_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN21_GRCPERIPH12_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH13 @Bit 3 : Enable or disable interrupt for event GRCPERIPH1[3] */
  #define GRCCONF_INTEN21_GRCPERIPH13_Pos (3UL)      /*!< Position of GRCPERIPH13 field.                                       */
  #define GRCCONF_INTEN21_GRCPERIPH13_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH13_Pos) /*!< Bit mask of GRCPERIPH13 field.       */
  #define GRCCONF_INTEN21_GRCPERIPH13_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH13 field.                           */
  #define GRCCONF_INTEN21_GRCPERIPH13_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH13 field.                           */
  #define GRCCONF_INTEN21_GRCPERIPH13_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN21_GRCPERIPH13_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH14 @Bit 4 : Enable or disable interrupt for event GRCPERIPH1[4] */
  #define GRCCONF_INTEN21_GRCPERIPH14_Pos (4UL)      /*!< Position of GRCPERIPH14 field.                                       */
  #define GRCCONF_INTEN21_GRCPERIPH14_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH14_Pos) /*!< Bit mask of GRCPERIPH14 field.       */
  #define GRCCONF_INTEN21_GRCPERIPH14_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH14 field.                           */
  #define GRCCONF_INTEN21_GRCPERIPH14_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH14 field.                           */
  #define GRCCONF_INTEN21_GRCPERIPH14_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN21_GRCPERIPH14_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH15 @Bit 5 : Enable or disable interrupt for event GRCPERIPH1[5] */
  #define GRCCONF_INTEN21_GRCPERIPH15_Pos (5UL)      /*!< Position of GRCPERIPH15 field.                                       */
  #define GRCCONF_INTEN21_GRCPERIPH15_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH15_Pos) /*!< Bit mask of GRCPERIPH15 field.       */
  #define GRCCONF_INTEN21_GRCPERIPH15_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH15 field.                           */
  #define GRCCONF_INTEN21_GRCPERIPH15_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH15 field.                           */
  #define GRCCONF_INTEN21_GRCPERIPH15_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN21_GRCPERIPH15_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH16 @Bit 6 : Enable or disable interrupt for event GRCPERIPH1[6] */
  #define GRCCONF_INTEN21_GRCPERIPH16_Pos (6UL)      /*!< Position of GRCPERIPH16 field.                                       */
  #define GRCCONF_INTEN21_GRCPERIPH16_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH16_Pos) /*!< Bit mask of GRCPERIPH16 field.       */
  #define GRCCONF_INTEN21_GRCPERIPH16_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH16 field.                           */
  #define GRCCONF_INTEN21_GRCPERIPH16_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH16 field.                           */
  #define GRCCONF_INTEN21_GRCPERIPH16_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN21_GRCPERIPH16_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH17 @Bit 7 : Enable or disable interrupt for event GRCPERIPH1[7] */
  #define GRCCONF_INTEN21_GRCPERIPH17_Pos (7UL)      /*!< Position of GRCPERIPH17 field.                                       */
  #define GRCCONF_INTEN21_GRCPERIPH17_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH17_Pos) /*!< Bit mask of GRCPERIPH17 field.       */
  #define GRCCONF_INTEN21_GRCPERIPH17_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH17 field.                           */
  #define GRCCONF_INTEN21_GRCPERIPH17_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH17 field.                           */
  #define GRCCONF_INTEN21_GRCPERIPH17_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN21_GRCPERIPH17_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH18 @Bit 8 : Enable or disable interrupt for event GRCPERIPH1[8] */
  #define GRCCONF_INTEN21_GRCPERIPH18_Pos (8UL)      /*!< Position of GRCPERIPH18 field.                                       */
  #define GRCCONF_INTEN21_GRCPERIPH18_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH18_Pos) /*!< Bit mask of GRCPERIPH18 field.       */
  #define GRCCONF_INTEN21_GRCPERIPH18_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH18 field.                           */
  #define GRCCONF_INTEN21_GRCPERIPH18_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH18 field.                           */
  #define GRCCONF_INTEN21_GRCPERIPH18_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN21_GRCPERIPH18_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH19 @Bit 9 : Enable or disable interrupt for event GRCPERIPH1[9] */
  #define GRCCONF_INTEN21_GRCPERIPH19_Pos (9UL)      /*!< Position of GRCPERIPH19 field.                                       */
  #define GRCCONF_INTEN21_GRCPERIPH19_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH19_Pos) /*!< Bit mask of GRCPERIPH19 field.       */
  #define GRCCONF_INTEN21_GRCPERIPH19_Min (0x0UL)    /*!< Min enumerator value of GRCPERIPH19 field.                           */
  #define GRCCONF_INTEN21_GRCPERIPH19_Max (0x1UL)    /*!< Max enumerator value of GRCPERIPH19 field.                           */
  #define GRCCONF_INTEN21_GRCPERIPH19_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRCCONF_INTEN21_GRCPERIPH19_Enabled (0x1UL) /*!< Enable                                                              */

/* GRCPERIPH110 @Bit 10 : Enable or disable interrupt for event GRCPERIPH1[10] */
  #define GRCCONF_INTEN21_GRCPERIPH110_Pos (10UL)    /*!< Position of GRCPERIPH110 field.                                      */
  #define GRCCONF_INTEN21_GRCPERIPH110_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH110_Pos) /*!< Bit mask of GRCPERIPH110 field.    */
  #define GRCCONF_INTEN21_GRCPERIPH110_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH110 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH110_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH110 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH110_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN21_GRCPERIPH110_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH111 @Bit 11 : Enable or disable interrupt for event GRCPERIPH1[11] */
  #define GRCCONF_INTEN21_GRCPERIPH111_Pos (11UL)    /*!< Position of GRCPERIPH111 field.                                      */
  #define GRCCONF_INTEN21_GRCPERIPH111_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH111_Pos) /*!< Bit mask of GRCPERIPH111 field.    */
  #define GRCCONF_INTEN21_GRCPERIPH111_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH111 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH111_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH111 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH111_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN21_GRCPERIPH111_Enabled (0x1UL) /*!< Enable                                                             */

