adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GRCPERIPH122 @Bit 22 : Enable or disable interrupt for event GRCPERIPH1[22] */
  #define GRCCONF_INTEN21_GRCPERIPH122_Pos (22UL)    /*!< Position of GRCPERIPH122 field.                                      */
  #define GRCCONF_INTEN21_GRCPERIPH122_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH122_Pos) /*!< Bit mask of GRCPERIPH122 field.    */
  #define GRCCONF_INTEN21_GRCPERIPH122_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH122 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH122_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH122 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH122_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN21_GRCPERIPH122_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH123 @Bit 23 : Enable or disable interrupt for event GRCPERIPH1[23] */
  #define GRCCONF_INTEN21_GRCPERIPH123_Pos (23UL)    /*!< Position of GRCPERIPH123 field.                                      */
  #define GRCCONF_INTEN21_GRCPERIPH123_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH123_Pos) /*!< Bit mask of GRCPERIPH123 field.    */
  #define GRCCONF_INTEN21_GRCPERIPH123_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH123 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH123_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH123 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH123_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN21_GRCPERIPH123_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH124 @Bit 24 : Enable or disable interrupt for event GRCPERIPH1[24] */
  #define GRCCONF_INTEN21_GRCPERIPH124_Pos (24UL)    /*!< Position of GRCPERIPH124 field.                                      */
  #define GRCCONF_INTEN21_GRCPERIPH124_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH124_Pos) /*!< Bit mask of GRCPERIPH124 field.    */
  #define GRCCONF_INTEN21_GRCPERIPH124_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH124 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH124_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH124 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH124_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN21_GRCPERIPH124_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH125 @Bit 25 : Enable or disable interrupt for event GRCPERIPH1[25] */
  #define GRCCONF_INTEN21_GRCPERIPH125_Pos (25UL)    /*!< Position of GRCPERIPH125 field.                                      */
  #define GRCCONF_INTEN21_GRCPERIPH125_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH125_Pos) /*!< Bit mask of GRCPERIPH125 field.    */
  #define GRCCONF_INTEN21_GRCPERIPH125_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH125 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH125_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH125 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH125_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN21_GRCPERIPH125_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH126 @Bit 26 : Enable or disable interrupt for event GRCPERIPH1[26] */
  #define GRCCONF_INTEN21_GRCPERIPH126_Pos (26UL)    /*!< Position of GRCPERIPH126 field.                                      */
  #define GRCCONF_INTEN21_GRCPERIPH126_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH126_Pos) /*!< Bit mask of GRCPERIPH126 field.    */
  #define GRCCONF_INTEN21_GRCPERIPH126_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH126 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH126_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH126 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH126_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN21_GRCPERIPH126_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH127 @Bit 27 : Enable or disable interrupt for event GRCPERIPH1[27] */
  #define GRCCONF_INTEN21_GRCPERIPH127_Pos (27UL)    /*!< Position of GRCPERIPH127 field.                                      */
  #define GRCCONF_INTEN21_GRCPERIPH127_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH127_Pos) /*!< Bit mask of GRCPERIPH127 field.    */
  #define GRCCONF_INTEN21_GRCPERIPH127_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH127 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH127_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH127 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH127_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN21_GRCPERIPH127_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH128 @Bit 28 : Enable or disable interrupt for event GRCPERIPH1[28] */
  #define GRCCONF_INTEN21_GRCPERIPH128_Pos (28UL)    /*!< Position of GRCPERIPH128 field.                                      */
  #define GRCCONF_INTEN21_GRCPERIPH128_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH128_Pos) /*!< Bit mask of GRCPERIPH128 field.    */
  #define GRCCONF_INTEN21_GRCPERIPH128_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH128 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH128_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH128 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH128_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN21_GRCPERIPH128_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH129 @Bit 29 : Enable or disable interrupt for event GRCPERIPH1[29] */
  #define GRCCONF_INTEN21_GRCPERIPH129_Pos (29UL)    /*!< Position of GRCPERIPH129 field.                                      */
  #define GRCCONF_INTEN21_GRCPERIPH129_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH129_Pos) /*!< Bit mask of GRCPERIPH129 field.    */
  #define GRCCONF_INTEN21_GRCPERIPH129_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH129 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH129_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH129 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH129_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN21_GRCPERIPH129_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH130 @Bit 30 : Enable or disable interrupt for event GRCPERIPH1[30] */
  #define GRCCONF_INTEN21_GRCPERIPH130_Pos (30UL)    /*!< Position of GRCPERIPH130 field.                                      */
  #define GRCCONF_INTEN21_GRCPERIPH130_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH130_Pos) /*!< Bit mask of GRCPERIPH130 field.    */
  #define GRCCONF_INTEN21_GRCPERIPH130_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH130 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH130_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH130 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH130_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN21_GRCPERIPH130_Enabled (0x1UL) /*!< Enable                                                             */

/* GRCPERIPH131 @Bit 31 : Enable or disable interrupt for event GRCPERIPH1[31] */
  #define GRCCONF_INTEN21_GRCPERIPH131_Pos (31UL)    /*!< Position of GRCPERIPH131 field.                                      */
  #define GRCCONF_INTEN21_GRCPERIPH131_Msk (0x1UL << GRCCONF_INTEN21_GRCPERIPH131_Pos) /*!< Bit mask of GRCPERIPH131 field.    */
  #define GRCCONF_INTEN21_GRCPERIPH131_Min (0x0UL)   /*!< Min enumerator value of GRCPERIPH131 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH131_Max (0x1UL)   /*!< Max enumerator value of GRCPERIPH131 field.                          */
  #define GRCCONF_INTEN21_GRCPERIPH131_Disabled (0x0UL) /*!< Disable                                                           */
  #define GRCCONF_INTEN21_GRCPERIPH131_Enabled (0x1UL) /*!< Enable                                                             */


/* GRCCONF_INTEN22: Enable or disable interrupt */
  #define GRCCONF_INTEN22_ResetValue (0x00000000UL)  /*!< Reset value of INTEN22 register.                                     */

/* SYSTEMOFFREADY @Bit 0 : Enable or disable interrupt for event SYSTEMOFFREADY */
  #define GRCCONF_INTEN22_SYSTEMOFFREADY_Pos (0UL)   /*!< Position of SYSTEMOFFREADY field.                                    */
  #define GRCCONF_INTEN22_SYSTEMOFFREADY_Msk (0x1UL << GRCCONF_INTEN22_SYSTEMOFFREADY_Pos) /*!< Bit mask of SYSTEMOFFREADY
                                                                            field.*/                                              
  #define GRCCONF_INTEN22_SYSTEMOFFREADY_Min (0x0UL) /*!< Min enumerator value of SYSTEMOFFREADY field.                        */
  #define GRCCONF_INTEN22_SYSTEMOFFREADY_Max (0x1UL) /*!< Max enumerator value of SYSTEMOFFREADY field.                        */
  #define GRCCONF_INTEN22_SYSTEMOFFREADY_Disabled (0x0UL) /*!< Disable                                                         */
  #define GRCCONF_INTEN22_SYSTEMOFFREADY_Enabled (0x1UL) /*!< Enable                                                           */

/* SYSTEMOFFNOTREADY @Bit 1 : Enable or disable interrupt for event SYSTEMOFFNOTREADY */
  #define GRCCONF_INTEN22_SYSTEMOFFNOTREADY_Pos (1UL) /*!< Position of SYSTEMOFFNOTREADY field.                                */
  #define GRCCONF_INTEN22_SYSTEMOFFNOTREADY_Msk (0x1UL << GRCCONF_INTEN22_SYSTEMOFFNOTREADY_Pos) /*!< Bit mask of
                                                                            SYSTEMOFFNOTREADY field.*/                            
  #define GRCCONF_INTEN22_SYSTEMOFFNOTREADY_Min (0x0UL) /*!< Min enumerator value of SYSTEMOFFNOTREADY field.                  */
  #define GRCCONF_INTEN22_SYSTEMOFFNOTREADY_Max (0x1UL) /*!< Max enumerator value of SYSTEMOFFNOTREADY field.                  */
  #define GRCCONF_INTEN22_SYSTEMOFFNOTREADY_Disabled (0x0UL) /*!< Disable                                                      */
  #define GRCCONF_INTEN22_SYSTEMOFFNOTREADY_Enabled (0x1UL) /*!< Enable                                                        */


