adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GRCPERIPH124 @Bit 24 : Write '1' to disable interrupt for event GRCPERIPH1[24] */
  #define GRCCONF_INTENCLR21_GRCPERIPH124_Pos (24UL) /*!< Position of GRCPERIPH124 field.                                      */
  #define GRCCONF_INTENCLR21_GRCPERIPH124_Msk (0x1UL << GRCCONF_INTENCLR21_GRCPERIPH124_Pos) /*!< Bit mask of GRCPERIPH124
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR21_GRCPERIPH124_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH124 field.                         */
  #define GRCCONF_INTENCLR21_GRCPERIPH124_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH124 field.                         */
  #define GRCCONF_INTENCLR21_GRCPERIPH124_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH124_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR21_GRCPERIPH124_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH125 @Bit 25 : Write '1' to disable interrupt for event GRCPERIPH1[25] */
  #define GRCCONF_INTENCLR21_GRCPERIPH125_Pos (25UL) /*!< Position of GRCPERIPH125 field.                                      */
  #define GRCCONF_INTENCLR21_GRCPERIPH125_Msk (0x1UL << GRCCONF_INTENCLR21_GRCPERIPH125_Pos) /*!< Bit mask of GRCPERIPH125
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR21_GRCPERIPH125_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH125 field.                         */
  #define GRCCONF_INTENCLR21_GRCPERIPH125_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH125 field.                         */
  #define GRCCONF_INTENCLR21_GRCPERIPH125_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH125_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR21_GRCPERIPH125_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH126 @Bit 26 : Write '1' to disable interrupt for event GRCPERIPH1[26] */
  #define GRCCONF_INTENCLR21_GRCPERIPH126_Pos (26UL) /*!< Position of GRCPERIPH126 field.                                      */
  #define GRCCONF_INTENCLR21_GRCPERIPH126_Msk (0x1UL << GRCCONF_INTENCLR21_GRCPERIPH126_Pos) /*!< Bit mask of GRCPERIPH126
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR21_GRCPERIPH126_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH126 field.                         */
  #define GRCCONF_INTENCLR21_GRCPERIPH126_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH126 field.                         */
  #define GRCCONF_INTENCLR21_GRCPERIPH126_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH126_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR21_GRCPERIPH126_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH127 @Bit 27 : Write '1' to disable interrupt for event GRCPERIPH1[27] */
  #define GRCCONF_INTENCLR21_GRCPERIPH127_Pos (27UL) /*!< Position of GRCPERIPH127 field.                                      */
  #define GRCCONF_INTENCLR21_GRCPERIPH127_Msk (0x1UL << GRCCONF_INTENCLR21_GRCPERIPH127_Pos) /*!< Bit mask of GRCPERIPH127
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR21_GRCPERIPH127_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH127 field.                         */
  #define GRCCONF_INTENCLR21_GRCPERIPH127_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH127 field.                         */
  #define GRCCONF_INTENCLR21_GRCPERIPH127_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH127_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR21_GRCPERIPH127_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH128 @Bit 28 : Write '1' to disable interrupt for event GRCPERIPH1[28] */
  #define GRCCONF_INTENCLR21_GRCPERIPH128_Pos (28UL) /*!< Position of GRCPERIPH128 field.                                      */
  #define GRCCONF_INTENCLR21_GRCPERIPH128_Msk (0x1UL << GRCCONF_INTENCLR21_GRCPERIPH128_Pos) /*!< Bit mask of GRCPERIPH128
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR21_GRCPERIPH128_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH128 field.                         */
  #define GRCCONF_INTENCLR21_GRCPERIPH128_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH128 field.                         */
  #define GRCCONF_INTENCLR21_GRCPERIPH128_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH128_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR21_GRCPERIPH128_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH129 @Bit 29 : Write '1' to disable interrupt for event GRCPERIPH1[29] */
  #define GRCCONF_INTENCLR21_GRCPERIPH129_Pos (29UL) /*!< Position of GRCPERIPH129 field.                                      */
  #define GRCCONF_INTENCLR21_GRCPERIPH129_Msk (0x1UL << GRCCONF_INTENCLR21_GRCPERIPH129_Pos) /*!< Bit mask of GRCPERIPH129
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR21_GRCPERIPH129_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH129 field.                         */
  #define GRCCONF_INTENCLR21_GRCPERIPH129_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH129 field.                         */
  #define GRCCONF_INTENCLR21_GRCPERIPH129_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH129_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR21_GRCPERIPH129_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* GRCPERIPH130 @Bit 30 : Write '1' to disable interrupt for event GRCPERIPH1[30] */
  #define GRCCONF_INTENCLR21_GRCPERIPH130_Pos (30UL) /*!< Position of GRCPERIPH130 field.                                      */
  #define GRCCONF_INTENCLR21_GRCPERIPH130_Msk (0x1UL << GRCCONF_INTENCLR21_GRCPERIPH130_Pos) /*!< Bit mask of GRCPERIPH130
                                                                            field.*/                                              
  #define GRCCONF_INTENCLR21_GRCPERIPH130_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH130 field.                         */
  #define GRCCONF_INTENCLR21_GRCPERIPH130_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH130 field.                         */
  #define GRCCONF_INTENCLR21_GRCPERIPH130_Clear (0x1UL) /*!< Disable                                                           */
  #define GRCCONF_INTENCLR21_GRCPERIPH130_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRCCONF_INTENCLR21_GRCPERIPH130_Enabled (0x1UL) /*!< Read: Enabled                                                   */

