adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GRCPERIPH15 @Bit 5 : Read pending status of interrupt for event GRCPERIPH1[5] */
  #define GRCCONF_INTPEND21_GRCPERIPH15_Pos (5UL)    /*!< Position of GRCPERIPH15 field.                                       */
  #define GRCCONF_INTPEND21_GRCPERIPH15_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH15_Pos) /*!< Bit mask of GRCPERIPH15 field.   */
  #define GRCCONF_INTPEND21_GRCPERIPH15_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH15 field.                           */
  #define GRCCONF_INTPEND21_GRCPERIPH15_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH15 field.                           */
  #define GRCCONF_INTPEND21_GRCPERIPH15_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND21_GRCPERIPH15_Pending (0x1UL) /*!< Read: Pending                                                     */

/* GRCPERIPH16 @Bit 6 : Read pending status of interrupt for event GRCPERIPH1[6] */
  #define GRCCONF_INTPEND21_GRCPERIPH16_Pos (6UL)    /*!< Position of GRCPERIPH16 field.                                       */
  #define GRCCONF_INTPEND21_GRCPERIPH16_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH16_Pos) /*!< Bit mask of GRCPERIPH16 field.   */
  #define GRCCONF_INTPEND21_GRCPERIPH16_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH16 field.                           */
  #define GRCCONF_INTPEND21_GRCPERIPH16_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH16 field.                           */
  #define GRCCONF_INTPEND21_GRCPERIPH16_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND21_GRCPERIPH16_Pending (0x1UL) /*!< Read: Pending                                                     */

/* GRCPERIPH17 @Bit 7 : Read pending status of interrupt for event GRCPERIPH1[7] */
  #define GRCCONF_INTPEND21_GRCPERIPH17_Pos (7UL)    /*!< Position of GRCPERIPH17 field.                                       */
  #define GRCCONF_INTPEND21_GRCPERIPH17_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH17_Pos) /*!< Bit mask of GRCPERIPH17 field.   */
  #define GRCCONF_INTPEND21_GRCPERIPH17_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH17 field.                           */
  #define GRCCONF_INTPEND21_GRCPERIPH17_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH17 field.                           */
  #define GRCCONF_INTPEND21_GRCPERIPH17_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND21_GRCPERIPH17_Pending (0x1UL) /*!< Read: Pending                                                     */

/* GRCPERIPH18 @Bit 8 : Read pending status of interrupt for event GRCPERIPH1[8] */
  #define GRCCONF_INTPEND21_GRCPERIPH18_Pos (8UL)    /*!< Position of GRCPERIPH18 field.                                       */
  #define GRCCONF_INTPEND21_GRCPERIPH18_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH18_Pos) /*!< Bit mask of GRCPERIPH18 field.   */
  #define GRCCONF_INTPEND21_GRCPERIPH18_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH18 field.                           */
  #define GRCCONF_INTPEND21_GRCPERIPH18_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH18 field.                           */
  #define GRCCONF_INTPEND21_GRCPERIPH18_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND21_GRCPERIPH18_Pending (0x1UL) /*!< Read: Pending                                                     */

/* GRCPERIPH19 @Bit 9 : Read pending status of interrupt for event GRCPERIPH1[9] */
  #define GRCCONF_INTPEND21_GRCPERIPH19_Pos (9UL)    /*!< Position of GRCPERIPH19 field.                                       */
  #define GRCCONF_INTPEND21_GRCPERIPH19_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH19_Pos) /*!< Bit mask of GRCPERIPH19 field.   */
  #define GRCCONF_INTPEND21_GRCPERIPH19_Min (0x0UL)  /*!< Min enumerator value of GRCPERIPH19 field.                           */
  #define GRCCONF_INTPEND21_GRCPERIPH19_Max (0x1UL)  /*!< Max enumerator value of GRCPERIPH19 field.                           */
  #define GRCCONF_INTPEND21_GRCPERIPH19_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRCCONF_INTPEND21_GRCPERIPH19_Pending (0x1UL) /*!< Read: Pending                                                     */

/* GRCPERIPH110 @Bit 10 : Read pending status of interrupt for event GRCPERIPH1[10] */
  #define GRCCONF_INTPEND21_GRCPERIPH110_Pos (10UL)  /*!< Position of GRCPERIPH110 field.                                      */
  #define GRCCONF_INTPEND21_GRCPERIPH110_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH110_Pos) /*!< Bit mask of GRCPERIPH110 field.*/
  #define GRCCONF_INTPEND21_GRCPERIPH110_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH110 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH110_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH110 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH110_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND21_GRCPERIPH110_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH111 @Bit 11 : Read pending status of interrupt for event GRCPERIPH1[11] */
  #define GRCCONF_INTPEND21_GRCPERIPH111_Pos (11UL)  /*!< Position of GRCPERIPH111 field.                                      */
  #define GRCCONF_INTPEND21_GRCPERIPH111_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH111_Pos) /*!< Bit mask of GRCPERIPH111 field.*/
  #define GRCCONF_INTPEND21_GRCPERIPH111_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH111 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH111_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH111 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH111_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND21_GRCPERIPH111_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH112 @Bit 12 : Read pending status of interrupt for event GRCPERIPH1[12] */
  #define GRCCONF_INTPEND21_GRCPERIPH112_Pos (12UL)  /*!< Position of GRCPERIPH112 field.                                      */
  #define GRCCONF_INTPEND21_GRCPERIPH112_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH112_Pos) /*!< Bit mask of GRCPERIPH112 field.*/
  #define GRCCONF_INTPEND21_GRCPERIPH112_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH112 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH112_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH112 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH112_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND21_GRCPERIPH112_Pending (0x1UL) /*!< Read: Pending                                                    */

