adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GRCPERIPH113 @Bit 13 : Read pending status of interrupt for event GRCPERIPH1[13] */
  #define GRCCONF_INTPEND21_GRCPERIPH113_Pos (13UL)  /*!< Position of GRCPERIPH113 field.                                      */
  #define GRCCONF_INTPEND21_GRCPERIPH113_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH113_Pos) /*!< Bit mask of GRCPERIPH113 field.*/
  #define GRCCONF_INTPEND21_GRCPERIPH113_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH113 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH113_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH113 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH113_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND21_GRCPERIPH113_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH114 @Bit 14 : Read pending status of interrupt for event GRCPERIPH1[14] */
  #define GRCCONF_INTPEND21_GRCPERIPH114_Pos (14UL)  /*!< Position of GRCPERIPH114 field.                                      */
  #define GRCCONF_INTPEND21_GRCPERIPH114_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH114_Pos) /*!< Bit mask of GRCPERIPH114 field.*/
  #define GRCCONF_INTPEND21_GRCPERIPH114_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH114 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH114_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH114 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH114_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND21_GRCPERIPH114_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH115 @Bit 15 : Read pending status of interrupt for event GRCPERIPH1[15] */
  #define GRCCONF_INTPEND21_GRCPERIPH115_Pos (15UL)  /*!< Position of GRCPERIPH115 field.                                      */
  #define GRCCONF_INTPEND21_GRCPERIPH115_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH115_Pos) /*!< Bit mask of GRCPERIPH115 field.*/
  #define GRCCONF_INTPEND21_GRCPERIPH115_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH115 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH115_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH115 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH115_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND21_GRCPERIPH115_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH116 @Bit 16 : Read pending status of interrupt for event GRCPERIPH1[16] */
  #define GRCCONF_INTPEND21_GRCPERIPH116_Pos (16UL)  /*!< Position of GRCPERIPH116 field.                                      */
  #define GRCCONF_INTPEND21_GRCPERIPH116_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH116_Pos) /*!< Bit mask of GRCPERIPH116 field.*/
  #define GRCCONF_INTPEND21_GRCPERIPH116_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH116 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH116_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH116 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH116_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND21_GRCPERIPH116_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH117 @Bit 17 : Read pending status of interrupt for event GRCPERIPH1[17] */
  #define GRCCONF_INTPEND21_GRCPERIPH117_Pos (17UL)  /*!< Position of GRCPERIPH117 field.                                      */
  #define GRCCONF_INTPEND21_GRCPERIPH117_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH117_Pos) /*!< Bit mask of GRCPERIPH117 field.*/
  #define GRCCONF_INTPEND21_GRCPERIPH117_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH117 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH117_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH117 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH117_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND21_GRCPERIPH117_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH118 @Bit 18 : Read pending status of interrupt for event GRCPERIPH1[18] */
  #define GRCCONF_INTPEND21_GRCPERIPH118_Pos (18UL)  /*!< Position of GRCPERIPH118 field.                                      */
  #define GRCCONF_INTPEND21_GRCPERIPH118_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH118_Pos) /*!< Bit mask of GRCPERIPH118 field.*/
  #define GRCCONF_INTPEND21_GRCPERIPH118_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH118 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH118_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH118 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH118_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND21_GRCPERIPH118_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH119 @Bit 19 : Read pending status of interrupt for event GRCPERIPH1[19] */
  #define GRCCONF_INTPEND21_GRCPERIPH119_Pos (19UL)  /*!< Position of GRCPERIPH119 field.                                      */
  #define GRCCONF_INTPEND21_GRCPERIPH119_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH119_Pos) /*!< Bit mask of GRCPERIPH119 field.*/
  #define GRCCONF_INTPEND21_GRCPERIPH119_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH119 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH119_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH119 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH119_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND21_GRCPERIPH119_Pending (0x1UL) /*!< Read: Pending                                                    */

/* GRCPERIPH120 @Bit 20 : Read pending status of interrupt for event GRCPERIPH1[20] */
  #define GRCCONF_INTPEND21_GRCPERIPH120_Pos (20UL)  /*!< Position of GRCPERIPH120 field.                                      */
  #define GRCCONF_INTPEND21_GRCPERIPH120_Msk (0x1UL << GRCCONF_INTPEND21_GRCPERIPH120_Pos) /*!< Bit mask of GRCPERIPH120 field.*/
  #define GRCCONF_INTPEND21_GRCPERIPH120_Min (0x0UL) /*!< Min enumerator value of GRCPERIPH120 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH120_Max (0x1UL) /*!< Max enumerator value of GRCPERIPH120 field.                          */
  #define GRCCONF_INTPEND21_GRCPERIPH120_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRCCONF_INTPEND21_GRCPERIPH120_Pending (0x1UL) /*!< Read: Pending                                                    */

