adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RAMPUP @Bit 2 : Ramp up done status */
  #define GRCCONF_CHIPCONF_RAMPUP_Pos (2UL)          /*!< Position of RAMPUP field.                                            */
  #define GRCCONF_CHIPCONF_RAMPUP_Msk (0x1UL << GRCCONF_CHIPCONF_RAMPUP_Pos) /*!< Bit mask of RAMPUP field.                    */
  #define GRCCONF_CHIPCONF_RAMPUP_Min (0x0UL)        /*!< Min enumerator value of RAMPUP field.                                */
  #define GRCCONF_CHIPCONF_RAMPUP_Max (0x1UL)        /*!< Max enumerator value of RAMPUP field.                                */
  #define GRCCONF_CHIPCONF_RAMPUP_NotDone (0x0UL)    /*!< Ramp up is not done                                                  */
  #define GRCCONF_CHIPCONF_RAMPUP_Done (0x1UL)       /*!< Ramp up is done                                                      */


/* GRCCONF_SYSTEMOFF: System OFF register */
  #define GRCCONF_SYSTEMOFF_ResetValue (0x00000000UL) /*!< Reset value of SYSTEMOFF register.                                  */

/* SYSTEMOFF @Bit 0 : Enable System OFF mode */
  #define GRCCONF_SYSTEMOFF_SYSTEMOFF_Pos (0UL)      /*!< Position of SYSTEMOFF field.                                         */
  #define GRCCONF_SYSTEMOFF_SYSTEMOFF_Msk (0x1UL << GRCCONF_SYSTEMOFF_SYSTEMOFF_Pos) /*!< Bit mask of SYSTEMOFF field.         */
  #define GRCCONF_SYSTEMOFF_SYSTEMOFF_Min (0x0UL)    /*!< Min enumerator value of SYSTEMOFF field.                             */
  #define GRCCONF_SYSTEMOFF_SYSTEMOFF_Max (0x1UL)    /*!< Max enumerator value of SYSTEMOFF field.                             */
  #define GRCCONF_SYSTEMOFF_SYSTEMOFF_NoOperation (0x0UL) /*!< No operation                                                    */
  #define GRCCONF_SYSTEMOFF_SYSTEMOFF_Enter (0x1UL)  /*!< Enter into System OFF mode                                           */

/* FORCESYSTEMOFF @Bit 1 : Force System OFF mode */
  #define GRCCONF_SYSTEMOFF_FORCESYSTEMOFF_Pos (1UL) /*!< Position of FORCESYSTEMOFF field.                                    */
  #define GRCCONF_SYSTEMOFF_FORCESYSTEMOFF_Msk (0x1UL << GRCCONF_SYSTEMOFF_FORCESYSTEMOFF_Pos) /*!< Bit mask of FORCESYSTEMOFF
                                                                            field.*/                                              
  #define GRCCONF_SYSTEMOFF_FORCESYSTEMOFF_Min (0x0UL) /*!< Min enumerator value of FORCESYSTEMOFF field.                      */
  #define GRCCONF_SYSTEMOFF_FORCESYSTEMOFF_Max (0x1UL) /*!< Max enumerator value of FORCESYSTEMOFF field.                      */
  #define GRCCONF_SYSTEMOFF_FORCESYSTEMOFF_NoOperation (0x0UL) /*!< No operation                                               */
  #define GRCCONF_SYSTEMOFF_FORCESYSTEMOFF_Force (0x1UL) /*!< Force into System OFF mode                                       */

/* FORCESYSTEMOFFNOW @Bit 2 : Force System OFF mode immediately */
  #define GRCCONF_SYSTEMOFF_FORCESYSTEMOFFNOW_Pos (2UL) /*!< Position of FORCESYSTEMOFFNOW field.                              */
  #define GRCCONF_SYSTEMOFF_FORCESYSTEMOFFNOW_Msk (0x1UL << GRCCONF_SYSTEMOFF_FORCESYSTEMOFFNOW_Pos) /*!< Bit mask of
                                                                            FORCESYSTEMOFFNOW field.*/                            
  #define GRCCONF_SYSTEMOFF_FORCESYSTEMOFFNOW_Min (0x0UL) /*!< Min enumerator value of FORCESYSTEMOFFNOW field.                */
  #define GRCCONF_SYSTEMOFF_FORCESYSTEMOFFNOW_Max (0x1UL) /*!< Max enumerator value of FORCESYSTEMOFFNOW field.                */
  #define GRCCONF_SYSTEMOFF_FORCESYSTEMOFFNOW_NoOperation (0x0UL) /*!< No operation                                            */
  #define GRCCONF_SYSTEMOFF_FORCESYSTEMOFFNOW_Force (0x1UL) /*!< Force into System OFF mode immediately                        */


/* GRCCONF_SYSTEMOFFSTAT: System OFF status */
  #define GRCCONF_SYSTEMOFFSTAT_ResetValue (0x00000000UL) /*!< Reset value of SYSTEMOFFSTAT register.                          */

/* STATUS0 @Bit 0 : System OFF status for power domain [0] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS0_Pos (0UL)    /*!< Position of STATUS0 field.                                           */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS0_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS0_Pos) /*!< Bit mask of STATUS0 field.       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS0_Min (0x0UL)  /*!< Min enumerator value of STATUS0 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS0_Max (0x1UL)  /*!< Max enumerator value of STATUS0 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS0_Ready (0x0UL) /*!< Power domain [0] is ready to go to system OFF                       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS0_Prevent (0x1UL) /*!< Power domain [0] is preventing system OFF                         */

/* STATUS1 @Bit 1 : System OFF status for power domain [1] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS1_Pos (1UL)    /*!< Position of STATUS1 field.                                           */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS1_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS1_Pos) /*!< Bit mask of STATUS1 field.       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS1_Min (0x0UL)  /*!< Min enumerator value of STATUS1 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS1_Max (0x1UL)  /*!< Max enumerator value of STATUS1 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS1_Ready (0x0UL) /*!< Power domain [1] is ready to go to system OFF                       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS1_Prevent (0x1UL) /*!< Power domain [1] is preventing system OFF                         */

/* STATUS2 @Bit 2 : System OFF status for power domain [2] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS2_Pos (2UL)    /*!< Position of STATUS2 field.                                           */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS2_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS2_Pos) /*!< Bit mask of STATUS2 field.       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS2_Min (0x0UL)  /*!< Min enumerator value of STATUS2 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS2_Max (0x1UL)  /*!< Max enumerator value of STATUS2 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS2_Ready (0x0UL) /*!< Power domain [2] is ready to go to system OFF                       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS2_Prevent (0x1UL) /*!< Power domain [2] is preventing system OFF                         */

/* STATUS3 @Bit 3 : System OFF status for power domain [3] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS3_Pos (3UL)    /*!< Position of STATUS3 field.                                           */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS3_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS3_Pos) /*!< Bit mask of STATUS3 field.       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS3_Min (0x0UL)  /*!< Min enumerator value of STATUS3 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS3_Max (0x1UL)  /*!< Max enumerator value of STATUS3 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS3_Ready (0x0UL) /*!< Power domain [3] is ready to go to system OFF                       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS3_Prevent (0x1UL) /*!< Power domain [3] is preventing system OFF                         */

/* STATUS4 @Bit 4 : System OFF status for power domain [4] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS4_Pos (4UL)    /*!< Position of STATUS4 field.                                           */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS4_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS4_Pos) /*!< Bit mask of STATUS4 field.       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS4_Min (0x0UL)  /*!< Min enumerator value of STATUS4 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS4_Max (0x1UL)  /*!< Max enumerator value of STATUS4 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS4_Ready (0x0UL) /*!< Power domain [4] is ready to go to system OFF                       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS4_Prevent (0x1UL) /*!< Power domain [4] is preventing system OFF                         */

/* STATUS5 @Bit 5 : System OFF status for power domain [5] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS5_Pos (5UL)    /*!< Position of STATUS5 field.                                           */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS5_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS5_Pos) /*!< Bit mask of STATUS5 field.       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS5_Min (0x0UL)  /*!< Min enumerator value of STATUS5 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS5_Max (0x1UL)  /*!< Max enumerator value of STATUS5 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS5_Ready (0x0UL) /*!< Power domain [5] is ready to go to system OFF                       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS5_Prevent (0x1UL) /*!< Power domain [5] is preventing system OFF                         */

/* STATUS6 @Bit 6 : System OFF status for power domain [6] */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS6_Pos (6UL)    /*!< Position of STATUS6 field.                                           */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS6_Msk (0x1UL << GRCCONF_SYSTEMOFFSTAT_STATUS6_Pos) /*!< Bit mask of STATUS6 field.       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS6_Min (0x0UL)  /*!< Min enumerator value of STATUS6 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS6_Max (0x1UL)  /*!< Max enumerator value of STATUS6 field.                               */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS6_Ready (0x0UL) /*!< Power domain [6] is ready to go to system OFF                       */
  #define GRCCONF_SYSTEMOFFSTAT_STATUS6_Prevent (0x1UL) /*!< Power domain [6] is preventing system OFF                         */

