adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* STATUS11 @Bit 11 : The power domain request status for power domain [11] */
  #define GRCCONF_PDREQSTATUS_STATUS11_Pos (11UL)    /*!< Position of STATUS11 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS11_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS11_Pos) /*!< Bit mask of STATUS11 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS11_Min (0x0UL)   /*!< Min enumerator value of STATUS11 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS11_Max (0x1UL)   /*!< Max enumerator value of STATUS11 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS11_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS11_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS12 @Bit 12 : The power domain request status for power domain [12] */
  #define GRCCONF_PDREQSTATUS_STATUS12_Pos (12UL)    /*!< Position of STATUS12 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS12_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS12_Pos) /*!< Bit mask of STATUS12 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS12_Min (0x0UL)   /*!< Min enumerator value of STATUS12 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS12_Max (0x1UL)   /*!< Max enumerator value of STATUS12 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS12_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS12_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS13 @Bit 13 : The power domain request status for power domain [13] */
  #define GRCCONF_PDREQSTATUS_STATUS13_Pos (13UL)    /*!< Position of STATUS13 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS13_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS13_Pos) /*!< Bit mask of STATUS13 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS13_Min (0x0UL)   /*!< Min enumerator value of STATUS13 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS13_Max (0x1UL)   /*!< Max enumerator value of STATUS13 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS13_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS13_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS14 @Bit 14 : The power domain request status for power domain [14] */
  #define GRCCONF_PDREQSTATUS_STATUS14_Pos (14UL)    /*!< Position of STATUS14 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS14_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS14_Pos) /*!< Bit mask of STATUS14 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS14_Min (0x0UL)   /*!< Min enumerator value of STATUS14 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS14_Max (0x1UL)   /*!< Max enumerator value of STATUS14 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS14_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS14_Active (0x1UL) /*!< Power domain request is active                                      */

/* STATUS15 @Bit 15 : The power domain request status for power domain [15] */
  #define GRCCONF_PDREQSTATUS_STATUS15_Pos (15UL)    /*!< Position of STATUS15 field.                                          */
  #define GRCCONF_PDREQSTATUS_STATUS15_Msk (0x1UL << GRCCONF_PDREQSTATUS_STATUS15_Pos) /*!< Bit mask of STATUS15 field.        */
  #define GRCCONF_PDREQSTATUS_STATUS15_Min (0x0UL)   /*!< Min enumerator value of STATUS15 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS15_Max (0x1UL)   /*!< Max enumerator value of STATUS15 field.                              */
  #define GRCCONF_PDREQSTATUS_STATUS15_Inactive (0x0UL) /*!< Power domain request is inactive                                  */
  #define GRCCONF_PDREQSTATUS_STATUS15_Active (0x1UL) /*!< Power domain request is active                                      */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           GRTC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct GRTC_CC ====================================================== */
/**
  * @brief CC [GRTC_CC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CCL;                               /*!< (@ 0x00000000) The lower 32-bits of Capture/Compare register CC[n]   */
  __IOM uint32_t  CCH;                               /*!< (@ 0x00000004) The higher 32-bits of Capture/Compare register CC[n]  */
  __IOM uint32_t  CCADD;                             /*!< (@ 0x00000008) Count to add to CC[n]                                 */
  __IOM uint32_t  CCEN;                              /*!< (@ 0x0000000C) Configure Capture/Compare register CC[n]              */
} NRF_GRTC_CC_Type;                                  /*!< Size = 16 (0x010)                                                    */
  #define GRTC_CC_MaxCount (24UL)                    /*!< Max size of CC[24] array.                                            */

/* GRTC_CC_CCL: The lower 32-bits of Capture/Compare register CC[n] */
  #define GRTC_CC_CCL_ResetValue (0x00000000UL)      /*!< Reset value of CCL register.                                         */

