adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* COMPARE17 @Bit 17 : Write '1' to enable interrupt for event COMPARE[17] */
  #define GRTC_INTENSET0_COMPARE17_Pos (17UL)        /*!< Position of COMPARE17 field.                                         */
  #define GRTC_INTENSET0_COMPARE17_Msk (0x1UL << GRTC_INTENSET0_COMPARE17_Pos) /*!< Bit mask of COMPARE17 field.               */
  #define GRTC_INTENSET0_COMPARE17_Min (0x0UL)       /*!< Min enumerator value of COMPARE17 field.                             */
  #define GRTC_INTENSET0_COMPARE17_Max (0x1UL)       /*!< Max enumerator value of COMPARE17 field.                             */
  #define GRTC_INTENSET0_COMPARE17_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET0_COMPARE17_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET0_COMPARE17_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE18 @Bit 18 : Write '1' to enable interrupt for event COMPARE[18] */
  #define GRTC_INTENSET0_COMPARE18_Pos (18UL)        /*!< Position of COMPARE18 field.                                         */
  #define GRTC_INTENSET0_COMPARE18_Msk (0x1UL << GRTC_INTENSET0_COMPARE18_Pos) /*!< Bit mask of COMPARE18 field.               */
  #define GRTC_INTENSET0_COMPARE18_Min (0x0UL)       /*!< Min enumerator value of COMPARE18 field.                             */
  #define GRTC_INTENSET0_COMPARE18_Max (0x1UL)       /*!< Max enumerator value of COMPARE18 field.                             */
  #define GRTC_INTENSET0_COMPARE18_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET0_COMPARE18_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET0_COMPARE18_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE19 @Bit 19 : Write '1' to enable interrupt for event COMPARE[19] */
  #define GRTC_INTENSET0_COMPARE19_Pos (19UL)        /*!< Position of COMPARE19 field.                                         */
  #define GRTC_INTENSET0_COMPARE19_Msk (0x1UL << GRTC_INTENSET0_COMPARE19_Pos) /*!< Bit mask of COMPARE19 field.               */
  #define GRTC_INTENSET0_COMPARE19_Min (0x0UL)       /*!< Min enumerator value of COMPARE19 field.                             */
  #define GRTC_INTENSET0_COMPARE19_Max (0x1UL)       /*!< Max enumerator value of COMPARE19 field.                             */
  #define GRTC_INTENSET0_COMPARE19_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET0_COMPARE19_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET0_COMPARE19_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE20 @Bit 20 : Write '1' to enable interrupt for event COMPARE[20] */
  #define GRTC_INTENSET0_COMPARE20_Pos (20UL)        /*!< Position of COMPARE20 field.                                         */
  #define GRTC_INTENSET0_COMPARE20_Msk (0x1UL << GRTC_INTENSET0_COMPARE20_Pos) /*!< Bit mask of COMPARE20 field.               */
  #define GRTC_INTENSET0_COMPARE20_Min (0x0UL)       /*!< Min enumerator value of COMPARE20 field.                             */
  #define GRTC_INTENSET0_COMPARE20_Max (0x1UL)       /*!< Max enumerator value of COMPARE20 field.                             */
  #define GRTC_INTENSET0_COMPARE20_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET0_COMPARE20_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET0_COMPARE20_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE21 @Bit 21 : Write '1' to enable interrupt for event COMPARE[21] */
  #define GRTC_INTENSET0_COMPARE21_Pos (21UL)        /*!< Position of COMPARE21 field.                                         */
  #define GRTC_INTENSET0_COMPARE21_Msk (0x1UL << GRTC_INTENSET0_COMPARE21_Pos) /*!< Bit mask of COMPARE21 field.               */
  #define GRTC_INTENSET0_COMPARE21_Min (0x0UL)       /*!< Min enumerator value of COMPARE21 field.                             */
  #define GRTC_INTENSET0_COMPARE21_Max (0x1UL)       /*!< Max enumerator value of COMPARE21 field.                             */
  #define GRTC_INTENSET0_COMPARE21_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET0_COMPARE21_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET0_COMPARE21_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE22 @Bit 22 : Write '1' to enable interrupt for event COMPARE[22] */
  #define GRTC_INTENSET0_COMPARE22_Pos (22UL)        /*!< Position of COMPARE22 field.                                         */
  #define GRTC_INTENSET0_COMPARE22_Msk (0x1UL << GRTC_INTENSET0_COMPARE22_Pos) /*!< Bit mask of COMPARE22 field.               */
  #define GRTC_INTENSET0_COMPARE22_Min (0x0UL)       /*!< Min enumerator value of COMPARE22 field.                             */
  #define GRTC_INTENSET0_COMPARE22_Max (0x1UL)       /*!< Max enumerator value of COMPARE22 field.                             */
  #define GRTC_INTENSET0_COMPARE22_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET0_COMPARE22_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET0_COMPARE22_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE23 @Bit 23 : Write '1' to enable interrupt for event COMPARE[23] */
  #define GRTC_INTENSET0_COMPARE23_Pos (23UL)        /*!< Position of COMPARE23 field.                                         */
  #define GRTC_INTENSET0_COMPARE23_Msk (0x1UL << GRTC_INTENSET0_COMPARE23_Pos) /*!< Bit mask of COMPARE23 field.               */
  #define GRTC_INTENSET0_COMPARE23_Min (0x0UL)       /*!< Min enumerator value of COMPARE23 field.                             */
  #define GRTC_INTENSET0_COMPARE23_Max (0x1UL)       /*!< Max enumerator value of COMPARE23 field.                             */
  #define GRTC_INTENSET0_COMPARE23_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET0_COMPARE23_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET0_COMPARE23_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

