adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* COMPARE10 @Bit 10 : Write '1' to enable interrupt for event COMPARE[10] */
  #define GRTC_INTENSET4_COMPARE10_Pos (10UL)        /*!< Position of COMPARE10 field.                                         */
  #define GRTC_INTENSET4_COMPARE10_Msk (0x1UL << GRTC_INTENSET4_COMPARE10_Pos) /*!< Bit mask of COMPARE10 field.               */
  #define GRTC_INTENSET4_COMPARE10_Min (0x0UL)       /*!< Min enumerator value of COMPARE10 field.                             */
  #define GRTC_INTENSET4_COMPARE10_Max (0x1UL)       /*!< Max enumerator value of COMPARE10 field.                             */
  #define GRTC_INTENSET4_COMPARE10_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET4_COMPARE10_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET4_COMPARE10_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE11 @Bit 11 : Write '1' to enable interrupt for event COMPARE[11] */
  #define GRTC_INTENSET4_COMPARE11_Pos (11UL)        /*!< Position of COMPARE11 field.                                         */
  #define GRTC_INTENSET4_COMPARE11_Msk (0x1UL << GRTC_INTENSET4_COMPARE11_Pos) /*!< Bit mask of COMPARE11 field.               */
  #define GRTC_INTENSET4_COMPARE11_Min (0x0UL)       /*!< Min enumerator value of COMPARE11 field.                             */
  #define GRTC_INTENSET4_COMPARE11_Max (0x1UL)       /*!< Max enumerator value of COMPARE11 field.                             */
  #define GRTC_INTENSET4_COMPARE11_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET4_COMPARE11_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET4_COMPARE11_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE12 @Bit 12 : Write '1' to enable interrupt for event COMPARE[12] */
  #define GRTC_INTENSET4_COMPARE12_Pos (12UL)        /*!< Position of COMPARE12 field.                                         */
  #define GRTC_INTENSET4_COMPARE12_Msk (0x1UL << GRTC_INTENSET4_COMPARE12_Pos) /*!< Bit mask of COMPARE12 field.               */
  #define GRTC_INTENSET4_COMPARE12_Min (0x0UL)       /*!< Min enumerator value of COMPARE12 field.                             */
  #define GRTC_INTENSET4_COMPARE12_Max (0x1UL)       /*!< Max enumerator value of COMPARE12 field.                             */
  #define GRTC_INTENSET4_COMPARE12_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET4_COMPARE12_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET4_COMPARE12_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE13 @Bit 13 : Write '1' to enable interrupt for event COMPARE[13] */
  #define GRTC_INTENSET4_COMPARE13_Pos (13UL)        /*!< Position of COMPARE13 field.                                         */
  #define GRTC_INTENSET4_COMPARE13_Msk (0x1UL << GRTC_INTENSET4_COMPARE13_Pos) /*!< Bit mask of COMPARE13 field.               */
  #define GRTC_INTENSET4_COMPARE13_Min (0x0UL)       /*!< Min enumerator value of COMPARE13 field.                             */
  #define GRTC_INTENSET4_COMPARE13_Max (0x1UL)       /*!< Max enumerator value of COMPARE13 field.                             */
  #define GRTC_INTENSET4_COMPARE13_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET4_COMPARE13_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET4_COMPARE13_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE14 @Bit 14 : Write '1' to enable interrupt for event COMPARE[14] */
  #define GRTC_INTENSET4_COMPARE14_Pos (14UL)        /*!< Position of COMPARE14 field.                                         */
  #define GRTC_INTENSET4_COMPARE14_Msk (0x1UL << GRTC_INTENSET4_COMPARE14_Pos) /*!< Bit mask of COMPARE14 field.               */
  #define GRTC_INTENSET4_COMPARE14_Min (0x0UL)       /*!< Min enumerator value of COMPARE14 field.                             */
  #define GRTC_INTENSET4_COMPARE14_Max (0x1UL)       /*!< Max enumerator value of COMPARE14 field.                             */
  #define GRTC_INTENSET4_COMPARE14_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET4_COMPARE14_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET4_COMPARE14_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE15 @Bit 15 : Write '1' to enable interrupt for event COMPARE[15] */
  #define GRTC_INTENSET4_COMPARE15_Pos (15UL)        /*!< Position of COMPARE15 field.                                         */
  #define GRTC_INTENSET4_COMPARE15_Msk (0x1UL << GRTC_INTENSET4_COMPARE15_Pos) /*!< Bit mask of COMPARE15 field.               */
  #define GRTC_INTENSET4_COMPARE15_Min (0x0UL)       /*!< Min enumerator value of COMPARE15 field.                             */
  #define GRTC_INTENSET4_COMPARE15_Max (0x1UL)       /*!< Max enumerator value of COMPARE15 field.                             */
  #define GRTC_INTENSET4_COMPARE15_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET4_COMPARE15_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET4_COMPARE15_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE16 @Bit 16 : Write '1' to enable interrupt for event COMPARE[16] */
  #define GRTC_INTENSET4_COMPARE16_Pos (16UL)        /*!< Position of COMPARE16 field.                                         */
  #define GRTC_INTENSET4_COMPARE16_Msk (0x1UL << GRTC_INTENSET4_COMPARE16_Pos) /*!< Bit mask of COMPARE16 field.               */
  #define GRTC_INTENSET4_COMPARE16_Min (0x0UL)       /*!< Min enumerator value of COMPARE16 field.                             */
  #define GRTC_INTENSET4_COMPARE16_Max (0x1UL)       /*!< Max enumerator value of COMPARE16 field.                             */
  #define GRTC_INTENSET4_COMPARE16_Set (0x1UL)       /*!< Enable                                                               */
  #define GRTC_INTENSET4_COMPARE16_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET4_COMPARE16_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

