adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* COMPARE21 @Bit 21 : Enable or disable interrupt for event COMPARE[21] */
  #define GRTC_INTEN6_COMPARE21_Pos (21UL)           /*!< Position of COMPARE21 field.                                         */
  #define GRTC_INTEN6_COMPARE21_Msk (0x1UL << GRTC_INTEN6_COMPARE21_Pos) /*!< Bit mask of COMPARE21 field.                     */
  #define GRTC_INTEN6_COMPARE21_Min (0x0UL)          /*!< Min enumerator value of COMPARE21 field.                             */
  #define GRTC_INTEN6_COMPARE21_Max (0x1UL)          /*!< Max enumerator value of COMPARE21 field.                             */
  #define GRTC_INTEN6_COMPARE21_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN6_COMPARE21_Enabled (0x1UL)      /*!< Enable                                                               */

/* COMPARE22 @Bit 22 : Enable or disable interrupt for event COMPARE[22] */
  #define GRTC_INTEN6_COMPARE22_Pos (22UL)           /*!< Position of COMPARE22 field.                                         */
  #define GRTC_INTEN6_COMPARE22_Msk (0x1UL << GRTC_INTEN6_COMPARE22_Pos) /*!< Bit mask of COMPARE22 field.                     */
  #define GRTC_INTEN6_COMPARE22_Min (0x0UL)          /*!< Min enumerator value of COMPARE22 field.                             */
  #define GRTC_INTEN6_COMPARE22_Max (0x1UL)          /*!< Max enumerator value of COMPARE22 field.                             */
  #define GRTC_INTEN6_COMPARE22_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN6_COMPARE22_Enabled (0x1UL)      /*!< Enable                                                               */

/* COMPARE23 @Bit 23 : Enable or disable interrupt for event COMPARE[23] */
  #define GRTC_INTEN6_COMPARE23_Pos (23UL)           /*!< Position of COMPARE23 field.                                         */
  #define GRTC_INTEN6_COMPARE23_Msk (0x1UL << GRTC_INTEN6_COMPARE23_Pos) /*!< Bit mask of COMPARE23 field.                     */
  #define GRTC_INTEN6_COMPARE23_Min (0x0UL)          /*!< Min enumerator value of COMPARE23 field.                             */
  #define GRTC_INTEN6_COMPARE23_Max (0x1UL)          /*!< Max enumerator value of COMPARE23 field.                             */
  #define GRTC_INTEN6_COMPARE23_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN6_COMPARE23_Enabled (0x1UL)      /*!< Enable                                                               */

/* RTCOMPARE @Bit 24 : Enable or disable interrupt for event RTCOMPARE */
  #define GRTC_INTEN6_RTCOMPARE_Pos (24UL)           /*!< Position of RTCOMPARE field.                                         */
  #define GRTC_INTEN6_RTCOMPARE_Msk (0x1UL << GRTC_INTEN6_RTCOMPARE_Pos) /*!< Bit mask of RTCOMPARE field.                     */
  #define GRTC_INTEN6_RTCOMPARE_Min (0x0UL)          /*!< Min enumerator value of RTCOMPARE field.                             */
  #define GRTC_INTEN6_RTCOMPARE_Max (0x1UL)          /*!< Max enumerator value of RTCOMPARE field.                             */
  #define GRTC_INTEN6_RTCOMPARE_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN6_RTCOMPARE_Enabled (0x1UL)      /*!< Enable                                                               */

/* RTCOMPARESYNC @Bit 25 : Enable or disable interrupt for event RTCOMPARESYNC */
  #define GRTC_INTEN6_RTCOMPARESYNC_Pos (25UL)       /*!< Position of RTCOMPARESYNC field.                                     */
  #define GRTC_INTEN6_RTCOMPARESYNC_Msk (0x1UL << GRTC_INTEN6_RTCOMPARESYNC_Pos) /*!< Bit mask of RTCOMPARESYNC field.         */
  #define GRTC_INTEN6_RTCOMPARESYNC_Min (0x0UL)      /*!< Min enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTEN6_RTCOMPARESYNC_Max (0x1UL)      /*!< Max enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTEN6_RTCOMPARESYNC_Disabled (0x0UL) /*!< Disable                                                              */
  #define GRTC_INTEN6_RTCOMPARESYNC_Enabled (0x1UL)  /*!< Enable                                                               */

/* SYSCOUNTERVALID @Bit 26 : Enable or disable interrupt for event SYSCOUNTERVALID */
  #define GRTC_INTEN6_SYSCOUNTERVALID_Pos (26UL)     /*!< Position of SYSCOUNTERVALID field.                                   */
  #define GRTC_INTEN6_SYSCOUNTERVALID_Msk (0x1UL << GRTC_INTEN6_SYSCOUNTERVALID_Pos) /*!< Bit mask of SYSCOUNTERVALID field.   */
  #define GRTC_INTEN6_SYSCOUNTERVALID_Min (0x0UL)    /*!< Min enumerator value of SYSCOUNTERVALID field.                       */
  #define GRTC_INTEN6_SYSCOUNTERVALID_Max (0x1UL)    /*!< Max enumerator value of SYSCOUNTERVALID field.                       */
  #define GRTC_INTEN6_SYSCOUNTERVALID_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRTC_INTEN6_SYSCOUNTERVALID_Enabled (0x1UL) /*!< Enable                                                              */

/* PWMPERIODEND @Bit 27 : Enable or disable interrupt for event PWMPERIODEND */
  #define GRTC_INTEN6_PWMPERIODEND_Pos (27UL)        /*!< Position of PWMPERIODEND field.                                      */
  #define GRTC_INTEN6_PWMPERIODEND_Msk (0x1UL << GRTC_INTEN6_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.            */
  #define GRTC_INTEN6_PWMPERIODEND_Min (0x0UL)       /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTEN6_PWMPERIODEND_Max (0x1UL)       /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTEN6_PWMPERIODEND_Disabled (0x0UL)  /*!< Disable                                                              */
  #define GRTC_INTEN6_PWMPERIODEND_Enabled (0x1UL)   /*!< Enable                                                               */


/* GRTC_INTENSET6: Enable interrupt */
  #define GRTC_INTENSET6_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET6 register.                                   */

/* COMPARE0 @Bit 0 : Write '1' to enable interrupt for event COMPARE[0] */
  #define GRTC_INTENSET6_COMPARE0_Pos (0UL)          /*!< Position of COMPARE0 field.                                          */
  #define GRTC_INTENSET6_COMPARE0_Msk (0x1UL << GRTC_INTENSET6_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                  */
  #define GRTC_INTENSET6_COMPARE0_Min (0x0UL)        /*!< Min enumerator value of COMPARE0 field.                              */
  #define GRTC_INTENSET6_COMPARE0_Max (0x1UL)        /*!< Max enumerator value of COMPARE0 field.                              */
  #define GRTC_INTENSET6_COMPARE0_Set (0x1UL)        /*!< Enable                                                               */
  #define GRTC_INTENSET6_COMPARE0_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET6_COMPARE0_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE1 @Bit 1 : Write '1' to enable interrupt for event COMPARE[1] */
  #define GRTC_INTENSET6_COMPARE1_Pos (1UL)          /*!< Position of COMPARE1 field.                                          */
  #define GRTC_INTENSET6_COMPARE1_Msk (0x1UL << GRTC_INTENSET6_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                  */
  #define GRTC_INTENSET6_COMPARE1_Min (0x0UL)        /*!< Min enumerator value of COMPARE1 field.                              */
  #define GRTC_INTENSET6_COMPARE1_Max (0x1UL)        /*!< Max enumerator value of COMPARE1 field.                              */
  #define GRTC_INTENSET6_COMPARE1_Set (0x1UL)        /*!< Enable                                                               */
  #define GRTC_INTENSET6_COMPARE1_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET6_COMPARE1_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE2 @Bit 2 : Write '1' to enable interrupt for event COMPARE[2] */
  #define GRTC_INTENSET6_COMPARE2_Pos (2UL)          /*!< Position of COMPARE2 field.                                          */
  #define GRTC_INTENSET6_COMPARE2_Msk (0x1UL << GRTC_INTENSET6_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field.                  */
  #define GRTC_INTENSET6_COMPARE2_Min (0x0UL)        /*!< Min enumerator value of COMPARE2 field.                              */
  #define GRTC_INTENSET6_COMPARE2_Max (0x1UL)        /*!< Max enumerator value of COMPARE2 field.                              */
  #define GRTC_INTENSET6_COMPARE2_Set (0x1UL)        /*!< Enable                                                               */
  #define GRTC_INTENSET6_COMPARE2_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET6_COMPARE2_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

