adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* COMPARE13 @Bit 13 : Enable or disable interrupt for event COMPARE[13] */
  #define GRTC_INTEN8_COMPARE13_Pos (13UL)           /*!< Position of COMPARE13 field.                                         */
  #define GRTC_INTEN8_COMPARE13_Msk (0x1UL << GRTC_INTEN8_COMPARE13_Pos) /*!< Bit mask of COMPARE13 field.                     */
  #define GRTC_INTEN8_COMPARE13_Min (0x0UL)          /*!< Min enumerator value of COMPARE13 field.                             */
  #define GRTC_INTEN8_COMPARE13_Max (0x1UL)          /*!< Max enumerator value of COMPARE13 field.                             */
  #define GRTC_INTEN8_COMPARE13_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN8_COMPARE13_Enabled (0x1UL)      /*!< Enable                                                               */

/* COMPARE14 @Bit 14 : Enable or disable interrupt for event COMPARE[14] */
  #define GRTC_INTEN8_COMPARE14_Pos (14UL)           /*!< Position of COMPARE14 field.                                         */
  #define GRTC_INTEN8_COMPARE14_Msk (0x1UL << GRTC_INTEN8_COMPARE14_Pos) /*!< Bit mask of COMPARE14 field.                     */
  #define GRTC_INTEN8_COMPARE14_Min (0x0UL)          /*!< Min enumerator value of COMPARE14 field.                             */
  #define GRTC_INTEN8_COMPARE14_Max (0x1UL)          /*!< Max enumerator value of COMPARE14 field.                             */
  #define GRTC_INTEN8_COMPARE14_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN8_COMPARE14_Enabled (0x1UL)      /*!< Enable                                                               */

/* COMPARE15 @Bit 15 : Enable or disable interrupt for event COMPARE[15] */
  #define GRTC_INTEN8_COMPARE15_Pos (15UL)           /*!< Position of COMPARE15 field.                                         */
  #define GRTC_INTEN8_COMPARE15_Msk (0x1UL << GRTC_INTEN8_COMPARE15_Pos) /*!< Bit mask of COMPARE15 field.                     */
  #define GRTC_INTEN8_COMPARE15_Min (0x0UL)          /*!< Min enumerator value of COMPARE15 field.                             */
  #define GRTC_INTEN8_COMPARE15_Max (0x1UL)          /*!< Max enumerator value of COMPARE15 field.                             */
  #define GRTC_INTEN8_COMPARE15_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN8_COMPARE15_Enabled (0x1UL)      /*!< Enable                                                               */

/* COMPARE16 @Bit 16 : Enable or disable interrupt for event COMPARE[16] */
  #define GRTC_INTEN8_COMPARE16_Pos (16UL)           /*!< Position of COMPARE16 field.                                         */
  #define GRTC_INTEN8_COMPARE16_Msk (0x1UL << GRTC_INTEN8_COMPARE16_Pos) /*!< Bit mask of COMPARE16 field.                     */
  #define GRTC_INTEN8_COMPARE16_Min (0x0UL)          /*!< Min enumerator value of COMPARE16 field.                             */
  #define GRTC_INTEN8_COMPARE16_Max (0x1UL)          /*!< Max enumerator value of COMPARE16 field.                             */
  #define GRTC_INTEN8_COMPARE16_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN8_COMPARE16_Enabled (0x1UL)      /*!< Enable                                                               */

/* COMPARE17 @Bit 17 : Enable or disable interrupt for event COMPARE[17] */
  #define GRTC_INTEN8_COMPARE17_Pos (17UL)           /*!< Position of COMPARE17 field.                                         */
  #define GRTC_INTEN8_COMPARE17_Msk (0x1UL << GRTC_INTEN8_COMPARE17_Pos) /*!< Bit mask of COMPARE17 field.                     */
  #define GRTC_INTEN8_COMPARE17_Min (0x0UL)          /*!< Min enumerator value of COMPARE17 field.                             */
  #define GRTC_INTEN8_COMPARE17_Max (0x1UL)          /*!< Max enumerator value of COMPARE17 field.                             */
  #define GRTC_INTEN8_COMPARE17_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN8_COMPARE17_Enabled (0x1UL)      /*!< Enable                                                               */

/* COMPARE18 @Bit 18 : Enable or disable interrupt for event COMPARE[18] */
  #define GRTC_INTEN8_COMPARE18_Pos (18UL)           /*!< Position of COMPARE18 field.                                         */
  #define GRTC_INTEN8_COMPARE18_Msk (0x1UL << GRTC_INTEN8_COMPARE18_Pos) /*!< Bit mask of COMPARE18 field.                     */
  #define GRTC_INTEN8_COMPARE18_Min (0x0UL)          /*!< Min enumerator value of COMPARE18 field.                             */
  #define GRTC_INTEN8_COMPARE18_Max (0x1UL)          /*!< Max enumerator value of COMPARE18 field.                             */
  #define GRTC_INTEN8_COMPARE18_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN8_COMPARE18_Enabled (0x1UL)      /*!< Enable                                                               */

/* COMPARE19 @Bit 19 : Enable or disable interrupt for event COMPARE[19] */
  #define GRTC_INTEN8_COMPARE19_Pos (19UL)           /*!< Position of COMPARE19 field.                                         */
  #define GRTC_INTEN8_COMPARE19_Msk (0x1UL << GRTC_INTEN8_COMPARE19_Pos) /*!< Bit mask of COMPARE19 field.                     */
  #define GRTC_INTEN8_COMPARE19_Min (0x0UL)          /*!< Min enumerator value of COMPARE19 field.                             */
  #define GRTC_INTEN8_COMPARE19_Max (0x1UL)          /*!< Max enumerator value of COMPARE19 field.                             */
  #define GRTC_INTEN8_COMPARE19_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN8_COMPARE19_Enabled (0x1UL)      /*!< Enable                                                               */

/* COMPARE20 @Bit 20 : Enable or disable interrupt for event COMPARE[20] */
  #define GRTC_INTEN8_COMPARE20_Pos (20UL)           /*!< Position of COMPARE20 field.                                         */
  #define GRTC_INTEN8_COMPARE20_Msk (0x1UL << GRTC_INTEN8_COMPARE20_Pos) /*!< Bit mask of COMPARE20 field.                     */
  #define GRTC_INTEN8_COMPARE20_Min (0x0UL)          /*!< Min enumerator value of COMPARE20 field.                             */
  #define GRTC_INTEN8_COMPARE20_Max (0x1UL)          /*!< Max enumerator value of COMPARE20 field.                             */
  #define GRTC_INTEN8_COMPARE20_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN8_COMPARE20_Enabled (0x1UL)      /*!< Enable                                                               */

