adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* COMPARE19 @Bit 19 : Read pending status of interrupt for event COMPARE[19] */
  #define GRTC_INTPEND12_COMPARE19_Pos (19UL)        /*!< Position of COMPARE19 field.                                         */
  #define GRTC_INTPEND12_COMPARE19_Msk (0x1UL << GRTC_INTPEND12_COMPARE19_Pos) /*!< Bit mask of COMPARE19 field.               */
  #define GRTC_INTPEND12_COMPARE19_Min (0x0UL)       /*!< Min enumerator value of COMPARE19 field.                             */
  #define GRTC_INTPEND12_COMPARE19_Max (0x1UL)       /*!< Max enumerator value of COMPARE19 field.                             */
  #define GRTC_INTPEND12_COMPARE19_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define GRTC_INTPEND12_COMPARE19_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* COMPARE20 @Bit 20 : Read pending status of interrupt for event COMPARE[20] */
  #define GRTC_INTPEND12_COMPARE20_Pos (20UL)        /*!< Position of COMPARE20 field.                                         */
  #define GRTC_INTPEND12_COMPARE20_Msk (0x1UL << GRTC_INTPEND12_COMPARE20_Pos) /*!< Bit mask of COMPARE20 field.               */
  #define GRTC_INTPEND12_COMPARE20_Min (0x0UL)       /*!< Min enumerator value of COMPARE20 field.                             */
  #define GRTC_INTPEND12_COMPARE20_Max (0x1UL)       /*!< Max enumerator value of COMPARE20 field.                             */
  #define GRTC_INTPEND12_COMPARE20_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define GRTC_INTPEND12_COMPARE20_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* COMPARE21 @Bit 21 : Read pending status of interrupt for event COMPARE[21] */
  #define GRTC_INTPEND12_COMPARE21_Pos (21UL)        /*!< Position of COMPARE21 field.                                         */
  #define GRTC_INTPEND12_COMPARE21_Msk (0x1UL << GRTC_INTPEND12_COMPARE21_Pos) /*!< Bit mask of COMPARE21 field.               */
  #define GRTC_INTPEND12_COMPARE21_Min (0x0UL)       /*!< Min enumerator value of COMPARE21 field.                             */
  #define GRTC_INTPEND12_COMPARE21_Max (0x1UL)       /*!< Max enumerator value of COMPARE21 field.                             */
  #define GRTC_INTPEND12_COMPARE21_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define GRTC_INTPEND12_COMPARE21_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* COMPARE22 @Bit 22 : Read pending status of interrupt for event COMPARE[22] */
  #define GRTC_INTPEND12_COMPARE22_Pos (22UL)        /*!< Position of COMPARE22 field.                                         */
  #define GRTC_INTPEND12_COMPARE22_Msk (0x1UL << GRTC_INTPEND12_COMPARE22_Pos) /*!< Bit mask of COMPARE22 field.               */
  #define GRTC_INTPEND12_COMPARE22_Min (0x0UL)       /*!< Min enumerator value of COMPARE22 field.                             */
  #define GRTC_INTPEND12_COMPARE22_Max (0x1UL)       /*!< Max enumerator value of COMPARE22 field.                             */
  #define GRTC_INTPEND12_COMPARE22_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define GRTC_INTPEND12_COMPARE22_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* COMPARE23 @Bit 23 : Read pending status of interrupt for event COMPARE[23] */
  #define GRTC_INTPEND12_COMPARE23_Pos (23UL)        /*!< Position of COMPARE23 field.                                         */
  #define GRTC_INTPEND12_COMPARE23_Msk (0x1UL << GRTC_INTPEND12_COMPARE23_Pos) /*!< Bit mask of COMPARE23 field.               */
  #define GRTC_INTPEND12_COMPARE23_Min (0x0UL)       /*!< Min enumerator value of COMPARE23 field.                             */
  #define GRTC_INTPEND12_COMPARE23_Max (0x1UL)       /*!< Max enumerator value of COMPARE23 field.                             */
  #define GRTC_INTPEND12_COMPARE23_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define GRTC_INTPEND12_COMPARE23_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* RTCOMPARE @Bit 24 : Read pending status of interrupt for event RTCOMPARE */
  #define GRTC_INTPEND12_RTCOMPARE_Pos (24UL)        /*!< Position of RTCOMPARE field.                                         */
  #define GRTC_INTPEND12_RTCOMPARE_Msk (0x1UL << GRTC_INTPEND12_RTCOMPARE_Pos) /*!< Bit mask of RTCOMPARE field.               */
  #define GRTC_INTPEND12_RTCOMPARE_Min (0x0UL)       /*!< Min enumerator value of RTCOMPARE field.                             */
  #define GRTC_INTPEND12_RTCOMPARE_Max (0x1UL)       /*!< Max enumerator value of RTCOMPARE field.                             */
  #define GRTC_INTPEND12_RTCOMPARE_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define GRTC_INTPEND12_RTCOMPARE_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* RTCOMPARESYNC @Bit 25 : Read pending status of interrupt for event RTCOMPARESYNC */
  #define GRTC_INTPEND12_RTCOMPARESYNC_Pos (25UL)    /*!< Position of RTCOMPARESYNC field.                                     */
  #define GRTC_INTPEND12_RTCOMPARESYNC_Msk (0x1UL << GRTC_INTPEND12_RTCOMPARESYNC_Pos) /*!< Bit mask of RTCOMPARESYNC field.   */
  #define GRTC_INTPEND12_RTCOMPARESYNC_Min (0x0UL)   /*!< Min enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTPEND12_RTCOMPARESYNC_Max (0x1UL)   /*!< Max enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTPEND12_RTCOMPARESYNC_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define GRTC_INTPEND12_RTCOMPARESYNC_Pending (0x1UL) /*!< Read: Pending                                                      */

/* SYSCOUNTERVALID @Bit 26 : Read pending status of interrupt for event SYSCOUNTERVALID */
  #define GRTC_INTPEND12_SYSCOUNTERVALID_Pos (26UL)  /*!< Position of SYSCOUNTERVALID field.                                   */
  #define GRTC_INTPEND12_SYSCOUNTERVALID_Msk (0x1UL << GRTC_INTPEND12_SYSCOUNTERVALID_Pos) /*!< Bit mask of SYSCOUNTERVALID
                                                                            field.*/                                              
  #define GRTC_INTPEND12_SYSCOUNTERVALID_Min (0x0UL) /*!< Min enumerator value of SYSCOUNTERVALID field.                       */
  #define GRTC_INTPEND12_SYSCOUNTERVALID_Max (0x1UL) /*!< Max enumerator value of SYSCOUNTERVALID field.                       */
  #define GRTC_INTPEND12_SYSCOUNTERVALID_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRTC_INTPEND12_SYSCOUNTERVALID_Pending (0x1UL) /*!< Read: Pending                                                    */

/* PWMPERIODEND @Bit 27 : Read pending status of interrupt for event PWMPERIODEND */
  #define GRTC_INTPEND12_PWMPERIODEND_Pos (27UL)     /*!< Position of PWMPERIODEND field.                                      */
  #define GRTC_INTPEND12_PWMPERIODEND_Msk (0x1UL << GRTC_INTPEND12_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.      */
  #define GRTC_INTPEND12_PWMPERIODEND_Min (0x0UL)    /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTPEND12_PWMPERIODEND_Max (0x1UL)    /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTPEND12_PWMPERIODEND_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define GRTC_INTPEND12_PWMPERIODEND_Pending (0x1UL) /*!< Read: Pending                                                       */


/* GRTC_INTEN13: Enable or disable interrupt */
  #define GRTC_INTEN13_ResetValue (0x00000000UL)     /*!< Reset value of INTEN13 register.                                     */

/* COMPARE0 @Bit 0 : Enable or disable interrupt for event COMPARE[0] */
  #define GRTC_INTEN13_COMPARE0_Pos (0UL)            /*!< Position of COMPARE0 field.                                          */
  #define GRTC_INTEN13_COMPARE0_Msk (0x1UL << GRTC_INTEN13_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                      */
  #define GRTC_INTEN13_COMPARE0_Min (0x0UL)          /*!< Min enumerator value of COMPARE0 field.                              */
  #define GRTC_INTEN13_COMPARE0_Max (0x1UL)          /*!< Max enumerator value of COMPARE0 field.                              */
  #define GRTC_INTEN13_COMPARE0_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN13_COMPARE0_Enabled (0x1UL)      /*!< Enable                                                               */

/* COMPARE1 @Bit 1 : Enable or disable interrupt for event COMPARE[1] */
  #define GRTC_INTEN13_COMPARE1_Pos (1UL)            /*!< Position of COMPARE1 field.                                          */
  #define GRTC_INTEN13_COMPARE1_Msk (0x1UL << GRTC_INTEN13_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                      */
  #define GRTC_INTEN13_COMPARE1_Min (0x0UL)          /*!< Min enumerator value of COMPARE1 field.                              */
  #define GRTC_INTEN13_COMPARE1_Max (0x1UL)          /*!< Max enumerator value of COMPARE1 field.                              */
  #define GRTC_INTEN13_COMPARE1_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN13_COMPARE1_Enabled (0x1UL)      /*!< Enable                                                               */

