adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RTCOMPARE @Bit 24 : Write '1' to enable interrupt for event RTCOMPARE */
  #define GRTC_INTENSET14_RTCOMPARE_Pos (24UL)       /*!< Position of RTCOMPARE field.                                         */
  #define GRTC_INTENSET14_RTCOMPARE_Msk (0x1UL << GRTC_INTENSET14_RTCOMPARE_Pos) /*!< Bit mask of RTCOMPARE field.             */
  #define GRTC_INTENSET14_RTCOMPARE_Min (0x0UL)      /*!< Min enumerator value of RTCOMPARE field.                             */
  #define GRTC_INTENSET14_RTCOMPARE_Max (0x1UL)      /*!< Max enumerator value of RTCOMPARE field.                             */
  #define GRTC_INTENSET14_RTCOMPARE_Set (0x1UL)      /*!< Enable                                                               */
  #define GRTC_INTENSET14_RTCOMPARE_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET14_RTCOMPARE_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* RTCOMPARESYNC @Bit 25 : Write '1' to enable interrupt for event RTCOMPARESYNC */
  #define GRTC_INTENSET14_RTCOMPARESYNC_Pos (25UL)   /*!< Position of RTCOMPARESYNC field.                                     */
  #define GRTC_INTENSET14_RTCOMPARESYNC_Msk (0x1UL << GRTC_INTENSET14_RTCOMPARESYNC_Pos) /*!< Bit mask of RTCOMPARESYNC field. */
  #define GRTC_INTENSET14_RTCOMPARESYNC_Min (0x0UL)  /*!< Min enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTENSET14_RTCOMPARESYNC_Max (0x1UL)  /*!< Max enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTENSET14_RTCOMPARESYNC_Set (0x1UL)  /*!< Enable                                                               */
  #define GRTC_INTENSET14_RTCOMPARESYNC_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define GRTC_INTENSET14_RTCOMPARESYNC_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* SYSCOUNTERVALID @Bit 26 : Write '1' to enable interrupt for event SYSCOUNTERVALID */
  #define GRTC_INTENSET14_SYSCOUNTERVALID_Pos (26UL) /*!< Position of SYSCOUNTERVALID field.                                   */
  #define GRTC_INTENSET14_SYSCOUNTERVALID_Msk (0x1UL << GRTC_INTENSET14_SYSCOUNTERVALID_Pos) /*!< Bit mask of SYSCOUNTERVALID
                                                                            field.*/                                              
  #define GRTC_INTENSET14_SYSCOUNTERVALID_Min (0x0UL) /*!< Min enumerator value of SYSCOUNTERVALID field.                      */
  #define GRTC_INTENSET14_SYSCOUNTERVALID_Max (0x1UL) /*!< Max enumerator value of SYSCOUNTERVALID field.                      */
  #define GRTC_INTENSET14_SYSCOUNTERVALID_Set (0x1UL) /*!< Enable                                                              */
  #define GRTC_INTENSET14_SYSCOUNTERVALID_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRTC_INTENSET14_SYSCOUNTERVALID_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* PWMPERIODEND @Bit 27 : Write '1' to enable interrupt for event PWMPERIODEND */
  #define GRTC_INTENSET14_PWMPERIODEND_Pos (27UL)    /*!< Position of PWMPERIODEND field.                                      */
  #define GRTC_INTENSET14_PWMPERIODEND_Msk (0x1UL << GRTC_INTENSET14_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.    */
  #define GRTC_INTENSET14_PWMPERIODEND_Min (0x0UL)   /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTENSET14_PWMPERIODEND_Max (0x1UL)   /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTENSET14_PWMPERIODEND_Set (0x1UL)   /*!< Enable                                                               */
  #define GRTC_INTENSET14_PWMPERIODEND_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define GRTC_INTENSET14_PWMPERIODEND_Enabled (0x1UL) /*!< Read: Enabled                                                      */


/* GRTC_INTENCLR14: Disable interrupt */
  #define GRTC_INTENCLR14_ResetValue (0x00000000UL)  /*!< Reset value of INTENCLR14 register.                                  */

/* COMPARE0 @Bit 0 : Write '1' to disable interrupt for event COMPARE[0] */
  #define GRTC_INTENCLR14_COMPARE0_Pos (0UL)         /*!< Position of COMPARE0 field.                                          */
  #define GRTC_INTENCLR14_COMPARE0_Msk (0x1UL << GRTC_INTENCLR14_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                */
  #define GRTC_INTENCLR14_COMPARE0_Min (0x0UL)       /*!< Min enumerator value of COMPARE0 field.                              */
  #define GRTC_INTENCLR14_COMPARE0_Max (0x1UL)       /*!< Max enumerator value of COMPARE0 field.                              */
  #define GRTC_INTENCLR14_COMPARE0_Clear (0x1UL)     /*!< Disable                                                              */
  #define GRTC_INTENCLR14_COMPARE0_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR14_COMPARE0_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE1 @Bit 1 : Write '1' to disable interrupt for event COMPARE[1] */
  #define GRTC_INTENCLR14_COMPARE1_Pos (1UL)         /*!< Position of COMPARE1 field.                                          */
  #define GRTC_INTENCLR14_COMPARE1_Msk (0x1UL << GRTC_INTENCLR14_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                */
  #define GRTC_INTENCLR14_COMPARE1_Min (0x0UL)       /*!< Min enumerator value of COMPARE1 field.                              */
  #define GRTC_INTENCLR14_COMPARE1_Max (0x1UL)       /*!< Max enumerator value of COMPARE1 field.                              */
  #define GRTC_INTENCLR14_COMPARE1_Clear (0x1UL)     /*!< Disable                                                              */
  #define GRTC_INTENCLR14_COMPARE1_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR14_COMPARE1_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

