adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* COMPARE22 @Bit 22 : Write '1' to disable interrupt for event COMPARE[22] */
  #define GRTC_INTENCLR14_COMPARE22_Pos (22UL)       /*!< Position of COMPARE22 field.                                         */
  #define GRTC_INTENCLR14_COMPARE22_Msk (0x1UL << GRTC_INTENCLR14_COMPARE22_Pos) /*!< Bit mask of COMPARE22 field.             */
  #define GRTC_INTENCLR14_COMPARE22_Min (0x0UL)      /*!< Min enumerator value of COMPARE22 field.                             */
  #define GRTC_INTENCLR14_COMPARE22_Max (0x1UL)      /*!< Max enumerator value of COMPARE22 field.                             */
  #define GRTC_INTENCLR14_COMPARE22_Clear (0x1UL)    /*!< Disable                                                              */
  #define GRTC_INTENCLR14_COMPARE22_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR14_COMPARE22_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* COMPARE23 @Bit 23 : Write '1' to disable interrupt for event COMPARE[23] */
  #define GRTC_INTENCLR14_COMPARE23_Pos (23UL)       /*!< Position of COMPARE23 field.                                         */
  #define GRTC_INTENCLR14_COMPARE23_Msk (0x1UL << GRTC_INTENCLR14_COMPARE23_Pos) /*!< Bit mask of COMPARE23 field.             */
  #define GRTC_INTENCLR14_COMPARE23_Min (0x0UL)      /*!< Min enumerator value of COMPARE23 field.                             */
  #define GRTC_INTENCLR14_COMPARE23_Max (0x1UL)      /*!< Max enumerator value of COMPARE23 field.                             */
  #define GRTC_INTENCLR14_COMPARE23_Clear (0x1UL)    /*!< Disable                                                              */
  #define GRTC_INTENCLR14_COMPARE23_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR14_COMPARE23_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* RTCOMPARE @Bit 24 : Write '1' to disable interrupt for event RTCOMPARE */
  #define GRTC_INTENCLR14_RTCOMPARE_Pos (24UL)       /*!< Position of RTCOMPARE field.                                         */
  #define GRTC_INTENCLR14_RTCOMPARE_Msk (0x1UL << GRTC_INTENCLR14_RTCOMPARE_Pos) /*!< Bit mask of RTCOMPARE field.             */
  #define GRTC_INTENCLR14_RTCOMPARE_Min (0x0UL)      /*!< Min enumerator value of RTCOMPARE field.                             */
  #define GRTC_INTENCLR14_RTCOMPARE_Max (0x1UL)      /*!< Max enumerator value of RTCOMPARE field.                             */
  #define GRTC_INTENCLR14_RTCOMPARE_Clear (0x1UL)    /*!< Disable                                                              */
  #define GRTC_INTENCLR14_RTCOMPARE_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR14_RTCOMPARE_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* RTCOMPARESYNC @Bit 25 : Write '1' to disable interrupt for event RTCOMPARESYNC */
  #define GRTC_INTENCLR14_RTCOMPARESYNC_Pos (25UL)   /*!< Position of RTCOMPARESYNC field.                                     */
  #define GRTC_INTENCLR14_RTCOMPARESYNC_Msk (0x1UL << GRTC_INTENCLR14_RTCOMPARESYNC_Pos) /*!< Bit mask of RTCOMPARESYNC field. */
  #define GRTC_INTENCLR14_RTCOMPARESYNC_Min (0x0UL)  /*!< Min enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTENCLR14_RTCOMPARESYNC_Max (0x1UL)  /*!< Max enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTENCLR14_RTCOMPARESYNC_Clear (0x1UL) /*!< Disable                                                             */
  #define GRTC_INTENCLR14_RTCOMPARESYNC_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define GRTC_INTENCLR14_RTCOMPARESYNC_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* SYSCOUNTERVALID @Bit 26 : Write '1' to disable interrupt for event SYSCOUNTERVALID */
  #define GRTC_INTENCLR14_SYSCOUNTERVALID_Pos (26UL) /*!< Position of SYSCOUNTERVALID field.                                   */
  #define GRTC_INTENCLR14_SYSCOUNTERVALID_Msk (0x1UL << GRTC_INTENCLR14_SYSCOUNTERVALID_Pos) /*!< Bit mask of SYSCOUNTERVALID
                                                                            field.*/                                              
  #define GRTC_INTENCLR14_SYSCOUNTERVALID_Min (0x0UL) /*!< Min enumerator value of SYSCOUNTERVALID field.                      */
  #define GRTC_INTENCLR14_SYSCOUNTERVALID_Max (0x1UL) /*!< Max enumerator value of SYSCOUNTERVALID field.                      */
  #define GRTC_INTENCLR14_SYSCOUNTERVALID_Clear (0x1UL) /*!< Disable                                                           */
  #define GRTC_INTENCLR14_SYSCOUNTERVALID_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GRTC_INTENCLR14_SYSCOUNTERVALID_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* PWMPERIODEND @Bit 27 : Write '1' to disable interrupt for event PWMPERIODEND */
  #define GRTC_INTENCLR14_PWMPERIODEND_Pos (27UL)    /*!< Position of PWMPERIODEND field.                                      */
  #define GRTC_INTENCLR14_PWMPERIODEND_Msk (0x1UL << GRTC_INTENCLR14_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.    */
  #define GRTC_INTENCLR14_PWMPERIODEND_Min (0x0UL)   /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTENCLR14_PWMPERIODEND_Max (0x1UL)   /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTENCLR14_PWMPERIODEND_Clear (0x1UL) /*!< Disable                                                              */
  #define GRTC_INTENCLR14_PWMPERIODEND_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define GRTC_INTENCLR14_PWMPERIODEND_Enabled (0x1UL) /*!< Read: Enabled                                                      */


/* GRTC_INTPEND14: Pending interrupts */
  #define GRTC_INTPEND14_ResetValue (0x00000000UL)   /*!< Reset value of INTPEND14 register.                                   */

/* COMPARE0 @Bit 0 : Read pending status of interrupt for event COMPARE[0] */
  #define GRTC_INTPEND14_COMPARE0_Pos (0UL)          /*!< Position of COMPARE0 field.                                          */
  #define GRTC_INTPEND14_COMPARE0_Msk (0x1UL << GRTC_INTPEND14_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                  */
  #define GRTC_INTPEND14_COMPARE0_Min (0x0UL)        /*!< Min enumerator value of COMPARE0 field.                              */
  #define GRTC_INTPEND14_COMPARE0_Max (0x1UL)        /*!< Max enumerator value of COMPARE0 field.                              */
  #define GRTC_INTPEND14_COMPARE0_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND14_COMPARE0_Pending (0x1UL)    /*!< Read: Pending                                                        */

