adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* COMPARE19 @Bit 19 : Read pending status of interrupt for event COMPARE[19] */
  #define GRTC_INTPEND15_COMPARE19_Pos (19UL)        /*!< Position of COMPARE19 field.                                         */
  #define GRTC_INTPEND15_COMPARE19_Msk (0x1UL << GRTC_INTPEND15_COMPARE19_Pos) /*!< Bit mask of COMPARE19 field.               */
  #define GRTC_INTPEND15_COMPARE19_Min (0x0UL)       /*!< Min enumerator value of COMPARE19 field.                             */
  #define GRTC_INTPEND15_COMPARE19_Max (0x1UL)       /*!< Max enumerator value of COMPARE19 field.                             */
  #define GRTC_INTPEND15_COMPARE19_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define GRTC_INTPEND15_COMPARE19_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* COMPARE20 @Bit 20 : Read pending status of interrupt for event COMPARE[20] */
  #define GRTC_INTPEND15_COMPARE20_Pos (20UL)        /*!< Position of COMPARE20 field.                                         */
  #define GRTC_INTPEND15_COMPARE20_Msk (0x1UL << GRTC_INTPEND15_COMPARE20_Pos) /*!< Bit mask of COMPARE20 field.               */
  #define GRTC_INTPEND15_COMPARE20_Min (0x0UL)       /*!< Min enumerator value of COMPARE20 field.                             */
  #define GRTC_INTPEND15_COMPARE20_Max (0x1UL)       /*!< Max enumerator value of COMPARE20 field.                             */
  #define GRTC_INTPEND15_COMPARE20_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define GRTC_INTPEND15_COMPARE20_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* COMPARE21 @Bit 21 : Read pending status of interrupt for event COMPARE[21] */
  #define GRTC_INTPEND15_COMPARE21_Pos (21UL)        /*!< Position of COMPARE21 field.                                         */
  #define GRTC_INTPEND15_COMPARE21_Msk (0x1UL << GRTC_INTPEND15_COMPARE21_Pos) /*!< Bit mask of COMPARE21 field.               */
  #define GRTC_INTPEND15_COMPARE21_Min (0x0UL)       /*!< Min enumerator value of COMPARE21 field.                             */
  #define GRTC_INTPEND15_COMPARE21_Max (0x1UL)       /*!< Max enumerator value of COMPARE21 field.                             */
  #define GRTC_INTPEND15_COMPARE21_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define GRTC_INTPEND15_COMPARE21_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* COMPARE22 @Bit 22 : Read pending status of interrupt for event COMPARE[22] */
  #define GRTC_INTPEND15_COMPARE22_Pos (22UL)        /*!< Position of COMPARE22 field.                                         */
  #define GRTC_INTPEND15_COMPARE22_Msk (0x1UL << GRTC_INTPEND15_COMPARE22_Pos) /*!< Bit mask of COMPARE22 field.               */
  #define GRTC_INTPEND15_COMPARE22_Min (0x0UL)       /*!< Min enumerator value of COMPARE22 field.                             */
  #define GRTC_INTPEND15_COMPARE22_Max (0x1UL)       /*!< Max enumerator value of COMPARE22 field.                             */
  #define GRTC_INTPEND15_COMPARE22_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define GRTC_INTPEND15_COMPARE22_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* COMPARE23 @Bit 23 : Read pending status of interrupt for event COMPARE[23] */
  #define GRTC_INTPEND15_COMPARE23_Pos (23UL)        /*!< Position of COMPARE23 field.                                         */
  #define GRTC_INTPEND15_COMPARE23_Msk (0x1UL << GRTC_INTPEND15_COMPARE23_Pos) /*!< Bit mask of COMPARE23 field.               */
  #define GRTC_INTPEND15_COMPARE23_Min (0x0UL)       /*!< Min enumerator value of COMPARE23 field.                             */
  #define GRTC_INTPEND15_COMPARE23_Max (0x1UL)       /*!< Max enumerator value of COMPARE23 field.                             */
  #define GRTC_INTPEND15_COMPARE23_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define GRTC_INTPEND15_COMPARE23_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* RTCOMPARE @Bit 24 : Read pending status of interrupt for event RTCOMPARE */
  #define GRTC_INTPEND15_RTCOMPARE_Pos (24UL)        /*!< Position of RTCOMPARE field.                                         */
  #define GRTC_INTPEND15_RTCOMPARE_Msk (0x1UL << GRTC_INTPEND15_RTCOMPARE_Pos) /*!< Bit mask of RTCOMPARE field.               */
  #define GRTC_INTPEND15_RTCOMPARE_Min (0x0UL)       /*!< Min enumerator value of RTCOMPARE field.                             */
  #define GRTC_INTPEND15_RTCOMPARE_Max (0x1UL)       /*!< Max enumerator value of RTCOMPARE field.                             */
  #define GRTC_INTPEND15_RTCOMPARE_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define GRTC_INTPEND15_RTCOMPARE_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* RTCOMPARESYNC @Bit 25 : Read pending status of interrupt for event RTCOMPARESYNC */
  #define GRTC_INTPEND15_RTCOMPARESYNC_Pos (25UL)    /*!< Position of RTCOMPARESYNC field.                                     */
  #define GRTC_INTPEND15_RTCOMPARESYNC_Msk (0x1UL << GRTC_INTPEND15_RTCOMPARESYNC_Pos) /*!< Bit mask of RTCOMPARESYNC field.   */
  #define GRTC_INTPEND15_RTCOMPARESYNC_Min (0x0UL)   /*!< Min enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTPEND15_RTCOMPARESYNC_Max (0x1UL)   /*!< Max enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTPEND15_RTCOMPARESYNC_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define GRTC_INTPEND15_RTCOMPARESYNC_Pending (0x1UL) /*!< Read: Pending                                                      */

/* SYSCOUNTERVALID @Bit 26 : Read pending status of interrupt for event SYSCOUNTERVALID */
  #define GRTC_INTPEND15_SYSCOUNTERVALID_Pos (26UL)  /*!< Position of SYSCOUNTERVALID field.                                   */
  #define GRTC_INTPEND15_SYSCOUNTERVALID_Msk (0x1UL << GRTC_INTPEND15_SYSCOUNTERVALID_Pos) /*!< Bit mask of SYSCOUNTERVALID
                                                                            field.*/                                              
  #define GRTC_INTPEND15_SYSCOUNTERVALID_Min (0x0UL) /*!< Min enumerator value of SYSCOUNTERVALID field.                       */
  #define GRTC_INTPEND15_SYSCOUNTERVALID_Max (0x1UL) /*!< Max enumerator value of SYSCOUNTERVALID field.                       */
  #define GRTC_INTPEND15_SYSCOUNTERVALID_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define GRTC_INTPEND15_SYSCOUNTERVALID_Pending (0x1UL) /*!< Read: Pending                                                    */

/* PWMPERIODEND @Bit 27 : Read pending status of interrupt for event PWMPERIODEND */
  #define GRTC_INTPEND15_PWMPERIODEND_Pos (27UL)     /*!< Position of PWMPERIODEND field.                                      */
  #define GRTC_INTPEND15_PWMPERIODEND_Msk (0x1UL << GRTC_INTPEND15_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.      */
  #define GRTC_INTPEND15_PWMPERIODEND_Min (0x0UL)    /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTPEND15_PWMPERIODEND_Max (0x1UL)    /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTPEND15_PWMPERIODEND_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define GRTC_INTPEND15_PWMPERIODEND_Pending (0x1UL) /*!< Read: Pending                                                       */


/* GRTC_EVTEN: Enable or disable event routing */
  #define GRTC_EVTEN_ResetValue (0x00000000UL)       /*!< Reset value of EVTEN register.                                       */

/* PWMPERIODEND @Bit 27 : Enable or disable event routing for event PWMPERIODEND */
  #define GRTC_EVTEN_PWMPERIODEND_Pos (27UL)         /*!< Position of PWMPERIODEND field.                                      */
  #define GRTC_EVTEN_PWMPERIODEND_Msk (0x1UL << GRTC_EVTEN_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.              */
  #define GRTC_EVTEN_PWMPERIODEND_Min (0x0UL)        /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define GRTC_EVTEN_PWMPERIODEND_Max (0x1UL)        /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define GRTC_EVTEN_PWMPERIODEND_Disabled (0x0UL)   /*!< Disable                                                              */
  #define GRTC_EVTEN_PWMPERIODEND_Enabled (0x1UL)    /*!< Enable                                                               */


