adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQUEST13 @Bit 13 : Request from index [13] */
  #define GRTC_KEEPRUNNING_REQUEST13_Pos (13UL)      /*!< Position of REQUEST13 field.                                         */
  #define GRTC_KEEPRUNNING_REQUEST13_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST13_Pos) /*!< Bit mask of REQUEST13 field.           */
  #define GRTC_KEEPRUNNING_REQUEST13_Min (0x0UL)     /*!< Min enumerator value of REQUEST13 field.                             */
  #define GRTC_KEEPRUNNING_REQUEST13_Max (0x1UL)     /*!< Max enumerator value of REQUEST13 field.                             */
  #define GRTC_KEEPRUNNING_REQUEST13_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                    */
  #define GRTC_KEEPRUNNING_REQUEST13_Active (0x1UL)  /*!< Keep SYSCOUNTER active                                               */

/* REQUEST14 @Bit 14 : Request from index [14] */
  #define GRTC_KEEPRUNNING_REQUEST14_Pos (14UL)      /*!< Position of REQUEST14 field.                                         */
  #define GRTC_KEEPRUNNING_REQUEST14_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST14_Pos) /*!< Bit mask of REQUEST14 field.           */
  #define GRTC_KEEPRUNNING_REQUEST14_Min (0x0UL)     /*!< Min enumerator value of REQUEST14 field.                             */
  #define GRTC_KEEPRUNNING_REQUEST14_Max (0x1UL)     /*!< Max enumerator value of REQUEST14 field.                             */
  #define GRTC_KEEPRUNNING_REQUEST14_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                    */
  #define GRTC_KEEPRUNNING_REQUEST14_Active (0x1UL)  /*!< Keep SYSCOUNTER active                                               */

/* REQUEST15 @Bit 15 : Request from index [15] */
  #define GRTC_KEEPRUNNING_REQUEST15_Pos (15UL)      /*!< Position of REQUEST15 field.                                         */
  #define GRTC_KEEPRUNNING_REQUEST15_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST15_Pos) /*!< Bit mask of REQUEST15 field.           */
  #define GRTC_KEEPRUNNING_REQUEST15_Min (0x0UL)     /*!< Min enumerator value of REQUEST15 field.                             */
  #define GRTC_KEEPRUNNING_REQUEST15_Max (0x1UL)     /*!< Max enumerator value of REQUEST15 field.                             */
  #define GRTC_KEEPRUNNING_REQUEST15_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                    */
  #define GRTC_KEEPRUNNING_REQUEST15_Active (0x1UL)  /*!< Keep SYSCOUNTER active                                               */


/* GRTC_TIMEOUT: Timeout after all CPUs gone into sleep state to stop the SYSCOUNTER */
  #define GRTC_TIMEOUT_ResetValue (0x00000000UL)     /*!< Reset value of TIMEOUT register.                                     */

/* VALUE @Bits 0..15 : Number of 32Ki cycles */
  #define GRTC_TIMEOUT_VALUE_Pos (0UL)               /*!< Position of VALUE field.                                             */
  #define GRTC_TIMEOUT_VALUE_Msk (0xFFFFUL << GRTC_TIMEOUT_VALUE_Pos) /*!< Bit mask of VALUE field.                            */


/* GRTC_INTERVAL: Count to add to CC[0] when the event EVENTS_COMPARE[0] triggers. */
  #define GRTC_INTERVAL_ResetValue (0x00000000UL)    /*!< Reset value of INTERVAL register.                                    */

/* VALUE @Bits 0..15 : Count to add to CC[0] */
  #define GRTC_INTERVAL_VALUE_Pos (0UL)              /*!< Position of VALUE field.                                             */
  #define GRTC_INTERVAL_VALUE_Msk (0xFFFFUL << GRTC_INTERVAL_VALUE_Pos) /*!< Bit mask of VALUE field.                          */


/* GRTC_WAKETIME: GRTC wake up time. */
  #define GRTC_WAKETIME_ResetValue (0x00000001UL)    /*!< Reset value of WAKETIME register.                                    */

/* VALUE @Bits 0..7 : Number of LFCLK clock cycles to wake up before the next scheduled EVENTS_COMPARE event */
  #define GRTC_WAKETIME_VALUE_Pos (0UL)              /*!< Position of VALUE field.                                             */
  #define GRTC_WAKETIME_VALUE_Msk (0xFFUL << GRTC_WAKETIME_VALUE_Pos) /*!< Bit mask of VALUE field.                            */


/* GRTC_RTCOMPAREL: The lower 32-bits of the RTCOMPARE register. */
  #define GRTC_RTCOMPAREL_ResetValue (0x00000000UL)  /*!< Reset value of RTCOMPAREL register.                                  */

/* VALUE @Bits 0..31 : The lower 32-bits of the compare value. */
  #define GRTC_RTCOMPAREL_VALUE_Pos (0UL)            /*!< Position of VALUE field.                                             */
  #define GRTC_RTCOMPAREL_VALUE_Msk (0xFFFFFFFFUL << GRTC_RTCOMPAREL_VALUE_Pos) /*!< Bit mask of VALUE field.                  */


/* GRTC_RTCOMPAREH: The most significant bits of the RTCOMPARE register. */
  #define GRTC_RTCOMPAREH_ResetValue (0x00000000UL)  /*!< Reset value of RTCOMPAREH register.                                  */

/* VALUE @Bits 0..14 : The most significant bits of the compare value. */
  #define GRTC_RTCOMPAREH_VALUE_Pos (0UL)            /*!< Position of VALUE field.                                             */
  #define GRTC_RTCOMPAREH_VALUE_Msk (0x7FFFUL << GRTC_RTCOMPAREH_VALUE_Pos) /*!< Bit mask of VALUE field.                      */


/* GRTC_RTCOMPARESYNCL: The lower 32-bits of the RTCOMPARESYNC register. */
  #define GRTC_RTCOMPARESYNCL_ResetValue (0x00000000UL) /*!< Reset value of RTCOMPARESYNCL register.                           */

/* VALUE @Bits 0..31 : The lower 32-bits of the compare value. */
  #define GRTC_RTCOMPARESYNCL_VALUE_Pos (0UL)        /*!< Position of VALUE field.                                             */
  #define GRTC_RTCOMPARESYNCL_VALUE_Msk (0xFFFFFFFFUL << GRTC_RTCOMPARESYNCL_VALUE_Pos) /*!< Bit mask of VALUE field.          */


/* GRTC_RTCOMPARESYNCH: The most significant bits of the RTCOMPARESYNC register. */
  #define GRTC_RTCOMPARESYNCH_ResetValue (0x00000000UL) /*!< Reset value of RTCOMPARESYNCH register.                           */

/* VALUE @Bits 0..14 : The most significant bits of the compare value. */
  #define GRTC_RTCOMPARESYNCH_VALUE_Pos (0UL)        /*!< Position of VALUE field.                                             */
  #define GRTC_RTCOMPARESYNCH_VALUE_Msk (0x7FFFUL << GRTC_RTCOMPARESYNCH_VALUE_Pos) /*!< Bit mask of VALUE field.              */


/* GRTC_PWMCONFIG: PWM configuration. */
  #define GRTC_PWMCONFIG_ResetValue (0x00000000UL)   /*!< Reset value of PWMCONFIG register.                                   */

/* COMPAREVALUE @Bits 0..7 : The PWM compare value */
  #define GRTC_PWMCONFIG_COMPAREVALUE_Pos (0UL)      /*!< Position of COMPAREVALUE field.                                      */
  #define GRTC_PWMCONFIG_COMPAREVALUE_Msk (0xFFUL << GRTC_PWMCONFIG_COMPAREVALUE_Pos) /*!< Bit mask of COMPAREVALUE field.     */


/* GRTC_CLKOUT: Configuration of clock output */
  #define GRTC_CLKOUT_ResetValue (0x00000000UL)      /*!< Reset value of CLKOUT register.                                      */

/* CLKOUT32K @Bit 0 : Enable 32Ki clock output on pin */
  #define GRTC_CLKOUT_CLKOUT32K_Pos (0UL)            /*!< Position of CLKOUT32K field.                                         */
  #define GRTC_CLKOUT_CLKOUT32K_Msk (0x1UL << GRTC_CLKOUT_CLKOUT32K_Pos) /*!< Bit mask of CLKOUT32K field.                     */
  #define GRTC_CLKOUT_CLKOUT32K_Min (0x0UL)          /*!< Min enumerator value of CLKOUT32K field.                             */
  #define GRTC_CLKOUT_CLKOUT32K_Max (0x1UL)          /*!< Max enumerator value of CLKOUT32K field.                             */
  #define GRTC_CLKOUT_CLKOUT32K_Disabled (0x0UL)     /*!< Disabled                                                             */
  #define GRTC_CLKOUT_CLKOUT32K_Enabled (0x1UL)      /*!< Enabled                                                              */

