adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VAL @Bits 0..4 : Peak detector threshold trimming value */
  #define HFXO_TRIM_PDTHR_VAL_Pos (0UL)              /*!< Position of VAL field.                                               */
  #define HFXO_TRIM_PDTHR_VAL_Msk (0x1FUL << HFXO_TRIM_PDTHR_VAL_Pos) /*!< Bit mask of VAL field.                              */
  #define HFXO_TRIM_PDTHR_VAL_Min (0xFFFFFFFFUL)     /*!< Min value of VAL field.                                              */
  #define HFXO_TRIM_PDTHR_VAL_Max (0xFFFFFFFFUL)     /*!< Max size of VAL field.                                               */


/* HFXO_TRIM_VREF: Voltage reference trimming */
  #define HFXO_TRIM_VREF_ResetValue (0x00000000UL)   /*!< Reset value of VREF register.                                        */

/* VAL @Bits 0..6 : Voltage reference trimming value */
  #define HFXO_TRIM_VREF_VAL_Pos (0UL)               /*!< Position of VAL field.                                               */
  #define HFXO_TRIM_VREF_VAL_Msk (0x7FUL << HFXO_TRIM_VREF_VAL_Pos) /*!< Bit mask of VAL field.                                */
  #define HFXO_TRIM_VREF_VAL_Min (0xFFFFFFFFUL)      /*!< Min value of VAL field.                                              */
  #define HFXO_TRIM_VREF_VAL_Max (0x0UL)             /*!< Max size of VAL field.                                               */


/* HFXO_TRIM_MULT2: Trimming the duty cycle of the frequency doubler */
  #define HFXO_TRIM_MULT2_ResetValue (0x00000000UL)  /*!< Reset value of MULT2 register.                                       */

/* VAL @Bits 0..3 : Duty cycle of the frequency doubler trimming value */
  #define HFXO_TRIM_MULT2_VAL_Pos (0UL)              /*!< Position of VAL field.                                               */
  #define HFXO_TRIM_MULT2_VAL_Msk (0xFUL << HFXO_TRIM_MULT2_VAL_Pos) /*!< Bit mask of VAL field.                               */
  #define HFXO_TRIM_MULT2_VAL_Min (0xFFFFFFFFUL)     /*!< Min value of VAL field.                                              */
  #define HFXO_TRIM_MULT2_VAL_Max (0xFFFFFFFFUL)     /*!< Max size of VAL field.                                               */



/* ==================================================== Struct HFXO_IDAC ===================================================== */
/**
  * @brief IDAC [HFXO_IDAC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INIT;                              /*!< (@ 0x00000000) Initial IDAC code for the pierce oscillator. Min =
                                                                         474nA, default = 114uA, max = 214us*/                    
  __IOM uint32_t  ICMPRATIO;                         /*!< (@ 0x00000004) Ratio between IDAC and AREG in the pierce AREG mode   */
  __IOM uint32_t  CHECKPERIOD;                       /*!< (@ 0x00000008) Period for the IDAC check in Pierce mode              */
  __IOM uint32_t  SETTLETIME;                        /*!< (@ 0x0000000C) Settling time for IDAC current changes                */
} NRF_HFXO_IDAC_Type;                                /*!< Size = 16 (0x010)                                                    */

/* HFXO_IDAC_INIT: Initial IDAC code for the pierce oscillator. Min = 474nA, default = 114uA, max = 214us */
  #define HFXO_IDAC_INIT_ResetValue (0x00000000UL)   /*!< Reset value of INIT register.                                        */

/* VAL @Bits 0..3 : Value */
  #define HFXO_IDAC_INIT_VAL_Pos (0UL)               /*!< Position of VAL field.                                               */
  #define HFXO_IDAC_INIT_VAL_Msk (0xFUL << HFXO_IDAC_INIT_VAL_Pos) /*!< Bit mask of VAL field.                                 */
  #define HFXO_IDAC_INIT_VAL_Min (0xFFFFFFF9UL)      /*!< Min value of VAL field.                                              */
  #define HFXO_IDAC_INIT_VAL_Max (0x8UL)             /*!< Max size of VAL field.                                               */


/* HFXO_IDAC_ICMPRATIO: Ratio between IDAC and AREG in the pierce AREG mode */
  #define HFXO_IDAC_ICMPRATIO_ResetValue (0x00000000UL) /*!< Reset value of ICMPRATIO register.                                */

/* VAL @Bits 0..1 : Value */
  #define HFXO_IDAC_ICMPRATIO_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define HFXO_IDAC_ICMPRATIO_VAL_Msk (0x3UL << HFXO_IDAC_ICMPRATIO_VAL_Pos) /*!< Bit mask of VAL field.                       */
  #define HFXO_IDAC_ICMPRATIO_VAL_Min (0x0UL)        /*!< Min value of VAL field.                                              */
  #define HFXO_IDAC_ICMPRATIO_VAL_Max (0x3UL)        /*!< Max size of VAL field.                                               */


/* HFXO_IDAC_CHECKPERIOD: Period for the IDAC check in Pierce mode */
  #define HFXO_IDAC_CHECKPERIOD_ResetValue (0x00000010UL) /*!< Reset value of CHECKPERIOD register.                            */

/* VAL @Bits 0..2 : Period value for the IDAC check */
  #define HFXO_IDAC_CHECKPERIOD_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define HFXO_IDAC_CHECKPERIOD_VAL_Msk (0x7UL << HFXO_IDAC_CHECKPERIOD_VAL_Pos) /*!< Bit mask of VAL field.                   */
  #define HFXO_IDAC_CHECKPERIOD_VAL_Min (0x0UL)      /*!< Min enumerator value of VAL field.                                   */
  #define HFXO_IDAC_CHECKPERIOD_VAL_Max (0x7UL)      /*!< Max enumerator value of VAL field.                                   */
  #define HFXO_IDAC_CHECKPERIOD_VAL_val31us (0x0UL)  /*!< IDAC period is 31us                                                  */
  #define HFXO_IDAC_CHECKPERIOD_VAL_val61us (0x1UL)  /*!< IDAC period is 61us                                                  */
  #define HFXO_IDAC_CHECKPERIOD_VAL_val122us (0x2UL) /*!< IDAC period is 122us                                                 */
  #define HFXO_IDAC_CHECKPERIOD_VAL_val244us (0x3UL) /*!< IDAC period is 244us                                                 */
  #define HFXO_IDAC_CHECKPERIOD_VAL_val488us (0x4UL) /*!< IDAC period is 488us                                                 */
  #define HFXO_IDAC_CHECKPERIOD_VAL_val977us (0x5UL) /*!< IDAC period is 977us                                                 */
  #define HFXO_IDAC_CHECKPERIOD_VAL_val1953us (0x6UL) /*!< IDAC period is 1953us                                               */
  #define HFXO_IDAC_CHECKPERIOD_VAL_val3906us (0x7UL) /*!< IDAC period is 3906us                                               */

