adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* HFXO_OVERRIDE_OUTBUFF: Override the OUT_BUFF signal to the analog module */
  #define HFXO_OVERRIDE_OUTBUFF_ResetValue (0x00000000UL) /*!< Reset value of OUTBUFF register.                                */

/* VAL @Bits 0..3 : Override value for the signal */
  #define HFXO_OVERRIDE_OUTBUFF_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_OUTBUFF_VAL_Msk (0xFUL << HFXO_OVERRIDE_OUTBUFF_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_OUTBUFF_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_OUTBUFF_EN_Msk (0x1UL << HFXO_OVERRIDE_OUTBUFF_EN_Pos) /*!< Bit mask of EN field.                      */
  #define HFXO_OVERRIDE_OUTBUFF_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_OUTBUFF_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_OUTBUFF_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_OUTBUFF_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_OUTSEL: Override the OUT_SEL signal to the analog module */
  #define HFXO_OVERRIDE_OUTSEL_ResetValue (0x00000000UL) /*!< Reset value of OUTSEL register.                                  */

/* VAL @Bits 0..1 : Override value for the signal */
  #define HFXO_OVERRIDE_OUTSEL_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_OUTSEL_VAL_Msk (0x3UL << HFXO_OVERRIDE_OUTSEL_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_OUTSEL_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_OUTSEL_EN_Msk (0x1UL << HFXO_OVERRIDE_OUTSEL_EN_Pos) /*!< Bit mask of EN field.                        */
  #define HFXO_OVERRIDE_OUTSEL_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_OUTSEL_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_OUTSEL_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_OUTSEL_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_PIXOPWRUP: Override the PIXO_PWRUP signal to the analog module */
  #define HFXO_OVERRIDE_PIXOPWRUP_ResetValue (0x00000000UL) /*!< Reset value of PIXOPWRUP register.                            */

/* VAL @Bit 0 : Override value for the signal */
  #define HFXO_OVERRIDE_PIXOPWRUP_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_PIXOPWRUP_VAL_Msk (0x1UL << HFXO_OVERRIDE_PIXOPWRUP_VAL_Pos) /*!< Bit mask of VAL field.               */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_PIXOPWRUP_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_PIXOPWRUP_EN_Msk (0x1UL << HFXO_OVERRIDE_PIXOPWRUP_EN_Pos) /*!< Bit mask of EN field.                  */
  #define HFXO_OVERRIDE_PIXOPWRUP_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_PIXOPWRUP_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_PIXOPWRUP_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define HFXO_OVERRIDE_PIXOPWRUP_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */


/* HFXO_OVERRIDE_PIXOSTARTUP: Override the PIXO_STARTUP signal to the analog module */
  #define HFXO_OVERRIDE_PIXOSTARTUP_ResetValue (0x00000000UL) /*!< Reset value of PIXOSTARTUP register.                        */

/* VAL @Bit 0 : Override value for the signal */
  #define HFXO_OVERRIDE_PIXOSTARTUP_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_PIXOSTARTUP_VAL_Msk (0x1UL << HFXO_OVERRIDE_PIXOSTARTUP_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_PIXOSTARTUP_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_PIXOSTARTUP_EN_Msk (0x1UL << HFXO_OVERRIDE_PIXOSTARTUP_EN_Pos) /*!< Bit mask of EN field.              */
  #define HFXO_OVERRIDE_PIXOSTARTUP_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_PIXOSTARTUP_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_PIXOSTARTUP_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define HFXO_OVERRIDE_PIXOSTARTUP_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* HFXO_OVERRIDE_PKDMUTE: Override the PKD_MUTE signal to the analog module */
  #define HFXO_OVERRIDE_PKDMUTE_ResetValue (0x00000000UL) /*!< Reset value of PKDMUTE register.                                */

/* VAL @Bit 0 : Override value for the signal */
  #define HFXO_OVERRIDE_PKDMUTE_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define HFXO_OVERRIDE_PKDMUTE_VAL_Msk (0x1UL << HFXO_OVERRIDE_PKDMUTE_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define HFXO_OVERRIDE_PKDMUTE_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define HFXO_OVERRIDE_PKDMUTE_EN_Msk (0x1UL << HFXO_OVERRIDE_PKDMUTE_EN_Pos) /*!< Bit mask of EN field.                      */
  #define HFXO_OVERRIDE_PKDMUTE_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_PKDMUTE_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define HFXO_OVERRIDE_PKDMUTE_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define HFXO_OVERRIDE_PKDMUTE_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */


