adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* MODECHANGED @Bit 0 : Read pending status of interrupt for event MODECHANGED */
  #define HFXO_INTPEND_MODECHANGED_Pos (0UL)         /*!< Position of MODECHANGED field.                                       */
  #define HFXO_INTPEND_MODECHANGED_Msk (0x1UL << HFXO_INTPEND_MODECHANGED_Pos) /*!< Bit mask of MODECHANGED field.             */
  #define HFXO_INTPEND_MODECHANGED_Min (0x0UL)       /*!< Min enumerator value of MODECHANGED field.                           */
  #define HFXO_INTPEND_MODECHANGED_Max (0x1UL)       /*!< Max enumerator value of MODECHANGED field.                           */
  #define HFXO_INTPEND_MODECHANGED_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define HFXO_INTPEND_MODECHANGED_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* ERRORPIERCE @Bit 1 : Read pending status of interrupt for event ERRORPIERCE */
  #define HFXO_INTPEND_ERRORPIERCE_Pos (1UL)         /*!< Position of ERRORPIERCE field.                                       */
  #define HFXO_INTPEND_ERRORPIERCE_Msk (0x1UL << HFXO_INTPEND_ERRORPIERCE_Pos) /*!< Bit mask of ERRORPIERCE field.             */
  #define HFXO_INTPEND_ERRORPIERCE_Min (0x0UL)       /*!< Min enumerator value of ERRORPIERCE field.                           */
  #define HFXO_INTPEND_ERRORPIERCE_Max (0x1UL)       /*!< Max enumerator value of ERRORPIERCE field.                           */
  #define HFXO_INTPEND_ERRORPIERCE_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define HFXO_INTPEND_ERRORPIERCE_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* ERRORRUNNING @Bit 2 : Read pending status of interrupt for event ERRORRUNNING */
  #define HFXO_INTPEND_ERRORRUNNING_Pos (2UL)        /*!< Position of ERRORRUNNING field.                                      */
  #define HFXO_INTPEND_ERRORRUNNING_Msk (0x1UL << HFXO_INTPEND_ERRORRUNNING_Pos) /*!< Bit mask of ERRORRUNNING field.          */
  #define HFXO_INTPEND_ERRORRUNNING_Min (0x0UL)      /*!< Min enumerator value of ERRORRUNNING field.                          */
  #define HFXO_INTPEND_ERRORRUNNING_Max (0x1UL)      /*!< Max enumerator value of ERRORRUNNING field.                          */
  #define HFXO_INTPEND_ERRORRUNNING_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define HFXO_INTPEND_ERRORRUNNING_Pending (0x1UL)  /*!< Read: Pending                                                        */


/* HFXO_STATUS: HFXO status */
  #define HFXO_STATUS_ResetValue (0x00000000UL)      /*!< Reset value of STATUS register.                                      */

/* MODE @Bits 0..1 : Current mode */
  #define HFXO_STATUS_MODE_Pos (0UL)                 /*!< Position of MODE field.                                              */
  #define HFXO_STATUS_MODE_Msk (0x3UL << HFXO_STATUS_MODE_Pos) /*!< Bit mask of MODE field.                                    */
  #define HFXO_STATUS_MODE_Min (0x0UL)               /*!< Min enumerator value of MODE field.                                  */
  #define HFXO_STATUS_MODE_Max (0x3UL)               /*!< Max enumerator value of MODE field.                                  */
  #define HFXO_STATUS_MODE_Pierce (0x0UL)            /*!< Pierce mode                                                          */
  #define HFXO_STATUS_MODE_Pixo (0x1UL)              /*!< PIXO mode                                                            */
  #define HFXO_STATUS_MODE_ExternalSine (0x2UL)      /*!< External sine wave clock                                             */
  #define HFXO_STATUS_MODE_ExternalSquare (0x3UL)    /*!< External square wave clock                                           */

/* RUNNING @Bit 4 : HFXO running status */
  #define HFXO_STATUS_RUNNING_Pos (4UL)              /*!< Position of RUNNING field.                                           */
  #define HFXO_STATUS_RUNNING_Msk (0x1UL << HFXO_STATUS_RUNNING_Pos) /*!< Bit mask of RUNNING field.                           */
  #define HFXO_STATUS_RUNNING_Min (0x0UL)            /*!< Min enumerator value of RUNNING field.                               */
  #define HFXO_STATUS_RUNNING_Max (0x1UL)            /*!< Max enumerator value of RUNNING field.                               */
  #define HFXO_STATUS_RUNNING_NotRunning (0x0UL)     /*!< HFXO not running                                                     */
  #define HFXO_STATUS_RUNNING_Running (0x1UL)        /*!< HFXO running                                                         */


/* HFXO_STATUSANA: Status of analog module output signals */
  #define HFXO_STATUSANA_ResetValue (0x00000000UL)   /*!< Reset value of STATUSANA register.                                   */

/* READY @Bit 0 : Current value of the READY signal from the analog module */
  #define HFXO_STATUSANA_READY_Pos (0UL)             /*!< Position of READY field.                                             */
  #define HFXO_STATUSANA_READY_Msk (0x1UL << HFXO_STATUSANA_READY_Pos) /*!< Bit mask of READY field.                           */

/* SETTLED @Bit 1 : Current value of the SETTLED signal from the analog module */
  #define HFXO_STATUSANA_SETTLED_Pos (1UL)           /*!< Position of SETTLED field.                                           */
  #define HFXO_STATUSANA_SETTLED_Msk (0x1UL << HFXO_STATUSANA_SETTLED_Pos) /*!< Bit mask of SETTLED field.                     */

/* PIXOACK @Bits 2..3 : Current value of the PIXO_ACK signal from the analog module */
  #define HFXO_STATUSANA_PIXOACK_Pos (2UL)           /*!< Position of PIXOACK field.                                           */
  #define HFXO_STATUSANA_PIXOACK_Msk (0x3UL << HFXO_STATUSANA_PIXOACK_Pos) /*!< Bit mask of PIXOACK field.                     */

/* ICMP @Bit 4 : Current value of the ICMP signal from the analog module */
  #define HFXO_STATUSANA_ICMP_Pos (4UL)              /*!< Position of ICMP field.                                              */
  #define HFXO_STATUSANA_ICMP_Msk (0x1UL << HFXO_STATUSANA_ICMP_Pos) /*!< Bit mask of ICMP field.                              */

/* PKDOUT @Bits 8..11 : Current value of the PKD_OUT signal from the analog module */
  #define HFXO_STATUSANA_PKDOUT_Pos (8UL)            /*!< Position of PKDOUT field.                                            */
  #define HFXO_STATUSANA_PKDOUT_Msk (0xFUL << HFXO_STATUSANA_PKDOUT_Pos) /*!< Bit mask of PKDOUT field.                        */


/* HFXO_MIRROR: Enable LOCK for mirrored registers */
  #define HFXO_MIRROR_ResetValue (0x00000001UL)      /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define HFXO_MIRROR_LOCK_Pos (0UL)                 /*!< Position of LOCK field.                                              */
  #define HFXO_MIRROR_LOCK_Msk (0x1UL << HFXO_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                                    */
  #define HFXO_MIRROR_LOCK_Min (0x0UL)               /*!< Min enumerator value of LOCK field.                                  */
  #define HFXO_MIRROR_LOCK_Max (0x1UL)               /*!< Max enumerator value of LOCK field.                                  */
  #define HFXO_MIRROR_LOCK_Disabled (0x0UL)          /*!< Lock disabled                                                        */
  #define HFXO_MIRROR_LOCK_Enabled (0x1UL)           /*!< Lock enabled                                                         */


