adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* =================================================== Struct HFXO64M_TRIM =================================================== */
/**
  * @brief TRIM [HFXO64M_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  RTUNE;                             /*!< (@ 0x00000000) Voltage reference tuning control. 2's complement (MSB
                                                                         bit is inverted). Tuning range is approximately
                                                                         +/-50mV*/                                                
  __IOM uint32_t  CHIRPTUNE;                         /*!< (@ 0x00000004) This is a process compensation tuning for chirp
                                                                         generator.*/                                             
  __IOM uint32_t  DOUBLERCOMP;                       /*!< (@ 0x00000008) Process compensation control for frequency doubler.   */
} NRF_HFXO64M_TRIM_Type;                             /*!< Size = 12 (0x00C)                                                    */

/* HFXO64M_TRIM_RTUNE: Voltage reference tuning control. 2's complement (MSB bit is inverted). Tuning range is approximately
                        +/-50mV */                                                                                                
                                                                                                                                  
  #define HFXO64M_TRIM_RTUNE_ResetValue (0x00000000UL) /*!< Reset value of RTUNE register.                                     */

/* VAL @Bits 0..3 : (unspecified) */
  #define HFXO64M_TRIM_RTUNE_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define HFXO64M_TRIM_RTUNE_VAL_Msk (0xFUL << HFXO64M_TRIM_RTUNE_VAL_Pos) /*!< Bit mask of VAL field.                         */


/* HFXO64M_TRIM_CHIRPTUNE: This is a process compensation tuning for chirp generator. */
  #define HFXO64M_TRIM_CHIRPTUNE_ResetValue (0x00000000UL) /*!< Reset value of CHIRPTUNE register.                             */

/* VAL @Bits 0..1 : (unspecified) */
  #define HFXO64M_TRIM_CHIRPTUNE_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define HFXO64M_TRIM_CHIRPTUNE_VAL_Msk (0x3UL << HFXO64M_TRIM_CHIRPTUNE_VAL_Pos) /*!< Bit mask of VAL field.                 */
  #define HFXO64M_TRIM_CHIRPTUNE_VAL_Min (0x0UL)     /*!< Min enumerator value of VAL field.                                   */
  #define HFXO64M_TRIM_CHIRPTUNE_VAL_Max (0x2UL)     /*!< Max enumerator value of VAL field.                                   */
  #define HFXO64M_TRIM_CHIRPTUNE_VAL_Fast (0x0UL)    /*!< Fast process                                                         */
  #define HFXO64M_TRIM_CHIRPTUNE_VAL_Typical (0x1UL) /*!< Typical process                                                      */
  #define HFXO64M_TRIM_CHIRPTUNE_VAL_Slow (0x2UL)    /*!< Slow process                                                         */


/* HFXO64M_TRIM_DOUBLERCOMP: Process compensation control for frequency doubler. */
  #define HFXO64M_TRIM_DOUBLERCOMP_ResetValue (0x00000000UL) /*!< Reset value of DOUBLERCOMP register.                         */

/* VAL @Bits 0..2 : (unspecified) */
  #define HFXO64M_TRIM_DOUBLERCOMP_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define HFXO64M_TRIM_DOUBLERCOMP_VAL_Msk (0x7UL << HFXO64M_TRIM_DOUBLERCOMP_VAL_Pos) /*!< Bit mask of VAL field.             */
  #define HFXO64M_TRIM_DOUBLERCOMP_VAL_Min (0x1UL)   /*!< Min enumerator value of VAL field.                                   */
  #define HFXO64M_TRIM_DOUBLERCOMP_VAL_Max (0x7UL)   /*!< Max enumerator value of VAL field.                                   */
  #define HFXO64M_TRIM_DOUBLERCOMP_VAL_Slow (0x1UL)  /*!< Slow process                                                         */
  #define HFXO64M_TRIM_DOUBLERCOMP_VAL_Typical (0x3UL) /*!< Typical process                                                    */
  #define HFXO64M_TRIM_DOUBLERCOMP_VAL_Fast (0x7UL)  /*!< Fast process                                                         */



/* ==================================================== Struct HFXO64M_TS ==================================================== */
/**
  * @brief TS [HFXO64M_TS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000000) Temperature sensor static configuration register.     */
  __IOM uint32_t  ENSEL;                             /*!< (@ 0x00000004) Enable TS per clock request.                          */
  __IOM uint32_t  DATAIN;                            /*!< (@ 0x00000008) TS test data input. Used only when debugging          */
  __IOM uint32_t  DATAINLOAD;                        /*!< (@ 0x0000000C) TS test data latch pulse input. Used only when
                                                                         debugging*/                                              
} NRF_HFXO64M_TS_Type;                               /*!< Size = 16 (0x010)                                                    */

/* HFXO64M_TS_CFG: Temperature sensor static configuration register. */
  #define HFXO64M_TS_CFG_ResetValue (0x00000000UL)   /*!< Reset value of CFG register.                                         */

/* MEASMODE1 @Bits 0..7 : Measurement mode control for ch1. */
  #define HFXO64M_TS_CFG_MEASMODE1_Pos (0UL)         /*!< Position of MEASMODE1 field.                                         */
  #define HFXO64M_TS_CFG_MEASMODE1_Msk (0xFFUL << HFXO64M_TS_CFG_MEASMODE1_Pos) /*!< Bit mask of MEASMODE1 field.              */

/* MEASMODE2 @Bits 8..15 : Measurement mode control for ch2. */
  #define HFXO64M_TS_CFG_MEASMODE2_Pos (8UL)         /*!< Position of MEASMODE2 field.                                         */
  #define HFXO64M_TS_CFG_MEASMODE2_Msk (0xFFUL << HFXO64M_TS_CFG_MEASMODE2_Pos) /*!< Bit mask of MEASMODE2 field.              */

/* TIMERSEL @Bits 16..18 : Sets temperature measurement interval */
  #define HFXO64M_TS_CFG_TIMERSEL_Pos (16UL)         /*!< Position of TIMERSEL field.                                          */
  #define HFXO64M_TS_CFG_TIMERSEL_Msk (0x7UL << HFXO64M_TS_CFG_TIMERSEL_Pos) /*!< Bit mask of TIMERSEL field.                  */
  #define HFXO64M_TS_CFG_TIMERSEL_Min (0x0UL)        /*!< Min enumerator value of TIMERSEL field.                              */
  #define HFXO64M_TS_CFG_TIMERSEL_Max (0x7UL)        /*!< Max enumerator value of TIMERSEL field.                              */
  #define HFXO64M_TS_CFG_TIMERSEL_Interval4us (0x0UL) /*!< 4 us                                                                */
  #define HFXO64M_TS_CFG_TIMERSEL_Interval8us (0x1UL) /*!< 8 us                                                                */
  #define HFXO64M_TS_CFG_TIMERSEL_Interval16us (0x2UL) /*!< 16 us                                                              */
  #define HFXO64M_TS_CFG_TIMERSEL_Interval32us (0x3UL) /*!< 32 us                                                              */
  #define HFXO64M_TS_CFG_TIMERSEL_Interval64us (0x4UL) /*!< 64 us                                                              */
  #define HFXO64M_TS_CFG_TIMERSEL_Interval128us (0x5UL) /*!< 128 us                                                            */
  #define HFXO64M_TS_CFG_TIMERSEL_Interval256us (0x6UL) /*!< 256 us                                                            */
  #define HFXO64M_TS_CFG_TIMERSEL_Interval512us (0x7UL) /*!< 512 us                                                            */

