adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ENABLEFASTMODE @Bit 20 : Enables fast slew rate function. */
  #define HFXO64M_TS_CFG_ENABLEFASTMODE_Pos (20UL)   /*!< Position of ENABLEFASTMODE field.                                    */
  #define HFXO64M_TS_CFG_ENABLEFASTMODE_Msk (0x1UL << HFXO64M_TS_CFG_ENABLEFASTMODE_Pos) /*!< Bit mask of ENABLEFASTMODE field.*/
  #define HFXO64M_TS_CFG_ENABLEFASTMODE_Min (0x0UL)  /*!< Min enumerator value of ENABLEFASTMODE field.                        */
  #define HFXO64M_TS_CFG_ENABLEFASTMODE_Max (0x1UL)  /*!< Max enumerator value of ENABLEFASTMODE field.                        */
  #define HFXO64M_TS_CFG_ENABLEFASTMODE_Disabled (0x0UL) /*!< Disabled                                                         */
  #define HFXO64M_TS_CFG_ENABLEFASTMODE_Enabled (0x1UL) /*!< Enabled                                                           */

/* ENABLEFILTER @Bit 21 : Enables continuous slow filter. */
  #define HFXO64M_TS_CFG_ENABLEFILTER_Pos (21UL)     /*!< Position of ENABLEFILTER field.                                      */
  #define HFXO64M_TS_CFG_ENABLEFILTER_Msk (0x1UL << HFXO64M_TS_CFG_ENABLEFILTER_Pos) /*!< Bit mask of ENABLEFILTER field.      */
  #define HFXO64M_TS_CFG_ENABLEFILTER_Min (0x0UL)    /*!< Min enumerator value of ENABLEFILTER field.                          */
  #define HFXO64M_TS_CFG_ENABLEFILTER_Max (0x1UL)    /*!< Max enumerator value of ENABLEFILTER field.                          */
  #define HFXO64M_TS_CFG_ENABLEFILTER_Disabled (0x0UL) /*!< Disabled                                                           */
  #define HFXO64M_TS_CFG_ENABLEFILTER_Enabled (0x1UL) /*!< Enabled                                                             */

/* ENABLEGATING @Bit 22 : Enables continuous comparison/disables comparator current saving */
  #define HFXO64M_TS_CFG_ENABLEGATING_Pos (22UL)     /*!< Position of ENABLEGATING field.                                      */
  #define HFXO64M_TS_CFG_ENABLEGATING_Msk (0x1UL << HFXO64M_TS_CFG_ENABLEGATING_Pos) /*!< Bit mask of ENABLEGATING field.      */
  #define HFXO64M_TS_CFG_ENABLEGATING_Min (0x0UL)    /*!< Min enumerator value of ENABLEGATING field.                          */
  #define HFXO64M_TS_CFG_ENABLEGATING_Max (0x1UL)    /*!< Max enumerator value of ENABLEGATING field.                          */
  #define HFXO64M_TS_CFG_ENABLEGATING_Disabled (0x0UL) /*!< Disabled                                                           */
  #define HFXO64M_TS_CFG_ENABLEGATING_Enabled (0x1UL) /*!< Enabled                                                             */

/* ENABLETOGGLEMODE @Bit 23 : Enables continuous toggle if both channels are on. */
  #define HFXO64M_TS_CFG_ENABLETOGGLEMODE_Pos (23UL) /*!< Position of ENABLETOGGLEMODE field.                                  */
  #define HFXO64M_TS_CFG_ENABLETOGGLEMODE_Msk (0x1UL << HFXO64M_TS_CFG_ENABLETOGGLEMODE_Pos) /*!< Bit mask of ENABLETOGGLEMODE
                                                                            field.*/                                              
  #define HFXO64M_TS_CFG_ENABLETOGGLEMODE_Min (0x0UL) /*!< Min enumerator value of ENABLETOGGLEMODE field.                     */
  #define HFXO64M_TS_CFG_ENABLETOGGLEMODE_Max (0x1UL) /*!< Max enumerator value of ENABLETOGGLEMODE field.                     */
  #define HFXO64M_TS_CFG_ENABLETOGGLEMODE_Disabled (0x0UL) /*!< Disabled                                                       */
  #define HFXO64M_TS_CFG_ENABLETOGGLEMODE_Enabled (0x1UL) /*!< Enabled                                                         */

/* ENABLETEST @Bit 24 : Enables TS test mode. */
  #define HFXO64M_TS_CFG_ENABLETEST_Pos (24UL)       /*!< Position of ENABLETEST field.                                        */
  #define HFXO64M_TS_CFG_ENABLETEST_Msk (0x1UL << HFXO64M_TS_CFG_ENABLETEST_Pos) /*!< Bit mask of ENABLETEST field.            */
  #define HFXO64M_TS_CFG_ENABLETEST_Min (0x0UL)      /*!< Min enumerator value of ENABLETEST field.                            */
  #define HFXO64M_TS_CFG_ENABLETEST_Max (0x1UL)      /*!< Max enumerator value of ENABLETEST field.                            */
  #define HFXO64M_TS_CFG_ENABLETEST_Disabled (0x0UL) /*!< Disabled                                                             */
  #define HFXO64M_TS_CFG_ENABLETEST_Enabled (0x1UL)  /*!< Enabled                                                              */


/* HFXO64M_TS_ENSEL: Enable TS per clock request. */
  #define HFXO64M_TS_ENSEL_ResetValue (0x00000000UL) /*!< Reset value of ENSEL register.                                       */

/* CMOS1 @Bit 0 : Enable TS when CMOS1 is requested. */
  #define HFXO64M_TS_ENSEL_CMOS1_Pos (0UL)           /*!< Position of CMOS1 field.                                             */
  #define HFXO64M_TS_ENSEL_CMOS1_Msk (0x1UL << HFXO64M_TS_ENSEL_CMOS1_Pos) /*!< Bit mask of CMOS1 field.                       */
  #define HFXO64M_TS_ENSEL_CMOS1_Min (0x0UL)         /*!< Min enumerator value of CMOS1 field.                                 */
  #define HFXO64M_TS_ENSEL_CMOS1_Max (0x1UL)         /*!< Max enumerator value of CMOS1 field.                                 */
  #define HFXO64M_TS_ENSEL_CMOS1_Disabled (0x0UL)    /*!< Disabled                                                             */
  #define HFXO64M_TS_ENSEL_CMOS1_Enabled (0x1UL)     /*!< Enabled                                                              */

/* CMOS2 @Bit 1 : Enable TS when CMOS2 is requested. */
  #define HFXO64M_TS_ENSEL_CMOS2_Pos (1UL)           /*!< Position of CMOS2 field.                                             */
  #define HFXO64M_TS_ENSEL_CMOS2_Msk (0x1UL << HFXO64M_TS_ENSEL_CMOS2_Pos) /*!< Bit mask of CMOS2 field.                       */
  #define HFXO64M_TS_ENSEL_CMOS2_Min (0x0UL)         /*!< Min enumerator value of CMOS2 field.                                 */
  #define HFXO64M_TS_ENSEL_CMOS2_Max (0x1UL)         /*!< Max enumerator value of CMOS2 field.                                 */
  #define HFXO64M_TS_ENSEL_CMOS2_Disabled (0x0UL)    /*!< Disabled                                                             */
  #define HFXO64M_TS_ENSEL_CMOS2_Enabled (0x1UL)     /*!< Enabled                                                              */

/* CMOS3 @Bit 2 : Enable TS when CMOS3 is requested. */
  #define HFXO64M_TS_ENSEL_CMOS3_Pos (2UL)           /*!< Position of CMOS3 field.                                             */
  #define HFXO64M_TS_ENSEL_CMOS3_Msk (0x1UL << HFXO64M_TS_ENSEL_CMOS3_Pos) /*!< Bit mask of CMOS3 field.                       */
  #define HFXO64M_TS_ENSEL_CMOS3_Min (0x0UL)         /*!< Min enumerator value of CMOS3 field.                                 */
  #define HFXO64M_TS_ENSEL_CMOS3_Max (0x1UL)         /*!< Max enumerator value of CMOS3 field.                                 */
  #define HFXO64M_TS_ENSEL_CMOS3_Disabled (0x0UL)    /*!< Disabled                                                             */
  #define HFXO64M_TS_ENSEL_CMOS3_Enabled (0x1UL)     /*!< Enabled                                                              */

/* CMOS2X @Bit 3 : Enable TS when CMOS2X is requested. */
  #define HFXO64M_TS_ENSEL_CMOS2X_Pos (3UL)          /*!< Position of CMOS2X field.                                            */
  #define HFXO64M_TS_ENSEL_CMOS2X_Msk (0x1UL << HFXO64M_TS_ENSEL_CMOS2X_Pos) /*!< Bit mask of CMOS2X field.                    */
  #define HFXO64M_TS_ENSEL_CMOS2X_Min (0x0UL)        /*!< Min enumerator value of CMOS2X field.                                */
  #define HFXO64M_TS_ENSEL_CMOS2X_Max (0x1UL)        /*!< Max enumerator value of CMOS2X field.                                */
  #define HFXO64M_TS_ENSEL_CMOS2X_Disabled (0x0UL)   /*!< Disabled                                                             */
  #define HFXO64M_TS_ENSEL_CMOS2X_Enabled (0x1UL)    /*!< Enabled                                                              */

