adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SIN1 @Bit 4 : Enable TS when SIN1 is requested. */
  #define HFXO64M_TS_ENSEL_SIN1_Pos (4UL)            /*!< Position of SIN1 field.                                              */
  #define HFXO64M_TS_ENSEL_SIN1_Msk (0x1UL << HFXO64M_TS_ENSEL_SIN1_Pos) /*!< Bit mask of SIN1 field.                          */
  #define HFXO64M_TS_ENSEL_SIN1_Min (0x0UL)          /*!< Min enumerator value of SIN1 field.                                  */
  #define HFXO64M_TS_ENSEL_SIN1_Max (0x1UL)          /*!< Max enumerator value of SIN1 field.                                  */
  #define HFXO64M_TS_ENSEL_SIN1_Disabled (0x0UL)     /*!< Disabled                                                             */
  #define HFXO64M_TS_ENSEL_SIN1_Enabled (0x1UL)      /*!< Enabled                                                              */

/* SIN2 @Bit 5 : Enable TS when SIN2 is requested. */
  #define HFXO64M_TS_ENSEL_SIN2_Pos (5UL)            /*!< Position of SIN2 field.                                              */
  #define HFXO64M_TS_ENSEL_SIN2_Msk (0x1UL << HFXO64M_TS_ENSEL_SIN2_Pos) /*!< Bit mask of SIN2 field.                          */
  #define HFXO64M_TS_ENSEL_SIN2_Min (0x0UL)          /*!< Min enumerator value of SIN2 field.                                  */
  #define HFXO64M_TS_ENSEL_SIN2_Max (0x1UL)          /*!< Max enumerator value of SIN2 field.                                  */
  #define HFXO64M_TS_ENSEL_SIN2_Disabled (0x0UL)     /*!< Disabled                                                             */
  #define HFXO64M_TS_ENSEL_SIN2_Enabled (0x1UL)      /*!< Enabled                                                              */

/* SIN3 @Bit 6 : Enable TS when SIN3 is requested. */
  #define HFXO64M_TS_ENSEL_SIN3_Pos (6UL)            /*!< Position of SIN3 field.                                              */
  #define HFXO64M_TS_ENSEL_SIN3_Msk (0x1UL << HFXO64M_TS_ENSEL_SIN3_Pos) /*!< Bit mask of SIN3 field.                          */
  #define HFXO64M_TS_ENSEL_SIN3_Min (0x0UL)          /*!< Min enumerator value of SIN3 field.                                  */
  #define HFXO64M_TS_ENSEL_SIN3_Max (0x1UL)          /*!< Max enumerator value of SIN3 field.                                  */
  #define HFXO64M_TS_ENSEL_SIN3_Disabled (0x0UL)     /*!< Disabled                                                             */
  #define HFXO64M_TS_ENSEL_SIN3_Enabled (0x1UL)      /*!< Enabled                                                              */

/* SIN4 @Bit 7 : Enable TS when SIN4 is requested. */
  #define HFXO64M_TS_ENSEL_SIN4_Pos (7UL)            /*!< Position of SIN4 field.                                              */
  #define HFXO64M_TS_ENSEL_SIN4_Msk (0x1UL << HFXO64M_TS_ENSEL_SIN4_Pos) /*!< Bit mask of SIN4 field.                          */
  #define HFXO64M_TS_ENSEL_SIN4_Min (0x0UL)          /*!< Min enumerator value of SIN4 field.                                  */
  #define HFXO64M_TS_ENSEL_SIN4_Max (0x1UL)          /*!< Max enumerator value of SIN4 field.                                  */
  #define HFXO64M_TS_ENSEL_SIN4_Disabled (0x0UL)     /*!< Disabled                                                             */
  #define HFXO64M_TS_ENSEL_SIN4_Enabled (0x1UL)      /*!< Enabled                                                              */

/* FORCE @Bit 8 : Force TS on when HFXO64M is powered. */
  #define HFXO64M_TS_ENSEL_FORCE_Pos (8UL)           /*!< Position of FORCE field.                                             */
  #define HFXO64M_TS_ENSEL_FORCE_Msk (0x1UL << HFXO64M_TS_ENSEL_FORCE_Pos) /*!< Bit mask of FORCE field.                       */
  #define HFXO64M_TS_ENSEL_FORCE_Min (0x0UL)         /*!< Min enumerator value of FORCE field.                                 */
  #define HFXO64M_TS_ENSEL_FORCE_Max (0x1UL)         /*!< Max enumerator value of FORCE field.                                 */
  #define HFXO64M_TS_ENSEL_FORCE_Disabled (0x0UL)    /*!< Disabled                                                             */
  #define HFXO64M_TS_ENSEL_FORCE_Enabled (0x1UL)     /*!< Enabled                                                              */


/* HFXO64M_TS_DATAIN: TS test data input. Used only when debugging */
  #define HFXO64M_TS_DATAIN_ResetValue (0x00000000UL) /*!< Reset value of DATAIN register.                                     */

/* VAL @Bits 0..15 : (unspecified) */
  #define HFXO64M_TS_DATAIN_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define HFXO64M_TS_DATAIN_VAL_Msk (0xFFFFUL << HFXO64M_TS_DATAIN_VAL_Pos) /*!< Bit mask of VAL field.                        */


/* HFXO64M_TS_DATAINLOAD: TS test data latch pulse input. Used only when debugging */
  #define HFXO64M_TS_DATAINLOAD_ResetValue (0x00000000UL) /*!< Reset value of DATAINLOAD register.                             */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_TS_DATAINLOAD_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define HFXO64M_TS_DATAINLOAD_VAL_Msk (0x1UL << HFXO64M_TS_DATAINLOAD_VAL_Pos) /*!< Bit mask of VAL field.                   */



/* ================================================= Struct HFXO64M_OVERRIDE ================================================= */
/**
  * @brief OVERRIDE [HFXO64M_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) PWRUP override                                        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) RETAIN override                                       */
  __IOM uint32_t  BIAS;                              /*!< (@ 0x00000008) BIAS override                                         */
  __IOM uint32_t  CHIRPCHARGE;                       /*!< (@ 0x0000000C) CHIRP_CHARGE override                                 */
  __IOM uint32_t  ENABLEXTALDAMPING;                 /*!< (@ 0x00000010) ENABLE_XTAL_DAMPING override                          */
  __IOM uint32_t  ENABLE0V8REGULATOR;                /*!< (@ 0x00000014) ENABLE_0V8_REGULATOR override                         */
  __IOM uint32_t  ENABLE1V5REGULATOR;                /*!< (@ 0x00000018) ENABLE_1V5_REGULATOR override                         */
  __IOM uint32_t  ENABLEAREG;                        /*!< (@ 0x0000001C) ENABLE_AREG override                                  */
  __IOM uint32_t  ENABLEBIAS;                        /*!< (@ 0x00000020) ENABLE_BIAS override                                  */
  __IOM uint32_t  ENABLEBOOST;                       /*!< (@ 0x00000024) ENABLE_BOOST override                                 */
  __IOM uint32_t  ENABLEBUFFER;                      /*!< (@ 0x00000028) ENABLE_BUFFER override                                */
  __IOM uint32_t  ENABLECHIRP;                       /*!< (@ 0x0000002C) ENABLE_CHIRP override                                 */
  __IOM uint32_t  ENABLECORE;                        /*!< (@ 0x00000030) ENABLE_CORE override                                  */
  __IOM uint32_t  ENABLECURRENTCOMPARISON;           /*!< (@ 0x00000034) ENABLE_CURRENT_COMPARISON override                    */
  __IOM uint32_t  ENABLEDACOUT;                      /*!< (@ 0x00000038) ENABLE_DAC_OUT override                               */
  __IOM uint32_t  ENABLEDETECTOR;                    /*!< (@ 0x0000003C) ENABLE_DETECTOR override                              */
  __IOM uint32_t  CURRENTCOMPARISON;                 /*!< (@ 0x00000040) CURRENT_COMPARISON override                           */
  __IOM uint32_t  DETECTOR1;                         /*!< (@ 0x00000044) DETECTOR1 override                                    */
  __IOM uint32_t  DETECTOR2;                         /*!< (@ 0x00000048) DETECTOR2 override                                    */
  __IOM uint32_t  ENABLEDOUBLER;                     /*!< (@ 0x0000004C) ENABLE_DOUBLER override                               */
  __IOM uint32_t  ENABLEVREF;                        /*!< (@ 0x00000050) ENABLE_VREF override                                  */
  __IOM uint32_t  TSENABLE;                          /*!< (@ 0x00000054) TSENABLE override                                     */
  __IOM uint32_t  TSENABLERESET;                     /*!< (@ 0x00000058) TSENABLERESET override                                */
} NRF_HFXO64M_OVERRIDE_Type;                         /*!< Size = 92 (0x05C)                                                    */

