adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* HFXO64M_OVERRIDE_PWRUP: PWRUP override */
  #define HFXO64M_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                 */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_PWRUP_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define HFXO64M_OVERRIDE_PWRUP_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_PWRUP_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define HFXO64M_OVERRIDE_PWRUP_EN_Msk (0x1UL << HFXO64M_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                    */


/* HFXO64M_OVERRIDE_RETAIN: RETAIN override */
  #define HFXO64M_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                               */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_RETAIN_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define HFXO64M_OVERRIDE_RETAIN_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.               */

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_RETAIN_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define HFXO64M_OVERRIDE_RETAIN_EN_Msk (0x1UL << HFXO64M_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.                  */


/* HFXO64M_OVERRIDE_BIAS: BIAS override */
  #define HFXO64M_OVERRIDE_BIAS_ResetValue (0x00000000UL) /*!< Reset value of BIAS register.                                   */

/* VAL @Bits 0..3 : (unspecified) */
  #define HFXO64M_OVERRIDE_BIAS_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define HFXO64M_OVERRIDE_BIAS_VAL_Msk (0xFUL << HFXO64M_OVERRIDE_BIAS_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_BIAS_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define HFXO64M_OVERRIDE_BIAS_EN_Msk (0x1UL << HFXO64M_OVERRIDE_BIAS_EN_Pos) /*!< Bit mask of EN field.                      */


/* HFXO64M_OVERRIDE_CHIRPCHARGE: CHIRP_CHARGE override */
  #define HFXO64M_OVERRIDE_CHIRPCHARGE_ResetValue (0x00000000UL) /*!< Reset value of CHIRPCHARGE register.                     */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_CHIRPCHARGE_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define HFXO64M_OVERRIDE_CHIRPCHARGE_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_CHIRPCHARGE_VAL_Pos) /*!< Bit mask of VAL field.     */

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_CHIRPCHARGE_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define HFXO64M_OVERRIDE_CHIRPCHARGE_EN_Msk (0x1UL << HFXO64M_OVERRIDE_CHIRPCHARGE_EN_Pos) /*!< Bit mask of EN field.        */


/* HFXO64M_OVERRIDE_ENABLEXTALDAMPING: ENABLE_XTAL_DAMPING override */
  #define HFXO64M_OVERRIDE_ENABLEXTALDAMPING_ResetValue (0x00000000UL) /*!< Reset value of ENABLEXTALDAMPING register.         */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLEXTALDAMPING_VAL_Pos (0UL) /*!< Position of VAL field.                                         */
  #define HFXO64M_OVERRIDE_ENABLEXTALDAMPING_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLEXTALDAMPING_VAL_Pos) /*!< Bit mask of VAL
                                                                            field.*/                                              

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLEXTALDAMPING_EN_Pos (31UL) /*!< Position of EN field.                                          */
  #define HFXO64M_OVERRIDE_ENABLEXTALDAMPING_EN_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLEXTALDAMPING_EN_Pos) /*!< Bit mask of EN
                                                                            field.*/                                              


/* HFXO64M_OVERRIDE_ENABLE0V8REGULATOR: ENABLE_0V8_REGULATOR override */
  #define HFXO64M_OVERRIDE_ENABLE0V8REGULATOR_ResetValue (0x00000000UL) /*!< Reset value of ENABLE0V8REGULATOR register.       */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLE0V8REGULATOR_VAL_Pos (0UL) /*!< Position of VAL field.                                        */
  #define HFXO64M_OVERRIDE_ENABLE0V8REGULATOR_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLE0V8REGULATOR_VAL_Pos) /*!< Bit mask of
                                                                            VAL field.*/                                          

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLE0V8REGULATOR_EN_Pos (31UL) /*!< Position of EN field.                                         */
  #define HFXO64M_OVERRIDE_ENABLE0V8REGULATOR_EN_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLE0V8REGULATOR_EN_Pos) /*!< Bit mask of EN
                                                                            field.*/                                              


/* HFXO64M_OVERRIDE_ENABLE1V5REGULATOR: ENABLE_1V5_REGULATOR override */
  #define HFXO64M_OVERRIDE_ENABLE1V5REGULATOR_ResetValue (0x00000000UL) /*!< Reset value of ENABLE1V5REGULATOR register.       */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLE1V5REGULATOR_VAL_Pos (0UL) /*!< Position of VAL field.                                        */
  #define HFXO64M_OVERRIDE_ENABLE1V5REGULATOR_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLE1V5REGULATOR_VAL_Pos) /*!< Bit mask of
                                                                            VAL field.*/                                          

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLE1V5REGULATOR_EN_Pos (31UL) /*!< Position of EN field.                                         */
  #define HFXO64M_OVERRIDE_ENABLE1V5REGULATOR_EN_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLE1V5REGULATOR_EN_Pos) /*!< Bit mask of EN
                                                                            field.*/                                              


/* HFXO64M_OVERRIDE_ENABLEAREG: ENABLE_AREG override */
  #define HFXO64M_OVERRIDE_ENABLEAREG_ResetValue (0x00000000UL) /*!< Reset value of ENABLEAREG register.                       */

