adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLEAREG_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define HFXO64M_OVERRIDE_ENABLEAREG_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLEAREG_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLEAREG_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define HFXO64M_OVERRIDE_ENABLEAREG_EN_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLEAREG_EN_Pos) /*!< Bit mask of EN field.          */


/* HFXO64M_OVERRIDE_ENABLEBIAS: ENABLE_BIAS override */
  #define HFXO64M_OVERRIDE_ENABLEBIAS_ResetValue (0x00000000UL) /*!< Reset value of ENABLEBIAS register.                       */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLEBIAS_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define HFXO64M_OVERRIDE_ENABLEBIAS_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLEBIAS_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLEBIAS_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define HFXO64M_OVERRIDE_ENABLEBIAS_EN_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLEBIAS_EN_Pos) /*!< Bit mask of EN field.          */


/* HFXO64M_OVERRIDE_ENABLEBOOST: ENABLE_BOOST override */
  #define HFXO64M_OVERRIDE_ENABLEBOOST_ResetValue (0x00000000UL) /*!< Reset value of ENABLEBOOST register.                     */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLEBOOST_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define HFXO64M_OVERRIDE_ENABLEBOOST_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLEBOOST_VAL_Pos) /*!< Bit mask of VAL field.     */

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLEBOOST_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define HFXO64M_OVERRIDE_ENABLEBOOST_EN_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLEBOOST_EN_Pos) /*!< Bit mask of EN field.        */


/* HFXO64M_OVERRIDE_ENABLEBUFFER: ENABLE_BUFFER override */
  #define HFXO64M_OVERRIDE_ENABLEBUFFER_ResetValue (0x00000000UL) /*!< Reset value of ENABLEBUFFER register.                   */

/* VAL @Bits 0..9 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLEBUFFER_VAL_Pos (0UL) /*!< Position of VAL field.                                              */
  #define HFXO64M_OVERRIDE_ENABLEBUFFER_VAL_Msk (0x3FFUL << HFXO64M_OVERRIDE_ENABLEBUFFER_VAL_Pos) /*!< Bit mask of VAL field. */

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLEBUFFER_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define HFXO64M_OVERRIDE_ENABLEBUFFER_EN_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLEBUFFER_EN_Pos) /*!< Bit mask of EN field.      */


/* HFXO64M_OVERRIDE_ENABLECHIRP: ENABLE_CHIRP override */
  #define HFXO64M_OVERRIDE_ENABLECHIRP_ResetValue (0x00000000UL) /*!< Reset value of ENABLECHIRP register.                     */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLECHIRP_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define HFXO64M_OVERRIDE_ENABLECHIRP_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLECHIRP_VAL_Pos) /*!< Bit mask of VAL field.     */

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLECHIRP_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define HFXO64M_OVERRIDE_ENABLECHIRP_EN_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLECHIRP_EN_Pos) /*!< Bit mask of EN field.        */


/* HFXO64M_OVERRIDE_ENABLECORE: ENABLE_CORE override */
  #define HFXO64M_OVERRIDE_ENABLECORE_ResetValue (0x00000000UL) /*!< Reset value of ENABLECORE register.                       */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLECORE_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define HFXO64M_OVERRIDE_ENABLECORE_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLECORE_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLECORE_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define HFXO64M_OVERRIDE_ENABLECORE_EN_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLECORE_EN_Pos) /*!< Bit mask of EN field.          */


/* HFXO64M_OVERRIDE_ENABLECURRENTCOMPARISON: ENABLE_CURRENT_COMPARISON override */
  #define HFXO64M_OVERRIDE_ENABLECURRENTCOMPARISON_ResetValue (0x00000000UL) /*!< Reset value of ENABLECURRENTCOMPARISON
                                                                            register.*/                                           

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLECURRENTCOMPARISON_VAL_Pos (0UL) /*!< Position of VAL field.                                   */
  #define HFXO64M_OVERRIDE_ENABLECURRENTCOMPARISON_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLECURRENTCOMPARISON_VAL_Pos) /*!< Bit
                                                                            mask of VAL field.*/                                  

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLECURRENTCOMPARISON_EN_Pos (31UL) /*!< Position of EN field.                                    */
  #define HFXO64M_OVERRIDE_ENABLECURRENTCOMPARISON_EN_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLECURRENTCOMPARISON_EN_Pos) /*!< Bit
                                                                            mask of EN field.*/                                   


/* HFXO64M_OVERRIDE_ENABLEDACOUT: ENABLE_DAC_OUT override */
  #define HFXO64M_OVERRIDE_ENABLEDACOUT_ResetValue (0x00000000UL) /*!< Reset value of ENABLEDACOUT register.                   */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLEDACOUT_VAL_Pos (0UL) /*!< Position of VAL field.                                              */
  #define HFXO64M_OVERRIDE_ENABLEDACOUT_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLEDACOUT_VAL_Pos) /*!< Bit mask of VAL field.   */

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLEDACOUT_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define HFXO64M_OVERRIDE_ENABLEDACOUT_EN_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLEDACOUT_EN_Pos) /*!< Bit mask of EN field.      */


/* HFXO64M_OVERRIDE_ENABLEDETECTOR: ENABLE_DETECTOR override */
  #define HFXO64M_OVERRIDE_ENABLEDETECTOR_ResetValue (0x00000000UL) /*!< Reset value of ENABLEDETECTOR register.               */

