adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLEDETECTOR_VAL_Pos (0UL) /*!< Position of VAL field.                                            */
  #define HFXO64M_OVERRIDE_ENABLEDETECTOR_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLEDETECTOR_VAL_Pos) /*!< Bit mask of VAL
                                                                            field.*/                                              

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLEDETECTOR_EN_Pos (31UL) /*!< Position of EN field.                                             */
  #define HFXO64M_OVERRIDE_ENABLEDETECTOR_EN_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLEDETECTOR_EN_Pos) /*!< Bit mask of EN field.  */


/* HFXO64M_OVERRIDE_CURRENTCOMPARISON: CURRENT_COMPARISON override */
  #define HFXO64M_OVERRIDE_CURRENTCOMPARISON_ResetValue (0x00000000UL) /*!< Reset value of CURRENTCOMPARISON register.         */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_CURRENTCOMPARISON_VAL_Pos (0UL) /*!< Position of VAL field.                                         */
  #define HFXO64M_OVERRIDE_CURRENTCOMPARISON_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_CURRENTCOMPARISON_VAL_Pos) /*!< Bit mask of VAL
                                                                            field.*/                                              

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_CURRENTCOMPARISON_EN_Pos (31UL) /*!< Position of EN field.                                          */
  #define HFXO64M_OVERRIDE_CURRENTCOMPARISON_EN_Msk (0x1UL << HFXO64M_OVERRIDE_CURRENTCOMPARISON_EN_Pos) /*!< Bit mask of EN
                                                                            field.*/                                              


/* HFXO64M_OVERRIDE_DETECTOR1: DETECTOR1 override */
  #define HFXO64M_OVERRIDE_DETECTOR1_ResetValue (0x00000000UL) /*!< Reset value of DETECTOR1 register.                         */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_DETECTOR1_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define HFXO64M_OVERRIDE_DETECTOR1_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_DETECTOR1_VAL_Pos) /*!< Bit mask of VAL field.         */

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_DETECTOR1_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define HFXO64M_OVERRIDE_DETECTOR1_EN_Msk (0x1UL << HFXO64M_OVERRIDE_DETECTOR1_EN_Pos) /*!< Bit mask of EN field.            */


/* HFXO64M_OVERRIDE_DETECTOR2: DETECTOR2 override */
  #define HFXO64M_OVERRIDE_DETECTOR2_ResetValue (0x00000000UL) /*!< Reset value of DETECTOR2 register.                         */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_DETECTOR2_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define HFXO64M_OVERRIDE_DETECTOR2_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_DETECTOR2_VAL_Pos) /*!< Bit mask of VAL field.         */

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_DETECTOR2_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define HFXO64M_OVERRIDE_DETECTOR2_EN_Msk (0x1UL << HFXO64M_OVERRIDE_DETECTOR2_EN_Pos) /*!< Bit mask of EN field.            */


/* HFXO64M_OVERRIDE_ENABLEDOUBLER: ENABLE_DOUBLER override */
  #define HFXO64M_OVERRIDE_ENABLEDOUBLER_ResetValue (0x00000000UL) /*!< Reset value of ENABLEDOUBLER register.                 */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLEDOUBLER_VAL_Pos (0UL) /*!< Position of VAL field.                                             */
  #define HFXO64M_OVERRIDE_ENABLEDOUBLER_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLEDOUBLER_VAL_Pos) /*!< Bit mask of VAL field. */

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLEDOUBLER_EN_Pos (31UL) /*!< Position of EN field.                                              */
  #define HFXO64M_OVERRIDE_ENABLEDOUBLER_EN_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLEDOUBLER_EN_Pos) /*!< Bit mask of EN field.    */


/* HFXO64M_OVERRIDE_ENABLEVREF: ENABLE_VREF override */
  #define HFXO64M_OVERRIDE_ENABLEVREF_ResetValue (0x00000000UL) /*!< Reset value of ENABLEVREF register.                       */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLEVREF_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define HFXO64M_OVERRIDE_ENABLEVREF_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLEVREF_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_ENABLEVREF_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define HFXO64M_OVERRIDE_ENABLEVREF_EN_Msk (0x1UL << HFXO64M_OVERRIDE_ENABLEVREF_EN_Pos) /*!< Bit mask of EN field.          */


/* HFXO64M_OVERRIDE_TSENABLE: TSENABLE override */
  #define HFXO64M_OVERRIDE_TSENABLE_ResetValue (0x00000000UL) /*!< Reset value of TSENABLE register.                           */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_TSENABLE_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define HFXO64M_OVERRIDE_TSENABLE_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_TSENABLE_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_TSENABLE_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define HFXO64M_OVERRIDE_TSENABLE_EN_Msk (0x1UL << HFXO64M_OVERRIDE_TSENABLE_EN_Pos) /*!< Bit mask of EN field.              */


/* HFXO64M_OVERRIDE_TSENABLERESET: TSENABLERESET override */
  #define HFXO64M_OVERRIDE_TSENABLERESET_ResetValue (0x00000000UL) /*!< Reset value of TSENABLERESET register.                 */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_OVERRIDE_TSENABLERESET_VAL_Pos (0UL) /*!< Position of VAL field.                                             */
  #define HFXO64M_OVERRIDE_TSENABLERESET_VAL_Msk (0x1UL << HFXO64M_OVERRIDE_TSENABLERESET_VAL_Pos) /*!< Bit mask of VAL field. */

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_OVERRIDE_TSENABLERESET_EN_Pos (31UL) /*!< Position of EN field.                                              */
  #define HFXO64M_OVERRIDE_TSENABLERESET_EN_Msk (0x1UL << HFXO64M_OVERRIDE_TSENABLERESET_EN_Pos) /*!< Bit mask of EN field.    */



