adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* =================================================== Struct HFXO64M_DFT ==================================================== */
/**
  * @brief DFT [HFXO64M_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATBCONFIG;                         /*!< (@ 0x00000000) ATB0 and ATB1 test mux control.                       */
} NRF_HFXO64M_DFT_Type;                              /*!< Size = 4 (0x004)                                                     */

/* HFXO64M_DFT_ATBCONFIG: ATB0 and ATB1 test mux control. */
  #define HFXO64M_DFT_ATBCONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATBCONFIG register.                              */

/* SELMUX0 @Bits 0..2 : Test mux control for ATB0. */
  #define HFXO64M_DFT_ATBCONFIG_SELMUX0_Pos (0UL)    /*!< Position of SELMUX0 field.                                           */
  #define HFXO64M_DFT_ATBCONFIG_SELMUX0_Msk (0x7UL << HFXO64M_DFT_ATBCONFIG_SELMUX0_Pos) /*!< Bit mask of SELMUX0 field.       */
  #define HFXO64M_DFT_ATBCONFIG_SELMUX0_Min (0x0UL)  /*!< Min enumerator value of SELMUX0 field.                               */
  #define HFXO64M_DFT_ATBCONFIG_SELMUX0_Max (0x4UL)  /*!< Max enumerator value of SELMUX0 field.                               */
  #define HFXO64M_DFT_ATBCONFIG_SELMUX0_None (0x0UL) /*!< Nothing selected.                                                    */
  #define HFXO64M_DFT_ATBCONFIG_SELMUX0_Vref (0x1UL) /*!< Voltage reference output. Approximately 0.76V                        */
  #define HFXO64M_DFT_ATBCONFIG_SELMUX0_V1v5Reg (0x2UL) /*!< 1.5V regulator output voltage.                                    */
  #define HFXO64M_DFT_ATBCONFIG_SELMUX0_V0V8Reg (0x3UL) /*!< 0.8V regulator output voltage.                                    */
  #define HFXO64M_DFT_ATBCONFIG_SELMUX0_VPierce (0x4UL) /*!< IPIERCE voltage. XO core imminent supply voltage.                 */

/* SELMUX1 @Bits 3..5 : Test mux control for ATB1. */
  #define HFXO64M_DFT_ATBCONFIG_SELMUX1_Pos (3UL)    /*!< Position of SELMUX1 field.                                           */
  #define HFXO64M_DFT_ATBCONFIG_SELMUX1_Msk (0x7UL << HFXO64M_DFT_ATBCONFIG_SELMUX1_Pos) /*!< Bit mask of SELMUX1 field.       */
  #define HFXO64M_DFT_ATBCONFIG_SELMUX1_Min (0x0UL)  /*!< Min enumerator value of SELMUX1 field.                               */
  #define HFXO64M_DFT_ATBCONFIG_SELMUX1_Max (0x4UL)  /*!< Max enumerator value of SELMUX1 field.                               */
  #define HFXO64M_DFT_ATBCONFIG_SELMUX1_None (0x0UL) /*!< Nothing selected.                                                    */
  #define HFXO64M_DFT_ATBCONFIG_SELMUX1_VAteg (0x1UL) /*!< AREG block test voltage. Xo level dependent.                        */
  #define HFXO64M_DFT_ATBCONFIG_SELMUX1_VChirp (0x2UL) /*!< Chirp generator test voltage.                                      */
  #define HFXO64M_DFT_ATBCONFIG_SELMUX1_VTS (0x3UL)  /*!< Temp Sensor test voltage.                                            */
  #define HFXO64M_DFT_ATBCONFIG_SELMUX1_VGnd (0x4UL) /*!< Connected to XO VSS/ground. Use as reference voltage for GND.        */

/* EN @Bit 31 : (unspecified) */
  #define HFXO64M_DFT_ATBCONFIG_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define HFXO64M_DFT_ATBCONFIG_EN_Msk (0x1UL << HFXO64M_DFT_ATBCONFIG_EN_Pos) /*!< Bit mask of EN field.                      */
  #define HFXO64M_DFT_ATBCONFIG_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define HFXO64M_DFT_ATBCONFIG_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define HFXO64M_DFT_ATBCONFIG_EN_Disabled (0x0UL)  /*!< Analog test busses are disabled.                                     */
  #define HFXO64M_DFT_ATBCONFIG_EN_Enabled (0x1UL)   /*!< Analog test busses are enabled.                                      */


/* ===================================================== Struct HFXO64M ====================================================== */
/**
  * @brief HFXO64M peripheral
  */
  typedef struct {                                   /*!< HFXO64M Structure                                                    */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_STARTED;                   /*!< (@ 0x00000100) HFXO64M started                                       */
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000104) HFXO64M stopped                                       */
    __IOM uint32_t EVENTS_ERRORBIAS;                 /*!< (@ 0x00000108) Error in BIAS setup                                   */
    __IOM uint32_t EVENTS_ERRORDETECTOR;             /*!< (@ 0x0000010C) Error with DETECTOR                                   */
    __IM uint32_t RESERVED1[124];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) HFXO64M status                                        */
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000404) Status of analog module output signals                */
    __IM uint32_t STATUSMMI;                         /*!< (@ 0x00000408) MMI internal values for debug use.                    */
    __IM uint32_t RESERVED3[13];
    __IOM NRF_HFXO64M_TRIM_Type TRIM;                /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED4[5];
    __IOM NRF_HFXO64M_TS_Type TS;                    /*!< (@ 0x00000460) (unspecified)                                         */
    __IM uint32_t RESERVED5[4];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IOM uint32_t PWRUPCTRL;                        /*!< (@ 0x00000484) Power up control                                      */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000488) HFXO64M mode                                          */
    __IOM uint32_t XTALSETTLETIME;                   /*!< (@ 0x0000048C) Settle time of the crystal. List of pre-coded times.  */
    __IOM uint32_t CHIRPTIME;                        /*!< (@ 0x00000490) Chirp period length. List of pre-coded times.         */
    __IOM uint32_t ENABLEDAMPING;                    /*!< (@ 0x00000494) Enables the MMI to do crystal damping when stopping the
                                                                         oscillator.*/                                            
    __IOM uint32_t FORCEBUFF;                        /*!< (@ 0x00000498) Enables all clock buffers when sinOut4_ana buffer is
                                                                         enabled.*/                                               
    __IOM uint32_t CFG;                              /*!< (@ 0x0000049C) Direct HFXO64M static configurations.                 */
    __IM uint32_t RESERVED6[24];
    __IOM NRF_HFXO64M_OVERRIDE_Type OVERRIDE;        /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED7[41];
    __IOM NRF_HFXO64M_DFT_Type DFT;                  /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_HFXO64M_Type;                                /*!< Size = 1540 (0x604)                                                  */

