adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* HFXO64M_EVENTS_STARTED: HFXO64M started */
  #define HFXO64M_EVENTS_STARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STARTED register.                        */

/* EVENTS_STARTED @Bit 0 : HFXO64M started */
  #define HFXO64M_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL) /*!< Position of EVENTS_STARTED field.                               */
  #define HFXO64M_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << HFXO64M_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/                               
  #define HFXO64M_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STARTED field.                 */
  #define HFXO64M_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STARTED field.                 */
  #define HFXO64M_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define HFXO64M_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL) /*!< Event generated                                         */


/* HFXO64M_EVENTS_STOPPED: HFXO64M stopped */
  #define HFXO64M_EVENTS_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STOPPED register.                        */

/* EVENTS_STOPPED @Bit 0 : HFXO64M stopped */
  #define HFXO64M_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL) /*!< Position of EVENTS_STOPPED field.                               */
  #define HFXO64M_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << HFXO64M_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_STOPPED field.*/                               
  #define HFXO64M_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STOPPED field.                 */
  #define HFXO64M_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STOPPED field.                 */
  #define HFXO64M_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define HFXO64M_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL) /*!< Event generated                                         */


/* HFXO64M_EVENTS_ERRORBIAS: Error in BIAS setup */
  #define HFXO64M_EVENTS_ERRORBIAS_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERRORBIAS register.                    */

/* EVENTS_ERRORBIAS @Bit 0 : Error in BIAS setup */
  #define HFXO64M_EVENTS_ERRORBIAS_EVENTS_ERRORBIAS_Pos (0UL) /*!< Position of EVENTS_ERRORBIAS field.                         */
  #define HFXO64M_EVENTS_ERRORBIAS_EVENTS_ERRORBIAS_Msk (0x1UL << HFXO64M_EVENTS_ERRORBIAS_EVENTS_ERRORBIAS_Pos) /*!< Bit mask
                                                                            of EVENTS_ERRORBIAS field.*/                          
  #define HFXO64M_EVENTS_ERRORBIAS_EVENTS_ERRORBIAS_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERRORBIAS field.           */
  #define HFXO64M_EVENTS_ERRORBIAS_EVENTS_ERRORBIAS_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERRORBIAS field.           */
  #define HFXO64M_EVENTS_ERRORBIAS_EVENTS_ERRORBIAS_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define HFXO64M_EVENTS_ERRORBIAS_EVENTS_ERRORBIAS_Generated (0x1UL) /*!< Event generated                                     */


/* HFXO64M_EVENTS_ERRORDETECTOR: Error with DETECTOR */
  #define HFXO64M_EVENTS_ERRORDETECTOR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERRORDETECTOR register.            */

/* EVENTS_ERRORDETECTOR @Bit 0 : Error with DETECTOR */
  #define HFXO64M_EVENTS_ERRORDETECTOR_EVENTS_ERRORDETECTOR_Pos (0UL) /*!< Position of EVENTS_ERRORDETECTOR field.             */
  #define HFXO64M_EVENTS_ERRORDETECTOR_EVENTS_ERRORDETECTOR_Msk (0x1UL << HFXO64M_EVENTS_ERRORDETECTOR_EVENTS_ERRORDETECTOR_Pos)
                                                                            /*!< Bit mask of EVENTS_ERRORDETECTOR field.*/        
  #define HFXO64M_EVENTS_ERRORDETECTOR_EVENTS_ERRORDETECTOR_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERRORDETECTOR
                                                                            field.*/                                              
  #define HFXO64M_EVENTS_ERRORDETECTOR_EVENTS_ERRORDETECTOR_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERRORDETECTOR
                                                                            field.*/                                              
  #define HFXO64M_EVENTS_ERRORDETECTOR_EVENTS_ERRORDETECTOR_NotGenerated (0x0UL) /*!< Event not generated                      */
  #define HFXO64M_EVENTS_ERRORDETECTOR_EVENTS_ERRORDETECTOR_Generated (0x1UL) /*!< Event generated                             */


/* HFXO64M_INTEN: Enable or disable interrupt */
  #define HFXO64M_INTEN_ResetValue (0x00000000UL)    /*!< Reset value of INTEN register.                                       */

/* STARTED @Bit 0 : Enable or disable interrupt for event STARTED */
  #define HFXO64M_INTEN_STARTED_Pos (0UL)            /*!< Position of STARTED field.                                           */
  #define HFXO64M_INTEN_STARTED_Msk (0x1UL << HFXO64M_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field.                       */
  #define HFXO64M_INTEN_STARTED_Min (0x0UL)          /*!< Min enumerator value of STARTED field.                               */
  #define HFXO64M_INTEN_STARTED_Max (0x1UL)          /*!< Max enumerator value of STARTED field.                               */
  #define HFXO64M_INTEN_STARTED_Disabled (0x0UL)     /*!< Disable                                                              */
  #define HFXO64M_INTEN_STARTED_Enabled (0x1UL)      /*!< Enable                                                               */

/* STOPPED @Bit 1 : Enable or disable interrupt for event STOPPED */
  #define HFXO64M_INTEN_STOPPED_Pos (1UL)            /*!< Position of STOPPED field.                                           */
  #define HFXO64M_INTEN_STOPPED_Msk (0x1UL << HFXO64M_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                       */
  #define HFXO64M_INTEN_STOPPED_Min (0x0UL)          /*!< Min enumerator value of STOPPED field.                               */
  #define HFXO64M_INTEN_STOPPED_Max (0x1UL)          /*!< Max enumerator value of STOPPED field.                               */
  #define HFXO64M_INTEN_STOPPED_Disabled (0x0UL)     /*!< Disable                                                              */
  #define HFXO64M_INTEN_STOPPED_Enabled (0x1UL)      /*!< Enable                                                               */

/* ERRORBIAS @Bit 2 : Enable or disable interrupt for event ERRORBIAS */
  #define HFXO64M_INTEN_ERRORBIAS_Pos (2UL)          /*!< Position of ERRORBIAS field.                                         */
  #define HFXO64M_INTEN_ERRORBIAS_Msk (0x1UL << HFXO64M_INTEN_ERRORBIAS_Pos) /*!< Bit mask of ERRORBIAS field.                 */
  #define HFXO64M_INTEN_ERRORBIAS_Min (0x0UL)        /*!< Min enumerator value of ERRORBIAS field.                             */
  #define HFXO64M_INTEN_ERRORBIAS_Max (0x1UL)        /*!< Max enumerator value of ERRORBIAS field.                             */
  #define HFXO64M_INTEN_ERRORBIAS_Disabled (0x0UL)   /*!< Disable                                                              */
  #define HFXO64M_INTEN_ERRORBIAS_Enabled (0x1UL)    /*!< Enable                                                               */

