adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ERRORDETECTOR @Bit 3 : Enable or disable interrupt for event ERRORDETECTOR */
  #define HFXO64M_INTEN_ERRORDETECTOR_Pos (3UL)      /*!< Position of ERRORDETECTOR field.                                     */
  #define HFXO64M_INTEN_ERRORDETECTOR_Msk (0x1UL << HFXO64M_INTEN_ERRORDETECTOR_Pos) /*!< Bit mask of ERRORDETECTOR field.     */
  #define HFXO64M_INTEN_ERRORDETECTOR_Min (0x0UL)    /*!< Min enumerator value of ERRORDETECTOR field.                         */
  #define HFXO64M_INTEN_ERRORDETECTOR_Max (0x1UL)    /*!< Max enumerator value of ERRORDETECTOR field.                         */
  #define HFXO64M_INTEN_ERRORDETECTOR_Disabled (0x0UL) /*!< Disable                                                            */
  #define HFXO64M_INTEN_ERRORDETECTOR_Enabled (0x1UL) /*!< Enable                                                              */


/* HFXO64M_INTENSET: Enable interrupt */
  #define HFXO64M_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                    */

/* STARTED @Bit 0 : Write '1' to enable interrupt for event STARTED */
  #define HFXO64M_INTENSET_STARTED_Pos (0UL)         /*!< Position of STARTED field.                                           */
  #define HFXO64M_INTENSET_STARTED_Msk (0x1UL << HFXO64M_INTENSET_STARTED_Pos) /*!< Bit mask of STARTED field.                 */
  #define HFXO64M_INTENSET_STARTED_Min (0x0UL)       /*!< Min enumerator value of STARTED field.                               */
  #define HFXO64M_INTENSET_STARTED_Max (0x1UL)       /*!< Max enumerator value of STARTED field.                               */
  #define HFXO64M_INTENSET_STARTED_Set (0x1UL)       /*!< Enable                                                               */
  #define HFXO64M_INTENSET_STARTED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define HFXO64M_INTENSET_STARTED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define HFXO64M_INTENSET_STOPPED_Pos (1UL)         /*!< Position of STOPPED field.                                           */
  #define HFXO64M_INTENSET_STOPPED_Msk (0x1UL << HFXO64M_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                 */
  #define HFXO64M_INTENSET_STOPPED_Min (0x0UL)       /*!< Min enumerator value of STOPPED field.                               */
  #define HFXO64M_INTENSET_STOPPED_Max (0x1UL)       /*!< Max enumerator value of STOPPED field.                               */
  #define HFXO64M_INTENSET_STOPPED_Set (0x1UL)       /*!< Enable                                                               */
  #define HFXO64M_INTENSET_STOPPED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define HFXO64M_INTENSET_STOPPED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* ERRORBIAS @Bit 2 : Write '1' to enable interrupt for event ERRORBIAS */
  #define HFXO64M_INTENSET_ERRORBIAS_Pos (2UL)       /*!< Position of ERRORBIAS field.                                         */
  #define HFXO64M_INTENSET_ERRORBIAS_Msk (0x1UL << HFXO64M_INTENSET_ERRORBIAS_Pos) /*!< Bit mask of ERRORBIAS field.           */
  #define HFXO64M_INTENSET_ERRORBIAS_Min (0x0UL)     /*!< Min enumerator value of ERRORBIAS field.                             */
  #define HFXO64M_INTENSET_ERRORBIAS_Max (0x1UL)     /*!< Max enumerator value of ERRORBIAS field.                             */
  #define HFXO64M_INTENSET_ERRORBIAS_Set (0x1UL)     /*!< Enable                                                               */
  #define HFXO64M_INTENSET_ERRORBIAS_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define HFXO64M_INTENSET_ERRORBIAS_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* ERRORDETECTOR @Bit 3 : Write '1' to enable interrupt for event ERRORDETECTOR */
  #define HFXO64M_INTENSET_ERRORDETECTOR_Pos (3UL)   /*!< Position of ERRORDETECTOR field.                                     */
  #define HFXO64M_INTENSET_ERRORDETECTOR_Msk (0x1UL << HFXO64M_INTENSET_ERRORDETECTOR_Pos) /*!< Bit mask of ERRORDETECTOR
                                                                            field.*/                                              
  #define HFXO64M_INTENSET_ERRORDETECTOR_Min (0x0UL) /*!< Min enumerator value of ERRORDETECTOR field.                         */
  #define HFXO64M_INTENSET_ERRORDETECTOR_Max (0x1UL) /*!< Max enumerator value of ERRORDETECTOR field.                         */
  #define HFXO64M_INTENSET_ERRORDETECTOR_Set (0x1UL) /*!< Enable                                                               */
  #define HFXO64M_INTENSET_ERRORDETECTOR_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define HFXO64M_INTENSET_ERRORDETECTOR_Enabled (0x1UL) /*!< Read: Enabled                                                    */


/* HFXO64M_INTENCLR: Disable interrupt */
  #define HFXO64M_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                    */

/* STARTED @Bit 0 : Write '1' to disable interrupt for event STARTED */
  #define HFXO64M_INTENCLR_STARTED_Pos (0UL)         /*!< Position of STARTED field.                                           */
  #define HFXO64M_INTENCLR_STARTED_Msk (0x1UL << HFXO64M_INTENCLR_STARTED_Pos) /*!< Bit mask of STARTED field.                 */
  #define HFXO64M_INTENCLR_STARTED_Min (0x0UL)       /*!< Min enumerator value of STARTED field.                               */
  #define HFXO64M_INTENCLR_STARTED_Max (0x1UL)       /*!< Max enumerator value of STARTED field.                               */
  #define HFXO64M_INTENCLR_STARTED_Clear (0x1UL)     /*!< Disable                                                              */
  #define HFXO64M_INTENCLR_STARTED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define HFXO64M_INTENCLR_STARTED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define HFXO64M_INTENCLR_STOPPED_Pos (1UL)         /*!< Position of STOPPED field.                                           */
  #define HFXO64M_INTENCLR_STOPPED_Msk (0x1UL << HFXO64M_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                 */
  #define HFXO64M_INTENCLR_STOPPED_Min (0x0UL)       /*!< Min enumerator value of STOPPED field.                               */
  #define HFXO64M_INTENCLR_STOPPED_Max (0x1UL)       /*!< Max enumerator value of STOPPED field.                               */
  #define HFXO64M_INTENCLR_STOPPED_Clear (0x1UL)     /*!< Disable                                                              */
  #define HFXO64M_INTENCLR_STOPPED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define HFXO64M_INTENCLR_STOPPED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* ERRORBIAS @Bit 2 : Write '1' to disable interrupt for event ERRORBIAS */
  #define HFXO64M_INTENCLR_ERRORBIAS_Pos (2UL)       /*!< Position of ERRORBIAS field.                                         */
  #define HFXO64M_INTENCLR_ERRORBIAS_Msk (0x1UL << HFXO64M_INTENCLR_ERRORBIAS_Pos) /*!< Bit mask of ERRORBIAS field.           */
  #define HFXO64M_INTENCLR_ERRORBIAS_Min (0x0UL)     /*!< Min enumerator value of ERRORBIAS field.                             */
  #define HFXO64M_INTENCLR_ERRORBIAS_Max (0x1UL)     /*!< Max enumerator value of ERRORBIAS field.                             */
  #define HFXO64M_INTENCLR_ERRORBIAS_Clear (0x1UL)   /*!< Disable                                                              */
  #define HFXO64M_INTENCLR_ERRORBIAS_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define HFXO64M_INTENCLR_ERRORBIAS_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* ERRORDETECTOR @Bit 3 : Write '1' to disable interrupt for event ERRORDETECTOR */
  #define HFXO64M_INTENCLR_ERRORDETECTOR_Pos (3UL)   /*!< Position of ERRORDETECTOR field.                                     */
  #define HFXO64M_INTENCLR_ERRORDETECTOR_Msk (0x1UL << HFXO64M_INTENCLR_ERRORDETECTOR_Pos) /*!< Bit mask of ERRORDETECTOR
                                                                            field.*/                                              
  #define HFXO64M_INTENCLR_ERRORDETECTOR_Min (0x0UL) /*!< Min enumerator value of ERRORDETECTOR field.                         */
  #define HFXO64M_INTENCLR_ERRORDETECTOR_Max (0x1UL) /*!< Max enumerator value of ERRORDETECTOR field.                         */
  #define HFXO64M_INTENCLR_ERRORDETECTOR_Clear (0x1UL) /*!< Disable                                                            */
  #define HFXO64M_INTENCLR_ERRORDETECTOR_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define HFXO64M_INTENCLR_ERRORDETECTOR_Enabled (0x1UL) /*!< Read: Enabled                                                    */


