adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* HFXO64M_INTPEND: Pending interrupts */
  #define HFXO64M_INTPEND_ResetValue (0x00000000UL)  /*!< Reset value of INTPEND register.                                     */

/* STARTED @Bit 0 : Read pending status of interrupt for event STARTED */
  #define HFXO64M_INTPEND_STARTED_Pos (0UL)          /*!< Position of STARTED field.                                           */
  #define HFXO64M_INTPEND_STARTED_Msk (0x1UL << HFXO64M_INTPEND_STARTED_Pos) /*!< Bit mask of STARTED field.                   */
  #define HFXO64M_INTPEND_STARTED_Min (0x0UL)        /*!< Min enumerator value of STARTED field.                               */
  #define HFXO64M_INTPEND_STARTED_Max (0x1UL)        /*!< Max enumerator value of STARTED field.                               */
  #define HFXO64M_INTPEND_STARTED_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define HFXO64M_INTPEND_STARTED_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* STOPPED @Bit 1 : Read pending status of interrupt for event STOPPED */
  #define HFXO64M_INTPEND_STOPPED_Pos (1UL)          /*!< Position of STOPPED field.                                           */
  #define HFXO64M_INTPEND_STOPPED_Msk (0x1UL << HFXO64M_INTPEND_STOPPED_Pos) /*!< Bit mask of STOPPED field.                   */
  #define HFXO64M_INTPEND_STOPPED_Min (0x0UL)        /*!< Min enumerator value of STOPPED field.                               */
  #define HFXO64M_INTPEND_STOPPED_Max (0x1UL)        /*!< Max enumerator value of STOPPED field.                               */
  #define HFXO64M_INTPEND_STOPPED_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define HFXO64M_INTPEND_STOPPED_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* ERRORBIAS @Bit 2 : Read pending status of interrupt for event ERRORBIAS */
  #define HFXO64M_INTPEND_ERRORBIAS_Pos (2UL)        /*!< Position of ERRORBIAS field.                                         */
  #define HFXO64M_INTPEND_ERRORBIAS_Msk (0x1UL << HFXO64M_INTPEND_ERRORBIAS_Pos) /*!< Bit mask of ERRORBIAS field.             */
  #define HFXO64M_INTPEND_ERRORBIAS_Min (0x0UL)      /*!< Min enumerator value of ERRORBIAS field.                             */
  #define HFXO64M_INTPEND_ERRORBIAS_Max (0x1UL)      /*!< Max enumerator value of ERRORBIAS field.                             */
  #define HFXO64M_INTPEND_ERRORBIAS_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define HFXO64M_INTPEND_ERRORBIAS_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* ERRORDETECTOR @Bit 3 : Read pending status of interrupt for event ERRORDETECTOR */
  #define HFXO64M_INTPEND_ERRORDETECTOR_Pos (3UL)    /*!< Position of ERRORDETECTOR field.                                     */
  #define HFXO64M_INTPEND_ERRORDETECTOR_Msk (0x1UL << HFXO64M_INTPEND_ERRORDETECTOR_Pos) /*!< Bit mask of ERRORDETECTOR field. */
  #define HFXO64M_INTPEND_ERRORDETECTOR_Min (0x0UL)  /*!< Min enumerator value of ERRORDETECTOR field.                         */
  #define HFXO64M_INTPEND_ERRORDETECTOR_Max (0x1UL)  /*!< Max enumerator value of ERRORDETECTOR field.                         */
  #define HFXO64M_INTPEND_ERRORDETECTOR_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define HFXO64M_INTPEND_ERRORDETECTOR_Pending (0x1UL) /*!< Read: Pending                                                     */


/* HFXO64M_STATUS: HFXO64M status */
  #define HFXO64M_STATUS_ResetValue (0x00000000UL)   /*!< Reset value of STATUS register.                                      */

/* MODE @Bit 0 : Current mode */
  #define HFXO64M_STATUS_MODE_Pos (0UL)              /*!< Position of MODE field.                                              */
  #define HFXO64M_STATUS_MODE_Msk (0x1UL << HFXO64M_STATUS_MODE_Pos) /*!< Bit mask of MODE field.                              */
  #define HFXO64M_STATUS_MODE_Min (0x0UL)            /*!< Min enumerator value of MODE field.                                  */
  #define HFXO64M_STATUS_MODE_Max (0x1UL)            /*!< Max enumerator value of MODE field.                                  */
  #define HFXO64M_STATUS_MODE_Normal (0x0UL)         /*!< Normal HFXO64M mode                                                  */
  #define HFXO64M_STATUS_MODE_TCXO (0x1UL)           /*!< External TCXO used, HFXO64M core is bypassed                         */

/* RUNNING @Bit 4 : HFXO64M running status */
  #define HFXO64M_STATUS_RUNNING_Pos (4UL)           /*!< Position of RUNNING field.                                           */
  #define HFXO64M_STATUS_RUNNING_Msk (0x1UL << HFXO64M_STATUS_RUNNING_Pos) /*!< Bit mask of RUNNING field.                     */
  #define HFXO64M_STATUS_RUNNING_Min (0x0UL)         /*!< Min enumerator value of RUNNING field.                               */
  #define HFXO64M_STATUS_RUNNING_Max (0x1UL)         /*!< Max enumerator value of RUNNING field.                               */
  #define HFXO64M_STATUS_RUNNING_NotRunning (0x0UL)  /*!< HFXO64M not running                                                  */
  #define HFXO64M_STATUS_RUNNING_Running (0x1UL)     /*!< HFXO64M running                                                      */


/* HFXO64M_STATUSANA: Status of analog module output signals */
  #define HFXO64M_STATUSANA_ResetValue (0x00000000UL) /*!< Reset value of STATUSANA register.                                  */

/* CURRENTCOMPARISON @Bit 0 : Current value of the CURRENT_COMPARISON from the analog module */
  #define HFXO64M_STATUSANA_CURRENTCOMPARISON_Pos (0UL) /*!< Position of CURRENTCOMPARISON field.                              */
  #define HFXO64M_STATUSANA_CURRENTCOMPARISON_Msk (0x1UL << HFXO64M_STATUSANA_CURRENTCOMPARISON_Pos) /*!< Bit mask of
                                                                            CURRENTCOMPARISON field.*/                            

/* DETECTOR1 @Bit 1 : Current value of the DETECTOR1 signal from the analog module */
  #define HFXO64M_STATUSANA_DETECTOR1_Pos (1UL)      /*!< Position of DETECTOR1 field.                                         */
  #define HFXO64M_STATUSANA_DETECTOR1_Msk (0x1UL << HFXO64M_STATUSANA_DETECTOR1_Pos) /*!< Bit mask of DETECTOR1 field.         */

/* DETECTOR2 @Bit 2 : Current value of the DETECTOR2 signal from the analog module */
  #define HFXO64M_STATUSANA_DETECTOR2_Pos (2UL)      /*!< Position of DETECTOR2 field.                                         */
  #define HFXO64M_STATUSANA_DETECTOR2_Msk (0x1UL << HFXO64M_STATUSANA_DETECTOR2_Pos) /*!< Bit mask of DETECTOR2 field.         */


/* HFXO64M_STATUSMMI: MMI internal values for debug use. */
  #define HFXO64M_STATUSMMI_ResetValue (0x00000000UL) /*!< Reset value of STATUSMMI register.                                  */

/* FSMSTATE @Bits 0..4 : FSM current state. Value must be checked against RTL. */
  #define HFXO64M_STATUSMMI_FSMSTATE_Pos (0UL)       /*!< Position of FSMSTATE field.                                          */
  #define HFXO64M_STATUSMMI_FSMSTATE_Msk (0x1FUL << HFXO64M_STATUSMMI_FSMSTATE_Pos) /*!< Bit mask of FSMSTATE field.           */

/* TSENABLE @Bit 5 : TS_ENABLE analog IP pin status. Tells if TS is running. */
  #define HFXO64M_STATUSMMI_TSENABLE_Pos (5UL)       /*!< Position of TSENABLE field.                                          */
  #define HFXO64M_STATUSMMI_TSENABLE_Msk (0x1UL << HFXO64M_STATUSMMI_TSENABLE_Pos) /*!< Bit mask of TSENABLE field.            */


/* HFXO64M_MIRROR: Enable LOCK for mirrored registers */
  #define HFXO64M_MIRROR_ResetValue (0x00000001UL)   /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define HFXO64M_MIRROR_LOCK_Pos (0UL)              /*!< Position of LOCK field.                                              */
  #define HFXO64M_MIRROR_LOCK_Msk (0x1UL << HFXO64M_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                              */
  #define HFXO64M_MIRROR_LOCK_Min (0x0UL)            /*!< Min enumerator value of LOCK field.                                  */
  #define HFXO64M_MIRROR_LOCK_Max (0x1UL)            /*!< Max enumerator value of LOCK field.                                  */
  #define HFXO64M_MIRROR_LOCK_Disabled (0x0UL)       /*!< Lock disabled                                                        */
  #define HFXO64M_MIRROR_LOCK_Enabled (0x1UL)        /*!< Lock enabled                                                         */


