adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* HFXO64M_PWRUPCTRL: Power up control */
  #define HFXO64M_PWRUPCTRL_ResetValue (0x00000002UL) /*!< Reset value of PWRUPCTRL register.                                  */

/* CTRL @Bits 0..1 : Power up control */
  #define HFXO64M_PWRUPCTRL_CTRL_Pos (0UL)           /*!< Position of CTRL field.                                              */
  #define HFXO64M_PWRUPCTRL_CTRL_Msk (0x3UL << HFXO64M_PWRUPCTRL_CTRL_Pos) /*!< Bit mask of CTRL field.                        */
  #define HFXO64M_PWRUPCTRL_CTRL_Min (0x0UL)         /*!< Min enumerator value of CTRL field.                                  */
  #define HFXO64M_PWRUPCTRL_CTRL_Max (0x2UL)         /*!< Max enumerator value of CTRL field.                                  */
  #define HFXO64M_PWRUPCTRL_CTRL_Auto (0x0UL)        /*!< Automatically handled by the peripheral                              */
  #define HFXO64M_PWRUPCTRL_CTRL_PowerUp (0x1UL)     /*!< Power up                                                             */
  #define HFXO64M_PWRUPCTRL_CTRL_PowerDown (0x2UL)   /*!< Power down                                                           */


/* HFXO64M_MODE: HFXO64M mode */
  #define HFXO64M_MODE_ResetValue (0x00000000UL)     /*!< Reset value of MODE register.                                        */

/* MODE @Bit 0 : Mode */
  #define HFXO64M_MODE_MODE_Pos (0UL)                /*!< Position of MODE field.                                              */
  #define HFXO64M_MODE_MODE_Msk (0x1UL << HFXO64M_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                  */
  #define HFXO64M_MODE_MODE_Min (0x0UL)              /*!< Min enumerator value of MODE field.                                  */
  #define HFXO64M_MODE_MODE_Max (0x1UL)              /*!< Max enumerator value of MODE field.                                  */
  #define HFXO64M_MODE_MODE_Normal (0x0UL)           /*!< Normal operating mode                                                */
  #define HFXO64M_MODE_MODE_TCXO (0x1UL)             /*!< TCXO/bypass mode                                                     */


/* HFXO64M_XTALSETTLETIME: Settle time of the crystal. List of pre-coded times. */
  #define HFXO64M_XTALSETTLETIME_ResetValue (0x00000003UL) /*!< Reset value of XTALSETTLETIME register.                        */

/* VAL @Bits 0..3 : (unspecified) */
  #define HFXO64M_XTALSETTLETIME_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define HFXO64M_XTALSETTLETIME_VAL_Msk (0xFUL << HFXO64M_XTALSETTLETIME_VAL_Pos) /*!< Bit mask of VAL field.                 */
  #define HFXO64M_XTALSETTLETIME_VAL_Min (0x0UL)     /*!< Min enumerator value of VAL field.                                   */
  #define HFXO64M_XTALSETTLETIME_VAL_Max (0xFUL)     /*!< Max enumerator value of VAL field.                                   */
  #define HFXO64M_XTALSETTLETIME_VAL_Settle250us (0x0UL) /*!< 250 us                                                           */
  #define HFXO64M_XTALSETTLETIME_VAL_Settle300us (0x1UL) /*!< 300 us                                                           */
  #define HFXO64M_XTALSETTLETIME_VAL_Settle350us (0x2UL) /*!< 350 us                                                           */
  #define HFXO64M_XTALSETTLETIME_VAL_Settle400us (0x3UL) /*!< 400 us                                                           */
  #define HFXO64M_XTALSETTLETIME_VAL_Settle500us (0x4UL) /*!< 500 us                                                           */
  #define HFXO64M_XTALSETTLETIME_VAL_Settle600us (0x5UL) /*!< 600 us                                                           */
  #define HFXO64M_XTALSETTLETIME_VAL_Settle700us (0x6UL) /*!< 700 us                                                           */
  #define HFXO64M_XTALSETTLETIME_VAL_Settle800us (0x7UL) /*!< 800 us                                                           */
  #define HFXO64M_XTALSETTLETIME_VAL_Settle1000us (0x8UL) /*!< 1000 us                                                         */
  #define HFXO64M_XTALSETTLETIME_VAL_Settle2000us (0x9UL) /*!< 2000 us                                                         */
  #define HFXO64M_XTALSETTLETIME_VAL_Settle3000us (0xAUL) /*!< 3000 us                                                         */
  #define HFXO64M_XTALSETTLETIME_VAL_Settle4000us (0xBUL) /*!< 4000 us                                                         */
  #define HFXO64M_XTALSETTLETIME_VAL_Settle5000us (0xCUL) /*!< 5000 us                                                         */
  #define HFXO64M_XTALSETTLETIME_VAL_Settle6000us (0xDUL) /*!< 6000 us                                                         */
  #define HFXO64M_XTALSETTLETIME_VAL_Settle7000us (0xEUL) /*!< 7000 us                                                         */
  #define HFXO64M_XTALSETTLETIME_VAL_Settle8500us (0xFUL) /*!< 8500 us                                                         */


/* HFXO64M_CHIRPTIME: Chirp period length. List of pre-coded times. */
  #define HFXO64M_CHIRPTIME_ResetValue (0x00000003UL) /*!< Reset value of CHIRPTIME register.                                  */

/* VAL @Bits 0..3 : (unspecified) */
  #define HFXO64M_CHIRPTIME_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define HFXO64M_CHIRPTIME_VAL_Msk (0xFUL << HFXO64M_CHIRPTIME_VAL_Pos) /*!< Bit mask of VAL field.                           */
  #define HFXO64M_CHIRPTIME_VAL_Min (0x0UL)          /*!< Min enumerator value of VAL field.                                   */
  #define HFXO64M_CHIRPTIME_VAL_Max (0xFUL)          /*!< Max enumerator value of VAL field.                                   */
  #define HFXO64M_CHIRPTIME_VAL_Chirp32us (0x0UL)    /*!< 32.0 us                                                              */
  #define HFXO64M_CHIRPTIME_VAL_Chirp40us (0x1UL)    /*!< 40.3 us                                                              */
  #define HFXO64M_CHIRPTIME_VAL_Chirp48us (0x2UL)    /*!< 48.5 us                                                              */
  #define HFXO64M_CHIRPTIME_VAL_Chirp56us (0x3UL)    /*!< 56.8 us                                                              */
  #define HFXO64M_CHIRPTIME_VAL_Chirp65us (0x4UL)    /*!< 65.1 us                                                              */
  #define HFXO64M_CHIRPTIME_VAL_Chirp73us (0x5UL)    /*!< 73.3 us                                                              */
  #define HFXO64M_CHIRPTIME_VAL_Chirp81us (0x6UL)    /*!< 81.6 us                                                              */
  #define HFXO64M_CHIRPTIME_VAL_Chirp89us (0x7UL)    /*!< 89.9 us                                                              */
  #define HFXO64M_CHIRPTIME_VAL_Chirp98us (0x8UL)    /*!< 98.1 us                                                              */
  #define HFXO64M_CHIRPTIME_VAL_Chirp106us (0x9UL)   /*!< 106.4 us                                                             */
  #define HFXO64M_CHIRPTIME_VAL_Chirp114us (0xAUL)   /*!< 114.7 us                                                             */
  #define HFXO64M_CHIRPTIME_VAL_Chirp122us (0xBUL)   /*!< 122.9 us                                                             */
  #define HFXO64M_CHIRPTIME_VAL_Chirp131us (0xCUL)   /*!< 131.2 us                                                             */
  #define HFXO64M_CHIRPTIME_VAL_Chirp139us (0xDUL)   /*!< 139.5 us                                                             */
  #define HFXO64M_CHIRPTIME_VAL_Chirp147us (0xEUL)   /*!< 147.7 us                                                             */
  #define HFXO64M_CHIRPTIME_VAL_Chirp156us (0xFUL)   /*!< 156.0 us                                                             */


/* HFXO64M_ENABLEDAMPING: Enables the MMI to do crystal damping when stopping the oscillator. */
  #define HFXO64M_ENABLEDAMPING_ResetValue (0x00000000UL) /*!< Reset value of ENABLEDAMPING register.                          */

