adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_ENABLEDAMPING_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define HFXO64M_ENABLEDAMPING_VAL_Msk (0x1UL << HFXO64M_ENABLEDAMPING_VAL_Pos) /*!< Bit mask of VAL field.                   */
  #define HFXO64M_ENABLEDAMPING_VAL_Min (0x0UL)      /*!< Min enumerator value of VAL field.                                   */
  #define HFXO64M_ENABLEDAMPING_VAL_Max (0x1UL)      /*!< Max enumerator value of VAL field.                                   */
  #define HFXO64M_ENABLEDAMPING_VAL_Disabled (0x0UL) /*!< Disabled                                                             */
  #define HFXO64M_ENABLEDAMPING_VAL_Enabled (0x1UL)  /*!< Enabled                                                              */


/* HFXO64M_FORCEBUFF: Enables all clock buffers when sinOut4_ana buffer is enabled. */
  #define HFXO64M_FORCEBUFF_ResetValue (0x00000000UL) /*!< Reset value of FORCEBUFF register.                                  */

/* VAL @Bit 0 : (unspecified) */
  #define HFXO64M_FORCEBUFF_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define HFXO64M_FORCEBUFF_VAL_Msk (0x1UL << HFXO64M_FORCEBUFF_VAL_Pos) /*!< Bit mask of VAL field.                           */
  #define HFXO64M_FORCEBUFF_VAL_Min (0x0UL)          /*!< Min enumerator value of VAL field.                                   */
  #define HFXO64M_FORCEBUFF_VAL_Max (0x1UL)          /*!< Max enumerator value of VAL field.                                   */
  #define HFXO64M_FORCEBUFF_VAL_Disabled (0x0UL)     /*!< Disabled                                                             */
  #define HFXO64M_FORCEBUFF_VAL_Enabled (0x1UL)      /*!< Enabled                                                              */


/* HFXO64M_CFG: Direct HFXO64M static configurations. */
  #define HFXO64M_CFG_ResetValue (0x00010072UL)      /*!< Reset value of CFG register.                                         */

/* LEVELSELECT @Bit 0 : Select for AREG level */
  #define HFXO64M_CFG_LEVELSELECT_Pos (0UL)          /*!< Position of LEVELSELECT field.                                       */
  #define HFXO64M_CFG_LEVELSELECT_Msk (0x1UL << HFXO64M_CFG_LEVELSELECT_Pos) /*!< Bit mask of LEVELSELECT field.               */
  #define HFXO64M_CFG_LEVELSELECT_Min (0x0UL)        /*!< Min enumerator value of LEVELSELECT field.                           */
  #define HFXO64M_CFG_LEVELSELECT_Max (0x1UL)        /*!< Max enumerator value of LEVELSELECT field.                           */
  #define HFXO64M_CFG_LEVELSELECT_High (0x0UL)       /*!< Normal, high amplitude                                               */
  #define HFXO64M_CFG_LEVELSELECT_Low (0x1UL)        /*!< Low power, low amplitude                                             */

/* ENABLENORMALBIASMODE @Bit 1 : Enable for normal bias mode. */
  #define HFXO64M_CFG_ENABLENORMALBIASMODE_Pos (1UL) /*!< Position of ENABLENORMALBIASMODE field.                              */
  #define HFXO64M_CFG_ENABLENORMALBIASMODE_Msk (0x1UL << HFXO64M_CFG_ENABLENORMALBIASMODE_Pos) /*!< Bit mask of
                                                                            ENABLENORMALBIASMODE field.*/                         
  #define HFXO64M_CFG_ENABLENORMALBIASMODE_Min (0x0UL) /*!< Min enumerator value of ENABLENORMALBIASMODE field.                */
  #define HFXO64M_CFG_ENABLENORMALBIASMODE_Max (0x1UL) /*!< Max enumerator value of ENABLENORMALBIASMODE field.                */
  #define HFXO64M_CFG_ENABLENORMALBIASMODE_Low (0x0UL) /*!< Low power bias mode                                                */
  #define HFXO64M_CFG_ENABLENORMALBIASMODE_Normal (0x1UL) /*!< Normal bias mode                                                */

/* BYPASSREG0V8 @Bit 2 : 0V8 regulator bypass control. */
  #define HFXO64M_CFG_BYPASSREG0V8_Pos (2UL)         /*!< Position of BYPASSREG0V8 field.                                      */
  #define HFXO64M_CFG_BYPASSREG0V8_Msk (0x1UL << HFXO64M_CFG_BYPASSREG0V8_Pos) /*!< Bit mask of BYPASSREG0V8 field.            */
  #define HFXO64M_CFG_BYPASSREG0V8_Min (0x0UL)       /*!< Min enumerator value of BYPASSREG0V8 field.                          */
  #define HFXO64M_CFG_BYPASSREG0V8_Max (0x1UL)       /*!< Max enumerator value of BYPASSREG0V8 field.                          */
  #define HFXO64M_CFG_BYPASSREG0V8_Normal (0x0UL)    /*!< Normal                                                               */
  #define HFXO64M_CFG_BYPASSREG0V8_Bypass (0x1UL)    /*!< Bypass                                                               */

/* BYPASSREG1V5 @Bit 3 : 1V5 regulator bypass control. */
  #define HFXO64M_CFG_BYPASSREG1V5_Pos (3UL)         /*!< Position of BYPASSREG1V5 field.                                      */
  #define HFXO64M_CFG_BYPASSREG1V5_Msk (0x1UL << HFXO64M_CFG_BYPASSREG1V5_Pos) /*!< Bit mask of BYPASSREG1V5 field.            */
  #define HFXO64M_CFG_BYPASSREG1V5_Min (0x0UL)       /*!< Min enumerator value of BYPASSREG1V5 field.                          */
  #define HFXO64M_CFG_BYPASSREG1V5_Max (0x1UL)       /*!< Max enumerator value of BYPASSREG1V5 field.                          */
  #define HFXO64M_CFG_BYPASSREG1V5_Normal (0x0UL)    /*!< Normal                                                               */
  #define HFXO64M_CFG_BYPASSREG1V5_Bypass (0x1UL)    /*!< Bypass                                                               */

/* ENABLECMOS1DIVIDER @Bit 4 : CMOSOUT1 clock divider enable. */
  #define HFXO64M_CFG_ENABLECMOS1DIVIDER_Pos (4UL)   /*!< Position of ENABLECMOS1DIVIDER field.                                */
  #define HFXO64M_CFG_ENABLECMOS1DIVIDER_Msk (0x1UL << HFXO64M_CFG_ENABLECMOS1DIVIDER_Pos) /*!< Bit mask of ENABLECMOS1DIVIDER
                                                                            field.*/                                              
  #define HFXO64M_CFG_ENABLECMOS1DIVIDER_Min (0x0UL) /*!< Min enumerator value of ENABLECMOS1DIVIDER field.                    */
  #define HFXO64M_CFG_ENABLECMOS1DIVIDER_Max (0x1UL) /*!< Max enumerator value of ENABLECMOS1DIVIDER field.                    */
  #define HFXO64M_CFG_ENABLECMOS1DIVIDER_Disabled (0x0UL) /*!< Disabled                                                        */
  #define HFXO64M_CFG_ENABLECMOS1DIVIDER_Enabled (0x1UL) /*!< Enabled                                                          */

/* ENABLECMOS2DIVIDER @Bit 5 : CMOSOUT2 clock divider enable. */
  #define HFXO64M_CFG_ENABLECMOS2DIVIDER_Pos (5UL)   /*!< Position of ENABLECMOS2DIVIDER field.                                */
  #define HFXO64M_CFG_ENABLECMOS2DIVIDER_Msk (0x1UL << HFXO64M_CFG_ENABLECMOS2DIVIDER_Pos) /*!< Bit mask of ENABLECMOS2DIVIDER
                                                                            field.*/                                              
  #define HFXO64M_CFG_ENABLECMOS2DIVIDER_Min (0x0UL) /*!< Min enumerator value of ENABLECMOS2DIVIDER field.                    */
  #define HFXO64M_CFG_ENABLECMOS2DIVIDER_Max (0x1UL) /*!< Max enumerator value of ENABLECMOS2DIVIDER field.                    */
  #define HFXO64M_CFG_ENABLECMOS2DIVIDER_Disabled (0x0UL) /*!< Disabled                                                        */
  #define HFXO64M_CFG_ENABLECMOS2DIVIDER_Enabled (0x1UL) /*!< Enabled                                                          */

/* ENABLECMOS3DIVIDER @Bit 6 : CMOSOUT3 clock divider enable. */
  #define HFXO64M_CFG_ENABLECMOS3DIVIDER_Pos (6UL)   /*!< Position of ENABLECMOS3DIVIDER field.                                */
  #define HFXO64M_CFG_ENABLECMOS3DIVIDER_Msk (0x1UL << HFXO64M_CFG_ENABLECMOS3DIVIDER_Pos) /*!< Bit mask of ENABLECMOS3DIVIDER
                                                                            field.*/                                              
  #define HFXO64M_CFG_ENABLECMOS3DIVIDER_Min (0x0UL) /*!< Min enumerator value of ENABLECMOS3DIVIDER field.                    */
  #define HFXO64M_CFG_ENABLECMOS3DIVIDER_Max (0x1UL) /*!< Max enumerator value of ENABLECMOS3DIVIDER field.                    */
  #define HFXO64M_CFG_ENABLECMOS3DIVIDER_Disabled (0x0UL) /*!< Disabled                                                        */
  #define HFXO64M_CFG_ENABLECMOS3DIVIDER_Enabled (0x1UL) /*!< Enabled                                                          */

/* ENABLETSDIVIDER @Bit 7 : TS clock divider enable. */
  #define HFXO64M_CFG_ENABLETSDIVIDER_Pos (7UL)      /*!< Position of ENABLETSDIVIDER field.                                   */
  #define HFXO64M_CFG_ENABLETSDIVIDER_Msk (0x1UL << HFXO64M_CFG_ENABLETSDIVIDER_Pos) /*!< Bit mask of ENABLETSDIVIDER field.   */
  #define HFXO64M_CFG_ENABLETSDIVIDER_Min (0x0UL)    /*!< Min enumerator value of ENABLETSDIVIDER field.                       */
  #define HFXO64M_CFG_ENABLETSDIVIDER_Max (0x1UL)    /*!< Max enumerator value of ENABLETSDIVIDER field.                       */
  #define HFXO64M_CFG_ENABLETSDIVIDER_Disabled (0x0UL) /*!< Disabled                                                           */
  #define HFXO64M_CFG_ENABLETSDIVIDER_Enabled (0x1UL) /*!< Enabled                                                             */

/* BUFFDRIVECMOS1 @Bits 8..9 : Buffer drive configuration for CMOS_OUT1 */
  #define HFXO64M_CFG_BUFFDRIVECMOS1_Pos (8UL)       /*!< Position of BUFFDRIVECMOS1 field.                                    */
  #define HFXO64M_CFG_BUFFDRIVECMOS1_Msk (0x3UL << HFXO64M_CFG_BUFFDRIVECMOS1_Pos) /*!< Bit mask of BUFFDRIVECMOS1 field.      */

