adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* BUFFDRIVECMOS2 @Bits 10..11 : Buffer drive configuration for CMOS_OUT2 */
  #define HFXO64M_CFG_BUFFDRIVECMOS2_Pos (10UL)      /*!< Position of BUFFDRIVECMOS2 field.                                    */
  #define HFXO64M_CFG_BUFFDRIVECMOS2_Msk (0x3UL << HFXO64M_CFG_BUFFDRIVECMOS2_Pos) /*!< Bit mask of BUFFDRIVECMOS2 field.      */

/* BUFFDRIVECMOS3 @Bits 12..13 : Buffer drive configuration for CMOS_OUT3 */
  #define HFXO64M_CFG_BUFFDRIVECMOS3_Pos (12UL)      /*!< Position of BUFFDRIVECMOS3 field.                                    */
  #define HFXO64M_CFG_BUFFDRIVECMOS3_Msk (0x3UL << HFXO64M_CFG_BUFFDRIVECMOS3_Pos) /*!< Bit mask of BUFFDRIVECMOS3 field.      */

/* BUFFDRIVETS @Bits 14..15 : Buffer drive configuration for TS clock */
  #define HFXO64M_CFG_BUFFDRIVETS_Pos (14UL)         /*!< Position of BUFFDRIVETS field.                                       */
  #define HFXO64M_CFG_BUFFDRIVETS_Msk (0x3UL << HFXO64M_CFG_BUFFDRIVETS_Pos) /*!< Bit mask of BUFFDRIVETS field.               */

/* CHIRPEN @Bit 16 : Enable chirp during the HFXO64 startup. */
  #define HFXO64M_CFG_CHIRPEN_Pos (16UL)             /*!< Position of CHIRPEN field.                                           */
  #define HFXO64M_CFG_CHIRPEN_Msk (0x1UL << HFXO64M_CFG_CHIRPEN_Pos) /*!< Bit mask of CHIRPEN field.                           */
  #define HFXO64M_CFG_CHIRPEN_Min (0x0UL)            /*!< Min enumerator value of CHIRPEN field.                               */
  #define HFXO64M_CFG_CHIRPEN_Max (0x1UL)            /*!< Max enumerator value of CHIRPEN field.                               */
  #define HFXO64M_CFG_CHIRPEN_Disabled (0x0UL)       /*!< Chirp disabled                                                       */
  #define HFXO64M_CFG_CHIRPEN_Enabled (0x1UL)        /*!< Chirp enabled                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           HSFLL                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct HSFLL_CONFIG =================================================== */
/**
  * @brief CONFIG [HSFLL_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000000) HSFLL configuration                                   */
} NRF_HSFLL_CONFIG_Type;                             /*!< Size = 4 (0x004)                                                     */

/* HSFLL_CONFIG_CFG: HSFLL configuration */
  #define HSFLL_CONFIG_CFG_ResetValue (0x00000000UL) /*!< Reset value of CFG register.                                         */

/* CFG @Bits 0..3 : Signal CFG[3:0] of analog module */
  #define HSFLL_CONFIG_CFG_CFG_Pos (0UL)             /*!< Position of CFG field.                                               */
  #define HSFLL_CONFIG_CFG_CFG_Msk (0xFUL << HSFLL_CONFIG_CFG_CFG_Pos) /*!< Bit mask of CFG field.                             */



/* =================================================== Struct HSFLL_FREQM ==================================================== */
/**
  * @brief FREQM [HSFLL_FREQM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  DONE;                              /*!< (@ 0x00000000) Frequency measurement done status                     */
  __IM  uint32_t  ERROR;                             /*!< (@ 0x00000004) Frequency measurement error status                    */
  __IM  uint32_t  MEAS;                              /*!< (@ 0x00000008) Frequency measurement                                 */
} NRF_HSFLL_FREQM_Type;                              /*!< Size = 12 (0x00C)                                                    */

/* HSFLL_FREQM_DONE: Frequency measurement done status */
  #define HSFLL_FREQM_DONE_ResetValue (0x00000000UL) /*!< Reset value of DONE register.                                        */

/* DONE @Bit 0 : Measurement done. */
  #define HSFLL_FREQM_DONE_DONE_Pos (0UL)            /*!< Position of DONE field.                                              */
  #define HSFLL_FREQM_DONE_DONE_Msk (0x1UL << HSFLL_FREQM_DONE_DONE_Pos) /*!< Bit mask of DONE field.                          */
  #define HSFLL_FREQM_DONE_DONE_Min (0x0UL)          /*!< Min enumerator value of DONE field.                                  */
  #define HSFLL_FREQM_DONE_DONE_Max (0x1UL)          /*!< Max enumerator value of DONE field.                                  */
  #define HSFLL_FREQM_DONE_DONE_InProgress (0x0UL)   /*!< Frequency measurement is in progress.                                */
  #define HSFLL_FREQM_DONE_DONE_Completed (0x1UL)    /*!< Frequency measurement is completed.                                  */


/* HSFLL_FREQM_ERROR: Frequency measurement error status */
  #define HSFLL_FREQM_ERROR_ResetValue (0x00000000UL) /*!< Reset value of ERROR register.                                      */

/* ERROR @Bit 0 : Error status. */
  #define HSFLL_FREQM_ERROR_ERROR_Pos (0UL)          /*!< Position of ERROR field.                                             */
  #define HSFLL_FREQM_ERROR_ERROR_Msk (0x1UL << HSFLL_FREQM_ERROR_ERROR_Pos) /*!< Bit mask of ERROR field.                     */
  #define HSFLL_FREQM_ERROR_ERROR_Min (0x0UL)        /*!< Min enumerator value of ERROR field.                                 */
  #define HSFLL_FREQM_ERROR_ERROR_Max (0x1UL)        /*!< Max enumerator value of ERROR field.                                 */
  #define HSFLL_FREQM_ERROR_ERROR_OutsideLimit (0x1UL) /*!< Frequency exceeded the accuracy 2 percent in closed loop mode.     */
  #define HSFLL_FREQM_ERROR_ERROR_WithinLimit (0x0UL) /*!< Frequency stayed within accuracy 2 percent in closed loop mode.     */


/* HSFLL_FREQM_MEAS: Frequency measurement */
  #define HSFLL_FREQM_MEAS_ResetValue (0x00000000UL) /*!< Reset value of MEAS register.                                        */

