adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VALUE @Bits 0..10 : Last frequency measurement value. */
  #define HSFLL_FREQM_MEAS_VALUE_Pos (0UL)           /*!< Position of VALUE field.                                             */
  #define HSFLL_FREQM_MEAS_VALUE_Msk (0x7FFUL << HSFLL_FREQM_MEAS_VALUE_Pos) /*!< Bit mask of VALUE field.                     */



/* ==================================================== Struct HSFLL_TRIM ==================================================== */
/**
  * @brief TRIM [HSFLL_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  VSUP;                              /*!< (@ 0x00000000) Internal regulator voltage supply level trimming      */
  __IOM uint32_t  COARSE;                            /*!< (@ 0x00000004) Coarse frequency trimming                             */
  __IOM uint32_t  FINE;                              /*!< (@ 0x00000008) Fine frequency trimming                               */
  __IM  uint32_t  RESERVED;
} NRF_HSFLL_TRIM_Type;                               /*!< Size = 16 (0x010)                                                    */

/* HSFLL_TRIM_VSUP: Internal regulator voltage supply level trimming */
  #define HSFLL_TRIM_VSUP_ResetValue (0x00000010UL)  /*!< Reset value of VSUP register.                                        */

/* VALUE @Bits 0..4 : Trim value */
  #define HSFLL_TRIM_VSUP_VALUE_Pos (0UL)            /*!< Position of VALUE field.                                             */
  #define HSFLL_TRIM_VSUP_VALUE_Msk (0x1FUL << HSFLL_TRIM_VSUP_VALUE_Pos) /*!< Bit mask of VALUE field.                        */


/* HSFLL_TRIM_COARSE: Coarse frequency trimming */
  #define HSFLL_TRIM_COARSE_ResetValue (0x00000004UL) /*!< Reset value of COARSE register.                                     */

/* VALUE @Bits 0..9 : Coarse frequency trimming value. */
  #define HSFLL_TRIM_COARSE_VALUE_Pos (0UL)          /*!< Position of VALUE field.                                             */
  #define HSFLL_TRIM_COARSE_VALUE_Msk (0x3FFUL << HSFLL_TRIM_COARSE_VALUE_Pos) /*!< Bit mask of VALUE field.                   */


/* HSFLL_TRIM_FINE: Fine frequency trimming */
  #define HSFLL_TRIM_FINE_ResetValue (0x0000001EUL)  /*!< Reset value of FINE register.                                        */

/* VALUE @Bits 0..10 : Fine frequency trimming value */
  #define HSFLL_TRIM_FINE_VALUE_Pos (0UL)            /*!< Position of VALUE field.                                             */
  #define HSFLL_TRIM_FINE_VALUE_Msk (0x7FFUL << HSFLL_TRIM_FINE_VALUE_Pos) /*!< Bit mask of VALUE field.                       */



/* ================================================= Struct HSFLL_CLOCKCTRL ================================================== */
/**
  * @brief CLOCKCTRL [HSFLL_CLOCKCTRL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MODE;                              /*!< (@ 0x00000000) Clock control                                         */
  __IOM uint32_t  DITHERING;                         /*!< (@ 0x00000004) Clock dithering configuration                         */
  __IOM uint32_t  MULT;                              /*!< (@ 0x00000008) Multiplication factor                                 */
  __IOM uint32_t  SLEEP;                             /*!< (@ 0x0000000C) Sleep configuration                                   */
  __IOM uint32_t  RETAINFINETRIM;                    /*!< (@ 0x00000010) Fine trim retain control                              */
  __IOM uint32_t  OVERRIDELOCKED;                    /*!< (@ 0x00000014) Override the LOCKED signal                            */
  __IOM uint32_t  DITHERINIT;                        /*!< (@ 0x00000018) Clock dithering, configurable seed                    */
} NRF_HSFLL_CLOCKCTRL_Type;                          /*!< Size = 28 (0x01C)                                                    */

/* HSFLL_CLOCKCTRL_MODE: Clock control */
  #define HSFLL_CLOCKCTRL_MODE_ResetValue (0x00000000UL) /*!< Reset value of MODE register.                                    */

/* MODE @Bits 0..1 : The HSFLL operating mode. */
  #define HSFLL_CLOCKCTRL_MODE_MODE_Pos (0UL)        /*!< Position of MODE field.                                              */
  #define HSFLL_CLOCKCTRL_MODE_MODE_Msk (0x3UL << HSFLL_CLOCKCTRL_MODE_MODE_Pos) /*!< Bit mask of MODE field.                  */
  #define HSFLL_CLOCKCTRL_MODE_MODE_Min (0x0UL)      /*!< Min enumerator value of MODE field.                                  */
  #define HSFLL_CLOCKCTRL_MODE_MODE_Max (0x3UL)      /*!< Max enumerator value of MODE field.                                  */
  #define HSFLL_CLOCKCTRL_MODE_MODE_Auto (0x0UL)     /*!< The PCGC controls the mode automatically.                            */
  #define HSFLL_CLOCKCTRL_MODE_MODE_OpenLoop (0x1UL) /*!< Open loop mode.                                                      */
  #define HSFLL_CLOCKCTRL_MODE_MODE_ClosedLoop (0x2UL) /*!< Closed loop mode.                                                  */
  #define HSFLL_CLOCKCTRL_MODE_MODE_Bypass (0x3UL)   /*!< Bypass mode.                                                         */

/* OVERRIDE @Bit 4 : HSFLL override mode. */
  #define HSFLL_CLOCKCTRL_MODE_OVERRIDE_Pos (4UL)    /*!< Position of OVERRIDE field.                                          */
  #define HSFLL_CLOCKCTRL_MODE_OVERRIDE_Msk (0x1UL << HSFLL_CLOCKCTRL_MODE_OVERRIDE_Pos) /*!< Bit mask of OVERRIDE field.      */
  #define HSFLL_CLOCKCTRL_MODE_OVERRIDE_Min (0x0UL)  /*!< Min enumerator value of OVERRIDE field.                              */
  #define HSFLL_CLOCKCTRL_MODE_OVERRIDE_Max (0x1UL)  /*!< Max enumerator value of OVERRIDE field.                              */
  #define HSFLL_CLOCKCTRL_MODE_OVERRIDE_Disabled (0x0UL) /*!< Override mode disabled.                                          */
  #define HSFLL_CLOCKCTRL_MODE_OVERRIDE_Enabled (0x1UL) /*!< Override mode enabled.                                            */


/* HSFLL_CLOCKCTRL_DITHERING: Clock dithering configuration */
  #define HSFLL_CLOCKCTRL_DITHERING_ResetValue (0x00000000UL) /*!< Reset value of DITHERING register.                          */

/* CYCLECOUNT @Bits 0..2 : Cycle count configuration for clock dithering */
  #define HSFLL_CLOCKCTRL_DITHERING_CYCLECOUNT_Pos (0UL) /*!< Position of CYCLECOUNT field.                                    */
  #define HSFLL_CLOCKCTRL_DITHERING_CYCLECOUNT_Msk (0x7UL << HSFLL_CLOCKCTRL_DITHERING_CYCLECOUNT_Pos) /*!< Bit mask of
                                                                            CYCLECOUNT field.*/                                   

/* MAXOFFSET @Bits 4..6 : Maximum offset configuration for clock dithering */
  #define HSFLL_CLOCKCTRL_DITHERING_MAXOFFSET_Pos (4UL) /*!< Position of MAXOFFSET field.                                      */
  #define HSFLL_CLOCKCTRL_DITHERING_MAXOFFSET_Msk (0x7UL << HSFLL_CLOCKCTRL_DITHERING_MAXOFFSET_Pos) /*!< Bit mask of MAXOFFSET
                                                                            field.*/                                              

