adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TASKS_STOP @Bit 0 : Stop the HSFLL */
  #define HSFLL_TASKS_STOP_TASKS_STOP_Pos (0UL)      /*!< Position of TASKS_STOP field.                                        */
  #define HSFLL_TASKS_STOP_TASKS_STOP_Msk (0x1UL << HSFLL_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.        */
  #define HSFLL_TASKS_STOP_TASKS_STOP_Min (0x1UL)    /*!< Min enumerator value of TASKS_STOP field.                            */
  #define HSFLL_TASKS_STOP_TASKS_STOP_Max (0x1UL)    /*!< Max enumerator value of TASKS_STOP field.                            */
  #define HSFLL_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* HSFLL_TASKS_SLEEP: Request the HSFLL into sleep mode */
  #define HSFLL_TASKS_SLEEP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SLEEP register.                                */

/* TASKS_SLEEP @Bit 0 : Request the HSFLL into sleep mode */
  #define HSFLL_TASKS_SLEEP_TASKS_SLEEP_Pos (0UL)    /*!< Position of TASKS_SLEEP field.                                       */
  #define HSFLL_TASKS_SLEEP_TASKS_SLEEP_Msk (0x1UL << HSFLL_TASKS_SLEEP_TASKS_SLEEP_Pos) /*!< Bit mask of TASKS_SLEEP field.   */
  #define HSFLL_TASKS_SLEEP_TASKS_SLEEP_Min (0x1UL)  /*!< Min enumerator value of TASKS_SLEEP field.                           */
  #define HSFLL_TASKS_SLEEP_TASKS_SLEEP_Max (0x1UL)  /*!< Max enumerator value of TASKS_SLEEP field.                           */
  #define HSFLL_TASKS_SLEEP_TASKS_SLEEP_Trigger (0x1UL) /*!< Trigger task                                                      */


/* HSFLL_TASKS_WAKEUP: Wakeup the HSFLL from sleep mode */
  #define HSFLL_TASKS_WAKEUP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_WAKEUP register.                              */

/* TASKS_WAKEUP @Bit 0 : Wakeup the HSFLL from sleep mode */
  #define HSFLL_TASKS_WAKEUP_TASKS_WAKEUP_Pos (0UL)  /*!< Position of TASKS_WAKEUP field.                                      */
  #define HSFLL_TASKS_WAKEUP_TASKS_WAKEUP_Msk (0x1UL << HSFLL_TASKS_WAKEUP_TASKS_WAKEUP_Pos) /*!< Bit mask of TASKS_WAKEUP
                                                                            field.*/                                              
  #define HSFLL_TASKS_WAKEUP_TASKS_WAKEUP_Min (0x1UL) /*!< Min enumerator value of TASKS_WAKEUP field.                         */
  #define HSFLL_TASKS_WAKEUP_TASKS_WAKEUP_Max (0x1UL) /*!< Max enumerator value of TASKS_WAKEUP field.                         */
  #define HSFLL_TASKS_WAKEUP_TASKS_WAKEUP_Trigger (0x1UL) /*!< Trigger task                                                    */


/* HSFLL_TASKS_FREQMEAS: Start frequency measurement in software-controlled mode */
  #define HSFLL_TASKS_FREQMEAS_ResetValue (0x00000000UL) /*!< Reset value of TASKS_FREQMEAS register.                          */

/* TASKS_FREQMEAS @Bit 0 : Start frequency measurement in software-controlled mode */
  #define HSFLL_TASKS_FREQMEAS_TASKS_FREQMEAS_Pos (0UL) /*!< Position of TASKS_FREQMEAS field.                                 */
  #define HSFLL_TASKS_FREQMEAS_TASKS_FREQMEAS_Msk (0x1UL << HSFLL_TASKS_FREQMEAS_TASKS_FREQMEAS_Pos) /*!< Bit mask of
                                                                            TASKS_FREQMEAS field.*/                               
  #define HSFLL_TASKS_FREQMEAS_TASKS_FREQMEAS_Min (0x1UL) /*!< Min enumerator value of TASKS_FREQMEAS field.                   */
  #define HSFLL_TASKS_FREQMEAS_TASKS_FREQMEAS_Max (0x1UL) /*!< Max enumerator value of TASKS_FREQMEAS field.                   */
  #define HSFLL_TASKS_FREQMEAS_TASKS_FREQMEAS_Trigger (0x1UL) /*!< Trigger task                                                */


/* HSFLL_TASKS_FREQCHANGE: Trigger frequency change */
  #define HSFLL_TASKS_FREQCHANGE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_FREQCHANGE register.                      */

/* TASKS_FREQCHANGE @Bit 0 : Trigger frequency change */
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Pos (0UL) /*!< Position of TASKS_FREQCHANGE field.                           */
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Msk (0x1UL << HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Pos) /*!< Bit mask of
                                                                            TASKS_FREQCHANGE field.*/                             
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Min (0x1UL) /*!< Min enumerator value of TASKS_FREQCHANGE field.             */
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Max (0x1UL) /*!< Max enumerator value of TASKS_FREQCHANGE field.             */
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Trigger (0x1UL) /*!< Trigger task                                            */


/* HSFLL_EVENTS_STARTED: HSFLL started */
  #define HSFLL_EVENTS_STARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STARTED register.                          */

/* EVENTS_STARTED @Bit 0 : HSFLL started */
  #define HSFLL_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL) /*!< Position of EVENTS_STARTED field.                                 */
  #define HSFLL_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << HSFLL_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/                               
  #define HSFLL_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STARTED field.                   */
  #define HSFLL_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STARTED field.                   */
  #define HSFLL_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define HSFLL_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL) /*!< Event generated                                           */


/* HSFLL_EVENTS_STOPPED: HSFLL stopped */
  #define HSFLL_EVENTS_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STOPPED register.                          */

