adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* I2S_CONFIG_CLKCONFIG: Clock source selection for the I2S module */
  #define I2S_CONFIG_CLKCONFIG_ResetValue (0x00000000UL) /*!< Reset value of CLKCONFIG register.                               */

/* CLKSRC @Bit 0 : Clock source selection */
  #define I2S_CONFIG_CLKCONFIG_CLKSRC_Pos (0UL)      /*!< Position of CLKSRC field.                                            */
  #define I2S_CONFIG_CLKCONFIG_CLKSRC_Msk (0x1UL << I2S_CONFIG_CLKCONFIG_CLKSRC_Pos) /*!< Bit mask of CLKSRC field.            */
  #define I2S_CONFIG_CLKCONFIG_CLKSRC_Min (0x0UL)    /*!< Min enumerator value of CLKSRC field.                                */
  #define I2S_CONFIG_CLKCONFIG_CLKSRC_Max (0x1UL)    /*!< Max enumerator value of CLKSRC field.                                */
  #define I2S_CONFIG_CLKCONFIG_CLKSRC_PCLK32M (0x0UL) /*!< 32MHz peripheral clock                                              */
  #define I2S_CONFIG_CLKCONFIG_CLKSRC_ACLK (0x1UL)   /*!< Audio PLL clock                                                      */

/* BYPASS @Bit 8 : Bypass clock generator. MCK will be equal to source input. If bypass is enabled the MCKFREQ setting has no
                   effect. */                                                                                                     
                                                                                                                                  
  #define I2S_CONFIG_CLKCONFIG_BYPASS_Pos (8UL)      /*!< Position of BYPASS field.                                            */
  #define I2S_CONFIG_CLKCONFIG_BYPASS_Msk (0x1UL << I2S_CONFIG_CLKCONFIG_BYPASS_Pos) /*!< Bit mask of BYPASS field.            */
  #define I2S_CONFIG_CLKCONFIG_BYPASS_Min (0x0UL)    /*!< Min enumerator value of BYPASS field.                                */
  #define I2S_CONFIG_CLKCONFIG_BYPASS_Max (0x1UL)    /*!< Max enumerator value of BYPASS field.                                */
  #define I2S_CONFIG_CLKCONFIG_BYPASS_Disable (0x0UL) /*!< Disable bypass                                                      */
  #define I2S_CONFIG_CLKCONFIG_BYPASS_Enable (0x1UL) /*!< Enable bypass                                                        */

/* JITTER @Bit 9 : Enable jittering clock. */
  #define I2S_CONFIG_CLKCONFIG_JITTER_Pos (9UL)      /*!< Position of JITTER field.                                            */
  #define I2S_CONFIG_CLKCONFIG_JITTER_Msk (0x1UL << I2S_CONFIG_CLKCONFIG_JITTER_Pos) /*!< Bit mask of JITTER field.            */
  #define I2S_CONFIG_CLKCONFIG_JITTER_Min (0x0UL)    /*!< Min enumerator value of JITTER field.                                */
  #define I2S_CONFIG_CLKCONFIG_JITTER_Max (0x1UL)    /*!< Max enumerator value of JITTER field.                                */
  #define I2S_CONFIG_CLKCONFIG_JITTER_Disable (0x0UL) /*!< Disable jitter                                                      */
  #define I2S_CONFIG_CLKCONFIG_JITTER_Enable (0x1UL) /*!< Enable jitter                                                        */



/* ===================================================== Struct I2S_RXD ====================================================== */
/**
  * @brief RXD [I2S_RXD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Receive buffer RAM start address.                     */
} NRF_I2S_RXD_Type;                                  /*!< Size = 4 (0x004)                                                     */

/* I2S_RXD_PTR: Receive buffer RAM start address. */
  #define I2S_RXD_PTR_ResetValue (0x00000000UL)      /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : Receive buffer Data RAM start address. When receiving, words containing samples will be written to this
                     address. This address is a word aligned Data RAM address. */                                                 
                                                                                                                                  
  #define I2S_RXD_PTR_PTR_Pos (0UL)                  /*!< Position of PTR field.                                               */
  #define I2S_RXD_PTR_PTR_Msk (0xFFFFFFFFUL << I2S_RXD_PTR_PTR_Pos) /*!< Bit mask of PTR field.                                */



/* ===================================================== Struct I2S_TXD ====================================================== */
/**
  * @brief TXD [I2S_TXD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Transmit buffer RAM start address                     */
} NRF_I2S_TXD_Type;                                  /*!< Size = 4 (0x004)                                                     */

/* I2S_TXD_PTR: Transmit buffer RAM start address */
  #define I2S_TXD_PTR_ResetValue (0x00000000UL)      /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : Transmit buffer Data RAM start address. When transmitting, words containing samples will be fetched from
                     this address. This address is a word aligned Data RAM address. */                                            
                                                                                                                                  
  #define I2S_TXD_PTR_PTR_Pos (0UL)                  /*!< Position of PTR field.                                               */
  #define I2S_TXD_PTR_PTR_Msk (0xFFFFFFFFUL << I2S_TXD_PTR_PTR_Pos) /*!< Bit mask of PTR field.                                */



/* ==================================================== Struct I2S_RXTXD ===================================================== */
/**
  * @brief RXTXD [I2S_RXTXD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000000) Size of RXD and TXD buffers                           */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x00000004) Number of 32 bit words sent and received since the
                                                                         previous END event. Nice to have only. TBD.*/            
} NRF_I2S_RXTXD_Type;                                /*!< Size = 8 (0x008)                                                     */

