adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* I2S_RXTXD_MAXCNT: Size of RXD and TXD buffers */
  #define I2S_RXTXD_MAXCNT_ResetValue (0x00000000UL) /*!< Reset value of MAXCNT register.                                      */

/* MAXCNT @Bits 0..13 : Size of RXD and TXD buffers in number of 32 bit words */
  #define I2S_RXTXD_MAXCNT_MAXCNT_Pos (0UL)          /*!< Position of MAXCNT field.                                            */
  #define I2S_RXTXD_MAXCNT_MAXCNT_Msk (0x3FFFUL << I2S_RXTXD_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                 */


/* I2S_RXTXD_AMOUNT: Number of 32 bit words sent and received since the previous END event. Nice to have only. TBD. */
  #define I2S_RXTXD_AMOUNT_ResetValue (0x00000000UL) /*!< Reset value of AMOUNT register.                                      */

/* AMOUNT @Bits 0..13 : Number of 32 bit words sent and received since the previous END event */
  #define I2S_RXTXD_AMOUNT_AMOUNT_Pos (0UL)          /*!< Position of AMOUNT field.                                            */
  #define I2S_RXTXD_AMOUNT_AMOUNT_Msk (0x3FFFUL << I2S_RXTXD_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.                 */



/* ===================================================== Struct I2S_PSEL ===================================================== */
/**
  * @brief PSEL [I2S_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MCK;                               /*!< (@ 0x00000000) Pin select for MCK signal                             */
  __IOM uint32_t  SCK;                               /*!< (@ 0x00000004) Pin select for SCK signal                             */
  __IOM uint32_t  LRCK;                              /*!< (@ 0x00000008) Pin select for LRCK signal                            */
  __IOM uint32_t  SDIN;                              /*!< (@ 0x0000000C) Pin select for SDIN signal                            */
  __IOM uint32_t  SDOUT;                             /*!< (@ 0x00000010) Pin select for SDOUT signal                           */
} NRF_I2S_PSEL_Type;                                 /*!< Size = 20 (0x014)                                                    */

/* I2S_PSEL_MCK: Pin select for MCK signal */
  #define I2S_PSEL_MCK_ResetValue (0xFFFFFFFFUL)     /*!< Reset value of MCK register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define I2S_PSEL_MCK_PIN_Pos (0UL)                 /*!< Position of PIN field.                                               */
  #define I2S_PSEL_MCK_PIN_Msk (0x1FUL << I2S_PSEL_MCK_PIN_Pos) /*!< Bit mask of PIN field.                                    */
  #define I2S_PSEL_MCK_PIN_Min (0x0UL)               /*!< Min value of PIN field.                                              */
  #define I2S_PSEL_MCK_PIN_Max (0x1FUL)              /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define I2S_PSEL_MCK_PORT_Pos (5UL)                /*!< Position of PORT field.                                              */
  #define I2S_PSEL_MCK_PORT_Msk (0xFUL << I2S_PSEL_MCK_PORT_Pos) /*!< Bit mask of PORT field.                                  */
  #define I2S_PSEL_MCK_PORT_Min (0x0UL)              /*!< Min value of PORT field.                                             */
  #define I2S_PSEL_MCK_PORT_Max (0xFUL)              /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define I2S_PSEL_MCK_CONNECT_Pos (31UL)            /*!< Position of CONNECT field.                                           */
  #define I2S_PSEL_MCK_CONNECT_Msk (0x1UL << I2S_PSEL_MCK_CONNECT_Pos) /*!< Bit mask of CONNECT field.                         */
  #define I2S_PSEL_MCK_CONNECT_Min (0x0UL)           /*!< Min enumerator value of CONNECT field.                               */
  #define I2S_PSEL_MCK_CONNECT_Max (0x1UL)           /*!< Max enumerator value of CONNECT field.                               */
  #define I2S_PSEL_MCK_CONNECT_Disconnected (0x1UL)  /*!< Disconnect                                                           */
  #define I2S_PSEL_MCK_CONNECT_Connected (0x0UL)     /*!< Connect                                                              */


/* I2S_PSEL_SCK: Pin select for SCK signal */
  #define I2S_PSEL_SCK_ResetValue (0xFFFFFFFFUL)     /*!< Reset value of SCK register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define I2S_PSEL_SCK_PIN_Pos (0UL)                 /*!< Position of PIN field.                                               */
  #define I2S_PSEL_SCK_PIN_Msk (0x1FUL << I2S_PSEL_SCK_PIN_Pos) /*!< Bit mask of PIN field.                                    */
  #define I2S_PSEL_SCK_PIN_Min (0x0UL)               /*!< Min value of PIN field.                                              */
  #define I2S_PSEL_SCK_PIN_Max (0x1FUL)              /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define I2S_PSEL_SCK_PORT_Pos (5UL)                /*!< Position of PORT field.                                              */
  #define I2S_PSEL_SCK_PORT_Msk (0xFUL << I2S_PSEL_SCK_PORT_Pos) /*!< Bit mask of PORT field.                                  */
  #define I2S_PSEL_SCK_PORT_Min (0x0UL)              /*!< Min value of PORT field.                                             */
  #define I2S_PSEL_SCK_PORT_Max (0xFUL)              /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define I2S_PSEL_SCK_CONNECT_Pos (31UL)            /*!< Position of CONNECT field.                                           */
  #define I2S_PSEL_SCK_CONNECT_Msk (0x1UL << I2S_PSEL_SCK_CONNECT_Pos) /*!< Bit mask of CONNECT field.                         */
  #define I2S_PSEL_SCK_CONNECT_Min (0x0UL)           /*!< Min enumerator value of CONNECT field.                               */
  #define I2S_PSEL_SCK_CONNECT_Max (0x1UL)           /*!< Max enumerator value of CONNECT field.                               */
  #define I2S_PSEL_SCK_CONNECT_Disconnected (0x1UL)  /*!< Disconnect                                                           */
  #define I2S_PSEL_SCK_CONNECT_Connected (0x0UL)     /*!< Connect                                                              */


/* I2S_PSEL_LRCK: Pin select for LRCK signal */
  #define I2S_PSEL_LRCK_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of LRCK register.                                        */

/* PIN @Bits 0..4 : Pin number */
  #define I2S_PSEL_LRCK_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define I2S_PSEL_LRCK_PIN_Msk (0x1FUL << I2S_PSEL_LRCK_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define I2S_PSEL_LRCK_PIN_Min (0x0UL)              /*!< Min value of PIN field.                                              */
  #define I2S_PSEL_LRCK_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define I2S_PSEL_LRCK_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define I2S_PSEL_LRCK_PORT_Msk (0xFUL << I2S_PSEL_LRCK_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define I2S_PSEL_LRCK_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define I2S_PSEL_LRCK_PORT_Max (0xFUL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define I2S_PSEL_LRCK_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define I2S_PSEL_LRCK_CONNECT_Msk (0x1UL << I2S_PSEL_LRCK_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define I2S_PSEL_LRCK_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define I2S_PSEL_LRCK_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define I2S_PSEL_LRCK_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define I2S_PSEL_LRCK_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */


/* I2S_PSEL_SDIN: Pin select for SDIN signal */
  #define I2S_PSEL_SDIN_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of SDIN register.                                        */

/* PIN @Bits 0..4 : Pin number */
  #define I2S_PSEL_SDIN_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define I2S_PSEL_SDIN_PIN_Msk (0x1FUL << I2S_PSEL_SDIN_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define I2S_PSEL_SDIN_PIN_Min (0x0UL)              /*!< Min value of PIN field.                                              */
  #define I2S_PSEL_SDIN_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define I2S_PSEL_SDIN_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define I2S_PSEL_SDIN_PORT_Msk (0xFUL << I2S_PSEL_SDIN_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define I2S_PSEL_SDIN_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define I2S_PSEL_SDIN_PORT_Max (0xFUL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define I2S_PSEL_SDIN_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define I2S_PSEL_SDIN_CONNECT_Msk (0x1UL << I2S_PSEL_SDIN_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define I2S_PSEL_SDIN_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define I2S_PSEL_SDIN_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define I2S_PSEL_SDIN_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define I2S_PSEL_SDIN_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */


/* I2S_PSEL_SDOUT: Pin select for SDOUT signal */
  #define I2S_PSEL_SDOUT_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of SDOUT register.                                       */

/* PIN @Bits 0..4 : Pin number */
  #define I2S_PSEL_SDOUT_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define I2S_PSEL_SDOUT_PIN_Msk (0x1FUL << I2S_PSEL_SDOUT_PIN_Pos) /*!< Bit mask of PIN field.                                */
  #define I2S_PSEL_SDOUT_PIN_Min (0x0UL)             /*!< Min value of PIN field.                                              */
  #define I2S_PSEL_SDOUT_PIN_Max (0x1FUL)            /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define I2S_PSEL_SDOUT_PORT_Pos (5UL)              /*!< Position of PORT field.                                              */
  #define I2S_PSEL_SDOUT_PORT_Msk (0xFUL << I2S_PSEL_SDOUT_PORT_Pos) /*!< Bit mask of PORT field.                              */
  #define I2S_PSEL_SDOUT_PORT_Min (0x0UL)            /*!< Min value of PORT field.                                             */
  #define I2S_PSEL_SDOUT_PORT_Max (0xFUL)            /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define I2S_PSEL_SDOUT_CONNECT_Pos (31UL)          /*!< Position of CONNECT field.                                           */
  #define I2S_PSEL_SDOUT_CONNECT_Msk (0x1UL << I2S_PSEL_SDOUT_CONNECT_Pos) /*!< Bit mask of CONNECT field.                     */
  #define I2S_PSEL_SDOUT_CONNECT_Min (0x0UL)         /*!< Min enumerator value of CONNECT field.                               */
  #define I2S_PSEL_SDOUT_CONNECT_Max (0x1UL)         /*!< Max enumerator value of CONNECT field.                               */
  #define I2S_PSEL_SDOUT_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                          */
  #define I2S_PSEL_SDOUT_CONNECT_Connected (0x0UL)   /*!< Connect                                                              */



/* =================================================== Struct I2S_CHANNEL ==================================================== */
/**
  * @brief CHANNEL [I2S_CHANNEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x00000000) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/                                              
  __IOM uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000004) Address of transaction that generated the last BUSERROR
                                                                         event.*/                                                 
} NRF_I2S_CHANNEL_Type;                              /*!< Size = 8 (0x008)                                                     */
  #define I2S_CHANNEL_MaxCount (2UL)                 /*!< Max size of CHANNEL[2] array.                                        */

