adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* I2S_CHANNEL_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define I2S_CHANNEL_TERMINATEONBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of TERMINATEONBUSERROR register.          */

/* ENABLE @Bit 0 : (unspecified) */
  #define I2S_CHANNEL_TERMINATEONBUSERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                      */
  #define I2S_CHANNEL_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << I2S_CHANNEL_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of
                                                                            ENABLE field.*/                                       
  #define I2S_CHANNEL_TERMINATEONBUSERROR_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                        */
  #define I2S_CHANNEL_TERMINATEONBUSERROR_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                        */
  #define I2S_CHANNEL_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL) /*!< Disable                                                 */
  #define I2S_CHANNEL_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL) /*!< Enable                                                   */


/* I2S_CHANNEL_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define I2S_CHANNEL_BUSERRORADDRESS_ResetValue (0x00000000UL) /*!< Reset value of BUSERRORADDRESS register.                  */

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define I2S_CHANNEL_BUSERRORADDRESS_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                        */
  #define I2S_CHANNEL_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << I2S_CHANNEL_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/                                      


/* ======================================================= Struct I2S ======================================================== */
/**
  * @brief Inter-IC Sound
  */
  typedef struct {                                   /*!< I2S Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Starts continuous I2S transfer. Also starts MCK
                                                                         generator when this is enabled*/                         
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stops I2S transfer and MCK generator. Triggering this
                                                                         task will cause the event STOPPED to be generated.*/     
    __IM uint32_t RESERVED[10];
    __OM uint32_t TASKS_DMA_START_TX;                /*!< (@ 0x00000030) Equivalent to
                                                                         ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_START_TX*/           
    __OM uint32_t TASKS_DMA_START_RX;                /*!< (@ 0x00000034) Equivalent to
                                                                         ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_START_RX*/           
    __OM uint32_t TASKS_DMA_STOP_TX;                 /*!< (@ 0x00000038) Equivalent to
                                                                         ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_STOP_TX*/            
    __OM uint32_t TASKS_DMA_STOP_RX;                 /*!< (@ 0x0000003C) Equivalent to
                                                                         ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_STOP_RX*/            
    __IM uint32_t RESERVED1[16];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED2[10];
    __IOM uint32_t SUBSCRIBE_DMA_START_TX;           /*!< (@ 0x000000B0) Subscribe configuration for task DMA_START_TX         */
    __IOM uint32_t SUBSCRIBE_DMA_START_RX;           /*!< (@ 0x000000B4) Subscribe configuration for task DMA_START_RX         */
    __IOM uint32_t SUBSCRIBE_DMA_STOP_TX;            /*!< (@ 0x000000B8) Subscribe configuration for task DMA_STOP_TX          */
    __IOM uint32_t SUBSCRIBE_DMA_STOP_RX;            /*!< (@ 0x000000BC) Subscribe configuration for task DMA_STOP_RX          */
    __IM uint32_t RESERVED3[16];
    __IOM uint32_t EVENTS_DMA_END_TX;                /*!< (@ 0x00000100) Equivalent to eventDmaEndTx                           */
    __IOM uint32_t EVENTS_RXPTRUPD;                  /*!< (@ 0x00000104) The RXD.PTR register has been copied to internal
                                                                         double-buffers. When the I2S module is started and RX
                                                                         is enabled, this event will be generated for every
                                                                         RXTXD.MAXCNT words received on the SDIN pin. Equivalent
                                                                         to eventDmaReadyRx.*/                                    
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000108) I2S transfer stopped. There are no requirements to how
                                                                         graceful the I2S module shall be stopped. The reason
                                                                         for this is that we are talking about streaming audio
                                                                         data here, and thus loosing some data is not critical.
                                                                         Graceful stopping of stream can easily be done in FW.
                                                                         Equivalent to eventStopped*/                             
    __IOM uint32_t EVENTS_ERROR_TX;                  /*!< (@ 0x0000010C) DMA read from memory failed. Equivalent to
                                                                         eventUnderflowTx*/                                       
    __IOM uint32_t EVENTS_ERROR_RX;                  /*!< (@ 0x00000110) DMA write to memory failed. Equivalent to
                                                                         eventOverflowRx*/                                        
    __IOM uint32_t EVENTS_TXPTRUPD;                  /*!< (@ 0x00000114) The TDX.PTR register has been copied to internal
                                                                         double-buffers. When the I2S module is started and TX
                                                                         is enabled, this event will be generated for every
                                                                         RXTXD.MAXCNT words that are sent on the SDOUT pin.
                                                                         Equivalent to eventDmaReadyTx.*/                         
    __IOM uint32_t EVENTS_DMA_END_RX;                /*!< (@ 0x00000118) DMA write to memory failed. Equivalent to
                                                                         eventDmaEndRx*/                                          
    __IOM uint32_t EVENTS_FRAMESTART;                /*!< (@ 0x0000011C) Frame start event, generated on the active edge of
                                                                         LRCK*/                                                   
    __IOM uint32_t EVENTS_BUSERROR[2];               /*!< (@ 0x00000120) This event is generated if an error occurs during the
                                                                         bus transfer. This event is generated on an AHB / AXI
                                                                         error response.*/                                        
    __IM uint32_t RESERVED4[22];
    __IOM uint32_t PUBLISH_DMA_END_TX;               /*!< (@ 0x00000180) Publish configuration for event DMA_END_TX            */
    __IOM uint32_t PUBLISH_RXPTRUPD;                 /*!< (@ 0x00000184) Publish configuration for event RXPTRUPD              */
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000188) Publish configuration for event STOPPED               */
    __IOM uint32_t PUBLISH_ERROR_TX;                 /*!< (@ 0x0000018C) Publish configuration for event ERROR_TX              */
    __IOM uint32_t PUBLISH_ERROR_RX;                 /*!< (@ 0x00000190) Publish configuration for event ERROR_RX              */
    __IOM uint32_t PUBLISH_TXPTRUPD;                 /*!< (@ 0x00000194) Publish configuration for event TXPTRUPD              */
    __IOM uint32_t PUBLISH_DMA_END_RX;               /*!< (@ 0x00000198) Publish configuration for event DMA_END_RX            */
    __IOM uint32_t PUBLISH_FRAMESTART;               /*!< (@ 0x0000019C) Publish configuration for event FRAMESTART            */
    __IOM uint32_t PUBLISH_BUSERROR[2];              /*!< (@ 0x000001A0) Publish configuration for event BUSERROR[n]           */
    __IM uint32_t RESERVED5[86];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED6[125];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable I2S module                                     */
    __IOM NRF_I2S_CONFIG_Type CONFIG;                /*!< (@ 0x00000504) (unspecified)                                         */
    __IM uint32_t RESERVED7[2];
    __IOM NRF_I2S_RXD_Type RXD;                      /*!< (@ 0x00000538) (unspecified)                                         */
    __IM uint32_t RESERVED8;
    __IOM NRF_I2S_TXD_Type TXD;                      /*!< (@ 0x00000540) (unspecified)                                         */
    __IM uint32_t RESERVED9[3];
    __IOM NRF_I2S_RXTXD_Type RXTXD;                  /*!< (@ 0x00000550) (unspecified)                                         */
    __IM uint32_t RESERVED10[2];
    __IOM NRF_I2S_PSEL_Type PSEL;                    /*!< (@ 0x00000560) (unspecified)                                         */
    __IM uint32_t RESERVED11[3];
    __IOM NRF_I2S_CHANNEL_Type CHANNEL[2];           /*!< (@ 0x00000580) (unspecified)                                         */
    __IM uint32_t RESERVED12[92];
    __IOM uint32_t DMA_ENABLE_RX;                    /*!< (@ 0x00000700) Equivalent to ID_DMA_CHANNEL_PERIPHERAL_ENABLE_RX     */
    __IOM uint32_t DMA_ENABLE_TX;                    /*!< (@ 0x00000704) Equivalent to ID_DMA_CHANNEL_PERIPHERAL_ENABLE_TX     */
  } NRF_I2S_Type;                                    /*!< Size = 1800 (0x708)                                                  */

/* I2S_TASKS_START: Starts continuous I2S transfer. Also starts MCK generator when this is enabled */
  #define I2S_TASKS_START_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_START register.                                 */

