adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* I2S_SUBSCRIBE_START: Subscribe configuration for task START */
  #define I2S_SUBSCRIBE_START_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_START register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define I2S_SUBSCRIBE_START_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define I2S_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << I2S_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define I2S_SUBSCRIBE_START_CHIDX_Min (0x0UL)      /*!< Min value of CHIDX field.                                            */
  #define I2S_SUBSCRIBE_START_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define I2S_SUBSCRIBE_START_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define I2S_SUBSCRIBE_START_EN_Msk (0x1UL << I2S_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field.                          */
  #define I2S_SUBSCRIBE_START_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define I2S_SUBSCRIBE_START_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define I2S_SUBSCRIBE_START_EN_Disabled (0x0UL)    /*!< Disable subscription                                                 */
  #define I2S_SUBSCRIBE_START_EN_Enabled (0x1UL)     /*!< Enable subscription                                                  */


/* I2S_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define I2S_SUBSCRIBE_STOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOP register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define I2S_SUBSCRIBE_STOP_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define I2S_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << I2S_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define I2S_SUBSCRIBE_STOP_CHIDX_Min (0x0UL)       /*!< Min value of CHIDX field.                                            */
  #define I2S_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define I2S_SUBSCRIBE_STOP_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define I2S_SUBSCRIBE_STOP_EN_Msk (0x1UL << I2S_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field.                            */
  #define I2S_SUBSCRIBE_STOP_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define I2S_SUBSCRIBE_STOP_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define I2S_SUBSCRIBE_STOP_EN_Disabled (0x0UL)     /*!< Disable subscription                                                 */
  #define I2S_SUBSCRIBE_STOP_EN_Enabled (0x1UL)      /*!< Enable subscription                                                  */


/* I2S_SUBSCRIBE_DMA_START_TX: Subscribe configuration for task DMA_START_TX */
  #define I2S_SUBSCRIBE_DMA_START_TX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DMA_START_TX register.            */

/* CHIDX @Bits 0..7 : DPPI channel that task DMA_START_TX will subscribe to */
  #define I2S_SUBSCRIBE_DMA_START_TX_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define I2S_SUBSCRIBE_DMA_START_TX_CHIDX_Msk (0xFFUL << I2S_SUBSCRIBE_DMA_START_TX_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define I2S_SUBSCRIBE_DMA_START_TX_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                          */
  #define I2S_SUBSCRIBE_DMA_START_TX_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define I2S_SUBSCRIBE_DMA_START_TX_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define I2S_SUBSCRIBE_DMA_START_TX_EN_Msk (0x1UL << I2S_SUBSCRIBE_DMA_START_TX_EN_Pos) /*!< Bit mask of EN field.            */
  #define I2S_SUBSCRIBE_DMA_START_TX_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define I2S_SUBSCRIBE_DMA_START_TX_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define I2S_SUBSCRIBE_DMA_START_TX_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define I2S_SUBSCRIBE_DMA_START_TX_EN_Enabled (0x1UL) /*!< Enable subscription                                               */


/* I2S_SUBSCRIBE_DMA_START_RX: Subscribe configuration for task DMA_START_RX */
  #define I2S_SUBSCRIBE_DMA_START_RX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DMA_START_RX register.            */

/* CHIDX @Bits 0..7 : DPPI channel that task DMA_START_RX will subscribe to */
  #define I2S_SUBSCRIBE_DMA_START_RX_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define I2S_SUBSCRIBE_DMA_START_RX_CHIDX_Msk (0xFFUL << I2S_SUBSCRIBE_DMA_START_RX_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define I2S_SUBSCRIBE_DMA_START_RX_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                          */
  #define I2S_SUBSCRIBE_DMA_START_RX_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define I2S_SUBSCRIBE_DMA_START_RX_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define I2S_SUBSCRIBE_DMA_START_RX_EN_Msk (0x1UL << I2S_SUBSCRIBE_DMA_START_RX_EN_Pos) /*!< Bit mask of EN field.            */
  #define I2S_SUBSCRIBE_DMA_START_RX_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define I2S_SUBSCRIBE_DMA_START_RX_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define I2S_SUBSCRIBE_DMA_START_RX_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define I2S_SUBSCRIBE_DMA_START_RX_EN_Enabled (0x1UL) /*!< Enable subscription                                               */


/* I2S_SUBSCRIBE_DMA_STOP_TX: Subscribe configuration for task DMA_STOP_TX */
  #define I2S_SUBSCRIBE_DMA_STOP_TX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DMA_STOP_TX register.              */

/* CHIDX @Bits 0..7 : DPPI channel that task DMA_STOP_TX will subscribe to */
  #define I2S_SUBSCRIBE_DMA_STOP_TX_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define I2S_SUBSCRIBE_DMA_STOP_TX_CHIDX_Msk (0xFFUL << I2S_SUBSCRIBE_DMA_STOP_TX_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define I2S_SUBSCRIBE_DMA_STOP_TX_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                           */
  #define I2S_SUBSCRIBE_DMA_STOP_TX_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define I2S_SUBSCRIBE_DMA_STOP_TX_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define I2S_SUBSCRIBE_DMA_STOP_TX_EN_Msk (0x1UL << I2S_SUBSCRIBE_DMA_STOP_TX_EN_Pos) /*!< Bit mask of EN field.              */
  #define I2S_SUBSCRIBE_DMA_STOP_TX_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define I2S_SUBSCRIBE_DMA_STOP_TX_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define I2S_SUBSCRIBE_DMA_STOP_TX_EN_Disabled (0x0UL) /*!< Disable subscription                                              */
  #define I2S_SUBSCRIBE_DMA_STOP_TX_EN_Enabled (0x1UL) /*!< Enable subscription                                                */


/* I2S_SUBSCRIBE_DMA_STOP_RX: Subscribe configuration for task DMA_STOP_RX */
  #define I2S_SUBSCRIBE_DMA_STOP_RX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DMA_STOP_RX register.              */

