adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task DMA_STOP_RX will subscribe to */
  #define I2S_SUBSCRIBE_DMA_STOP_RX_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define I2S_SUBSCRIBE_DMA_STOP_RX_CHIDX_Msk (0xFFUL << I2S_SUBSCRIBE_DMA_STOP_RX_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define I2S_SUBSCRIBE_DMA_STOP_RX_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                           */
  #define I2S_SUBSCRIBE_DMA_STOP_RX_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define I2S_SUBSCRIBE_DMA_STOP_RX_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define I2S_SUBSCRIBE_DMA_STOP_RX_EN_Msk (0x1UL << I2S_SUBSCRIBE_DMA_STOP_RX_EN_Pos) /*!< Bit mask of EN field.              */
  #define I2S_SUBSCRIBE_DMA_STOP_RX_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define I2S_SUBSCRIBE_DMA_STOP_RX_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define I2S_SUBSCRIBE_DMA_STOP_RX_EN_Disabled (0x0UL) /*!< Disable subscription                                              */
  #define I2S_SUBSCRIBE_DMA_STOP_RX_EN_Enabled (0x1UL) /*!< Enable subscription                                                */


/* I2S_EVENTS_DMA_END_TX: Equivalent to eventDmaEndTx */
  #define I2S_EVENTS_DMA_END_TX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_DMA_END_TX register.                      */

/* EVENTS_DMA_END_TX @Bit 0 : Equivalent to eventDmaEndTx */
  #define I2S_EVENTS_DMA_END_TX_EVENTS_DMA_END_TX_Pos (0UL) /*!< Position of EVENTS_DMA_END_TX field.                          */
  #define I2S_EVENTS_DMA_END_TX_EVENTS_DMA_END_TX_Msk (0x1UL << I2S_EVENTS_DMA_END_TX_EVENTS_DMA_END_TX_Pos) /*!< Bit mask of
                                                                            EVENTS_DMA_END_TX field.*/                            
  #define I2S_EVENTS_DMA_END_TX_EVENTS_DMA_END_TX_Min (0x0UL) /*!< Min enumerator value of EVENTS_DMA_END_TX field.            */
  #define I2S_EVENTS_DMA_END_TX_EVENTS_DMA_END_TX_Max (0x1UL) /*!< Max enumerator value of EVENTS_DMA_END_TX field.            */
  #define I2S_EVENTS_DMA_END_TX_EVENTS_DMA_END_TX_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define I2S_EVENTS_DMA_END_TX_EVENTS_DMA_END_TX_Generated (0x1UL) /*!< Event generated                                       */


/* I2S_EVENTS_RXPTRUPD: The RXD.PTR register has been copied to internal double-buffers. When the I2S module is started and RX
                         is enabled, this event will be generated for every RXTXD.MAXCNT words received on the SDIN pin.
                         Equivalent to eventDmaReadyRx. */                                                                        
                                                                                                                                  
  #define I2S_EVENTS_RXPTRUPD_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXPTRUPD register.                          */

/* EVENTS_RXPTRUPD @Bit 0 : The RXD.PTR register has been copied to internal double-buffers. When the I2S module is started and
                            RX is enabled, this event will be generated for every RXTXD.MAXCNT words received on the SDIN pin.
                            Equivalent to eventDmaReadyRx. */                                                                     
                                                                                                                                  
  #define I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Pos (0UL) /*!< Position of EVENTS_RXPTRUPD field.                                */
  #define I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Msk (0x1UL << I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Pos) /*!< Bit mask of
                                                                            EVENTS_RXPTRUPD field.*/                              
  #define I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXPTRUPD field.                  */
  #define I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXPTRUPD field.                  */
  #define I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Generated (0x1UL) /*!< Event generated                                           */


/* I2S_EVENTS_STOPPED: I2S transfer stopped. There are no requirements to how graceful the I2S module shall be stopped. The
                        reason for this is that we are talking about streaming audio data here, and thus loosing some data is
                        not critical. Graceful stopping of stream can easily be done in FW. Equivalent to eventStopped */         
                                                                                                                                  
  #define I2S_EVENTS_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STOPPED register.                            */

/* EVENTS_STOPPED @Bit 0 : I2S transfer stopped. There are no requirements to how graceful the I2S module shall be stopped. The
                           reason for this is that we are talking about streaming audio data here, and thus loosing some data is
                           not critical. Graceful stopping of stream can easily be done in FW. Equivalent to eventStopped */      
                                                                                                                                  
  #define I2S_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL) /*!< Position of EVENTS_STOPPED field.                                   */
  #define I2S_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << I2S_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of EVENTS_STOPPED
                                                                            field.*/                                              
  #define I2S_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STOPPED field.                     */
  #define I2S_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STOPPED field.                     */
  #define I2S_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define I2S_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL) /*!< Event generated                                             */


