adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* I2S_EVENTS_ERROR_TX: DMA read from memory failed. Equivalent to eventUnderflowTx */
  #define I2S_EVENTS_ERROR_TX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERROR_TX register.                          */

/* EVENTS_ERROR_TX @Bit 0 : DMA read from memory failed. Equivalent to eventUnderflowTx */
  #define I2S_EVENTS_ERROR_TX_EVENTS_ERROR_TX_Pos (0UL) /*!< Position of EVENTS_ERROR_TX field.                                */
  #define I2S_EVENTS_ERROR_TX_EVENTS_ERROR_TX_Msk (0x1UL << I2S_EVENTS_ERROR_TX_EVENTS_ERROR_TX_Pos) /*!< Bit mask of
                                                                            EVENTS_ERROR_TX field.*/                              
  #define I2S_EVENTS_ERROR_TX_EVENTS_ERROR_TX_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERROR_TX field.                  */
  #define I2S_EVENTS_ERROR_TX_EVENTS_ERROR_TX_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERROR_TX field.                  */
  #define I2S_EVENTS_ERROR_TX_EVENTS_ERROR_TX_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define I2S_EVENTS_ERROR_TX_EVENTS_ERROR_TX_Generated (0x1UL) /*!< Event generated                                           */


/* I2S_EVENTS_ERROR_RX: DMA write to memory failed. Equivalent to eventOverflowRx */
  #define I2S_EVENTS_ERROR_RX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERROR_RX register.                          */

/* EVENTS_ERROR_RX @Bit 0 : DMA write to memory failed. Equivalent to eventOverflowRx */
  #define I2S_EVENTS_ERROR_RX_EVENTS_ERROR_RX_Pos (0UL) /*!< Position of EVENTS_ERROR_RX field.                                */
  #define I2S_EVENTS_ERROR_RX_EVENTS_ERROR_RX_Msk (0x1UL << I2S_EVENTS_ERROR_RX_EVENTS_ERROR_RX_Pos) /*!< Bit mask of
                                                                            EVENTS_ERROR_RX field.*/                              
  #define I2S_EVENTS_ERROR_RX_EVENTS_ERROR_RX_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERROR_RX field.                  */
  #define I2S_EVENTS_ERROR_RX_EVENTS_ERROR_RX_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERROR_RX field.                  */
  #define I2S_EVENTS_ERROR_RX_EVENTS_ERROR_RX_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define I2S_EVENTS_ERROR_RX_EVENTS_ERROR_RX_Generated (0x1UL) /*!< Event generated                                           */


/* I2S_EVENTS_TXPTRUPD: The TDX.PTR register has been copied to internal double-buffers. When the I2S module is started and TX
                         is enabled, this event will be generated for every RXTXD.MAXCNT words that are sent on the SDOUT pin.
                         Equivalent to eventDmaReadyTx. */                                                                        
                                                                                                                                  
  #define I2S_EVENTS_TXPTRUPD_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXPTRUPD register.                          */

/* EVENTS_TXPTRUPD @Bit 0 : The TDX.PTR register has been copied to internal double-buffers. When the I2S module is started and
                            TX is enabled, this event will be generated for every RXTXD.MAXCNT words that are sent on the SDOUT
                            pin. Equivalent to eventDmaReadyTx. */                                                                
                                                                                                                                  
  #define I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Pos (0UL) /*!< Position of EVENTS_TXPTRUPD field.                                */
  #define I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Msk (0x1UL << I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Pos) /*!< Bit mask of
                                                                            EVENTS_TXPTRUPD field.*/                              
  #define I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXPTRUPD field.                  */
  #define I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXPTRUPD field.                  */
  #define I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Generated (0x1UL) /*!< Event generated                                           */


/* I2S_EVENTS_DMA_END_RX: DMA write to memory failed. Equivalent to eventDmaEndRx */
  #define I2S_EVENTS_DMA_END_RX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_DMA_END_RX register.                      */

/* EVENTS_DMA_END_RX @Bit 0 : DMA write to memory failed. Equivalent to eventDmaEndRx */
  #define I2S_EVENTS_DMA_END_RX_EVENTS_DMA_END_RX_Pos (0UL) /*!< Position of EVENTS_DMA_END_RX field.                          */
  #define I2S_EVENTS_DMA_END_RX_EVENTS_DMA_END_RX_Msk (0x1UL << I2S_EVENTS_DMA_END_RX_EVENTS_DMA_END_RX_Pos) /*!< Bit mask of
                                                                            EVENTS_DMA_END_RX field.*/                            
  #define I2S_EVENTS_DMA_END_RX_EVENTS_DMA_END_RX_Min (0x0UL) /*!< Min enumerator value of EVENTS_DMA_END_RX field.            */
  #define I2S_EVENTS_DMA_END_RX_EVENTS_DMA_END_RX_Max (0x1UL) /*!< Max enumerator value of EVENTS_DMA_END_RX field.            */
  #define I2S_EVENTS_DMA_END_RX_EVENTS_DMA_END_RX_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define I2S_EVENTS_DMA_END_RX_EVENTS_DMA_END_RX_Generated (0x1UL) /*!< Event generated                                       */


/* I2S_EVENTS_FRAMESTART: Frame start event, generated on the active edge of LRCK */
  #define I2S_EVENTS_FRAMESTART_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FRAMESTART register.                      */

/* EVENTS_FRAMESTART @Bit 0 : Frame start event, generated on the active edge of LRCK */
  #define I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_Pos (0UL) /*!< Position of EVENTS_FRAMESTART field.                          */
  #define I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_Msk (0x1UL << I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_Pos) /*!< Bit mask of
                                                                            EVENTS_FRAMESTART field.*/                            
  #define I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_Min (0x0UL) /*!< Min enumerator value of EVENTS_FRAMESTART field.            */
  #define I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_Max (0x1UL) /*!< Max enumerator value of EVENTS_FRAMESTART field.            */
  #define I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_Generated (0x1UL) /*!< Event generated                                       */


/* I2S_EVENTS_BUSERROR: This event is generated if an error occurs during the bus transfer. This event is generated on an AHB /
                         AXI error response. */                                                                                   
                                                                                                                                  
  #define I2S_EVENTS_BUSERROR_MaxCount (2UL)         /*!< Max size of EVENTS_BUSERROR[2] array.                                */
  #define I2S_EVENTS_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_BUSERROR[2] register.                       */

/* EVENTS_BUSERROR @Bit 0 : This event is generated if an error occurs during the bus transfer. This event is generated on an
                            AHB / AXI error response. */                                                                          
                                                                                                                                  
  #define I2S_EVENTS_BUSERROR_EVENTS_BUSERROR_Pos (0UL) /*!< Position of EVENTS_BUSERROR field.                                */
  #define I2S_EVENTS_BUSERROR_EVENTS_BUSERROR_Msk (0x1UL << I2S_EVENTS_BUSERROR_EVENTS_BUSERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_BUSERROR field.*/                              
  #define I2S_EVENTS_BUSERROR_EVENTS_BUSERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_BUSERROR field.                  */
  #define I2S_EVENTS_BUSERROR_EVENTS_BUSERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_BUSERROR field.                  */
  #define I2S_EVENTS_BUSERROR_EVENTS_BUSERROR_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define I2S_EVENTS_BUSERROR_EVENTS_BUSERROR_Generated (0x1UL) /*!< Event generated                                           */


/* I2S_PUBLISH_DMA_END_TX: Publish configuration for event DMA_END_TX */
  #define I2S_PUBLISH_DMA_END_TX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_DMA_END_TX register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event DMA_END_TX will publish to */
  #define I2S_PUBLISH_DMA_END_TX_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define I2S_PUBLISH_DMA_END_TX_CHIDX_Msk (0xFFUL << I2S_PUBLISH_DMA_END_TX_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define I2S_PUBLISH_DMA_END_TX_CHIDX_Min (0x0UL)   /*!< Min value of CHIDX field.                                            */
  #define I2S_PUBLISH_DMA_END_TX_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define I2S_PUBLISH_DMA_END_TX_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define I2S_PUBLISH_DMA_END_TX_EN_Msk (0x1UL << I2S_PUBLISH_DMA_END_TX_EN_Pos) /*!< Bit mask of EN field.                    */
  #define I2S_PUBLISH_DMA_END_TX_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define I2S_PUBLISH_DMA_END_TX_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define I2S_PUBLISH_DMA_END_TX_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define I2S_PUBLISH_DMA_END_TX_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* I2S_PUBLISH_RXPTRUPD: Publish configuration for event RXPTRUPD */
  #define I2S_PUBLISH_RXPTRUPD_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXPTRUPD register.                        */

