adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event RXPTRUPD will publish to */
  #define I2S_PUBLISH_RXPTRUPD_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define I2S_PUBLISH_RXPTRUPD_CHIDX_Msk (0xFFUL << I2S_PUBLISH_RXPTRUPD_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define I2S_PUBLISH_RXPTRUPD_CHIDX_Min (0x0UL)     /*!< Min value of CHIDX field.                                            */
  #define I2S_PUBLISH_RXPTRUPD_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define I2S_PUBLISH_RXPTRUPD_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define I2S_PUBLISH_RXPTRUPD_EN_Msk (0x1UL << I2S_PUBLISH_RXPTRUPD_EN_Pos) /*!< Bit mask of EN field.                        */
  #define I2S_PUBLISH_RXPTRUPD_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define I2S_PUBLISH_RXPTRUPD_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define I2S_PUBLISH_RXPTRUPD_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define I2S_PUBLISH_RXPTRUPD_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* I2S_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define I2S_PUBLISH_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STOPPED register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define I2S_PUBLISH_STOPPED_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define I2S_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << I2S_PUBLISH_STOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define I2S_PUBLISH_STOPPED_CHIDX_Min (0x0UL)      /*!< Min value of CHIDX field.                                            */
  #define I2S_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define I2S_PUBLISH_STOPPED_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define I2S_PUBLISH_STOPPED_EN_Msk (0x1UL << I2S_PUBLISH_STOPPED_EN_Pos) /*!< Bit mask of EN field.                          */
  #define I2S_PUBLISH_STOPPED_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define I2S_PUBLISH_STOPPED_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define I2S_PUBLISH_STOPPED_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define I2S_PUBLISH_STOPPED_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* I2S_PUBLISH_ERROR_TX: Publish configuration for event ERROR_TX */
  #define I2S_PUBLISH_ERROR_TX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ERROR_TX register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event ERROR_TX will publish to */
  #define I2S_PUBLISH_ERROR_TX_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define I2S_PUBLISH_ERROR_TX_CHIDX_Msk (0xFFUL << I2S_PUBLISH_ERROR_TX_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define I2S_PUBLISH_ERROR_TX_CHIDX_Min (0x0UL)     /*!< Min value of CHIDX field.                                            */
  #define I2S_PUBLISH_ERROR_TX_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define I2S_PUBLISH_ERROR_TX_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define I2S_PUBLISH_ERROR_TX_EN_Msk (0x1UL << I2S_PUBLISH_ERROR_TX_EN_Pos) /*!< Bit mask of EN field.                        */
  #define I2S_PUBLISH_ERROR_TX_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define I2S_PUBLISH_ERROR_TX_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define I2S_PUBLISH_ERROR_TX_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define I2S_PUBLISH_ERROR_TX_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* I2S_PUBLISH_ERROR_RX: Publish configuration for event ERROR_RX */
  #define I2S_PUBLISH_ERROR_RX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ERROR_RX register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event ERROR_RX will publish to */
  #define I2S_PUBLISH_ERROR_RX_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define I2S_PUBLISH_ERROR_RX_CHIDX_Msk (0xFFUL << I2S_PUBLISH_ERROR_RX_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define I2S_PUBLISH_ERROR_RX_CHIDX_Min (0x0UL)     /*!< Min value of CHIDX field.                                            */
  #define I2S_PUBLISH_ERROR_RX_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define I2S_PUBLISH_ERROR_RX_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define I2S_PUBLISH_ERROR_RX_EN_Msk (0x1UL << I2S_PUBLISH_ERROR_RX_EN_Pos) /*!< Bit mask of EN field.                        */
  #define I2S_PUBLISH_ERROR_RX_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define I2S_PUBLISH_ERROR_RX_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define I2S_PUBLISH_ERROR_RX_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define I2S_PUBLISH_ERROR_RX_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* I2S_PUBLISH_TXPTRUPD: Publish configuration for event TXPTRUPD */
  #define I2S_PUBLISH_TXPTRUPD_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXPTRUPD register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event TXPTRUPD will publish to */
  #define I2S_PUBLISH_TXPTRUPD_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define I2S_PUBLISH_TXPTRUPD_CHIDX_Msk (0xFFUL << I2S_PUBLISH_TXPTRUPD_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define I2S_PUBLISH_TXPTRUPD_CHIDX_Min (0x0UL)     /*!< Min value of CHIDX field.                                            */
  #define I2S_PUBLISH_TXPTRUPD_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define I2S_PUBLISH_TXPTRUPD_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define I2S_PUBLISH_TXPTRUPD_EN_Msk (0x1UL << I2S_PUBLISH_TXPTRUPD_EN_Pos) /*!< Bit mask of EN field.                        */
  #define I2S_PUBLISH_TXPTRUPD_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define I2S_PUBLISH_TXPTRUPD_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define I2S_PUBLISH_TXPTRUPD_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define I2S_PUBLISH_TXPTRUPD_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* I2S_PUBLISH_DMA_END_RX: Publish configuration for event DMA_END_RX */
  #define I2S_PUBLISH_DMA_END_RX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_DMA_END_RX register.                    */

