adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event DMA_END_RX will publish to */
  #define I2S_PUBLISH_DMA_END_RX_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define I2S_PUBLISH_DMA_END_RX_CHIDX_Msk (0xFFUL << I2S_PUBLISH_DMA_END_RX_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define I2S_PUBLISH_DMA_END_RX_CHIDX_Min (0x0UL)   /*!< Min value of CHIDX field.                                            */
  #define I2S_PUBLISH_DMA_END_RX_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define I2S_PUBLISH_DMA_END_RX_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define I2S_PUBLISH_DMA_END_RX_EN_Msk (0x1UL << I2S_PUBLISH_DMA_END_RX_EN_Pos) /*!< Bit mask of EN field.                    */
  #define I2S_PUBLISH_DMA_END_RX_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define I2S_PUBLISH_DMA_END_RX_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define I2S_PUBLISH_DMA_END_RX_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define I2S_PUBLISH_DMA_END_RX_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* I2S_PUBLISH_FRAMESTART: Publish configuration for event FRAMESTART */
  #define I2S_PUBLISH_FRAMESTART_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_FRAMESTART register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event FRAMESTART will publish to */
  #define I2S_PUBLISH_FRAMESTART_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define I2S_PUBLISH_FRAMESTART_CHIDX_Msk (0xFFUL << I2S_PUBLISH_FRAMESTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define I2S_PUBLISH_FRAMESTART_CHIDX_Min (0x0UL)   /*!< Min value of CHIDX field.                                            */
  #define I2S_PUBLISH_FRAMESTART_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define I2S_PUBLISH_FRAMESTART_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define I2S_PUBLISH_FRAMESTART_EN_Msk (0x1UL << I2S_PUBLISH_FRAMESTART_EN_Pos) /*!< Bit mask of EN field.                    */
  #define I2S_PUBLISH_FRAMESTART_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define I2S_PUBLISH_FRAMESTART_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define I2S_PUBLISH_FRAMESTART_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define I2S_PUBLISH_FRAMESTART_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* I2S_PUBLISH_BUSERROR: Publish configuration for event BUSERROR[n] */
  #define I2S_PUBLISH_BUSERROR_MaxCount (2UL)        /*!< Max size of PUBLISH_BUSERROR[2] array.                               */
  #define I2S_PUBLISH_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_BUSERROR[2] register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR[n] will publish to */
  #define I2S_PUBLISH_BUSERROR_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define I2S_PUBLISH_BUSERROR_CHIDX_Msk (0xFFUL << I2S_PUBLISH_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define I2S_PUBLISH_BUSERROR_CHIDX_Min (0x0UL)     /*!< Min value of CHIDX field.                                            */
  #define I2S_PUBLISH_BUSERROR_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define I2S_PUBLISH_BUSERROR_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define I2S_PUBLISH_BUSERROR_EN_Msk (0x1UL << I2S_PUBLISH_BUSERROR_EN_Pos) /*!< Bit mask of EN field.                        */
  #define I2S_PUBLISH_BUSERROR_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define I2S_PUBLISH_BUSERROR_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define I2S_PUBLISH_BUSERROR_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define I2S_PUBLISH_BUSERROR_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* I2S_INTEN: Enable or disable interrupt */
  #define I2S_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* DMA_END_TX @Bit 0 : Enable or disable interrupt for event DMA_END_TX */
  #define I2S_INTEN_DMA_END_TX_Pos (0UL)             /*!< Position of DMA_END_TX field.                                        */
  #define I2S_INTEN_DMA_END_TX_Msk (0x1UL << I2S_INTEN_DMA_END_TX_Pos) /*!< Bit mask of DMA_END_TX field.                      */
  #define I2S_INTEN_DMA_END_TX_Min (0x0UL)           /*!< Min enumerator value of DMA_END_TX field.                            */
  #define I2S_INTEN_DMA_END_TX_Max (0x1UL)           /*!< Max enumerator value of DMA_END_TX field.                            */
  #define I2S_INTEN_DMA_END_TX_Disabled (0x0UL)      /*!< Disable                                                              */
  #define I2S_INTEN_DMA_END_TX_Enabled (0x1UL)       /*!< Enable                                                               */

/* RXPTRUPD @Bit 1 : Enable or disable interrupt for event RXPTRUPD */
  #define I2S_INTEN_RXPTRUPD_Pos (1UL)               /*!< Position of RXPTRUPD field.                                          */
  #define I2S_INTEN_RXPTRUPD_Msk (0x1UL << I2S_INTEN_RXPTRUPD_Pos) /*!< Bit mask of RXPTRUPD field.                            */
  #define I2S_INTEN_RXPTRUPD_Min (0x0UL)             /*!< Min enumerator value of RXPTRUPD field.                              */
  #define I2S_INTEN_RXPTRUPD_Max (0x1UL)             /*!< Max enumerator value of RXPTRUPD field.                              */
  #define I2S_INTEN_RXPTRUPD_Disabled (0x0UL)        /*!< Disable                                                              */
  #define I2S_INTEN_RXPTRUPD_Enabled (0x1UL)         /*!< Enable                                                               */

/* STOPPED @Bit 2 : Enable or disable interrupt for event STOPPED */
  #define I2S_INTEN_STOPPED_Pos (2UL)                /*!< Position of STOPPED field.                                           */
  #define I2S_INTEN_STOPPED_Msk (0x1UL << I2S_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                               */
  #define I2S_INTEN_STOPPED_Min (0x0UL)              /*!< Min enumerator value of STOPPED field.                               */
  #define I2S_INTEN_STOPPED_Max (0x1UL)              /*!< Max enumerator value of STOPPED field.                               */
  #define I2S_INTEN_STOPPED_Disabled (0x0UL)         /*!< Disable                                                              */
  #define I2S_INTEN_STOPPED_Enabled (0x1UL)          /*!< Enable                                                               */

