adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ERROR_TX @Bit 3 : Enable or disable interrupt for event ERROR_TX */
  #define I2S_INTEN_ERROR_TX_Pos (3UL)               /*!< Position of ERROR_TX field.                                          */
  #define I2S_INTEN_ERROR_TX_Msk (0x1UL << I2S_INTEN_ERROR_TX_Pos) /*!< Bit mask of ERROR_TX field.                            */
  #define I2S_INTEN_ERROR_TX_Min (0x0UL)             /*!< Min enumerator value of ERROR_TX field.                              */
  #define I2S_INTEN_ERROR_TX_Max (0x1UL)             /*!< Max enumerator value of ERROR_TX field.                              */
  #define I2S_INTEN_ERROR_TX_Disabled (0x0UL)        /*!< Disable                                                              */
  #define I2S_INTEN_ERROR_TX_Enabled (0x1UL)         /*!< Enable                                                               */

/* ERROR_RX @Bit 4 : Enable or disable interrupt for event ERROR_RX */
  #define I2S_INTEN_ERROR_RX_Pos (4UL)               /*!< Position of ERROR_RX field.                                          */
  #define I2S_INTEN_ERROR_RX_Msk (0x1UL << I2S_INTEN_ERROR_RX_Pos) /*!< Bit mask of ERROR_RX field.                            */
  #define I2S_INTEN_ERROR_RX_Min (0x0UL)             /*!< Min enumerator value of ERROR_RX field.                              */
  #define I2S_INTEN_ERROR_RX_Max (0x1UL)             /*!< Max enumerator value of ERROR_RX field.                              */
  #define I2S_INTEN_ERROR_RX_Disabled (0x0UL)        /*!< Disable                                                              */
  #define I2S_INTEN_ERROR_RX_Enabled (0x1UL)         /*!< Enable                                                               */

/* TXPTRUPD @Bit 5 : Enable or disable interrupt for event TXPTRUPD */
  #define I2S_INTEN_TXPTRUPD_Pos (5UL)               /*!< Position of TXPTRUPD field.                                          */
  #define I2S_INTEN_TXPTRUPD_Msk (0x1UL << I2S_INTEN_TXPTRUPD_Pos) /*!< Bit mask of TXPTRUPD field.                            */
  #define I2S_INTEN_TXPTRUPD_Min (0x0UL)             /*!< Min enumerator value of TXPTRUPD field.                              */
  #define I2S_INTEN_TXPTRUPD_Max (0x1UL)             /*!< Max enumerator value of TXPTRUPD field.                              */
  #define I2S_INTEN_TXPTRUPD_Disabled (0x0UL)        /*!< Disable                                                              */
  #define I2S_INTEN_TXPTRUPD_Enabled (0x1UL)         /*!< Enable                                                               */

/* DMA_END_RX @Bit 6 : Enable or disable interrupt for event DMA_END_RX */
  #define I2S_INTEN_DMA_END_RX_Pos (6UL)             /*!< Position of DMA_END_RX field.                                        */
  #define I2S_INTEN_DMA_END_RX_Msk (0x1UL << I2S_INTEN_DMA_END_RX_Pos) /*!< Bit mask of DMA_END_RX field.                      */
  #define I2S_INTEN_DMA_END_RX_Min (0x0UL)           /*!< Min enumerator value of DMA_END_RX field.                            */
  #define I2S_INTEN_DMA_END_RX_Max (0x1UL)           /*!< Max enumerator value of DMA_END_RX field.                            */
  #define I2S_INTEN_DMA_END_RX_Disabled (0x0UL)      /*!< Disable                                                              */
  #define I2S_INTEN_DMA_END_RX_Enabled (0x1UL)       /*!< Enable                                                               */

/* FRAMESTART @Bit 7 : Enable or disable interrupt for event FRAMESTART */
  #define I2S_INTEN_FRAMESTART_Pos (7UL)             /*!< Position of FRAMESTART field.                                        */
  #define I2S_INTEN_FRAMESTART_Msk (0x1UL << I2S_INTEN_FRAMESTART_Pos) /*!< Bit mask of FRAMESTART field.                      */
  #define I2S_INTEN_FRAMESTART_Min (0x0UL)           /*!< Min enumerator value of FRAMESTART field.                            */
  #define I2S_INTEN_FRAMESTART_Max (0x1UL)           /*!< Max enumerator value of FRAMESTART field.                            */
  #define I2S_INTEN_FRAMESTART_Disabled (0x0UL)      /*!< Disable                                                              */
  #define I2S_INTEN_FRAMESTART_Enabled (0x1UL)       /*!< Enable                                                               */

/* BUSERROR0 @Bit 8 : Enable or disable interrupt for event BUSERROR[0] */
  #define I2S_INTEN_BUSERROR0_Pos (8UL)              /*!< Position of BUSERROR0 field.                                         */
  #define I2S_INTEN_BUSERROR0_Msk (0x1UL << I2S_INTEN_BUSERROR0_Pos) /*!< Bit mask of BUSERROR0 field.                         */
  #define I2S_INTEN_BUSERROR0_Min (0x0UL)            /*!< Min enumerator value of BUSERROR0 field.                             */
  #define I2S_INTEN_BUSERROR0_Max (0x1UL)            /*!< Max enumerator value of BUSERROR0 field.                             */
  #define I2S_INTEN_BUSERROR0_Disabled (0x0UL)       /*!< Disable                                                              */
  #define I2S_INTEN_BUSERROR0_Enabled (0x1UL)        /*!< Enable                                                               */

/* BUSERROR1 @Bit 9 : Enable or disable interrupt for event BUSERROR[1] */
  #define I2S_INTEN_BUSERROR1_Pos (9UL)              /*!< Position of BUSERROR1 field.                                         */
  #define I2S_INTEN_BUSERROR1_Msk (0x1UL << I2S_INTEN_BUSERROR1_Pos) /*!< Bit mask of BUSERROR1 field.                         */
  #define I2S_INTEN_BUSERROR1_Min (0x0UL)            /*!< Min enumerator value of BUSERROR1 field.                             */
  #define I2S_INTEN_BUSERROR1_Max (0x1UL)            /*!< Max enumerator value of BUSERROR1 field.                             */
  #define I2S_INTEN_BUSERROR1_Disabled (0x0UL)       /*!< Disable                                                              */
  #define I2S_INTEN_BUSERROR1_Enabled (0x1UL)        /*!< Enable                                                               */


/* I2S_INTENSET: Enable interrupt */
  #define I2S_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* DMA_END_TX @Bit 0 : Write '1' to enable interrupt for event DMA_END_TX */
  #define I2S_INTENSET_DMA_END_TX_Pos (0UL)          /*!< Position of DMA_END_TX field.                                        */
  #define I2S_INTENSET_DMA_END_TX_Msk (0x1UL << I2S_INTENSET_DMA_END_TX_Pos) /*!< Bit mask of DMA_END_TX field.                */
  #define I2S_INTENSET_DMA_END_TX_Min (0x0UL)        /*!< Min enumerator value of DMA_END_TX field.                            */
  #define I2S_INTENSET_DMA_END_TX_Max (0x1UL)        /*!< Max enumerator value of DMA_END_TX field.                            */
  #define I2S_INTENSET_DMA_END_TX_Set (0x1UL)        /*!< Enable                                                               */
  #define I2S_INTENSET_DMA_END_TX_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define I2S_INTENSET_DMA_END_TX_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RXPTRUPD @Bit 1 : Write '1' to enable interrupt for event RXPTRUPD */
  #define I2S_INTENSET_RXPTRUPD_Pos (1UL)            /*!< Position of RXPTRUPD field.                                          */
  #define I2S_INTENSET_RXPTRUPD_Msk (0x1UL << I2S_INTENSET_RXPTRUPD_Pos) /*!< Bit mask of RXPTRUPD field.                      */
  #define I2S_INTENSET_RXPTRUPD_Min (0x0UL)          /*!< Min enumerator value of RXPTRUPD field.                              */
  #define I2S_INTENSET_RXPTRUPD_Max (0x1UL)          /*!< Max enumerator value of RXPTRUPD field.                              */
  #define I2S_INTENSET_RXPTRUPD_Set (0x1UL)          /*!< Enable                                                               */
  #define I2S_INTENSET_RXPTRUPD_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define I2S_INTENSET_RXPTRUPD_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* STOPPED @Bit 2 : Write '1' to enable interrupt for event STOPPED */
  #define I2S_INTENSET_STOPPED_Pos (2UL)             /*!< Position of STOPPED field.                                           */
  #define I2S_INTENSET_STOPPED_Msk (0x1UL << I2S_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define I2S_INTENSET_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define I2S_INTENSET_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define I2S_INTENSET_STOPPED_Set (0x1UL)           /*!< Enable                                                               */
  #define I2S_INTENSET_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define I2S_INTENSET_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* ERROR_TX @Bit 3 : Write '1' to enable interrupt for event ERROR_TX */
  #define I2S_INTENSET_ERROR_TX_Pos (3UL)            /*!< Position of ERROR_TX field.                                          */
  #define I2S_INTENSET_ERROR_TX_Msk (0x1UL << I2S_INTENSET_ERROR_TX_Pos) /*!< Bit mask of ERROR_TX field.                      */
  #define I2S_INTENSET_ERROR_TX_Min (0x0UL)          /*!< Min enumerator value of ERROR_TX field.                              */
  #define I2S_INTENSET_ERROR_TX_Max (0x1UL)          /*!< Max enumerator value of ERROR_TX field.                              */
  #define I2S_INTENSET_ERROR_TX_Set (0x1UL)          /*!< Enable                                                               */
  #define I2S_INTENSET_ERROR_TX_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define I2S_INTENSET_ERROR_TX_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

