adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ERROR_RX @Bit 4 : Write '1' to enable interrupt for event ERROR_RX */
  #define I2S_INTENSET_ERROR_RX_Pos (4UL)            /*!< Position of ERROR_RX field.                                          */
  #define I2S_INTENSET_ERROR_RX_Msk (0x1UL << I2S_INTENSET_ERROR_RX_Pos) /*!< Bit mask of ERROR_RX field.                      */
  #define I2S_INTENSET_ERROR_RX_Min (0x0UL)          /*!< Min enumerator value of ERROR_RX field.                              */
  #define I2S_INTENSET_ERROR_RX_Max (0x1UL)          /*!< Max enumerator value of ERROR_RX field.                              */
  #define I2S_INTENSET_ERROR_RX_Set (0x1UL)          /*!< Enable                                                               */
  #define I2S_INTENSET_ERROR_RX_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define I2S_INTENSET_ERROR_RX_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* TXPTRUPD @Bit 5 : Write '1' to enable interrupt for event TXPTRUPD */
  #define I2S_INTENSET_TXPTRUPD_Pos (5UL)            /*!< Position of TXPTRUPD field.                                          */
  #define I2S_INTENSET_TXPTRUPD_Msk (0x1UL << I2S_INTENSET_TXPTRUPD_Pos) /*!< Bit mask of TXPTRUPD field.                      */
  #define I2S_INTENSET_TXPTRUPD_Min (0x0UL)          /*!< Min enumerator value of TXPTRUPD field.                              */
  #define I2S_INTENSET_TXPTRUPD_Max (0x1UL)          /*!< Max enumerator value of TXPTRUPD field.                              */
  #define I2S_INTENSET_TXPTRUPD_Set (0x1UL)          /*!< Enable                                                               */
  #define I2S_INTENSET_TXPTRUPD_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define I2S_INTENSET_TXPTRUPD_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* DMA_END_RX @Bit 6 : Write '1' to enable interrupt for event DMA_END_RX */
  #define I2S_INTENSET_DMA_END_RX_Pos (6UL)          /*!< Position of DMA_END_RX field.                                        */
  #define I2S_INTENSET_DMA_END_RX_Msk (0x1UL << I2S_INTENSET_DMA_END_RX_Pos) /*!< Bit mask of DMA_END_RX field.                */
  #define I2S_INTENSET_DMA_END_RX_Min (0x0UL)        /*!< Min enumerator value of DMA_END_RX field.                            */
  #define I2S_INTENSET_DMA_END_RX_Max (0x1UL)        /*!< Max enumerator value of DMA_END_RX field.                            */
  #define I2S_INTENSET_DMA_END_RX_Set (0x1UL)        /*!< Enable                                                               */
  #define I2S_INTENSET_DMA_END_RX_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define I2S_INTENSET_DMA_END_RX_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* FRAMESTART @Bit 7 : Write '1' to enable interrupt for event FRAMESTART */
  #define I2S_INTENSET_FRAMESTART_Pos (7UL)          /*!< Position of FRAMESTART field.                                        */
  #define I2S_INTENSET_FRAMESTART_Msk (0x1UL << I2S_INTENSET_FRAMESTART_Pos) /*!< Bit mask of FRAMESTART field.                */
  #define I2S_INTENSET_FRAMESTART_Min (0x0UL)        /*!< Min enumerator value of FRAMESTART field.                            */
  #define I2S_INTENSET_FRAMESTART_Max (0x1UL)        /*!< Max enumerator value of FRAMESTART field.                            */
  #define I2S_INTENSET_FRAMESTART_Set (0x1UL)        /*!< Enable                                                               */
  #define I2S_INTENSET_FRAMESTART_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define I2S_INTENSET_FRAMESTART_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* BUSERROR0 @Bit 8 : Write '1' to enable interrupt for event BUSERROR[0] */
  #define I2S_INTENSET_BUSERROR0_Pos (8UL)           /*!< Position of BUSERROR0 field.                                         */
  #define I2S_INTENSET_BUSERROR0_Msk (0x1UL << I2S_INTENSET_BUSERROR0_Pos) /*!< Bit mask of BUSERROR0 field.                   */
  #define I2S_INTENSET_BUSERROR0_Min (0x0UL)         /*!< Min enumerator value of BUSERROR0 field.                             */
  #define I2S_INTENSET_BUSERROR0_Max (0x1UL)         /*!< Max enumerator value of BUSERROR0 field.                             */
  #define I2S_INTENSET_BUSERROR0_Set (0x1UL)         /*!< Enable                                                               */
  #define I2S_INTENSET_BUSERROR0_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define I2S_INTENSET_BUSERROR0_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* BUSERROR1 @Bit 9 : Write '1' to enable interrupt for event BUSERROR[1] */
  #define I2S_INTENSET_BUSERROR1_Pos (9UL)           /*!< Position of BUSERROR1 field.                                         */
  #define I2S_INTENSET_BUSERROR1_Msk (0x1UL << I2S_INTENSET_BUSERROR1_Pos) /*!< Bit mask of BUSERROR1 field.                   */
  #define I2S_INTENSET_BUSERROR1_Min (0x0UL)         /*!< Min enumerator value of BUSERROR1 field.                             */
  #define I2S_INTENSET_BUSERROR1_Max (0x1UL)         /*!< Max enumerator value of BUSERROR1 field.                             */
  #define I2S_INTENSET_BUSERROR1_Set (0x1UL)         /*!< Enable                                                               */
  #define I2S_INTENSET_BUSERROR1_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define I2S_INTENSET_BUSERROR1_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* I2S_INTENCLR: Disable interrupt */
  #define I2S_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* DMA_END_TX @Bit 0 : Write '1' to disable interrupt for event DMA_END_TX */
  #define I2S_INTENCLR_DMA_END_TX_Pos (0UL)          /*!< Position of DMA_END_TX field.                                        */
  #define I2S_INTENCLR_DMA_END_TX_Msk (0x1UL << I2S_INTENCLR_DMA_END_TX_Pos) /*!< Bit mask of DMA_END_TX field.                */
  #define I2S_INTENCLR_DMA_END_TX_Min (0x0UL)        /*!< Min enumerator value of DMA_END_TX field.                            */
  #define I2S_INTENCLR_DMA_END_TX_Max (0x1UL)        /*!< Max enumerator value of DMA_END_TX field.                            */
  #define I2S_INTENCLR_DMA_END_TX_Clear (0x1UL)      /*!< Disable                                                              */
  #define I2S_INTENCLR_DMA_END_TX_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define I2S_INTENCLR_DMA_END_TX_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

