adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RXPTRUPD @Bit 1 : Write '1' to disable interrupt for event RXPTRUPD */
  #define I2S_INTENCLR_RXPTRUPD_Pos (1UL)            /*!< Position of RXPTRUPD field.                                          */
  #define I2S_INTENCLR_RXPTRUPD_Msk (0x1UL << I2S_INTENCLR_RXPTRUPD_Pos) /*!< Bit mask of RXPTRUPD field.                      */
  #define I2S_INTENCLR_RXPTRUPD_Min (0x0UL)          /*!< Min enumerator value of RXPTRUPD field.                              */
  #define I2S_INTENCLR_RXPTRUPD_Max (0x1UL)          /*!< Max enumerator value of RXPTRUPD field.                              */
  #define I2S_INTENCLR_RXPTRUPD_Clear (0x1UL)        /*!< Disable                                                              */
  #define I2S_INTENCLR_RXPTRUPD_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define I2S_INTENCLR_RXPTRUPD_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* STOPPED @Bit 2 : Write '1' to disable interrupt for event STOPPED */
  #define I2S_INTENCLR_STOPPED_Pos (2UL)             /*!< Position of STOPPED field.                                           */
  #define I2S_INTENCLR_STOPPED_Msk (0x1UL << I2S_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define I2S_INTENCLR_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define I2S_INTENCLR_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define I2S_INTENCLR_STOPPED_Clear (0x1UL)         /*!< Disable                                                              */
  #define I2S_INTENCLR_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define I2S_INTENCLR_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* ERROR_TX @Bit 3 : Write '1' to disable interrupt for event ERROR_TX */
  #define I2S_INTENCLR_ERROR_TX_Pos (3UL)            /*!< Position of ERROR_TX field.                                          */
  #define I2S_INTENCLR_ERROR_TX_Msk (0x1UL << I2S_INTENCLR_ERROR_TX_Pos) /*!< Bit mask of ERROR_TX field.                      */
  #define I2S_INTENCLR_ERROR_TX_Min (0x0UL)          /*!< Min enumerator value of ERROR_TX field.                              */
  #define I2S_INTENCLR_ERROR_TX_Max (0x1UL)          /*!< Max enumerator value of ERROR_TX field.                              */
  #define I2S_INTENCLR_ERROR_TX_Clear (0x1UL)        /*!< Disable                                                              */
  #define I2S_INTENCLR_ERROR_TX_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define I2S_INTENCLR_ERROR_TX_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ERROR_RX @Bit 4 : Write '1' to disable interrupt for event ERROR_RX */
  #define I2S_INTENCLR_ERROR_RX_Pos (4UL)            /*!< Position of ERROR_RX field.                                          */
  #define I2S_INTENCLR_ERROR_RX_Msk (0x1UL << I2S_INTENCLR_ERROR_RX_Pos) /*!< Bit mask of ERROR_RX field.                      */
  #define I2S_INTENCLR_ERROR_RX_Min (0x0UL)          /*!< Min enumerator value of ERROR_RX field.                              */
  #define I2S_INTENCLR_ERROR_RX_Max (0x1UL)          /*!< Max enumerator value of ERROR_RX field.                              */
  #define I2S_INTENCLR_ERROR_RX_Clear (0x1UL)        /*!< Disable                                                              */
  #define I2S_INTENCLR_ERROR_RX_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define I2S_INTENCLR_ERROR_RX_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* TXPTRUPD @Bit 5 : Write '1' to disable interrupt for event TXPTRUPD */
  #define I2S_INTENCLR_TXPTRUPD_Pos (5UL)            /*!< Position of TXPTRUPD field.                                          */
  #define I2S_INTENCLR_TXPTRUPD_Msk (0x1UL << I2S_INTENCLR_TXPTRUPD_Pos) /*!< Bit mask of TXPTRUPD field.                      */
  #define I2S_INTENCLR_TXPTRUPD_Min (0x0UL)          /*!< Min enumerator value of TXPTRUPD field.                              */
  #define I2S_INTENCLR_TXPTRUPD_Max (0x1UL)          /*!< Max enumerator value of TXPTRUPD field.                              */
  #define I2S_INTENCLR_TXPTRUPD_Clear (0x1UL)        /*!< Disable                                                              */
  #define I2S_INTENCLR_TXPTRUPD_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define I2S_INTENCLR_TXPTRUPD_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* DMA_END_RX @Bit 6 : Write '1' to disable interrupt for event DMA_END_RX */
  #define I2S_INTENCLR_DMA_END_RX_Pos (6UL)          /*!< Position of DMA_END_RX field.                                        */
  #define I2S_INTENCLR_DMA_END_RX_Msk (0x1UL << I2S_INTENCLR_DMA_END_RX_Pos) /*!< Bit mask of DMA_END_RX field.                */
  #define I2S_INTENCLR_DMA_END_RX_Min (0x0UL)        /*!< Min enumerator value of DMA_END_RX field.                            */
  #define I2S_INTENCLR_DMA_END_RX_Max (0x1UL)        /*!< Max enumerator value of DMA_END_RX field.                            */
  #define I2S_INTENCLR_DMA_END_RX_Clear (0x1UL)      /*!< Disable                                                              */
  #define I2S_INTENCLR_DMA_END_RX_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define I2S_INTENCLR_DMA_END_RX_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* FRAMESTART @Bit 7 : Write '1' to disable interrupt for event FRAMESTART */
  #define I2S_INTENCLR_FRAMESTART_Pos (7UL)          /*!< Position of FRAMESTART field.                                        */
  #define I2S_INTENCLR_FRAMESTART_Msk (0x1UL << I2S_INTENCLR_FRAMESTART_Pos) /*!< Bit mask of FRAMESTART field.                */
  #define I2S_INTENCLR_FRAMESTART_Min (0x0UL)        /*!< Min enumerator value of FRAMESTART field.                            */
  #define I2S_INTENCLR_FRAMESTART_Max (0x1UL)        /*!< Max enumerator value of FRAMESTART field.                            */
  #define I2S_INTENCLR_FRAMESTART_Clear (0x1UL)      /*!< Disable                                                              */
  #define I2S_INTENCLR_FRAMESTART_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define I2S_INTENCLR_FRAMESTART_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* BUSERROR0 @Bit 8 : Write '1' to disable interrupt for event BUSERROR[0] */
  #define I2S_INTENCLR_BUSERROR0_Pos (8UL)           /*!< Position of BUSERROR0 field.                                         */
  #define I2S_INTENCLR_BUSERROR0_Msk (0x1UL << I2S_INTENCLR_BUSERROR0_Pos) /*!< Bit mask of BUSERROR0 field.                   */
  #define I2S_INTENCLR_BUSERROR0_Min (0x0UL)         /*!< Min enumerator value of BUSERROR0 field.                             */
  #define I2S_INTENCLR_BUSERROR0_Max (0x1UL)         /*!< Max enumerator value of BUSERROR0 field.                             */
  #define I2S_INTENCLR_BUSERROR0_Clear (0x1UL)       /*!< Disable                                                              */
  #define I2S_INTENCLR_BUSERROR0_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define I2S_INTENCLR_BUSERROR0_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* BUSERROR1 @Bit 9 : Write '1' to disable interrupt for event BUSERROR[1] */
  #define I2S_INTENCLR_BUSERROR1_Pos (9UL)           /*!< Position of BUSERROR1 field.                                         */
  #define I2S_INTENCLR_BUSERROR1_Msk (0x1UL << I2S_INTENCLR_BUSERROR1_Pos) /*!< Bit mask of BUSERROR1 field.                   */
  #define I2S_INTENCLR_BUSERROR1_Min (0x0UL)         /*!< Min enumerator value of BUSERROR1 field.                             */
  #define I2S_INTENCLR_BUSERROR1_Max (0x1UL)         /*!< Max enumerator value of BUSERROR1 field.                             */
  #define I2S_INTENCLR_BUSERROR1_Clear (0x1UL)       /*!< Disable                                                              */
  #define I2S_INTENCLR_BUSERROR1_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define I2S_INTENCLR_BUSERROR1_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* I2S_ENABLE: Enable I2S module */
  #define I2S_ENABLE_ResetValue (0x00000000UL)       /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : Enable I2S module */
  #define I2S_ENABLE_ENABLE_Pos (0UL)                /*!< Position of ENABLE field.                                            */
  #define I2S_ENABLE_ENABLE_Msk (0x1UL << I2S_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                                */
  #define I2S_ENABLE_ENABLE_Min (0x0UL)              /*!< Min enumerator value of ENABLE field.                                */
  #define I2S_ENABLE_ENABLE_Max (0x1UL)              /*!< Max enumerator value of ENABLE field.                                */
  #define I2S_ENABLE_ENABLE_Disabled (0x0UL)         /*!< Disable                                                              */
  #define I2S_ENABLE_ENABLE_Enabled (0x1UL)          /*!< Enable                                                               */


/* I2S_DMA_ENABLE_RX: Equivalent to ID_DMA_CHANNEL_PERIPHERAL_ENABLE_RX */
  #define I2S_DMA_ENABLE_RX_ResetValue (0x00000000UL) /*!< Reset value of DMA_ENABLE_RX register.                              */

/* ENABLE @Bit 0 : (unspecified) */
  #define I2S_DMA_ENABLE_RX_ENABLE_Pos (0UL)         /*!< Position of ENABLE field.                                            */
  #define I2S_DMA_ENABLE_RX_ENABLE_Msk (0x1UL << I2S_DMA_ENABLE_RX_ENABLE_Pos) /*!< Bit mask of ENABLE field.                  */
  #define I2S_DMA_ENABLE_RX_ENABLE_Min (0x0UL)       /*!< Min enumerator value of ENABLE field.                                */
  #define I2S_DMA_ENABLE_RX_ENABLE_Max (0x1UL)       /*!< Max enumerator value of ENABLE field.                                */
  #define I2S_DMA_ENABLE_RX_ENABLE_Disabled (0x0UL)  /*!< Disable                                                              */
  #define I2S_DMA_ENABLE_RX_ENABLE_Enabled (0x1UL)   /*!< Enable                                                               */


/* I2S_DMA_ENABLE_TX: Equivalent to ID_DMA_CHANNEL_PERIPHERAL_ENABLE_TX */
  #define I2S_DMA_ENABLE_TX_ResetValue (0x00000000UL) /*!< Reset value of DMA_ENABLE_TX register.                              */

/* ENABLE @Bit 0 : (unspecified) */
  #define I2S_DMA_ENABLE_TX_ENABLE_Pos (0UL)         /*!< Position of ENABLE field.                                            */
  #define I2S_DMA_ENABLE_TX_ENABLE_Msk (0x1UL << I2S_DMA_ENABLE_TX_ENABLE_Pos) /*!< Bit mask of ENABLE field.                  */
  #define I2S_DMA_ENABLE_TX_ENABLE_Min (0x0UL)       /*!< Min enumerator value of ENABLE field.                                */
  #define I2S_DMA_ENABLE_TX_ENABLE_Max (0x1UL)       /*!< Max enumerator value of ENABLE field.                                */
  #define I2S_DMA_ENABLE_TX_ENABLE_Disabled (0x0UL)  /*!< Disable                                                              */
  #define I2S_DMA_ENABLE_TX_ENABLE_Enabled (0x1UL)   /*!< Enable                                                               */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            I3C                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

