adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ===================================================== Struct I3C_CDR ====================================================== */
/**
  * @brief CDR [I3C_CDR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  STARTOFFSET;                       /*!< (@ 0x00000000) Start offset of recovered clock                       */
  __IOM uint32_t  MAXCYCLERATIO;                     /*!< (@ 0x00000004) Maximum cycle ratio between SDA/SCL and CDR (clock and
                                                                         data recovery) clock*/                                   
  __IOM uint32_t  MAXSKEW;                           /*!< (@ 0x00000008) Maximum skew between SCL and SCL in CDR clock cycles  */
} NRF_I3C_CDR_Type;                                  /*!< Size = 12 (0x00C)                                                    */

/* I3C_CDR_STARTOFFSET: Start offset of recovered clock */
  #define I3C_CDR_STARTOFFSET_ResetValue (0x00000004UL) /*!< Reset value of STARTOFFSET register.                              */

/* VAL @Bits 0..15 : Value */
  #define I3C_CDR_STARTOFFSET_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define I3C_CDR_STARTOFFSET_VAL_Msk (0xFFFFUL << I3C_CDR_STARTOFFSET_VAL_Pos) /*!< Bit mask of VAL field.                    */


/* I3C_CDR_MAXCYCLERATIO: Maximum cycle ratio between SDA/SCL and CDR (clock and data recovery) clock */
  #define I3C_CDR_MAXCYCLERATIO_ResetValue (0x00000028UL) /*!< Reset value of MAXCYCLERATIO register.                          */

/* VAL @Bits 0..15 : Value */
  #define I3C_CDR_MAXCYCLERATIO_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define I3C_CDR_MAXCYCLERATIO_VAL_Msk (0xFFFFUL << I3C_CDR_MAXCYCLERATIO_VAL_Pos) /*!< Bit mask of VAL field.                */


/* I3C_CDR_MAXSKEW: Maximum skew between SCL and SCL in CDR clock cycles */
  #define I3C_CDR_MAXSKEW_ResetValue (0x00000005UL)  /*!< Reset value of MAXSKEW register.                                     */

/* VAL @Bits 0..7 : Value */
  #define I3C_CDR_MAXSKEW_VAL_Pos (0UL)              /*!< Position of VAL field.                                               */
  #define I3C_CDR_MAXSKEW_VAL_Msk (0xFFUL << I3C_CDR_MAXSKEW_VAL_Pos) /*!< Bit mask of VAL field.                              */


/* ======================================================= Struct I3C ======================================================== */
/**
  * @brief I3C
  */
  typedef struct {                                   /*!< I3C Structure                                                        */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_CORE;                      /*!< (@ 0x00000100) Event indicating that interrupt triggered at I3C core */
    __IOM uint32_t EVENTS_DMA;                       /*!< (@ 0x00000104) Event indicating that interrupt triggered at I3C DMA  */
    __IM uint32_t RESERVED1[126];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000400) Enable I3C peripheral.                                */
    __IOM NRF_I3C_CDR_Type CDR;                      /*!< (@ 0x00000404) (unspecified)                                         */
    __IOM uint32_t SLAVEIF0;                         /*!< (@ 0x00000410) I3C slave interface 0                                 */
    __IOM uint32_t SLAVEIF1;                         /*!< (@ 0x00000414) I3C slave interface 1                                 */
    __IOM uint32_t SLAVEPID0;                        /*!< (@ 0x00000418) Slave Device Provisioned ID 0                         */
    __IOM uint32_t SLAVEPID1;                        /*!< (@ 0x0000041C) Slave Device Provisioned ID 1                         */
    __IOM uint32_t KEEPSDA;                          /*!< (@ 0x00000420) Enable or disable the SDA high-keeper used for
                                                                         Master-to-Slave and Slave-to-Master bus hand-off.*/      
    __IOM uint32_t KEEPSCL;                          /*!< (@ 0x00000424) Enable or disable the SCL high-keeper used for
                                                                         Master-to-Slave and Slave-to-Master bus hand-off.*/      
  } NRF_I3C_Type;                                    /*!< Size = 1064 (0x428)                                                  */

/* I3C_EVENTS_CORE: Event indicating that interrupt triggered at I3C core */
  #define I3C_EVENTS_CORE_ResetValue (0x00000000UL)  /*!< Reset value of EVENTS_CORE register.                                 */

/* EVENTS_CORE @Bit 0 : Event indicating that interrupt triggered at I3C core */
  #define I3C_EVENTS_CORE_EVENTS_CORE_Pos (0UL)      /*!< Position of EVENTS_CORE field.                                       */
  #define I3C_EVENTS_CORE_EVENTS_CORE_Msk (0x1UL << I3C_EVENTS_CORE_EVENTS_CORE_Pos) /*!< Bit mask of EVENTS_CORE field.       */
  #define I3C_EVENTS_CORE_EVENTS_CORE_Min (0x0UL)    /*!< Min enumerator value of EVENTS_CORE field.                           */
  #define I3C_EVENTS_CORE_EVENTS_CORE_Max (0x1UL)    /*!< Max enumerator value of EVENTS_CORE field.                           */
  #define I3C_EVENTS_CORE_EVENTS_CORE_NotGenerated (0x0UL) /*!< Event not generated                                            */
  #define I3C_EVENTS_CORE_EVENTS_CORE_Generated (0x1UL) /*!< Event generated                                                   */


