adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* I3C_EVENTS_DMA: Event indicating that interrupt triggered at I3C DMA */
  #define I3C_EVENTS_DMA_ResetValue (0x00000000UL)   /*!< Reset value of EVENTS_DMA register.                                  */

/* EVENTS_DMA @Bit 0 : Event indicating that interrupt triggered at I3C DMA */
  #define I3C_EVENTS_DMA_EVENTS_DMA_Pos (0UL)        /*!< Position of EVENTS_DMA field.                                        */
  #define I3C_EVENTS_DMA_EVENTS_DMA_Msk (0x1UL << I3C_EVENTS_DMA_EVENTS_DMA_Pos) /*!< Bit mask of EVENTS_DMA field.            */
  #define I3C_EVENTS_DMA_EVENTS_DMA_Min (0x0UL)      /*!< Min enumerator value of EVENTS_DMA field.                            */
  #define I3C_EVENTS_DMA_EVENTS_DMA_Max (0x1UL)      /*!< Max enumerator value of EVENTS_DMA field.                            */
  #define I3C_EVENTS_DMA_EVENTS_DMA_NotGenerated (0x0UL) /*!< Event not generated                                              */
  #define I3C_EVENTS_DMA_EVENTS_DMA_Generated (0x1UL) /*!< Event generated                                                     */


/* I3C_INTEN: Enable or disable interrupt */
  #define I3C_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* CORE @Bit 0 : Enable or disable interrupt for event CORE */
  #define I3C_INTEN_CORE_Pos (0UL)                   /*!< Position of CORE field.                                              */
  #define I3C_INTEN_CORE_Msk (0x1UL << I3C_INTEN_CORE_Pos) /*!< Bit mask of CORE field.                                        */
  #define I3C_INTEN_CORE_Min (0x0UL)                 /*!< Min enumerator value of CORE field.                                  */
  #define I3C_INTEN_CORE_Max (0x1UL)                 /*!< Max enumerator value of CORE field.                                  */
  #define I3C_INTEN_CORE_Disabled (0x0UL)            /*!< Disable                                                              */
  #define I3C_INTEN_CORE_Enabled (0x1UL)             /*!< Enable                                                               */

/* DMA @Bit 1 : Enable or disable interrupt for event DMA */
  #define I3C_INTEN_DMA_Pos (1UL)                    /*!< Position of DMA field.                                               */
  #define I3C_INTEN_DMA_Msk (0x1UL << I3C_INTEN_DMA_Pos) /*!< Bit mask of DMA field.                                           */
  #define I3C_INTEN_DMA_Min (0x0UL)                  /*!< Min enumerator value of DMA field.                                   */
  #define I3C_INTEN_DMA_Max (0x1UL)                  /*!< Max enumerator value of DMA field.                                   */
  #define I3C_INTEN_DMA_Disabled (0x0UL)             /*!< Disable                                                              */
  #define I3C_INTEN_DMA_Enabled (0x1UL)              /*!< Enable                                                               */


/* I3C_INTENSET: Enable interrupt */
  #define I3C_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* CORE @Bit 0 : Write '1' to enable interrupt for event CORE */
  #define I3C_INTENSET_CORE_Pos (0UL)                /*!< Position of CORE field.                                              */
  #define I3C_INTENSET_CORE_Msk (0x1UL << I3C_INTENSET_CORE_Pos) /*!< Bit mask of CORE field.                                  */
  #define I3C_INTENSET_CORE_Min (0x0UL)              /*!< Min enumerator value of CORE field.                                  */
  #define I3C_INTENSET_CORE_Max (0x1UL)              /*!< Max enumerator value of CORE field.                                  */
  #define I3C_INTENSET_CORE_Set (0x1UL)              /*!< Enable                                                               */
  #define I3C_INTENSET_CORE_Disabled (0x0UL)         /*!< Read: Disabled                                                       */
  #define I3C_INTENSET_CORE_Enabled (0x1UL)          /*!< Read: Enabled                                                        */

/* DMA @Bit 1 : Write '1' to enable interrupt for event DMA */
  #define I3C_INTENSET_DMA_Pos (1UL)                 /*!< Position of DMA field.                                               */
  #define I3C_INTENSET_DMA_Msk (0x1UL << I3C_INTENSET_DMA_Pos) /*!< Bit mask of DMA field.                                     */
  #define I3C_INTENSET_DMA_Min (0x0UL)               /*!< Min enumerator value of DMA field.                                   */
  #define I3C_INTENSET_DMA_Max (0x1UL)               /*!< Max enumerator value of DMA field.                                   */
  #define I3C_INTENSET_DMA_Set (0x1UL)               /*!< Enable                                                               */
  #define I3C_INTENSET_DMA_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define I3C_INTENSET_DMA_Enabled (0x1UL)           /*!< Read: Enabled                                                        */


/* I3C_INTENCLR: Disable interrupt */
  #define I3C_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* CORE @Bit 0 : Write '1' to disable interrupt for event CORE */
  #define I3C_INTENCLR_CORE_Pos (0UL)                /*!< Position of CORE field.                                              */
  #define I3C_INTENCLR_CORE_Msk (0x1UL << I3C_INTENCLR_CORE_Pos) /*!< Bit mask of CORE field.                                  */
  #define I3C_INTENCLR_CORE_Min (0x0UL)              /*!< Min enumerator value of CORE field.                                  */
  #define I3C_INTENCLR_CORE_Max (0x1UL)              /*!< Max enumerator value of CORE field.                                  */
  #define I3C_INTENCLR_CORE_Clear (0x1UL)            /*!< Disable                                                              */
  #define I3C_INTENCLR_CORE_Disabled (0x0UL)         /*!< Read: Disabled                                                       */
  #define I3C_INTENCLR_CORE_Enabled (0x1UL)          /*!< Read: Enabled                                                        */

/* DMA @Bit 1 : Write '1' to disable interrupt for event DMA */
  #define I3C_INTENCLR_DMA_Pos (1UL)                 /*!< Position of DMA field.                                               */
  #define I3C_INTENCLR_DMA_Msk (0x1UL << I3C_INTENCLR_DMA_Pos) /*!< Bit mask of DMA field.                                     */
  #define I3C_INTENCLR_DMA_Min (0x0UL)               /*!< Min enumerator value of DMA field.                                   */
  #define I3C_INTENCLR_DMA_Max (0x1UL)               /*!< Max enumerator value of DMA field.                                   */
  #define I3C_INTENCLR_DMA_Clear (0x1UL)             /*!< Disable                                                              */
  #define I3C_INTENCLR_DMA_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define I3C_INTENCLR_DMA_Enabled (0x1UL)           /*!< Read: Enabled                                                        */


/* I3C_INTPEND: Pending interrupts */
  #define I3C_INTPEND_ResetValue (0x00000000UL)      /*!< Reset value of INTPEND register.                                     */

/* CORE @Bit 0 : Read pending status of interrupt for event CORE */
  #define I3C_INTPEND_CORE_Pos (0UL)                 /*!< Position of CORE field.                                              */
  #define I3C_INTPEND_CORE_Msk (0x1UL << I3C_INTPEND_CORE_Pos) /*!< Bit mask of CORE field.                                    */
  #define I3C_INTPEND_CORE_Min (0x0UL)               /*!< Min enumerator value of CORE field.                                  */
  #define I3C_INTPEND_CORE_Max (0x1UL)               /*!< Max enumerator value of CORE field.                                  */
  #define I3C_INTPEND_CORE_NotPending (0x0UL)        /*!< Read: Not pending                                                    */
  #define I3C_INTPEND_CORE_Pending (0x1UL)           /*!< Read: Pending                                                        */

