adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DCR @Bits 0..7 : Device Characteristic Value */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC3_DCR_Pos (0UL) /*!< Position of DCR field.                                             */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC3_DCR_Msk (0xFFUL << I3CCORE_CORE_DEVCHARTABLE_LOC3_DCR_Pos) /*!< Bit mask of DCR field.*/

/* BCR @Bits 8..15 : Bus Characteristic Value */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC3_BCR_Pos (8UL) /*!< Position of BCR field.                                             */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC3_BCR_Msk (0xFFUL << I3CCORE_CORE_DEVCHARTABLE_LOC3_BCR_Pos) /*!< Bit mask of BCR field.*/


/* I3CCORE_CORE_DEVCHARTABLE_LOC4: Device Characteristic Table Location-4 of Device [n] */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC4_ResetValue (0x00000000UL) /*!< Reset value of LOC4 register.                          */

/* DEVDYNAMICADDR @Bits 0..7 : Device Dynamic Address assigned. */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC4_DEVDYNAMICADDR_Pos (0UL) /*!< Position of DEVDYNAMICADDR field.                       */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC4_DEVDYNAMICADDR_Msk (0xFFUL << I3CCORE_CORE_DEVCHARTABLE_LOC4_DEVDYNAMICADDR_Pos) /*!<
                                                                            Bit mask of DEVDYNAMICADDR field.*/                   



/* =================================================== Struct I3CCORE_CORE =================================================== */
/**
  * @brief CORE [I3CCORE_CORE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DEVICECTRL;                        /*!< (@ 0x00000000) DWC_mipi_i3c control Register                         */
  __IOM uint32_t  DEVICEADDR;                        /*!< (@ 0x00000004) In the master mode of operation this Register is used
                                                                         to program the Device Dynamic Addresses and its
                                                                         respective valid bit.*/                                  
  __IOM uint32_t  HWCAPABILITY;                      /*!< (@ 0x00000008) Hardware Capability register                          */
  __IOM uint32_t  COMMANDQUEUEPORT;                  /*!< (@ 0x0000000C) Command Queue Port.                                   */
  __IOM uint32_t  RESPONSEQUEUEPORT;                 /*!< (@ 0x00000010) Response Queue Port                                   */
  #if defined(_GNUC_)
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
  #endif
  union {
    __IOM uint32_t RXDATAPORT;                       /*!< (@ 0x00000014) Receive Data Port Register                            */
    __IOM uint32_t TXDATAPORT;                       /*!< (@ 0x00000014) Transmit Data Port Register                           */
  };
  #if defined(_GNUC_)
    #pragma GCC diagnostic pop
  #endif
  #if defined(_GNUC_)
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
  #endif
  union {
    __IOM uint32_t IBIQUEUEDATA;                     /*!< (@ 0x00000018) In-Band Interrupt Queue Data Register                 */
    __IOM uint32_t IBIQUEUESTATUS;                   /*!< (@ 0x00000018) In-Band Interrupt Queue Status Register               */
  };
  #if defined(_GNUC_)
    #pragma GCC diagnostic pop
  #endif
  __IOM uint32_t  QUEUETHLDCTRL;                     /*!< (@ 0x0000001C) Queue Threshold Control Register                      */
  __IOM uint32_t  DATABUFFERTHLDCTRL;                /*!< (@ 0x00000020) Data Buffer Threshold Control Register                */
  __IOM uint32_t  IBIQUEUECTRL;                      /*!< (@ 0x00000024) This Register is used to control whether or not to
                                                                         intimate the application if an IBI request is rejected
                                                                         (Nacked).*/                                              
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  IBIMRREQREJECT;                    /*!< (@ 0x0000002C) IBI Master Request Rejection Control Register.        */
  __IOM uint32_t  IBISIRREQREJECT;                   /*!< (@ 0x00000030) IBI SIR Request Rejection Control                     */
  __IOM uint32_t  RESETCTRL;                         /*!< (@ 0x00000034) This Register is used for general software reset and
                                                                         for individual buffer reset.*/                           
  __IOM uint32_t  SLVEVENTSTATUS;                    /*!< (@ 0x00000038) This register indicates the status/values of some
                                                                         events/controls that are relavant to slave mode of
                                                                         operation.*/                                             
  __IOM uint32_t  INTRSTATUS;                        /*!< (@ 0x0000003C) Interrupt Status Register                             */
  __IOM uint32_t  INTRSTATUSEN;                      /*!< (@ 0x00000040) Interrupt Status Enable Register.                     */
  __IOM uint32_t  INTRSIGNALEN;                      /*!< (@ 0x00000044) Interrupt Signal Enable Register                      */
  __IOM uint32_t  INTRFORCE;                         /*!< (@ 0x00000048) Interrupt Force Enable Register                       */
  __IOM uint32_t  QUEUESTATUSLEVEL;                  /*!< (@ 0x0000004C) Queue Status Level Register.                          */
  __IOM uint32_t  DATABUFFERSTATUSLEVEL;             /*!< (@ 0x00000050) Data Buffer Status Level Register.                    */
  #if defined(_GNUC_)
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
  #endif
  union {
    __IOM uint32_t PRESENTSTATEM;                    /*!< (@ 0x00000054) The user can get status of the DWC_mipi_i3c Controller
                                                                         from this 32-bit read only register (Master).*/          
    __IOM uint32_t PRESENTSTATES;                    /*!< (@ 0x00000054) The user can get status of the DWC_mipi_i3c Controller
                                                                         from this 32-bit read only register (Slave).*/           
  };
  #if defined(_GNUC_)
    #pragma GCC diagnostic pop
  #endif
  __IOM uint32_t  CCCDEVICESTATUS;                   /*!< (@ 0x00000058) Device Operating Status Register.                     */
  __IOM uint32_t  DEVICEADDRTABLEPOINTER;            /*!< (@ 0x0000005C) Pointer for Device Address Table                      */
  __IOM uint32_t  DEVCHARTABLEPOINTER;               /*!< (@ 0x00000060) Pointer for Device Characteristics Table              */
  __IM  uint32_t  RESERVED1[2];
  __IOM uint32_t  VENDORSPECIFICREGPOINTER;          /*!< (@ 0x0000006C) Pointer for Vendor Specific Registers.                */
  __IOM uint32_t  SLVMIPIIDVALUE;                    /*!< (@ 0x00000070) I3C MIPI Manufacturer ID Register.                    */
  __IOM uint32_t  SLVPIDVALUE;                       /*!< (@ 0x00000074) I3C Normal Provisional ID Register.                   */
  __IOM uint32_t  SLVCHARCTRL;                       /*!< (@ 0x00000078) I3C Slave Characteristic Register.                    */
  __IOM uint32_t  SLVMAXLEN;                         /*!< (@ 0x0000007C) I3C Max Write/Read Length Register.                   */
  __IOM uint32_t  MAXREADTURNAROUND;                 /*!< (@ 0x00000080) MXDS Maximum Read Turnaround Time.                    */
  __IOM uint32_t  MAXDATASPEED;                      /*!< (@ 0x00000084) The values in this register are returned by the slave
                                                                         as GETACCMST CCC data.*/                                 
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  SLVINTRREQ;                        /*!< (@ 0x0000008C) This register is used in slave mode of operation.     */
  __IOM uint32_t  SLVTSXSYMBLTIMING;                 /*!< (@ 0x00000090) TSP/TSL Symbol Timing Register                        */
  __IM  uint32_t  RESERVED3[7];
  __IOM uint32_t  DEVICECTRLEXTENDED;                /*!< (@ 0x000000B0) Device Control Extended register.                     */
  __IOM uint32_t  SCLI3CODTIMING;                    /*!< (@ 0x000000B4) SCL I3C Open Drain Timing Register                    */
  __IOM uint32_t  SCLI3CPPTIMING;                    /*!< (@ 0x000000B8) SCL I3C Push Pull Timing Register                     */
  __IOM uint32_t  SCLI2CFMTIMING;                    /*!< (@ 0x000000BC) SCL I2C Fast Mode Timing Register                     */
  __IOM uint32_t  SCLI2CFMPTIMING;                   /*!< (@ 0x000000C0) SCL I2C Fast Mode Plus Timing Register                */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  SCLEXTLCNTTIMING;                  /*!< (@ 0x000000C8) SCL Extended Low Count Timing Register.               */
  __IOM uint32_t  SCLEXTTERMNLCNTTIMING;             /*!< (@ 0x000000CC) SCL Termination Bit Low Count Timing Register         */
  __IOM uint32_t  SDAHOLDSWITCHDLYTIMING;            /*!< (@ 0x000000D0) SDA Hold and Mode Switch Delay Timing Register        */
  __IOM uint32_t  BUSFREEAVAILTIMING;                /*!< (@ 0x000000D4) Bus Free and Available Timing Register                */
  __IOM uint32_t  BUSIDLETIMING;                     /*!< (@ 0x000000D8) Bus Idle Timing Register                              */
  __IOM uint32_t  SCLLOWMSTEXTTIMEOUT;               /*!< (@ 0x000000DC) The SCL Low Master Extended Timeout register is used to
                                                                         define the duration of the SCL Low Bus Reset Pattern.*/  
  __IOM uint32_t  I3CVERID;                          /*!< (@ 0x000000E0) This register reflects the current release number of
                                                                         DWC_mipi_i3c*/                                           
  __IOM uint32_t  I3CVERTYPE;                        /*!< (@ 0x000000E4) This register reflects the current release type of
                                                                         DWC_mipi_i3c.*/                                          
  __IOM uint32_t  QUEUESIZECAPABILITY;               /*!< (@ 0x000000E8) This register reflects the configured size of the Data
                                                                         Buffer and Queues in DWC_mipi_i3c.*/                     
  __IM  uint32_t  RESERVED5[69];
  #if defined(_GNUC_)
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
  #endif
  union {
    __IOM NRF_I3CCORE_CORE_DEVCHARTABLE_Type DEVCHARTABLE[10]; /*!< (@ 0x00000200) (unspecified)                               */
    __IOM uint32_t SECDEVCHARTABLE[32];              /*!< (@ 0x00000200) Secondary Master Device Characteristic Table Location
                                                                         of Device [n]*/                                          
  };
  #if defined(_GNUC_)
    #pragma GCC diagnostic pop
  #endif
  __IM  uint32_t  RESERVED6[8];
  __IOM uint32_t  DEVADDRTABLELOC[10];               /*!< (@ 0x000002C0) Device Address Table of Device [n]                    */
} NRF_I3CCORE_CORE_Type;                             /*!< Size = 744 (0x2E8)                                                   */

