adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* I3CCORE_CORE_DEVICECTRL: DWC_mipi_i3c control Register */
  #define I3CCORE_CORE_DEVICECTRL_ResetValue (0x00000000UL) /*!< Reset value of DEVICECTRL register.                           */

/* IBAINCLUDE @Bit 0 : I3C Broadcast Address include */
  #define I3CCORE_CORE_DEVICECTRL_IBAINCLUDE_Pos (0UL) /*!< Position of IBAINCLUDE field.                                      */
  #define I3CCORE_CORE_DEVICECTRL_IBAINCLUDE_Msk (0x1UL << I3CCORE_CORE_DEVICECTRL_IBAINCLUDE_Pos) /*!< Bit mask of IBAINCLUDE
                                                                            field.*/                                              
  #define I3CCORE_CORE_DEVICECTRL_IBAINCLUDE_Min (0x0UL) /*!< Min enumerator value of IBAINCLUDE field.                        */
  #define I3CCORE_CORE_DEVICECTRL_IBAINCLUDE_Max (0x1UL) /*!< Max enumerator value of IBAINCLUDE field.                        */
  #define I3CCORE_CORE_DEVICECTRL_IBAINCLUDE_NOT_INCLUDED (0x0UL) /*!< (unspecified)                                           */
  #define I3CCORE_CORE_DEVICECTRL_IBAINCLUDE_INCLUDED (0x1UL) /*!< (unspecified)                                               */

/* I2CSLAVEPRESENT @Bit 7 : I2C Slave Present */
  #define I3CCORE_CORE_DEVICECTRL_I2CSLAVEPRESENT_Pos (7UL) /*!< Position of I2CSLAVEPRESENT field.                            */
  #define I3CCORE_CORE_DEVICECTRL_I2CSLAVEPRESENT_Msk (0x1UL << I3CCORE_CORE_DEVICECTRL_I2CSLAVEPRESENT_Pos) /*!< Bit mask of
                                                                            I2CSLAVEPRESENT field.*/                              
  #define I3CCORE_CORE_DEVICECTRL_I2CSLAVEPRESENT_Min (0x0UL) /*!< Min enumerator value of I2CSLAVEPRESENT field.              */
  #define I3CCORE_CORE_DEVICECTRL_I2CSLAVEPRESENT_Max (0x1UL) /*!< Max enumerator value of I2CSLAVEPRESENT field.              */
  #define I3CCORE_CORE_DEVICECTRL_I2CSLAVEPRESENT_DISABLED (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_CORE_DEVICECTRL_I2CSLAVEPRESENT_ENABLED (0x1UL) /*!< (unspecified)                                           */

/* HOTJOINCTRL @Bit 8 : Hot-Join ACK/NACK Control */
  #define I3CCORE_CORE_DEVICECTRL_HOTJOINCTRL_Pos (8UL) /*!< Position of HOTJOINCTRL field.                                    */
  #define I3CCORE_CORE_DEVICECTRL_HOTJOINCTRL_Msk (0x1UL << I3CCORE_CORE_DEVICECTRL_HOTJOINCTRL_Pos) /*!< Bit mask of
                                                                            HOTJOINCTRL field.*/                                  
  #define I3CCORE_CORE_DEVICECTRL_HOTJOINCTRL_Min (0x0UL) /*!< Min enumerator value of HOTJOINCTRL field.                      */
  #define I3CCORE_CORE_DEVICECTRL_HOTJOINCTRL_Max (0x1UL) /*!< Max enumerator value of HOTJOINCTRL field.                      */
  #define I3CCORE_CORE_DEVICECTRL_HOTJOINCTRL_DISABLED (0x0UL) /*!< (unspecified)                                              */
  #define I3CCORE_CORE_DEVICECTRL_HOTJOINCTRL_ENABLED (0x1UL) /*!< (unspecified)                                               */

/* IDLECNTMULTPLIER @Bits 24..25 : Idle Count Multiplier */
  #define I3CCORE_CORE_DEVICECTRL_IDLECNTMULTPLIER_Pos (24UL) /*!< Position of IDLECNTMULTPLIER field.                         */
  #define I3CCORE_CORE_DEVICECTRL_IDLECNTMULTPLIER_Msk (0x3UL << I3CCORE_CORE_DEVICECTRL_IDLECNTMULTPLIER_Pos) /*!< Bit mask of
                                                                            IDLECNTMULTPLIER field.*/                             
  #define I3CCORE_CORE_DEVICECTRL_IDLECNTMULTPLIER_Min (0x0UL) /*!< Min enumerator value of IDLECNTMULTPLIER field.            */
  #define I3CCORE_CORE_DEVICECTRL_IDLECNTMULTPLIER_Max (0x3UL) /*!< Max enumerator value of IDLECNTMULTPLIER field.            */
  #define I3CCORE_CORE_DEVICECTRL_IDLECNTMULTPLIER_MultiplyBy1 (0x0UL) /*!< (unspecified)                                      */
  #define I3CCORE_CORE_DEVICECTRL_IDLECNTMULTPLIER_MultiplyBy2 (0x1UL) /*!< (unspecified)                                      */
  #define I3CCORE_CORE_DEVICECTRL_IDLECNTMULTPLIER_MultiplyBy4 (0x2UL) /*!< (unspecified)                                      */
  #define I3CCORE_CORE_DEVICECTRL_IDLECNTMULTPLIER_MultiplyBy8 (0x3UL) /*!< (unspecified)                                      */

/* ADAPTIVEI2CI3C @Bit 27 : This field is used in Slave mode of operation. */
  #define I3CCORE_CORE_DEVICECTRL_ADAPTIVEI2CI3C_Pos (27UL) /*!< Position of ADAPTIVEI2CI3C field.                             */
  #define I3CCORE_CORE_DEVICECTRL_ADAPTIVEI2CI3C_Msk (0x1UL << I3CCORE_CORE_DEVICECTRL_ADAPTIVEI2CI3C_Pos) /*!< Bit mask of
                                                                            ADAPTIVEI2CI3C field.*/                               

/* DMAENABLE @Bit 28 : DMA Handshake Interface Enable */
  #define I3CCORE_CORE_DEVICECTRL_DMAENABLE_Pos (28UL) /*!< Position of DMAENABLE field.                                       */
  #define I3CCORE_CORE_DEVICECTRL_DMAENABLE_Msk (0x1UL << I3CCORE_CORE_DEVICECTRL_DMAENABLE_Pos) /*!< Bit mask of DMAENABLE
                                                                            field.*/                                              
  #define I3CCORE_CORE_DEVICECTRL_DMAENABLE_Min (0x0UL) /*!< Min enumerator value of DMAENABLE field.                          */
  #define I3CCORE_CORE_DEVICECTRL_DMAENABLE_Max (0x1UL) /*!< Max enumerator value of DMAENABLE field.                          */
  #define I3CCORE_CORE_DEVICECTRL_DMAENABLE_DISABLE (0x0UL) /*!< The DMA handshake control has no significance.                */
  #define I3CCORE_CORE_DEVICECTRL_DMAENABLE_ENABLE (0x1UL) /*!< Enables the DMA handshake control to interact with external
                                                                DMA.*/                                                            

/* ABORT @Bit 29 : DWC_mipi_i3c Abort */
  #define I3CCORE_CORE_DEVICECTRL_ABORT_Pos (29UL)   /*!< Position of ABORT field.                                             */
  #define I3CCORE_CORE_DEVICECTRL_ABORT_Msk (0x1UL << I3CCORE_CORE_DEVICECTRL_ABORT_Pos) /*!< Bit mask of ABORT field.         */

/* RESUME @Bit 30 : DWC_mipi_i3c Resume */
  #define I3CCORE_CORE_DEVICECTRL_RESUME_Pos (30UL)  /*!< Position of RESUME field.                                            */
  #define I3CCORE_CORE_DEVICECTRL_RESUME_Msk (0x1UL << I3CCORE_CORE_DEVICECTRL_RESUME_Pos) /*!< Bit mask of RESUME field.      */

/* ENABLE @Bit 31 : Controls whether or not DWC_mipi_i3c is enabled. */
  #define I3CCORE_CORE_DEVICECTRL_ENABLE_Pos (31UL)  /*!< Position of ENABLE field.                                            */
  #define I3CCORE_CORE_DEVICECTRL_ENABLE_Msk (0x1UL << I3CCORE_CORE_DEVICECTRL_ENABLE_Pos) /*!< Bit mask of ENABLE field.      */
  #define I3CCORE_CORE_DEVICECTRL_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                                */
  #define I3CCORE_CORE_DEVICECTRL_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                                */
  #define I3CCORE_CORE_DEVICECTRL_ENABLE_DISABLE (0x0UL) /*!< Disables the DWC_mipi_i3c controller                             */
  #define I3CCORE_CORE_DEVICECTRL_ENABLE_ENABLE (0x1UL) /*!< Enables the DWC_mipi_i3c controller.                              */


/* I3CCORE_CORE_DEVICEADDR: In the master mode of operation this Register is used to program the Device Dynamic Addresses and
                             its respective valid bit. */                                                                         
                                                                                                                                  
  #define I3CCORE_CORE_DEVICEADDR_ResetValue (0x80000000UL) /*!< Reset value of DEVICEADDR register.                           */

