adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DEFSLVSTSEN @Bit 10 : Define Slave CCC Received Status Enable */
  #define I3CCORE_CORE_INTRSTATUSEN_DEFSLVSTSEN_Pos (10UL) /*!< Position of DEFSLVSTSEN field.                                 */
  #define I3CCORE_CORE_INTRSTATUSEN_DEFSLVSTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_DEFSLVSTSEN_Pos) /*!< Bit mask of
                                                                            DEFSLVSTSEN field.*/                                  

/* READREQRECVSTSEN @Bit 11 : Read Request Received Status Enable */
  #define I3CCORE_CORE_INTRSTATUSEN_READREQRECVSTSEN_Pos (11UL) /*!< Position of READREQRECVSTSEN field.                       */
  #define I3CCORE_CORE_INTRSTATUSEN_READREQRECVSTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_READREQRECVSTSEN_Pos) /*!< Bit mask
                                                                            of READREQRECVSTSEN field.*/                          

/* IBIUPDATEDSTSEN @Bit 12 : IBI Updated Status Enable */
  #define I3CCORE_CORE_INTRSTATUSEN_IBIUPDATEDSTSEN_Pos (12UL) /*!< Position of IBIUPDATEDSTSEN field.                         */
  #define I3CCORE_CORE_INTRSTATUSEN_IBIUPDATEDSTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_IBIUPDATEDSTSEN_Pos) /*!< Bit mask
                                                                            of IBIUPDATEDSTSEN field.*/                           

/* BUSOWNERUPDATEDSTSEN @Bit 13 : Bus owner Updated Status Enable */
  #define I3CCORE_CORE_INTRSTATUSEN_BUSOWNERUPDATEDSTSEN_Pos (13UL) /*!< Position of BUSOWNERUPDATEDSTSEN field.               */
  #define I3CCORE_CORE_INTRSTATUSEN_BUSOWNERUPDATEDSTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_BUSOWNERUPDATEDSTSEN_Pos) /*!<
                                                                            Bit mask of BUSOWNERUPDATEDSTSEN field.*/             

/* BUSRESETDONESTSEN @Bit 15 : Bus Reset Pattern Generation Done Status Enable. */
  #define I3CCORE_CORE_INTRSTATUSEN_BUSRESETDONESTSEN_Pos (15UL) /*!< Position of BUSRESETDONESTSEN field.                     */
  #define I3CCORE_CORE_INTRSTATUSEN_BUSRESETDONESTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_BUSRESETDONESTSEN_Pos) /*!< Bit
                                                                            mask of BUSRESETDONESTSEN field.*/                    


/* I3CCORE_CORE_INTRSIGNALEN: Interrupt Signal Enable Register */
  #define I3CCORE_CORE_INTRSIGNALEN_ResetValue (0x00000000UL) /*!< Reset value of INTRSIGNALEN register.                       */

/* TXTHLDSIGNALEN @Bit 0 : Transmit Buffer Threshold Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_TXTHLDSIGNALEN_Pos (0UL) /*!< Position of TXTHLDSIGNALEN field.                            */
  #define I3CCORE_CORE_INTRSIGNALEN_TXTHLDSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_TXTHLDSIGNALEN_Pos) /*!< Bit mask of
                                                                            TXTHLDSIGNALEN field.*/                               

/* RXTHLDSIGNALEN @Bit 1 : Receive Buffer Threshold Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_RXTHLDSIGNALEN_Pos (1UL) /*!< Position of RXTHLDSIGNALEN field.                            */
  #define I3CCORE_CORE_INTRSIGNALEN_RXTHLDSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_RXTHLDSIGNALEN_Pos) /*!< Bit mask of
                                                                            RXTHLDSIGNALEN field.*/                               

/* IBITHLDSIGNALEN @Bit 2 : IBI Buffer Threshold Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_IBITHLDSIGNALEN_Pos (2UL) /*!< Position of IBITHLDSIGNALEN field.                          */
  #define I3CCORE_CORE_INTRSIGNALEN_IBITHLDSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_IBITHLDSIGNALEN_Pos) /*!< Bit mask
                                                                            of IBITHLDSIGNALEN field.*/                           

/* CMDQUEUEREADYSIGNALEN @Bit 3 : Command Queue Ready Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_CMDQUEUEREADYSIGNALEN_Pos (3UL) /*!< Position of CMDQUEUEREADYSIGNALEN field.              */
  #define I3CCORE_CORE_INTRSIGNALEN_CMDQUEUEREADYSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_CMDQUEUEREADYSIGNALEN_Pos)
                                                                            /*!< Bit mask of CMDQUEUEREADYSIGNALEN field.*/       

/* RESPREADYSIGNALEN @Bit 4 : Response Queue Ready Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_RESPREADYSIGNALEN_Pos (4UL) /*!< Position of RESPREADYSIGNALEN field.                      */
  #define I3CCORE_CORE_INTRSIGNALEN_RESPREADYSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_RESPREADYSIGNALEN_Pos) /*!< Bit
                                                                            mask of RESPREADYSIGNALEN field.*/                    

/* TRANSFERABORTSIGNALEN @Bit 5 : Transfer Abort Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_TRANSFERABORTSIGNALEN_Pos (5UL) /*!< Position of TRANSFERABORTSIGNALEN field.              */
  #define I3CCORE_CORE_INTRSIGNALEN_TRANSFERABORTSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_TRANSFERABORTSIGNALEN_Pos)
                                                                            /*!< Bit mask of TRANSFERABORTSIGNALEN field.*/       

/* CCCUPDATEDSIGNALEN @Bit 6 : CCC Table Updated Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_CCCUPDATEDSIGNALEN_Pos (6UL) /*!< Position of CCCUPDATEDSIGNALEN field.                    */
  #define I3CCORE_CORE_INTRSIGNALEN_CCCUPDATEDSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_CCCUPDATEDSIGNALEN_Pos) /*!< Bit
                                                                            mask of CCCUPDATEDSIGNALEN field.*/                   

/* DYNADDRASSGNSIGNALEN @Bit 8 : Dynamic Address Assigned Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_DYNADDRASSGNSIGNALEN_Pos (8UL) /*!< Position of DYNADDRASSGNSIGNALEN field.                */
  #define I3CCORE_CORE_INTRSIGNALEN_DYNADDRASSGNSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_DYNADDRASSGNSIGNALEN_Pos) /*!<
                                                                            Bit mask of DYNADDRASSGNSIGNALEN field.*/             

