adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TRANSFERERRSIGNALEN @Bit 9 : Transfer Error Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_TRANSFERERRSIGNALEN_Pos (9UL) /*!< Position of TRANSFERERRSIGNALEN field.                  */
  #define I3CCORE_CORE_INTRSIGNALEN_TRANSFERERRSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_TRANSFERERRSIGNALEN_Pos) /*!<
                                                                            Bit mask of TRANSFERERRSIGNALEN field.*/              

/* DEFSLVSIGNALEN @Bit 10 : Define Slave CCC Received Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_DEFSLVSIGNALEN_Pos (10UL) /*!< Position of DEFSLVSIGNALEN field.                           */
  #define I3CCORE_CORE_INTRSIGNALEN_DEFSLVSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_DEFSLVSIGNALEN_Pos) /*!< Bit mask of
                                                                            DEFSLVSIGNALEN field.*/                               

/* READREQRECVSIGNALEN @Bit 11 : Read Request Received Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_READREQRECVSIGNALEN_Pos (11UL) /*!< Position of READREQRECVSIGNALEN field.                 */
  #define I3CCORE_CORE_INTRSIGNALEN_READREQRECVSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_READREQRECVSIGNALEN_Pos) /*!<
                                                                            Bit mask of READREQRECVSIGNALEN field.*/              

/* IBIUPDATEDSIGNALEN @Bit 12 : IBI Updated Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_IBIUPDATEDSIGNALEN_Pos (12UL) /*!< Position of IBIUPDATEDSIGNALEN field.                   */
  #define I3CCORE_CORE_INTRSIGNALEN_IBIUPDATEDSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_IBIUPDATEDSIGNALEN_Pos) /*!< Bit
                                                                            mask of IBIUPDATEDSIGNALEN field.*/                   

/* BUSOWNERUPDATEDSIGNALEN @Bit 13 : Bus owner Updated Signal Enable */
  #define I3CCORE_CORE_INTRSIGNALEN_BUSOWNERUPDATEDSIGNALEN_Pos (13UL) /*!< Position of BUSOWNERUPDATEDSIGNALEN field.         */
  #define I3CCORE_CORE_INTRSIGNALEN_BUSOWNERUPDATEDSIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_BUSOWNERUPDATEDSIGNALEN_Pos)
                                                                            /*!< Bit mask of BUSOWNERUPDATEDSIGNALEN field.*/     

/* BUSRESETDONESIGNALEN @Bit 15 : Bus Reset Pattern Generation Done Signal Enable. */
  #define I3CCORE_CORE_INTRSIGNALEN_BUSRESETDONESIGNALEN_Pos (15UL) /*!< Position of BUSRESETDONESIGNALEN field.               */
  #define I3CCORE_CORE_INTRSIGNALEN_BUSRESETDONESIGNALEN_Msk (0x1UL << I3CCORE_CORE_INTRSIGNALEN_BUSRESETDONESIGNALEN_Pos) /*!<
                                                                            Bit mask of BUSRESETDONESIGNALEN field.*/             


/* I3CCORE_CORE_INTRFORCE: Interrupt Force Enable Register */
  #define I3CCORE_CORE_INTRFORCE_ResetValue (0x00000000UL) /*!< Reset value of INTRFORCE register.                             */

/* TXTHLDFORCEEN @Bit 0 : Transmit Buffer Threshold Force Enable */
  #define I3CCORE_CORE_INTRFORCE_TXTHLDFORCEEN_Pos (0UL) /*!< Position of TXTHLDFORCEEN field.                                 */
  #define I3CCORE_CORE_INTRFORCE_TXTHLDFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_TXTHLDFORCEEN_Pos) /*!< Bit mask of
                                                                            TXTHLDFORCEEN field.*/                                

/* RXTHLDFORCEEN @Bit 1 : Receive Buffer Threshold Force Enable */
  #define I3CCORE_CORE_INTRFORCE_RXTHLDFORCEEN_Pos (1UL) /*!< Position of RXTHLDFORCEEN field.                                 */
  #define I3CCORE_CORE_INTRFORCE_RXTHLDFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_RXTHLDFORCEEN_Pos) /*!< Bit mask of
                                                                            RXTHLDFORCEEN field.*/                                

/* IBITHLDFORCEEN @Bit 2 : IBI Buffer Threshold Force Enable */
  #define I3CCORE_CORE_INTRFORCE_IBITHLDFORCEEN_Pos (2UL) /*!< Position of IBITHLDFORCEEN field.                               */
  #define I3CCORE_CORE_INTRFORCE_IBITHLDFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_IBITHLDFORCEEN_Pos) /*!< Bit mask of
                                                                            IBITHLDFORCEEN field.*/                               

/* CMDQUEUEREADYFORCEEN @Bit 3 : Command Queue Ready Force Enable */
  #define I3CCORE_CORE_INTRFORCE_CMDQUEUEREADYFORCEEN_Pos (3UL) /*!< Position of CMDQUEUEREADYFORCEEN field.                   */
  #define I3CCORE_CORE_INTRFORCE_CMDQUEUEREADYFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_CMDQUEUEREADYFORCEEN_Pos) /*!< Bit
                                                                            mask of CMDQUEUEREADYFORCEEN field.*/                 

/* RESPREADYFORCEEN @Bit 4 : Response Queue Ready Force Enable */
  #define I3CCORE_CORE_INTRFORCE_RESPREADYFORCEEN_Pos (4UL) /*!< Position of RESPREADYFORCEEN field.                           */
  #define I3CCORE_CORE_INTRFORCE_RESPREADYFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_RESPREADYFORCEEN_Pos) /*!< Bit mask of
                                                                            RESPREADYFORCEEN field.*/                             

/* TRANSFERABORTFORCEEN @Bit 5 : Transfer Abort Force Enable */
  #define I3CCORE_CORE_INTRFORCE_TRANSFERABORTFORCEEN_Pos (5UL) /*!< Position of TRANSFERABORTFORCEEN field.                   */
  #define I3CCORE_CORE_INTRFORCE_TRANSFERABORTFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_TRANSFERABORTFORCEEN_Pos) /*!< Bit
                                                                            mask of TRANSFERABORTFORCEEN field.*/                 

/* CCCUPDATEDFORCEEN @Bit 6 : CCC Table Updated Force Enable */
  #define I3CCORE_CORE_INTRFORCE_CCCUPDATEDFORCEEN_Pos (6UL) /*!< Position of CCCUPDATEDFORCEEN field.                         */
  #define I3CCORE_CORE_INTRFORCE_CCCUPDATEDFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_CCCUPDATEDFORCEEN_Pos) /*!< Bit mask of
                                                                            CCCUPDATEDFORCEEN field.*/                            

/* DYNADDRASSGNFORCEEN @Bit 8 : Dynamic Address Assigned Force Enable */
  #define I3CCORE_CORE_INTRFORCE_DYNADDRASSGNFORCEEN_Pos (8UL) /*!< Position of DYNADDRASSGNFORCEEN field.                     */
  #define I3CCORE_CORE_INTRFORCE_DYNADDRASSGNFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_DYNADDRASSGNFORCEEN_Pos) /*!< Bit mask
                                                                            of DYNADDRASSGNFORCEEN field.*/                       

/* TRANSFERERRFORCEEN @Bit 9 : Transfer Error Force Enable */
  #define I3CCORE_CORE_INTRFORCE_TRANSFERERRFORCEEN_Pos (9UL) /*!< Position of TRANSFERERRFORCEEN field.                       */
  #define I3CCORE_CORE_INTRFORCE_TRANSFERERRFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_TRANSFERERRFORCEEN_Pos) /*!< Bit mask
                                                                            of TRANSFERERRFORCEEN field.*/                        

/* DEFSLVFORCEEN @Bit 10 : Define Slave CCC Received Force Enable */
  #define I3CCORE_CORE_INTRFORCE_DEFSLVFORCEEN_Pos (10UL) /*!< Position of DEFSLVFORCEEN field.                                */
  #define I3CCORE_CORE_INTRFORCE_DEFSLVFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_DEFSLVFORCEEN_Pos) /*!< Bit mask of
                                                                            DEFSLVFORCEEN field.*/                                

/* READREQFORCEEN @Bit 11 : Read Request Received Force Enable */
  #define I3CCORE_CORE_INTRFORCE_READREQFORCEEN_Pos (11UL) /*!< Position of READREQFORCEEN field.                              */
  #define I3CCORE_CORE_INTRFORCE_READREQFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_READREQFORCEEN_Pos) /*!< Bit mask of
                                                                            READREQFORCEEN field.*/                               

/* IBIUPDATEDFORCEEN @Bit 12 : IBI Updated Force Enable */
  #define I3CCORE_CORE_INTRFORCE_IBIUPDATEDFORCEEN_Pos (12UL) /*!< Position of IBIUPDATEDFORCEEN field.                        */
  #define I3CCORE_CORE_INTRFORCE_IBIUPDATEDFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_IBIUPDATEDFORCEEN_Pos) /*!< Bit mask of
                                                                            IBIUPDATEDFORCEEN field.*/                            

