adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* BUSOWNERUPDATEDFORCEEN @Bit 13 : Bus owner Updated Force Enable */
  #define I3CCORE_CORE_INTRFORCE_BUSOWNERUPDATEDFORCEEN_Pos (13UL) /*!< Position of BUSOWNERUPDATEDFORCEEN field.              */
  #define I3CCORE_CORE_INTRFORCE_BUSOWNERUPDATEDFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_BUSOWNERUPDATEDFORCEEN_Pos) /*!<
                                                                            Bit mask of BUSOWNERUPDATEDFORCEEN field.*/           

/* BUSRESETDONEFORCEEN @Bit 15 : Bus Reset Pattern Generation Done Force Enable. */
  #define I3CCORE_CORE_INTRFORCE_BUSRESETDONEFORCEEN_Pos (15UL) /*!< Position of BUSRESETDONEFORCEEN field.                    */
  #define I3CCORE_CORE_INTRFORCE_BUSRESETDONEFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_BUSRESETDONEFORCEEN_Pos) /*!< Bit mask
                                                                            of BUSRESETDONEFORCEEN field.*/                       


/* I3CCORE_CORE_QUEUESTATUSLEVEL: Queue Status Level Register. */
  #define I3CCORE_CORE_QUEUESTATUSLEVEL_ResetValue (0x00000010UL) /*!< Reset value of QUEUESTATUSLEVEL register.               */

/* CMDQUEUEEMPTYLOC @Bits 0..7 : Command Queue Empty Locations. */
  #define I3CCORE_CORE_QUEUESTATUSLEVEL_CMDQUEUEEMPTYLOC_Pos (0UL) /*!< Position of CMDQUEUEEMPTYLOC field.                    */
  #define I3CCORE_CORE_QUEUESTATUSLEVEL_CMDQUEUEEMPTYLOC_Msk (0xFFUL << I3CCORE_CORE_QUEUESTATUSLEVEL_CMDQUEUEEMPTYLOC_Pos) /*!<
                                                                            Bit mask of CMDQUEUEEMPTYLOC field.*/                 

/* RESPBUFBLR @Bits 8..15 : Response Buffer Level Value. */
  #define I3CCORE_CORE_QUEUESTATUSLEVEL_RESPBUFBLR_Pos (8UL) /*!< Position of RESPBUFBLR field.                                */
  #define I3CCORE_CORE_QUEUESTATUSLEVEL_RESPBUFBLR_Msk (0xFFUL << I3CCORE_CORE_QUEUESTATUSLEVEL_RESPBUFBLR_Pos) /*!< Bit mask of
                                                                            RESPBUFBLR field.*/                                   

/* IBIBUFBLR @Bits 16..23 : IBI Buffer Level Value. */
  #define I3CCORE_CORE_QUEUESTATUSLEVEL_IBIBUFBLR_Pos (16UL) /*!< Position of IBIBUFBLR field.                                 */
  #define I3CCORE_CORE_QUEUESTATUSLEVEL_IBIBUFBLR_Msk (0xFFUL << I3CCORE_CORE_QUEUESTATUSLEVEL_IBIBUFBLR_Pos) /*!< Bit mask of
                                                                            IBIBUFBLR field.*/                                    

/* IBISTSCNT @Bits 24..28 : IBI Buffer Status Count. */
  #define I3CCORE_CORE_QUEUESTATUSLEVEL_IBISTSCNT_Pos (24UL) /*!< Position of IBISTSCNT field.                                 */
  #define I3CCORE_CORE_QUEUESTATUSLEVEL_IBISTSCNT_Msk (0x1FUL << I3CCORE_CORE_QUEUESTATUSLEVEL_IBISTSCNT_Pos) /*!< Bit mask of
                                                                            IBISTSCNT field.*/                                    


/* I3CCORE_CORE_DATABUFFERSTATUSLEVEL: Data Buffer Status Level Register. */
  #define I3CCORE_CORE_DATABUFFERSTATUSLEVEL_ResetValue (0x00000040UL) /*!< Reset value of DATABUFFERSTATUSLEVEL register.     */

/* TXBUFEMPTYLOC @Bits 0..7 : Transmit Buffer Empty Level Value. */
  #define I3CCORE_CORE_DATABUFFERSTATUSLEVEL_TXBUFEMPTYLOC_Pos (0UL) /*!< Position of TXBUFEMPTYLOC field.                     */
  #define I3CCORE_CORE_DATABUFFERSTATUSLEVEL_TXBUFEMPTYLOC_Msk (0xFFUL << I3CCORE_CORE_DATABUFFERSTATUSLEVEL_TXBUFEMPTYLOC_Pos)
                                                                            /*!< Bit mask of TXBUFEMPTYLOC field.*/               

/* RXBUFBLR @Bits 16..23 : Receive Buffer Level Value. */
  #define I3CCORE_CORE_DATABUFFERSTATUSLEVEL_RXBUFBLR_Pos (16UL) /*!< Position of RXBUFBLR field.                              */
  #define I3CCORE_CORE_DATABUFFERSTATUSLEVEL_RXBUFBLR_Msk (0xFFUL << I3CCORE_CORE_DATABUFFERSTATUSLEVEL_RXBUFBLR_Pos) /*!< Bit
                                                                            mask of RXBUFBLR field.*/                             


/* I3CCORE_CORE_PRESENTSTATEM: The user can get status of the DWC_mipi_i3c Controller from this 32-bit read only register
                                (Master). */                                                                                      
                                                                                                                                  
  #define I3CCORE_CORE_PRESENTSTATEM_ResetValue (0x10000003UL) /*!< Reset value of PRESENTSTATEM register.                     */

/* SCLLINESIGNALLEVEL @Bit 0 : This bit is used to check the SCL line level to recover from errors and for debugging. */
  #define I3CCORE_CORE_PRESENTSTATEM_SCLLINESIGNALLEVEL_Pos (0UL) /*!< Position of SCLLINESIGNALLEVEL field.                   */
  #define I3CCORE_CORE_PRESENTSTATEM_SCLLINESIGNALLEVEL_Msk (0x1UL << I3CCORE_CORE_PRESENTSTATEM_SCLLINESIGNALLEVEL_Pos) /*!<
                                                                            Bit mask of SCLLINESIGNALLEVEL field.*/               

/* SDALINESIGNALLEVEL @Bit 1 : This bit is used to check the SDA line level to recover from errors and for debugging. */
  #define I3CCORE_CORE_PRESENTSTATEM_SDALINESIGNALLEVEL_Pos (1UL) /*!< Position of SDALINESIGNALLEVEL field.                   */
  #define I3CCORE_CORE_PRESENTSTATEM_SDALINESIGNALLEVEL_Msk (0x1UL << I3CCORE_CORE_PRESENTSTATEM_SDALINESIGNALLEVEL_Pos) /*!<
                                                                            Bit mask of SDALINESIGNALLEVEL field.*/               

/* CURRENTMASTER @Bit 2 : This Bit is used to check whether the Master is Current Master or not. */
  #define I3CCORE_CORE_PRESENTSTATEM_CURRENTMASTER_Pos (2UL) /*!< Position of CURRENTMASTER field.                             */
  #define I3CCORE_CORE_PRESENTSTATEM_CURRENTMASTER_Msk (0x1UL << I3CCORE_CORE_PRESENTSTATEM_CURRENTMASTER_Pos) /*!< Bit mask of
                                                                            CURRENTMASTER field.*/                                
  #define I3CCORE_CORE_PRESENTSTATEM_CURRENTMASTER_Min (0x0UL) /*!< Min enumerator value of CURRENTMASTER field.               */
  #define I3CCORE_CORE_PRESENTSTATEM_CURRENTMASTER_Max (0x1UL) /*!< Max enumerator value of CURRENTMASTER field.               */
  #define I3CCORE_CORE_PRESENTSTATEM_CURRENTMASTER_NOT_BUS_OWNER (0x0UL) /*!< Master is not Current Master                     */
  #define I3CCORE_CORE_PRESENTSTATEM_CURRENTMASTER_BUS_OWNER (0x1UL) /*!< Master is Current Master                             */

/* CMTFRSTS @Bits 8..13 : Transfer Type Status */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_Pos (8UL) /*!< Position of CMTFRSTS field.                                       */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_Msk (0x3FUL << I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_Pos) /*!< Bit mask of CMTFRSTS
                                                                            field.*/                                              
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_Min (0x0UL) /*!< Min enumerator value of CMTFRSTS field.                         */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_Max (0xFUL) /*!< Max enumerator value of CMTFRSTS field.                         */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_IDLE (0x00UL) /*!< Controller is in Idle state, waiting for commands from
                                                                 application or Slave initated In-band Interrupt.*/               
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_BCCCWTRANSFER (0x01UL) /*!< Broadcast CCC Write Transfer.                        */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_DCCCWTRANSFER (0x02UL) /*!< Directed CCC Write Transfer.                         */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_DCCCRTRANSFER (0x03UL) /*!< Directed CCC Read Transfer.                          */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_ENTDAATRANSFER (0x04UL) /*!< ENTDAA Address Assignment Transfer.                 */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_SETDASATRANSFER (0x05UL) /*!< SETDASA Address Assignment Transfer.               */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_SDRWTRANSFER (0x06UL) /*!< Private I3C SDR Write Transfer.                       */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_SDRRTRANSFER (0x07UL) /*!< Private I3C SDR Read Transfer.                        */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_SDRWTRANSFERI2C (0x08UL) /*!< Private I2C SDR Write Transfer.                    */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_SDRRTRANSFERI2C (0x09UL) /*!< Private I2C SDR Read Transfer.                     */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_TSWTRANSFER (0x0AUL) /*!< Private HDR Ternary Symbol(TS) Write Transfer.         */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_TSRTRANSFER (0x0BUL) /*!< Private HDR Ternary Symbol(TS) Read Transfer.          */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_DDRWTRANSFER (0x0CUL) /*!< Private HDR Double-Data Rate(DDR) Write Transfer.     */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_DDRRTRANSFER (0x0DUL) /*!< Private HDR Double-Data Rate(DDR) Read Transfer.      */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_IBITRANSFER (0x0EUL) /*!< Servicing In-Band Interrupt Transfer.                  */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_HALT (0x0FUL) /*!< Halt state. Controller is in Halt State, waiting for the
                                                                 application to resume through DEVICE_CTRL Register.*/            

