adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CMTFRSTSTS @Bits 16..21 : Current Master Transfer State Status. */
  #define I3CCORE_CORE_PRESENTSTATES_CMTFRSTSTS_Pos (16UL) /*!< Position of CMTFRSTSTS field.                                  */
  #define I3CCORE_CORE_PRESENTSTATES_CMTFRSTSTS_Msk (0x3FUL << I3CCORE_CORE_PRESENTSTATES_CMTFRSTSTS_Pos) /*!< Bit mask of
                                                                            CMTFRSTSTS field.*/                                   

/* CMDTID @Bits 24..27 : This field reflects the Transaction-ID of the current executing command. */
  #define I3CCORE_CORE_PRESENTSTATES_CMDTID_Pos (24UL) /*!< Position of CMDTID field.                                          */
  #define I3CCORE_CORE_PRESENTSTATES_CMDTID_Msk (0xFUL << I3CCORE_CORE_PRESENTSTATES_CMDTID_Pos) /*!< Bit mask of CMDTID field.*/

/* MASTERIDLE @Bit 28 : This field reflects whether the Master Controller is in Idle state or not. */
  #define I3CCORE_CORE_PRESENTSTATES_MASTERIDLE_Pos (28UL) /*!< Position of MASTERIDLE field.                                  */
  #define I3CCORE_CORE_PRESENTSTATES_MASTERIDLE_Msk (0x1UL << I3CCORE_CORE_PRESENTSTATES_MASTERIDLE_Pos) /*!< Bit mask of
                                                                            MASTERIDLE field.*/                                   
  #define I3CCORE_CORE_PRESENTSTATES_MASTERIDLE_Min (0x0UL) /*!< Min enumerator value of MASTERIDLE field.                     */
  #define I3CCORE_CORE_PRESENTSTATES_MASTERIDLE_Max (0x1UL) /*!< Max enumerator value of MASTERIDLE field.                     */
  #define I3CCORE_CORE_PRESENTSTATES_MASTERIDLE_MST_NOT_IDLE (0x0UL) /*!< (unspecified)                                        */
  #define I3CCORE_CORE_PRESENTSTATES_MASTERIDLE_MST_IDLE (0x1UL) /*!< (unspecified)                                            */


/* I3CCORE_CORE_CCCDEVICESTATUS: Device Operating Status Register. */
  #define I3CCORE_CORE_CCCDEVICESTATUS_ResetValue (0x00000000UL) /*!< Reset value of CCCDEVICESTATUS register.                 */

/* PENDINGINTR @Bits 0..3 : Pending Interrupt */
  #define I3CCORE_CORE_CCCDEVICESTATUS_PENDINGINTR_Pos (0UL) /*!< Position of PENDINGINTR field.                               */
  #define I3CCORE_CORE_CCCDEVICESTATUS_PENDINGINTR_Msk (0xFUL << I3CCORE_CORE_CCCDEVICESTATUS_PENDINGINTR_Pos) /*!< Bit mask of
                                                                            PENDINGINTR field.*/                                  

/* PROTOCOLERR @Bit 5 : Protocol Error */
  #define I3CCORE_CORE_CCCDEVICESTATUS_PROTOCOLERR_Pos (5UL) /*!< Position of PROTOCOLERR field.                               */
  #define I3CCORE_CORE_CCCDEVICESTATUS_PROTOCOLERR_Msk (0x1UL << I3CCORE_CORE_CCCDEVICESTATUS_PROTOCOLERR_Pos) /*!< Bit mask of
                                                                            PROTOCOLERR field.*/                                  

/* ACTIVITYMODE @Bits 6..7 : Activity Mode */
  #define I3CCORE_CORE_CCCDEVICESTATUS_ACTIVITYMODE_Pos (6UL) /*!< Position of ACTIVITYMODE field.                             */
  #define I3CCORE_CORE_CCCDEVICESTATUS_ACTIVITYMODE_Msk (0x3UL << I3CCORE_CORE_CCCDEVICESTATUS_ACTIVITYMODE_Pos) /*!< Bit mask
                                                                            of ACTIVITYMODE field.*/                              

/* UNDERFLOWERR @Bit 8 : Underflow error */
  #define I3CCORE_CORE_CCCDEVICESTATUS_UNDERFLOWERR_Pos (8UL) /*!< Position of UNDERFLOWERR field.                             */
  #define I3CCORE_CORE_CCCDEVICESTATUS_UNDERFLOWERR_Msk (0x1UL << I3CCORE_CORE_CCCDEVICESTATUS_UNDERFLOWERR_Pos) /*!< Bit mask
                                                                            of UNDERFLOWERR field.*/                              

/* SLAVEBUSY @Bit 9 : Slave Busy */
  #define I3CCORE_CORE_CCCDEVICESTATUS_SLAVEBUSY_Pos (9UL) /*!< Position of SLAVEBUSY field.                                   */
  #define I3CCORE_CORE_CCCDEVICESTATUS_SLAVEBUSY_Msk (0x1UL << I3CCORE_CORE_CCCDEVICESTATUS_SLAVEBUSY_Pos) /*!< Bit mask of
                                                                            SLAVEBUSY field.*/                                    

/* OVERFLOWERR @Bit 10 : Overflow Error */
  #define I3CCORE_CORE_CCCDEVICESTATUS_OVERFLOWERR_Pos (10UL) /*!< Position of OVERFLOWERR field.                              */
  #define I3CCORE_CORE_CCCDEVICESTATUS_OVERFLOWERR_Msk (0x1UL << I3CCORE_CORE_CCCDEVICESTATUS_OVERFLOWERR_Pos) /*!< Bit mask of
                                                                            OVERFLOWERR field.*/                                  

/* DATANOTREADY @Bit 11 : Data not ready */
  #define I3CCORE_CORE_CCCDEVICESTATUS_DATANOTREADY_Pos (11UL) /*!< Position of DATANOTREADY field.                            */
  #define I3CCORE_CORE_CCCDEVICESTATUS_DATANOTREADY_Msk (0x1UL << I3CCORE_CORE_CCCDEVICESTATUS_DATANOTREADY_Pos) /*!< Bit mask
                                                                            of DATANOTREADY field.*/                              

/* BUFFERNOTAVAIL @Bit 12 : Buffer not available */
  #define I3CCORE_CORE_CCCDEVICESTATUS_BUFFERNOTAVAIL_Pos (12UL) /*!< Position of BUFFERNOTAVAIL field.                        */
  #define I3CCORE_CORE_CCCDEVICESTATUS_BUFFERNOTAVAIL_Msk (0x1UL << I3CCORE_CORE_CCCDEVICESTATUS_BUFFERNOTAVAIL_Pos) /*!< Bit
                                                                            mask of BUFFERNOTAVAIL field.*/                       

/* FRAMEERROR @Bit 13 : Frame Error */
  #define I3CCORE_CORE_CCCDEVICESTATUS_FRAMEERROR_Pos (13UL) /*!< Position of FRAMEERROR field.                                */
  #define I3CCORE_CORE_CCCDEVICESTATUS_FRAMEERROR_Msk (0x1UL << I3CCORE_CORE_CCCDEVICESTATUS_FRAMEERROR_Pos) /*!< Bit mask of
                                                                            FRAMEERROR field.*/                                   


/* I3CCORE_CORE_DEVICEADDRTABLEPOINTER: Pointer for Device Address Table */
  #define I3CCORE_CORE_DEVICEADDRTABLEPOINTER_ResetValue (0x000A02C0UL) /*!< Reset value of DEVICEADDRTABLEPOINTER register.   */

