adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PDEVADDRTABLESTARTADDR @Bits 0..15 : Start Address of Device Address Table. */
  #define I3CCORE_CORE_DEVICEADDRTABLEPOINTER_PDEVADDRTABLESTARTADDR_Pos (0UL) /*!< Position of PDEVADDRTABLESTARTADDR field.  */
  #define I3CCORE_CORE_DEVICEADDRTABLEPOINTER_PDEVADDRTABLESTARTADDR_Msk (0xFFFFUL << I3CCORE_CORE_DEVICEADDRTABLEPOINTER_PDEVADDRTABLESTARTADDR_Pos)
                                                                            /*!< Bit mask of PDEVADDRTABLESTARTADDR field.*/      

/* DEVADDRTABLEDEPTH @Bits 16..31 : Depth of Device Address Table */
  #define I3CCORE_CORE_DEVICEADDRTABLEPOINTER_DEVADDRTABLEDEPTH_Pos (16UL) /*!< Position of DEVADDRTABLEDEPTH field.           */
  #define I3CCORE_CORE_DEVICEADDRTABLEPOINTER_DEVADDRTABLEDEPTH_Msk (0xFFFFUL << I3CCORE_CORE_DEVICEADDRTABLEPOINTER_DEVADDRTABLEDEPTH_Pos)
                                                                            /*!< Bit mask of DEVADDRTABLEDEPTH field.*/           


/* I3CCORE_CORE_DEVCHARTABLEPOINTER: Pointer for Device Characteristics Table */
  #define I3CCORE_CORE_DEVCHARTABLEPOINTER_ResetValue (0x00028200UL) /*!< Reset value of DEVCHARTABLEPOINTER register.         */

/* PDEVCHARTABLESTARTADDR @Bits 0..11 : Start Address of Device Characteristics Table. */
  #define I3CCORE_CORE_DEVCHARTABLEPOINTER_PDEVCHARTABLESTARTADDR_Pos (0UL) /*!< Position of PDEVCHARTABLESTARTADDR field.     */
  #define I3CCORE_CORE_DEVCHARTABLEPOINTER_PDEVCHARTABLESTARTADDR_Msk (0xFFFUL << I3CCORE_CORE_DEVCHARTABLEPOINTER_PDEVCHARTABLESTARTADDR_Pos)
                                                                            /*!< Bit mask of PDEVCHARTABLESTARTADDR field.*/      

/* DEVCHARTABLEDEPTH @Bits 12..18 : Depth of Device Characteristics Table */
  #define I3CCORE_CORE_DEVCHARTABLEPOINTER_DEVCHARTABLEDEPTH_Pos (12UL) /*!< Position of DEVCHARTABLEDEPTH field.              */
  #define I3CCORE_CORE_DEVCHARTABLEPOINTER_DEVCHARTABLEDEPTH_Msk (0x7FUL << I3CCORE_CORE_DEVCHARTABLEPOINTER_DEVCHARTABLEDEPTH_Pos)
                                                                            /*!< Bit mask of DEVCHARTABLEDEPTH field.*/           

/* PRESENTDEVCHARTABLEINDX @Bits 19..22 : Current index of Device Characteristics Table. */
  #define I3CCORE_CORE_DEVCHARTABLEPOINTER_PRESENTDEVCHARTABLEINDX_Pos (19UL) /*!< Position of PRESENTDEVCHARTABLEINDX field.  */
  #define I3CCORE_CORE_DEVCHARTABLEPOINTER_PRESENTDEVCHARTABLEINDX_Msk (0xFUL << I3CCORE_CORE_DEVCHARTABLEPOINTER_PRESENTDEVCHARTABLEINDX_Pos)
                                                                            /*!< Bit mask of PRESENTDEVCHARTABLEINDX field.*/     


/* I3CCORE_CORE_VENDORSPECIFICREGPOINTER: Pointer for Vendor Specific Registers. */
  #define I3CCORE_CORE_VENDORSPECIFICREGPOINTER_ResetValue (0x000000B0UL) /*!< Reset value of VENDORSPECIFICREGPOINTER
                                                                            register.*/                                           

/* PVENDORREGSTARTADDR @Bits 0..15 : Start Address of Vendor specific registers. */
  #define I3CCORE_CORE_VENDORSPECIFICREGPOINTER_PVENDORREGSTARTADDR_Pos (0UL) /*!< Position of PVENDORREGSTARTADDR field.      */
  #define I3CCORE_CORE_VENDORSPECIFICREGPOINTER_PVENDORREGSTARTADDR_Msk (0xFFFFUL << I3CCORE_CORE_VENDORSPECIFICREGPOINTER_PVENDORREGSTARTADDR_Pos)
                                                                            /*!< Bit mask of PVENDORREGSTARTADDR field.*/         


/* I3CCORE_CORE_SLVMIPIIDVALUE: I3C MIPI Manufacturer ID Register. */
  #define I3CCORE_CORE_SLVMIPIIDVALUE_ResetValue (0x00000000UL) /*!< Reset value of SLVMIPIIDVALUE register.                   */

/* SLVPROVIDSEL @Bit 0 : Specifies the Provisional ID Type Selector (PID[32]). */
  #define I3CCORE_CORE_SLVMIPIIDVALUE_SLVPROVIDSEL_Pos (0UL) /*!< Position of SLVPROVIDSEL field.                              */
  #define I3CCORE_CORE_SLVMIPIIDVALUE_SLVPROVIDSEL_Msk (0x1UL << I3CCORE_CORE_SLVMIPIIDVALUE_SLVPROVIDSEL_Pos) /*!< Bit mask of
                                                                            SLVPROVIDSEL field.*/                                 

/* SLVMIPIMFGID @Bits 1..15 : Specifies the MIPI Manufacturer ID. */
  #define I3CCORE_CORE_SLVMIPIIDVALUE_SLVMIPIMFGID_Pos (1UL) /*!< Position of SLVMIPIMFGID field.                              */
  #define I3CCORE_CORE_SLVMIPIIDVALUE_SLVMIPIMFGID_Msk (0x7FFFUL << I3CCORE_CORE_SLVMIPIIDVALUE_SLVMIPIMFGID_Pos) /*!< Bit mask
                                                                            of SLVMIPIMFGID field.*/                              


/* I3CCORE_CORE_SLVPIDVALUE: I3C Normal Provisional ID Register. */
  #define I3CCORE_CORE_SLVPIDVALUE_ResetValue (0x00000000UL) /*!< Reset value of SLVPIDVALUE register.                         */

/* SLVPIDDCR @Bits 0..11 : Specifies the additional 12-bit ID of DWC_mipi_i3c device (PID[11:0]). */
  #define I3CCORE_CORE_SLVPIDVALUE_SLVPIDDCR_Pos (0UL) /*!< Position of SLVPIDDCR field.                                       */
  #define I3CCORE_CORE_SLVPIDVALUE_SLVPIDDCR_Msk (0xFFFUL << I3CCORE_CORE_SLVPIDVALUE_SLVPIDDCR_Pos) /*!< Bit mask of SLVPIDDCR
                                                                            field.*/                                              

/* SLVINSTID @Bits 12..15 : This field is used to program the instance ID of the Slave. */
  #define I3CCORE_CORE_SLVPIDVALUE_SLVINSTID_Pos (12UL) /*!< Position of SLVINSTID field.                                      */
  #define I3CCORE_CORE_SLVPIDVALUE_SLVINSTID_Msk (0xFUL << I3CCORE_CORE_SLVPIDVALUE_SLVINSTID_Pos) /*!< Bit mask of SLVINSTID
                                                                            field.*/                                              

/* SLVPARTID @Bits 16..31 : Specifies the Part ID of DWC_mipi_i3c device (PID[31:16]) */
  #define I3CCORE_CORE_SLVPIDVALUE_SLVPARTID_Pos (16UL) /*!< Position of SLVPARTID field.                                      */
  #define I3CCORE_CORE_SLVPIDVALUE_SLVPARTID_Msk (0xFFFFUL << I3CCORE_CORE_SLVPIDVALUE_SLVPARTID_Pos) /*!< Bit mask of SLVPARTID
                                                                            field.*/                                              


