adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* I3CCORE_CORE_SLVCHARCTRL: I3C Slave Characteristic Register. */
  #define I3CCORE_CORE_SLVCHARCTRL_ResetValue (0x00070062UL) /*!< Reset value of SLVCHARCTRL register.                         */

/* MAXDATASPEEDLIMIT @Bit 0 : Max Data Speed Limitation field in Bus Characteristic Register (BCR[0]). */
  #define I3CCORE_CORE_SLVCHARCTRL_MAXDATASPEEDLIMIT_Pos (0UL) /*!< Position of MAXDATASPEEDLIMIT field.                       */
  #define I3CCORE_CORE_SLVCHARCTRL_MAXDATASPEEDLIMIT_Msk (0x1UL << I3CCORE_CORE_SLVCHARCTRL_MAXDATASPEEDLIMIT_Pos) /*!< Bit mask
                                                                            of MAXDATASPEEDLIMIT field.*/                         

/* IBIREQUESTCAPABLE @Bit 1 : IBI Request Capable field in Bus Characteristic Register (BCR[1]). */
  #define I3CCORE_CORE_SLVCHARCTRL_IBIREQUESTCAPABLE_Pos (1UL) /*!< Position of IBIREQUESTCAPABLE field.                       */
  #define I3CCORE_CORE_SLVCHARCTRL_IBIREQUESTCAPABLE_Msk (0x1UL << I3CCORE_CORE_SLVCHARCTRL_IBIREQUESTCAPABLE_Pos) /*!< Bit mask
                                                                            of IBIREQUESTCAPABLE field.*/                         

/* IBIPAYLOAD @Bit 2 : IBI Payload field in Bus Characteristic Register (BCR[2]). */
  #define I3CCORE_CORE_SLVCHARCTRL_IBIPAYLOAD_Pos (2UL) /*!< Position of IBIPAYLOAD field.                                     */
  #define I3CCORE_CORE_SLVCHARCTRL_IBIPAYLOAD_Msk (0x1UL << I3CCORE_CORE_SLVCHARCTRL_IBIPAYLOAD_Pos) /*!< Bit mask of IBIPAYLOAD
                                                                            field.*/                                              

/* OFFLINECAPABLE @Bit 3 : Offline Capable field in Bus Characteristic Register (BCR[3]). */
  #define I3CCORE_CORE_SLVCHARCTRL_OFFLINECAPABLE_Pos (3UL) /*!< Position of OFFLINECAPABLE field.                             */
  #define I3CCORE_CORE_SLVCHARCTRL_OFFLINECAPABLE_Msk (0x1UL << I3CCORE_CORE_SLVCHARCTRL_OFFLINECAPABLE_Pos) /*!< Bit mask of
                                                                            OFFLINECAPABLE field.*/                               

/* BRIDGEIDENTIFIER @Bit 4 : Bridge Identifier field in Bus Characteristic Register (BCR[4]). */
  #define I3CCORE_CORE_SLVCHARCTRL_BRIDGEIDENTIFIER_Pos (4UL) /*!< Position of BRIDGEIDENTIFIER field.                         */
  #define I3CCORE_CORE_SLVCHARCTRL_BRIDGEIDENTIFIER_Msk (0x1UL << I3CCORE_CORE_SLVCHARCTRL_BRIDGEIDENTIFIER_Pos) /*!< Bit mask
                                                                            of BRIDGEIDENTIFIER field.*/                          

/* HDRCAPABLE @Bit 5 : SDR Only or SDR and HDR Capable field in Bus Characteristic Register (BCR[5]). */
  #define I3CCORE_CORE_SLVCHARCTRL_HDRCAPABLE_Pos (5UL) /*!< Position of HDRCAPABLE field.                                     */
  #define I3CCORE_CORE_SLVCHARCTRL_HDRCAPABLE_Msk (0x1UL << I3CCORE_CORE_SLVCHARCTRL_HDRCAPABLE_Pos) /*!< Bit mask of HDRCAPABLE
                                                                            field.*/                                              

/* DEVICEROLE @Bits 6..7 : Device Role field in Bus Characteristic Register (BCR[7:6]). */
  #define I3CCORE_CORE_SLVCHARCTRL_DEVICEROLE_Pos (6UL) /*!< Position of DEVICEROLE field.                                     */
  #define I3CCORE_CORE_SLVCHARCTRL_DEVICEROLE_Msk (0x3UL << I3CCORE_CORE_SLVCHARCTRL_DEVICEROLE_Pos) /*!< Bit mask of DEVICEROLE
                                                                            field.*/                                              

/* DCR @Bits 8..15 : I3C Device Characteristic Value. */
  #define I3CCORE_CORE_SLVCHARCTRL_DCR_Pos (8UL)     /*!< Position of DCR field.                                               */
  #define I3CCORE_CORE_SLVCHARCTRL_DCR_Msk (0xFFUL << I3CCORE_CORE_SLVCHARCTRL_DCR_Pos) /*!< Bit mask of DCR field.            */

/* HDRCAP @Bits 16..23 : I3C Device HDR Capability Register Value. */
  #define I3CCORE_CORE_SLVCHARCTRL_HDRCAP_Pos (16UL) /*!< Position of HDRCAP field.                                            */
  #define I3CCORE_CORE_SLVCHARCTRL_HDRCAP_Msk (0xFFUL << I3CCORE_CORE_SLVCHARCTRL_HDRCAP_Pos) /*!< Bit mask of HDRCAP field.   */


/* I3CCORE_CORE_SLVMAXLEN: I3C Max Write/Read Length Register. */
  #define I3CCORE_CORE_SLVMAXLEN_ResetValue (0x00FF00FFUL) /*!< Reset value of SLVMAXLEN register.                             */

/* MWL @Bits 0..15 : I3C Device Max Write Length */
  #define I3CCORE_CORE_SLVMAXLEN_MWL_Pos (0UL)       /*!< Position of MWL field.                                               */
  #define I3CCORE_CORE_SLVMAXLEN_MWL_Msk (0xFFFFUL << I3CCORE_CORE_SLVMAXLEN_MWL_Pos) /*!< Bit mask of MWL field.              */

/* MRL @Bits 16..31 : I3C Device Max Read Length. */
  #define I3CCORE_CORE_SLVMAXLEN_MRL_Pos (16UL)      /*!< Position of MRL field.                                               */
  #define I3CCORE_CORE_SLVMAXLEN_MRL_Msk (0xFFFFUL << I3CCORE_CORE_SLVMAXLEN_MRL_Pos) /*!< Bit mask of MRL field.              */


/* I3CCORE_CORE_MAXREADTURNAROUND: MXDS Maximum Read Turnaround Time. */
  #define I3CCORE_CORE_MAXREADTURNAROUND_ResetValue (0x00000000UL) /*!< Reset value of MAXREADTURNAROUND register.             */

/* MXDSMAXRDTURN @Bits 0..23 : Specifies the maximum read turnaround time (in microseconds (us)) of DWC_mipi_i3c Slave. */
  #define I3CCORE_CORE_MAXREADTURNAROUND_MXDSMAXRDTURN_Pos (0UL) /*!< Position of MXDSMAXRDTURN field.                         */
  #define I3CCORE_CORE_MAXREADTURNAROUND_MXDSMAXRDTURN_Msk (0xFFFFFFUL << I3CCORE_CORE_MAXREADTURNAROUND_MXDSMAXRDTURN_Pos) /*!<
                                                                            Bit mask of MXDSMAXRDTURN field.*/                    


/* I3CCORE_CORE_MAXDATASPEED: The values in this register are returned by the slave as GETACCMST CCC data. */
  #define I3CCORE_CORE_MAXDATASPEED_ResetValue (0x00000000UL) /*!< Reset value of MAXDATASPEED register.                       */

/* MXDSMAXWRSPEED @Bits 0..2 : Specifies the Maximum Sustained Data Rate for non-CCC messages sent by Master Device to
                               DWC_mipi_i3c Slave device */                                                                       
                                                                                                                                  
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_Pos (0UL) /*!< Position of MXDSMAXWRSPEED field.                            */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_Msk (0x7UL << I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_Pos) /*!< Bit mask of
                                                                            MXDSMAXWRSPEED field.*/                               
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_Min (0x0UL) /*!< Min enumerator value of MXDSMAXWRSPEED field.              */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_Max (0x4UL) /*!< Max enumerator value of MXDSMAXWRSPEED field.              */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_12M5HZ (0x0UL) /*!< 12.5MHz                                                 */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_8MHZ (0x1UL) /*!< 8MHZ                                                      */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_6MHZ (0x2UL) /*!< 6MHz                                                      */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_4MHZ (0x3UL) /*!< 4MHz                                                      */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_2MHZ (0x4UL) /*!< 2MHz                                                      */

/* MXDSMAXRDSPEED @Bits 8..10 : Specifies the Maximum Sustained Data Rate for non-CCC messages sent by DWC_mipi_i3c Slave Device
                                to Master Device */                                                                               
                                                                                                                                  
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_Pos (8UL) /*!< Position of MXDSMAXRDSPEED field.                            */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_Msk (0x7UL << I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_Pos) /*!< Bit mask of
                                                                            MXDSMAXRDSPEED field.*/                               
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_Min (0x0UL) /*!< Min enumerator value of MXDSMAXRDSPEED field.              */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_Max (0x4UL) /*!< Max enumerator value of MXDSMAXRDSPEED field.              */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_12M5HZ (0x0UL) /*!< 12.5MHz                                                 */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_8MHZ (0x1UL) /*!< 8MHZ                                                      */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_6MHZ (0x2UL) /*!< 6MHz                                                      */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_4MHZ (0x3UL) /*!< 4MHz                                                      */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_2MHZ (0x4UL) /*!< 2MHz                                                      */

/* MXDSCLKDATATURN @Bits 16..18 : Specifies the clock to data turnaround time (Tsco parameter) of DWC_mipi_i3c Slave device */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_Pos (16UL) /*!< Position of MXDSCLKDATATURN field.                         */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_Msk (0x7UL << I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_Pos) /*!< Bit mask
                                                                            of MXDSCLKDATATURN field.*/                           
  #define I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_Min (0x0UL) /*!< Min enumerator value of MXDSCLKDATATURN field.            */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_Max (0x4UL) /*!< Max enumerator value of MXDSCLKDATATURN field.            */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_8NS (0x0UL) /*!< 8ns                                                       */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_9NS (0x1UL) /*!< 9ns                                                       */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_10NS (0x2UL) /*!< 10ns                                                     */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_11NS (0x3UL) /*!< 11ns                                                     */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_12NS (0x4UL) /*!< 12ns                                                     */


/* I3CCORE_CORE_SLVINTRREQ: This register is used in slave mode of operation. */
  #define I3CCORE_CORE_SLVINTRREQ_ResetValue (0x00000000UL) /*!< Reset value of SLVINTRREQ register.                           */

