adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* I3CCORE_CORE_SCLI3CPPTIMING: SCL I3C Push Pull Timing Register */
  #define I3CCORE_CORE_SCLI3CPPTIMING_ResetValue (0x000A000AUL) /*!< Reset value of SCLI3CPPTIMING register.                   */

/* I3CPPLCNT @Bits 0..7 : I3C Push Pull Low Count. */
  #define I3CCORE_CORE_SCLI3CPPTIMING_I3CPPLCNT_Pos (0UL) /*!< Position of I3CPPLCNT field.                                    */
  #define I3CCORE_CORE_SCLI3CPPTIMING_I3CPPLCNT_Msk (0xFFUL << I3CCORE_CORE_SCLI3CPPTIMING_I3CPPLCNT_Pos) /*!< Bit mask of
                                                                            I3CPPLCNT field.*/                                    

/* I3CPPHCNT @Bits 16..23 : I3C Push Pull High Count. */
  #define I3CCORE_CORE_SCLI3CPPTIMING_I3CPPHCNT_Pos (16UL) /*!< Position of I3CPPHCNT field.                                   */
  #define I3CCORE_CORE_SCLI3CPPTIMING_I3CPPHCNT_Msk (0xFFUL << I3CCORE_CORE_SCLI3CPPTIMING_I3CPPHCNT_Pos) /*!< Bit mask of
                                                                            I3CPPHCNT field.*/                                    


/* I3CCORE_CORE_SCLI2CFMTIMING: SCL I2C Fast Mode Timing Register */
  #define I3CCORE_CORE_SCLI2CFMTIMING_ResetValue (0x00100010UL) /*!< Reset value of SCLI2CFMTIMING register.                   */

/* I2CFMLCNT @Bits 0..15 : I2C Fast Mode Low Count */
  #define I3CCORE_CORE_SCLI2CFMTIMING_I2CFMLCNT_Pos (0UL) /*!< Position of I2CFMLCNT field.                                    */
  #define I3CCORE_CORE_SCLI2CFMTIMING_I2CFMLCNT_Msk (0xFFFFUL << I3CCORE_CORE_SCLI2CFMTIMING_I2CFMLCNT_Pos) /*!< Bit mask of
                                                                            I2CFMLCNT field.*/                                    

/* I2CFMHCNT @Bits 16..31 : I2C Fast Mode High Count */
  #define I3CCORE_CORE_SCLI2CFMTIMING_I2CFMHCNT_Pos (16UL) /*!< Position of I2CFMHCNT field.                                   */
  #define I3CCORE_CORE_SCLI2CFMTIMING_I2CFMHCNT_Msk (0xFFFFUL << I3CCORE_CORE_SCLI2CFMTIMING_I2CFMHCNT_Pos) /*!< Bit mask of
                                                                            I2CFMHCNT field.*/                                    


/* I3CCORE_CORE_SCLI2CFMPTIMING: SCL I2C Fast Mode Plus Timing Register */
  #define I3CCORE_CORE_SCLI2CFMPTIMING_ResetValue (0x00100010UL) /*!< Reset value of SCLI2CFMPTIMING register.                 */

/* I2CFMPLCNT @Bits 0..15 : I2C Fast Mode Plus Low Count */
  #define I3CCORE_CORE_SCLI2CFMPTIMING_I2CFMPLCNT_Pos (0UL) /*!< Position of I2CFMPLCNT field.                                 */
  #define I3CCORE_CORE_SCLI2CFMPTIMING_I2CFMPLCNT_Msk (0xFFFFUL << I3CCORE_CORE_SCLI2CFMPTIMING_I2CFMPLCNT_Pos) /*!< Bit mask of
                                                                            I2CFMPLCNT field.*/                                   

/* I2CFMPHCNT @Bits 16..23 : I2C Fast Mode Plus High Count */
  #define I3CCORE_CORE_SCLI2CFMPTIMING_I2CFMPHCNT_Pos (16UL) /*!< Position of I2CFMPHCNT field.                                */
  #define I3CCORE_CORE_SCLI2CFMPTIMING_I2CFMPHCNT_Msk (0xFFUL << I3CCORE_CORE_SCLI2CFMPTIMING_I2CFMPHCNT_Pos) /*!< Bit mask of
                                                                            I2CFMPHCNT field.*/                                   


/* I3CCORE_CORE_SCLEXTLCNTTIMING: SCL Extended Low Count Timing Register. */
  #define I3CCORE_CORE_SCLEXTLCNTTIMING_ResetValue (0x20202020UL) /*!< Reset value of SCLEXTLCNTTIMING register.               */

/* I3CEXTLCNT1 @Bits 0..7 : I3C Extended Low Count Register 1 */
  #define I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT1_Pos (0UL) /*!< Position of I3CEXTLCNT1 field.                              */
  #define I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT1_Msk (0xFFUL << I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT1_Pos) /*!< Bit mask
                                                                            of I3CEXTLCNT1 field.*/                               

/* I3CEXTLCNT2 @Bits 8..15 : I3C Extended Low Count Register 2 */
  #define I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT2_Pos (8UL) /*!< Position of I3CEXTLCNT2 field.                              */
  #define I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT2_Msk (0xFFUL << I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT2_Pos) /*!< Bit mask
                                                                            of I3CEXTLCNT2 field.*/                               

/* I3CEXTLCNT3 @Bits 16..23 : I3C Extended Low Count Register 3 */
  #define I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT3_Pos (16UL) /*!< Position of I3CEXTLCNT3 field.                             */
  #define I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT3_Msk (0xFFUL << I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT3_Pos) /*!< Bit mask
                                                                            of I3CEXTLCNT3 field.*/                               

/* I3CEXTLCNT4 @Bits 24..31 : I3C Extended Low Count Register 4 */
  #define I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT4_Pos (24UL) /*!< Position of I3CEXTLCNT4 field.                             */
  #define I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT4_Msk (0xFFUL << I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT4_Pos) /*!< Bit mask
                                                                            of I3CEXTLCNT4 field.*/                               


/* I3CCORE_CORE_SCLEXTTERMNLCNTTIMING: SCL Termination Bit Low Count Timing Register */
  #define I3CCORE_CORE_SCLEXTTERMNLCNTTIMING_ResetValue (0x00030000UL) /*!< Reset value of SCLEXTTERMNLCNTTIMING register.     */

/* I3CEXTTERMNLCNT @Bits 0..3 : I3C Read Termination Bit Low count. */
  #define I3CCORE_CORE_SCLEXTTERMNLCNTTIMING_I3CEXTTERMNLCNT_Pos (0UL) /*!< Position of I3CEXTTERMNLCNT field.                 */
  #define I3CCORE_CORE_SCLEXTTERMNLCNTTIMING_I3CEXTTERMNLCNT_Msk (0xFUL << I3CCORE_CORE_SCLEXTTERMNLCNTTIMING_I3CEXTTERMNLCNT_Pos)
                                                                            /*!< Bit mask of I3CEXTTERMNLCNT field.*/             

/* I3CTSSKEWCNT @Bits 16..19 : I3C HDR Ternary Skew Count. */
  #define I3CCORE_CORE_SCLEXTTERMNLCNTTIMING_I3CTSSKEWCNT_Pos (16UL) /*!< Position of I3CTSSKEWCNT field.                      */
  #define I3CCORE_CORE_SCLEXTTERMNLCNTTIMING_I3CTSSKEWCNT_Msk (0xFUL << I3CCORE_CORE_SCLEXTTERMNLCNTTIMING_I3CTSSKEWCNT_Pos)
                                                                            /*!< Bit mask of I3CTSSKEWCNT field.*/                


/* I3CCORE_CORE_SDAHOLDSWITCHDLYTIMING: SDA Hold and Mode Switch Delay Timing Register */
  #define I3CCORE_CORE_SDAHOLDSWITCHDLYTIMING_ResetValue (0x00000001UL) /*!< Reset value of SDAHOLDSWITCHDLYTIMING register.   */

/* SDATXHOLD @Bits 16..18 : This field controls the hold time (in term of the core clock period) of the transmit data (SDA) with
                            */                                                                                                    
                                                                                                                                  
