adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RXBUFSIZE @Bits 4..7 : Receive Data Buffer Size */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_Pos (4UL) /*!< Position of RXBUFSIZE field.                               */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_Msk (0xFUL << I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_Pos) /*!< Bit mask
                                                                            of RXBUFSIZE field.*/                                 
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_Min (0x0UL) /*!< Min enumerator value of RXBUFSIZE field.                 */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_Max (0x5UL) /*!< Max enumerator value of RXBUFSIZE field.                 */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_2DWORD (0x0UL) /*!< 2 DWORDS                                              */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_4DWORD (0x1UL) /*!< 4 DWORDS                                              */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_8DWORD (0x2UL) /*!< 8 DWORDS                                              */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_16DWORD (0x3UL) /*!< 16 DWORDS                                            */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_32DWORD (0x4UL) /*!< 32 DWORDS                                            */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_64DWORD (0x5UL) /*!< 64 DWORDS                                            */

/* CMDBUFSIZE @Bits 8..11 : Command Queue Size */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_Pos (8UL) /*!< Position of CMDBUFSIZE field.                             */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_Msk (0xFUL << I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_Pos) /*!< Bit
                                                                            mask of CMDBUFSIZE field.*/                           
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_Min (0x0UL) /*!< Min enumerator value of CMDBUFSIZE field.               */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_Max (0x3UL) /*!< Max enumerator value of CMDBUFSIZE field.               */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_2DWORD (0x0UL) /*!< 2 DWORDS                                             */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_4DWORD (0x1UL) /*!< 4 DWORDS                                             */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_8DWORD (0x2UL) /*!< 8 DWORDS                                             */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_16DWORD (0x3UL) /*!< 16 DWORDS                                           */

/* RESPBUFSIZE @Bits 12..15 : Response Queue Size */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_Pos (12UL) /*!< Position of RESPBUFSIZE field.                          */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_Msk (0xFUL << I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_Pos) /*!< Bit
                                                                            mask of RESPBUFSIZE field.*/                          
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_Min (0x0UL) /*!< Min enumerator value of RESPBUFSIZE field.             */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_Max (0x3UL) /*!< Max enumerator value of RESPBUFSIZE field.             */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_2DWORD (0x0UL) /*!< 2 DWORDS                                            */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_4DWORD (0x1UL) /*!< 4 DWORDS                                            */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_8DWORD (0x2UL) /*!< 8 DWORDS                                            */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_16DWORD (0x3UL) /*!< 16 DWORDS                                          */

/* IBIBUFSIZE @Bits 16..19 : IBI Queue Size */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_Pos (16UL) /*!< Position of IBIBUFSIZE field.                            */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_Msk (0xFUL << I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_Pos) /*!< Bit
                                                                            mask of IBIBUFSIZE field.*/                           
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_Min (0x0UL) /*!< Min enumerator value of IBIBUFSIZE field.               */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_Max (0x3UL) /*!< Max enumerator value of IBIBUFSIZE field.               */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_2DWORD (0x0UL) /*!< 2 DWORDS                                             */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_4DWORD (0x1UL) /*!< 4 DWORDS                                             */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_8DWORD (0x2UL) /*!< 8 DWORDS                                             */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_16DWORD (0x3UL) /*!< 16 DWORDS                                           */


/* I3CCORE_CORE_SECDEVCHARTABLE: Secondary Master Device Characteristic Table Location of Device [n] */
  #define I3CCORE_CORE_SECDEVCHARTABLE_MaxCount (32UL) /*!< Max size of SECDEVCHARTABLE[32] array.                             */
  #define I3CCORE_CORE_SECDEVCHARTABLE_ResetValue (0x00000000UL) /*!< Reset value of SECDEVCHARTABLE[32] register.             */

/* DYNAMICADDR @Bits 0..7 : The Dynamic Addr of Device [n] */
  #define I3CCORE_CORE_SECDEVCHARTABLE_DYNAMICADDR_Pos (0UL) /*!< Position of DYNAMICADDR field.                               */
  #define I3CCORE_CORE_SECDEVCHARTABLE_DYNAMICADDR_Msk (0xFFUL << I3CCORE_CORE_SECDEVCHARTABLE_DYNAMICADDR_Pos) /*!< Bit mask of
                                                                            DYNAMICADDR field.*/                                  

/* DCRTYPE @Bits 8..15 : The DCR TYPE of Device [n] */
  #define I3CCORE_CORE_SECDEVCHARTABLE_DCRTYPE_Pos (8UL) /*!< Position of DCRTYPE field.                                       */
  #define I3CCORE_CORE_SECDEVCHARTABLE_DCRTYPE_Msk (0xFFUL << I3CCORE_CORE_SECDEVCHARTABLE_DCRTYPE_Pos) /*!< Bit mask of DCRTYPE
                                                                            field.*/                                              

/* BCRTYPE @Bits 16..23 : The BCR TYPE of Device [n] */
  #define I3CCORE_CORE_SECDEVCHARTABLE_BCRTYPE_Pos (16UL) /*!< Position of BCRTYPE field.                                      */
  #define I3CCORE_CORE_SECDEVCHARTABLE_BCRTYPE_Msk (0xFFUL << I3CCORE_CORE_SECDEVCHARTABLE_BCRTYPE_Pos) /*!< Bit mask of BCRTYPE
                                                                            field.*/                                              

/* STATICADDR @Bits 24..31 : The Static Addr of Device [n] */
  #define I3CCORE_CORE_SECDEVCHARTABLE_STATICADDR_Pos (24UL) /*!< Position of STATICADDR field.                                */
  #define I3CCORE_CORE_SECDEVCHARTABLE_STATICADDR_Msk (0xFFUL << I3CCORE_CORE_SECDEVCHARTABLE_STATICADDR_Pos) /*!< Bit mask of
                                                                            STATICADDR field.*/                                   


