adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RSVDDSTSCATTEREN @Bit 18 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDDSTSCATTEREN_Pos (18UL) /*!< Position of RSVDDSTSCATTEREN field.                           */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDDSTSCATTEREN_Msk (0x1UL << I3CCORE_DMA_CH1_CTL1L_RSVDDSTSCATTEREN_Pos) /*!< Bit mask of
                                                                            RSVDDSTSCATTEREN field.*/                             

/* RSVDCTL @Bit 19 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDCTL_Pos (19UL)   /*!< Position of RSVDCTL field.                                           */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDCTL_Msk (0x1UL << I3CCORE_DMA_CH1_CTL1L_RSVDCTL_Pos) /*!< Bit mask of RSVDCTL field.       */

/* TTFC @Bits 20..22 : Transfer Type and Flow Control. */
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_Pos (20UL)      /*!< Position of TTFC field.                                              */
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_Msk (0x7UL << I3CCORE_DMA_CH1_CTL1L_TTFC_Pos) /*!< Bit mask of TTFC field.                */
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_Min (0x0UL)     /*!< Min enumerator value of TTFC field.                                  */
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_Max (0x7UL)     /*!< Max enumerator value of TTFC field.                                  */
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_TT_FC_0 (0x0UL) /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_TT_FC_1 (0x1UL) /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_TT_FC_2 (0x2UL) /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_TT_FC_3 (0x3UL) /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_TT_FC_4 (0x4UL) /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_TT_FC_5 (0x5UL) /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_TT_FC_6 (0x6UL) /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_TT_FC_7 (0x7UL) /*!< (unspecified)                                                        */

/* RSVDDMS @Bits 23..24 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDDMS_Pos (23UL)   /*!< Position of RSVDDMS field.                                           */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDDMS_Msk (0x3UL << I3CCORE_DMA_CH1_CTL1L_RSVDDMS_Pos) /*!< Bit mask of RSVDDMS field.       */

/* RSVDSMS @Bits 25..26 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDSMS_Pos (25UL)   /*!< Position of RSVDSMS field.                                           */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDSMS_Msk (0x3UL << I3CCORE_DMA_CH1_CTL1L_RSVDSMS_Pos) /*!< Bit mask of RSVDSMS field.       */

/* RSVDLLPDSTEN @Bit 27 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDLLPDSTEN_Pos (27UL) /*!< Position of RSVDLLPDSTEN field.                                   */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDLLPDSTEN_Msk (0x1UL << I3CCORE_DMA_CH1_CTL1L_RSVDLLPDSTEN_Pos) /*!< Bit mask of RSVDLLPDSTEN
                                                                            field.*/                                              

/* RSVDLLPSRCEN @Bit 28 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDLLPSRCEN_Pos (28UL) /*!< Position of RSVDLLPSRCEN field.                                   */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDLLPSRCEN_Msk (0x1UL << I3CCORE_DMA_CH1_CTL1L_RSVDLLPSRCEN_Pos) /*!< Bit mask of RSVDLLPSRCEN
                                                                            field.*/                                              

/* RSVD1CTL @Bits 29..31 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CTL1L_RSVD1CTL_Pos (29UL)  /*!< Position of RSVD1CTL field.                                          */
  #define I3CCORE_DMA_CH1_CTL1L_RSVD1CTL_Msk (0x7UL << I3CCORE_DMA_CH1_CTL1L_RSVD1CTL_Pos) /*!< Bit mask of RSVD1CTL field.    */


/* I3CCORE_DMA_CH1_CTL1H: This register contains fields that control the DMA transfer. */
  #define I3CCORE_DMA_CH1_CTL1H_ResetValue (0x00000002UL) /*!< Reset value of CTL1H register.                                  */

/* BLOCKTS @Bits 0..4 : Block Transfer Size. */
  #define I3CCORE_DMA_CH1_CTL1H_BLOCKTS_Pos (0UL)    /*!< Position of BLOCKTS field.                                           */
  #define I3CCORE_DMA_CH1_CTL1H_BLOCKTS_Msk (0x1FUL << I3CCORE_DMA_CH1_CTL1H_BLOCKTS_Pos) /*!< Bit mask of BLOCKTS field.      */

/* RSVD2CTL @Bits 5..11 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CTL1H_RSVD2CTL_Pos (5UL)   /*!< Position of RSVD2CTL field.                                          */
  #define I3CCORE_DMA_CH1_CTL1H_RSVD2CTL_Msk (0x7FUL << I3CCORE_DMA_CH1_CTL1H_RSVD2CTL_Pos) /*!< Bit mask of RSVD2CTL field.   */

/* DONE @Bit 12 : Done bit. */
  #define I3CCORE_DMA_CH1_CTL1H_DONE_Pos (12UL)      /*!< Position of DONE field.                                              */
  #define I3CCORE_DMA_CH1_CTL1H_DONE_Msk (0x1UL << I3CCORE_DMA_CH1_CTL1H_DONE_Pos) /*!< Bit mask of DONE field.                */
  #define I3CCORE_DMA_CH1_CTL1H_DONE_Min (0x0UL)     /*!< Min enumerator value of DONE field.                                  */
  #define I3CCORE_DMA_CH1_CTL1H_DONE_Max (0x1UL)     /*!< Max enumerator value of DONE field.                                  */
  #define I3CCORE_DMA_CH1_CTL1H_DONE_DISABLED (0x0UL) /*!< (unspecified)                                                       */
  #define I3CCORE_DMA_CH1_CTL1H_DONE_ENABLED (0x1UL) /*!< (unspecified)                                                        */


/* I3CCORE_DMA_CH1_CFG1L: This register contains fields that configure the DMA transfer. */
  #define I3CCORE_DMA_CH1_CFG1L_ResetValue (0x00000E20UL) /*!< Reset value of CFG1L register.                                  */

