adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RSVDCFG @Bits 0..4 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDCFG_Pos (0UL)    /*!< Position of RSVDCFG field.                                           */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDCFG_Msk (0x1FUL << I3CCORE_DMA_CH1_CFG1L_RSVDCFG_Pos) /*!< Bit mask of RSVDCFG field.      */

/* CHPRIOR @Bits 5..7 : Channel Priority. */
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_Pos (5UL)    /*!< Position of CHPRIOR field.                                           */
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_Msk (0x7UL << I3CCORE_DMA_CH1_CFG1L_CHPRIOR_Pos) /*!< Bit mask of CHPRIOR field.       */
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_Min (0x0UL)  /*!< Min enumerator value of CHPRIOR field.                               */
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_Max (0x7UL)  /*!< Max enumerator value of CHPRIOR field.                               */
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_CH_PRIOR_0 (0x0UL) /*!< (unspecified)                                                  */
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_CH_PRIOR_1 (0x1UL) /*!< (unspecified)                                                  */
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_CH_PRIOR_2 (0x2UL) /*!< (unspecified)                                                  */
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_CH_PRIOR_3 (0x3UL) /*!< (unspecified)                                                  */
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_CH_PRIOR_4 (0x4UL) /*!< (unspecified)                                                  */
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_CH_PRIOR_5 (0x5UL) /*!< (unspecified)                                                  */
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_CH_PRIOR_6 (0x6UL) /*!< (unspecified)                                                  */
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_CH_PRIOR_7 (0x7UL) /*!< (unspecified)                                                  */

/* CHSUSP @Bit 8 : Channel Suspend. */
  #define I3CCORE_DMA_CH1_CFG1L_CHSUSP_Pos (8UL)     /*!< Position of CHSUSP field.                                            */
  #define I3CCORE_DMA_CH1_CFG1L_CHSUSP_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_CHSUSP_Pos) /*!< Bit mask of CHSUSP field.          */
  #define I3CCORE_DMA_CH1_CFG1L_CHSUSP_Min (0x0UL)   /*!< Min enumerator value of CHSUSP field.                                */
  #define I3CCORE_DMA_CH1_CFG1L_CHSUSP_Max (0x1UL)   /*!< Max enumerator value of CHSUSP field.                                */
  #define I3CCORE_DMA_CH1_CFG1L_CHSUSP_NOT_SUSPENDED (0x0UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH1_CFG1L_CHSUSP_SUSPENDED (0x1UL) /*!< (unspecified)                                                    */

/* FIFOEMPTY @Bit 9 : Channel FIFO status. */
  #define I3CCORE_DMA_CH1_CFG1L_FIFOEMPTY_Pos (9UL)  /*!< Position of FIFOEMPTY field.                                         */
  #define I3CCORE_DMA_CH1_CFG1L_FIFOEMPTY_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_FIFOEMPTY_Pos) /*!< Bit mask of FIFOEMPTY field. */
  #define I3CCORE_DMA_CH1_CFG1L_FIFOEMPTY_Min (0x0UL) /*!< Min enumerator value of FIFOEMPTY field.                            */
  #define I3CCORE_DMA_CH1_CFG1L_FIFOEMPTY_Max (0x1UL) /*!< Max enumerator value of FIFOEMPTY field.                            */
  #define I3CCORE_DMA_CH1_CFG1L_FIFOEMPTY_NOT_EMPTY (0x0UL) /*!< (unspecified)                                                 */
  #define I3CCORE_DMA_CH1_CFG1L_FIFOEMPTY_EMPTY (0x1UL) /*!< (unspecified)                                                     */

/* HSSELDST @Bit 10 : Destination Software or Hardware Handshaking Select. */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELDST_Pos (10UL)  /*!< Position of HSSELDST field.                                          */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELDST_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_HSSELDST_Pos) /*!< Bit mask of HSSELDST field.    */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELDST_Min (0x0UL) /*!< Min enumerator value of HSSELDST field.                              */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELDST_Max (0x1UL) /*!< Max enumerator value of HSSELDST field.                              */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELDST_HARDWARE_HS (0x0UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELDST_SOFTWARE_HS (0x1UL) /*!< (unspecified)                                                */

/* HSSELSRC @Bit 11 : Source Software or Hardware Handshaking Select. */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELSRC_Pos (11UL)  /*!< Position of HSSELSRC field.                                          */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELSRC_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_HSSELSRC_Pos) /*!< Bit mask of HSSELSRC field.    */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELSRC_Min (0x0UL) /*!< Min enumerator value of HSSELSRC field.                              */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELSRC_Max (0x1UL) /*!< Max enumerator value of HSSELSRC field.                              */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELSRC_HARDWARE_HS (0x0UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELSRC_SOFTWARE_HS (0x1UL) /*!< (unspecified)                                                */

/* RSVDLOCKCHL @Bits 12..13 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKCHL_Pos (12UL) /*!< Position of RSVDLOCKCHL field.                                     */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKCHL_Msk (0x3UL << I3CCORE_DMA_CH1_CFG1L_RSVDLOCKCHL_Pos) /*!< Bit mask of RSVDLOCKCHL
                                                                            field.*/                                              

/* RSVDLOCKBL @Bits 14..15 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKBL_Pos (14UL) /*!< Position of RSVDLOCKBL field.                                       */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKBL_Msk (0x3UL << I3CCORE_DMA_CH1_CFG1L_RSVDLOCKBL_Pos) /*!< Bit mask of RSVDLOCKBL
                                                                            field.*/                                              

/* RSVDLOCKCH @Bit 16 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKCH_Pos (16UL) /*!< Position of RSVDLOCKCH field.                                       */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKCH_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_RSVDLOCKCH_Pos) /*!< Bit mask of RSVDLOCKCH
                                                                            field.*/                                              

/* RSVDLOCKB @Bit 17 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKB_Pos (17UL) /*!< Position of RSVDLOCKB field.                                         */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKB_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_RSVDLOCKB_Pos) /*!< Bit mask of RSVDLOCKB field. */

/* DSTHSPOL @Bit 18 : Destination Handshaking Interface Polarity. */
  #define I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_Pos (18UL)  /*!< Position of DSTHSPOL field.                                          */
  #define I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_Pos) /*!< Bit mask of DSTHSPOL field.    */
  #define I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_Min (0x0UL) /*!< Min enumerator value of DSTHSPOL field.                              */
  #define I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_Max (0x1UL) /*!< Max enumerator value of DSTHSPOL field.                              */
  #define I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_ACTIVE_HIGH (0x0UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_ACTIVE_LOW (0x1UL) /*!< (unspecified)                                                 */

