adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SGI @Bits 0..19 : Source Gather Interval. */
  #define I3CCORE_DMA_CH1_SGR1_SGI_Pos (0UL)         /*!< Position of SGI field.                                               */
  #define I3CCORE_DMA_CH1_SGR1_SGI_Msk (0xFFFFFUL << I3CCORE_DMA_CH1_SGR1_SGI_Pos) /*!< Bit mask of SGI field.                 */

/* SGC @Bits 20..24 : Source Gather Count. */
  #define I3CCORE_DMA_CH1_SGR1_SGC_Pos (20UL)        /*!< Position of SGC field.                                               */
  #define I3CCORE_DMA_CH1_SGR1_SGC_Msk (0x1FUL << I3CCORE_DMA_CH1_SGR1_SGC_Pos) /*!< Bit mask of SGC field.                    */



/* ================================================= Struct I3CCORE_DMA_INT ================================================== */
/**
  * @brief INT [I3CCORE_DMA_INT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  RAWTFR;                            /*!< (@ 0x00000000) Interrupt events are stored in this Raw Interrupt
                                                                         Status register before masking.*/                        
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  RAWBLOCK;                          /*!< (@ 0x00000008) Interrupt events are stored in this Raw Interrupt
                                                                         Status register before masking.*/                        
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  RAWSRCTRAN;                        /*!< (@ 0x00000010) Interrupt events are stored in this Raw Interrupt
                                                                         Status register before masking.*/                        
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  RAWDSTTRAN;                        /*!< (@ 0x00000018) Interrupt events are stored in this Raw Interrupt
                                                                         Status register before masking.*/                        
  __IM  uint32_t  RESERVED3;
  __IOM uint32_t  RAWERR;                            /*!< (@ 0x00000020) Interrupt events are stored in this Raw Interrupt
                                                                         Status register before masking.*/                        
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  STATUSTFR;                         /*!< (@ 0x00000028) Channel DMA Transfer complete interrupt event from all
                                                                         channels is stored in this Interrupt Status register
                                                                         after masking.*/                                         
  __IM  uint32_t  RESERVED5;
  __IOM uint32_t  STATUSBLOCK;                       /*!< (@ 0x00000030) Channel Block complete interrupt event from all
                                                                         channels is stored in this Interrupt Status register
                                                                         after masking.*/                                         
  __IM  uint32_t  RESERVED6;
  __IOM uint32_t  STATUSSRCTRAN;                     /*!< (@ 0x00000038) Channel Source Transaction complete interrupt event
                                                                         from all channels is stored in this Interrupt Status
                                                                         register after masking.*/                                
  __IM  uint32_t  RESERVED7;
  __IOM uint32_t  STATUSDSTTRAN;                     /*!< (@ 0x00000040) Channel destination transaction complete interrupt
                                                                         event from all channels is stored in this Interrupt
                                                                         Status register after masking.*/                         
  __IM  uint32_t  RESERVED8;
  __IOM uint32_t  STATUSERR;                         /*!< (@ 0x00000048) Channel Error interrupt event from all channels is
                                                                         stored in this Interrupt Status register after
                                                                         masking.*/                                               
  __IM  uint32_t  RESERVED9;
  __IOM uint32_t  MASKTFR;                           /*!< (@ 0x00000050) The contents of the Raw Status register RawTfr is
                                                                         masked with the contents of the Mask register MaskTfr.*/ 
  __IM  uint32_t  RESERVED10;
  __IOM uint32_t  MASKBLOCK;                         /*!< (@ 0x00000058) The contents of the Raw Status register RawBlock is
                                                                         masked with the contents of the Mask register
                                                                         MaskBlock.*/                                             
  __IM  uint32_t  RESERVED11;
  __IOM uint32_t  MASKSRCTRAN;                       /*!< (@ 0x00000060) The contents of the Raw Status register RawSrcTran is
                                                                         masked with the contents of the Mask register
                                                                         MaskSrcTran.*/                                           
  __IM  uint32_t  RESERVED12;
  __IOM uint32_t  MASKDSTTRAN;                       /*!< (@ 0x00000068) The contents of the Raw Status register RawDstTran is
                                                                         masked with the contents of the Mask register
                                                                         MaskDstTran.*/                                           
  __IM  uint32_t  RESERVED13;
  __IOM uint32_t  MASKERR;                           /*!< (@ 0x00000070) The contents of the Raw Status register RawErr is
                                                                         masked with the contents of the Mask register MaskErr.*/ 
  __IM  uint32_t  RESERVED14;
  __IOM uint32_t  CLEARTFR;                          /*!< (@ 0x00000078) Each bit in the RawTfr and StatusTfr is cleared on the
                                                                         same cycle by writing a 1 to the corresponding location
                                                                         in the this registers.*/                                 
  __IM  uint32_t  RESERVED15;
  __IOM uint32_t  CLEARBLOCK;                        /*!< (@ 0x00000080) Each bit in the RawBlock and StatusBlock is cleared on
                                                                         the same cycle by writing a 1 to the corresponding
                                                                         location in the this registers.*/                        
  __IM  uint32_t  RESERVED16;
  __IOM uint32_t  CLEARSRCTRAN;                      /*!< (@ 0x00000088) Each bit in the RawSrcTran and StatusSrcTran is cleared
                                                                         on the same cycle by writing a 1 to the corresponding
                                                                         location in the this registers.*/                        
  __IM  uint32_t  RESERVED17;
  __IOM uint32_t  CLEARDSTTRAN;                      /*!< (@ 0x00000090) Each bit in the RawDstTran and StatusDstTran is cleared
                                                                         on the same cycle by writing a 1 to the corresponding
                                                                         location in the this registers.*/                        
  __IM  uint32_t  RESERVED18;
  __IOM uint32_t  CLEARERR;                          /*!< (@ 0x00000098) Each bit in the RawErr and StatusErr is cleared on the
                                                                         same cycle by writing a 1 to the corresponding location
                                                                         in the this registers.*/                                 
  __IM  uint32_t  RESERVED19;
  __IOM uint32_t  STATUSINT;                         /*!< (@ 0x000000A0) The contents of each of the five Status registers
                                                                         StatusTfr, StatusBlock, StatusSrcTran, StatusDstTran,
                                                                         StatusErr is ORed to produce a single bit for each
                                                                         interrupt type in the Combined Status register
                                                                         (StatusInt).*/                                           
} NRF_I3CCORE_DMA_INT_Type;                          /*!< Size = 164 (0x0A4)                                                   */

/* I3CCORE_DMA_INT_RAWTFR: Interrupt events are stored in this Raw Interrupt Status register before masking. */
  #define I3CCORE_DMA_INT_RAWTFR_ResetValue (0x00000000UL) /*!< Reset value of RAWTFR register.                                */

/* RAW @Bits 0..1 : Raw Status for IntTfr Interrupt */
  #define I3CCORE_DMA_INT_RAWTFR_RAW_Pos (0UL)       /*!< Position of RAW field.                                               */
  #define I3CCORE_DMA_INT_RAWTFR_RAW_Msk (0x3UL << I3CCORE_DMA_INT_RAWTFR_RAW_Pos) /*!< Bit mask of RAW field.                 */
  #define I3CCORE_DMA_INT_RAWTFR_RAW_Min (0x0UL)     /*!< Min enumerator value of RAW field.                                   */
  #define I3CCORE_DMA_INT_RAWTFR_RAW_Max (0x1UL)     /*!< Max enumerator value of RAW field.                                   */
  #define I3CCORE_DMA_INT_RAWTFR_RAW_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define I3CCORE_DMA_INT_RAWTFR_RAW_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */


/* I3CCORE_DMA_INT_RAWBLOCK: Interrupt events are stored in this Raw Interrupt Status register before masking. */
  #define I3CCORE_DMA_INT_RAWBLOCK_ResetValue (0x00000000UL) /*!< Reset value of RAWBLOCK register.                            */

/* RAW @Bits 0..1 : Raw Status for IntBlock Interrupt */
  #define I3CCORE_DMA_INT_RAWBLOCK_RAW_Pos (0UL)     /*!< Position of RAW field.                                               */
  #define I3CCORE_DMA_INT_RAWBLOCK_RAW_Msk (0x3UL << I3CCORE_DMA_INT_RAWBLOCK_RAW_Pos) /*!< Bit mask of RAW field.             */
  #define I3CCORE_DMA_INT_RAWBLOCK_RAW_Min (0x0UL)   /*!< Min enumerator value of RAW field.                                   */
  #define I3CCORE_DMA_INT_RAWBLOCK_RAW_Max (0x1UL)   /*!< Max enumerator value of RAW field.                                   */
  #define I3CCORE_DMA_INT_RAWBLOCK_RAW_INACTIVE (0x0UL) /*!< (unspecified)                                                     */
  #define I3CCORE_DMA_INT_RAWBLOCK_RAW_ACTIVE (0x1UL) /*!< (unspecified)                                                       */


/* I3CCORE_DMA_INT_RAWSRCTRAN: Interrupt events are stored in this Raw Interrupt Status register before masking. */
  #define I3CCORE_DMA_INT_RAWSRCTRAN_ResetValue (0x00000000UL) /*!< Reset value of RAWSRCTRAN register.                        */

/* RAW @Bits 0..1 : Raw Status for IntSrcTran Interrupt */
  #define I3CCORE_DMA_INT_RAWSRCTRAN_RAW_Pos (0UL)   /*!< Position of RAW field.                                               */
  #define I3CCORE_DMA_INT_RAWSRCTRAN_RAW_Msk (0x3UL << I3CCORE_DMA_INT_RAWSRCTRAN_RAW_Pos) /*!< Bit mask of RAW field.         */
  #define I3CCORE_DMA_INT_RAWSRCTRAN_RAW_Min (0x0UL) /*!< Min enumerator value of RAW field.                                   */
  #define I3CCORE_DMA_INT_RAWSRCTRAN_RAW_Max (0x1UL) /*!< Max enumerator value of RAW field.                                   */
  #define I3CCORE_DMA_INT_RAWSRCTRAN_RAW_INACTIVE (0x0UL) /*!< (unspecified)                                                   */
  #define I3CCORE_DMA_INT_RAWSRCTRAN_RAW_ACTIVE (0x1UL) /*!< (unspecified)                                                     */


