adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* I3CCORE_DMA_INT_RAWDSTTRAN: Interrupt events are stored in this Raw Interrupt Status register before masking. */
  #define I3CCORE_DMA_INT_RAWDSTTRAN_ResetValue (0x00000000UL) /*!< Reset value of RAWDSTTRAN register.                        */

/* RAW @Bits 0..1 : Raw Status for IntDstTran Interrupt */
  #define I3CCORE_DMA_INT_RAWDSTTRAN_RAW_Pos (0UL)   /*!< Position of RAW field.                                               */
  #define I3CCORE_DMA_INT_RAWDSTTRAN_RAW_Msk (0x3UL << I3CCORE_DMA_INT_RAWDSTTRAN_RAW_Pos) /*!< Bit mask of RAW field.         */
  #define I3CCORE_DMA_INT_RAWDSTTRAN_RAW_Min (0x0UL) /*!< Min enumerator value of RAW field.                                   */
  #define I3CCORE_DMA_INT_RAWDSTTRAN_RAW_Max (0x1UL) /*!< Max enumerator value of RAW field.                                   */
  #define I3CCORE_DMA_INT_RAWDSTTRAN_RAW_INACTIVE (0x0UL) /*!< (unspecified)                                                   */
  #define I3CCORE_DMA_INT_RAWDSTTRAN_RAW_ACTIVE (0x1UL) /*!< (unspecified)                                                     */


/* I3CCORE_DMA_INT_RAWERR: Interrupt events are stored in this Raw Interrupt Status register before masking. */
  #define I3CCORE_DMA_INT_RAWERR_ResetValue (0x00000000UL) /*!< Reset value of RAWERR register.                                */

/* RAW @Bits 0..1 : Raw Status for IntErr Interrupt */
  #define I3CCORE_DMA_INT_RAWERR_RAW_Pos (0UL)       /*!< Position of RAW field.                                               */
  #define I3CCORE_DMA_INT_RAWERR_RAW_Msk (0x3UL << I3CCORE_DMA_INT_RAWERR_RAW_Pos) /*!< Bit mask of RAW field.                 */
  #define I3CCORE_DMA_INT_RAWERR_RAW_Min (0x0UL)     /*!< Min enumerator value of RAW field.                                   */
  #define I3CCORE_DMA_INT_RAWERR_RAW_Max (0x1UL)     /*!< Max enumerator value of RAW field.                                   */
  #define I3CCORE_DMA_INT_RAWERR_RAW_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define I3CCORE_DMA_INT_RAWERR_RAW_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */


/* I3CCORE_DMA_INT_STATUSTFR: Channel DMA Transfer complete interrupt event from all channels is stored in this Interrupt Status
                               register after masking. */                                                                         
                                                                                                                                  
  #define I3CCORE_DMA_INT_STATUSTFR_ResetValue (0x00000000UL) /*!< Reset value of STATUSTFR register.                          */

/* STATUS @Bits 0..1 : Status for IntTfr Interrupt */
  #define I3CCORE_DMA_INT_STATUSTFR_STATUS_Pos (0UL) /*!< Position of STATUS field.                                            */
  #define I3CCORE_DMA_INT_STATUSTFR_STATUS_Msk (0x3UL << I3CCORE_DMA_INT_STATUSTFR_STATUS_Pos) /*!< Bit mask of STATUS field.  */
  #define I3CCORE_DMA_INT_STATUSTFR_STATUS_Min (0x0UL) /*!< Min enumerator value of STATUS field.                              */
  #define I3CCORE_DMA_INT_STATUSTFR_STATUS_Max (0x1UL) /*!< Max enumerator value of STATUS field.                              */
  #define I3CCORE_DMA_INT_STATUSTFR_STATUS_INACTIVE (0x0UL) /*!< (unspecified)                                                 */
  #define I3CCORE_DMA_INT_STATUSTFR_STATUS_ACTIVE (0x1UL) /*!< (unspecified)                                                   */


/* I3CCORE_DMA_INT_STATUSBLOCK: Channel Block complete interrupt event from all channels is stored in this Interrupt Status
                                 register after masking. */                                                                       
                                                                                                                                  
  #define I3CCORE_DMA_INT_STATUSBLOCK_ResetValue (0x00000000UL) /*!< Reset value of STATUSBLOCK register.                      */

/* STATUS @Bits 0..1 : Status for IntBlock Interrupt */
  #define I3CCORE_DMA_INT_STATUSBLOCK_STATUS_Pos (0UL) /*!< Position of STATUS field.                                          */
  #define I3CCORE_DMA_INT_STATUSBLOCK_STATUS_Msk (0x3UL << I3CCORE_DMA_INT_STATUSBLOCK_STATUS_Pos) /*!< Bit mask of STATUS
                                                                            field.*/                                              
  #define I3CCORE_DMA_INT_STATUSBLOCK_STATUS_Min (0x0UL) /*!< Min enumerator value of STATUS field.                            */
  #define I3CCORE_DMA_INT_STATUSBLOCK_STATUS_Max (0x1UL) /*!< Max enumerator value of STATUS field.                            */
  #define I3CCORE_DMA_INT_STATUSBLOCK_STATUS_INACTIVE (0x0UL) /*!< (unspecified)                                               */
  #define I3CCORE_DMA_INT_STATUSBLOCK_STATUS_ACTIVE (0x1UL) /*!< (unspecified)                                                 */


/* I3CCORE_DMA_INT_STATUSSRCTRAN: Channel Source Transaction complete interrupt event from all channels is stored in this
                                   Interrupt Status register after masking. */                                                    
                                                                                                                                  
  #define I3CCORE_DMA_INT_STATUSSRCTRAN_ResetValue (0x00000000UL) /*!< Reset value of STATUSSRCTRAN register.                  */

/* STATUS @Bits 0..1 : Status for IntSrcTran Interrupt */
  #define I3CCORE_DMA_INT_STATUSSRCTRAN_STATUS_Pos (0UL) /*!< Position of STATUS field.                                        */
  #define I3CCORE_DMA_INT_STATUSSRCTRAN_STATUS_Msk (0x3UL << I3CCORE_DMA_INT_STATUSSRCTRAN_STATUS_Pos) /*!< Bit mask of STATUS
                                                                            field.*/                                              
  #define I3CCORE_DMA_INT_STATUSSRCTRAN_STATUS_Min (0x0UL) /*!< Min enumerator value of STATUS field.                          */
  #define I3CCORE_DMA_INT_STATUSSRCTRAN_STATUS_Max (0x1UL) /*!< Max enumerator value of STATUS field.                          */
  #define I3CCORE_DMA_INT_STATUSSRCTRAN_STATUS_INACTIVE (0x0UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_INT_STATUSSRCTRAN_STATUS_ACTIVE (0x1UL) /*!< (unspecified)                                               */


