adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* INTMASK @Bits 0..1 : Mask for IntBlock Interrupt */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASK_Pos (0UL) /*!< Position of INTMASK field.                                          */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASK_Msk (0x3UL << I3CCORE_DMA_INT_MASKBLOCK_INTMASK_Pos) /*!< Bit mask of INTMASK
                                                                            field.*/                                              
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASK_Min (0x0UL) /*!< Min enumerator value of INTMASK field.                            */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASK_Max (0x1UL) /*!< Max enumerator value of INTMASK field.                            */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASK_MASK (0x0UL) /*!< (unspecified)                                                    */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASK_UNMASK (0x1UL) /*!< (unspecified)                                                  */

/* RSVDMASKBLOCK @Bits 2..7 : Reserved field- read-only */
  #define I3CCORE_DMA_INT_MASKBLOCK_RSVDMASKBLOCK_Pos (2UL) /*!< Position of RSVDMASKBLOCK field.                              */
  #define I3CCORE_DMA_INT_MASKBLOCK_RSVDMASKBLOCK_Msk (0x3FUL << I3CCORE_DMA_INT_MASKBLOCK_RSVDMASKBLOCK_Pos) /*!< Bit mask of
                                                                            RSVDMASKBLOCK field.*/                                

/* INTMASKWE @Bits 8..9 : Interrupt Mask Write Enable */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_Pos (8UL) /*!< Position of INTMASKWE field.                                      */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_Msk (0x3UL << I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_Pos) /*!< Bit mask of INTMASKWE
                                                                            field.*/                                              
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_Min (0x0UL) /*!< Min enumerator value of INTMASKWE field.                        */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_Max (0x1UL) /*!< Max enumerator value of INTMASKWE field.                        */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_DISABLED (0x0UL) /*!< (unspecified)                                              */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_ENABLED (0x1UL) /*!< (unspecified)                                               */


/* I3CCORE_DMA_INT_MASKSRCTRAN: The contents of the Raw Status register RawSrcTran is masked with the contents of the Mask
                                 register MaskSrcTran. */                                                                         
                                                                                                                                  
  #define I3CCORE_DMA_INT_MASKSRCTRAN_ResetValue (0x00000000UL) /*!< Reset value of MASKSRCTRAN register.                      */

/* INTMASK @Bits 0..1 : Mask for IntSrcTran Interrupt */
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASK_Pos (0UL) /*!< Position of INTMASK field.                                        */
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASK_Msk (0x3UL << I3CCORE_DMA_INT_MASKSRCTRAN_INTMASK_Pos) /*!< Bit mask of INTMASK
                                                                            field.*/                                              
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASK_Min (0x0UL) /*!< Min enumerator value of INTMASK field.                          */
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASK_Max (0x1UL) /*!< Max enumerator value of INTMASK field.                          */
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASK_MASK (0x0UL) /*!< (unspecified)                                                  */
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASK_UNMASK (0x1UL) /*!< (unspecified)                                                */

/* RSVDMASKSRCTRAN @Bits 2..7 : Reserved field- read-only */
  #define I3CCORE_DMA_INT_MASKSRCTRAN_RSVDMASKSRCTRAN_Pos (2UL) /*!< Position of RSVDMASKSRCTRAN field.                        */
  #define I3CCORE_DMA_INT_MASKSRCTRAN_RSVDMASKSRCTRAN_Msk (0x3FUL << I3CCORE_DMA_INT_MASKSRCTRAN_RSVDMASKSRCTRAN_Pos) /*!< Bit
                                                                            mask of RSVDMASKSRCTRAN field.*/                      

/* INTMASKWE @Bits 8..9 : Interrupt Mask Write Enable */
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASKWE_Pos (8UL) /*!< Position of INTMASKWE field.                                    */
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASKWE_Msk (0x3UL << I3CCORE_DMA_INT_MASKSRCTRAN_INTMASKWE_Pos) /*!< Bit mask of
                                                                            INTMASKWE field.*/                                    
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASKWE_Min (0x0UL) /*!< Min enumerator value of INTMASKWE field.                      */
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASKWE_Max (0x1UL) /*!< Max enumerator value of INTMASKWE field.                      */
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASKWE_DISABLED (0x0UL) /*!< (unspecified)                                            */
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASKWE_ENABLED (0x1UL) /*!< (unspecified)                                             */


/* I3CCORE_DMA_INT_MASKDSTTRAN: The contents of the Raw Status register RawDstTran is masked with the contents of the Mask
                                 register MaskDstTran. */                                                                         
                                                                                                                                  
  #define I3CCORE_DMA_INT_MASKDSTTRAN_ResetValue (0x00000000UL) /*!< Reset value of MASKDSTTRAN register.                      */

/* INTMASK @Bits 0..1 : Mask for IntDstTran Interrupt */
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASK_Pos (0UL) /*!< Position of INTMASK field.                                        */
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASK_Msk (0x3UL << I3CCORE_DMA_INT_MASKDSTTRAN_INTMASK_Pos) /*!< Bit mask of INTMASK
                                                                            field.*/                                              
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASK_Min (0x0UL) /*!< Min enumerator value of INTMASK field.                          */
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASK_Max (0x1UL) /*!< Max enumerator value of INTMASK field.                          */
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASK_MASK (0x0UL) /*!< (unspecified)                                                  */
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASK_UNMASK (0x1UL) /*!< (unspecified)                                                */

