adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RSVDMASKDSTTRAN @Bits 2..7 : Reserved field - read-only */
  #define I3CCORE_DMA_INT_MASKDSTTRAN_RSVDMASKDSTTRAN_Pos (2UL) /*!< Position of RSVDMASKDSTTRAN field.                        */
  #define I3CCORE_DMA_INT_MASKDSTTRAN_RSVDMASKDSTTRAN_Msk (0x3FUL << I3CCORE_DMA_INT_MASKDSTTRAN_RSVDMASKDSTTRAN_Pos) /*!< Bit
                                                                            mask of RSVDMASKDSTTRAN field.*/                      

/* INTMASKWE @Bits 8..9 : Interrupt Mask Write Enable */
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASKWE_Pos (8UL) /*!< Position of INTMASKWE field.                                    */
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASKWE_Msk (0x3UL << I3CCORE_DMA_INT_MASKDSTTRAN_INTMASKWE_Pos) /*!< Bit mask of
                                                                            INTMASKWE field.*/                                    
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASKWE_Min (0x0UL) /*!< Min enumerator value of INTMASKWE field.                      */
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASKWE_Max (0x1UL) /*!< Max enumerator value of INTMASKWE field.                      */
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASKWE_DISABLED (0x0UL) /*!< (unspecified)                                            */
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASKWE_ENABLED (0x1UL) /*!< (unspecified)                                             */


/* I3CCORE_DMA_INT_MASKERR: The contents of the Raw Status register RawErr is masked with the contents of the Mask register
                             MaskErr. */                                                                                          
                                                                                                                                  
  #define I3CCORE_DMA_INT_MASKERR_ResetValue (0x00000000UL) /*!< Reset value of MASKERR register.                              */

/* INTMASK @Bits 0..1 : Mask for IntErr Interrupt */
  #define I3CCORE_DMA_INT_MASKERR_INTMASK_Pos (0UL)  /*!< Position of INTMASK field.                                           */
  #define I3CCORE_DMA_INT_MASKERR_INTMASK_Msk (0x3UL << I3CCORE_DMA_INT_MASKERR_INTMASK_Pos) /*!< Bit mask of INTMASK field.   */
  #define I3CCORE_DMA_INT_MASKERR_INTMASK_Min (0x0UL) /*!< Min enumerator value of INTMASK field.                              */
  #define I3CCORE_DMA_INT_MASKERR_INTMASK_Max (0x1UL) /*!< Max enumerator value of INTMASK field.                              */
  #define I3CCORE_DMA_INT_MASKERR_INTMASK_MASK (0x0UL) /*!< (unspecified)                                                      */
  #define I3CCORE_DMA_INT_MASKERR_INTMASK_UNMASK (0x1UL) /*!< (unspecified)                                                    */

/* RSVDMASKERR @Bits 2..7 : Reserved field- read-only */
  #define I3CCORE_DMA_INT_MASKERR_RSVDMASKERR_Pos (2UL) /*!< Position of RSVDMASKERR field.                                    */
  #define I3CCORE_DMA_INT_MASKERR_RSVDMASKERR_Msk (0x3FUL << I3CCORE_DMA_INT_MASKERR_RSVDMASKERR_Pos) /*!< Bit mask of
                                                                            RSVDMASKERR field.*/                                  

/* INTMASKWE @Bits 8..9 : Interrupt Mask Write Enable */
  #define I3CCORE_DMA_INT_MASKERR_INTMASKWE_Pos (8UL) /*!< Position of INTMASKWE field.                                        */
  #define I3CCORE_DMA_INT_MASKERR_INTMASKWE_Msk (0x3UL << I3CCORE_DMA_INT_MASKERR_INTMASKWE_Pos) /*!< Bit mask of INTMASKWE
                                                                            field.*/                                              
  #define I3CCORE_DMA_INT_MASKERR_INTMASKWE_Min (0x0UL) /*!< Min enumerator value of INTMASKWE field.                          */
  #define I3CCORE_DMA_INT_MASKERR_INTMASKWE_Max (0x1UL) /*!< Max enumerator value of INTMASKWE field.                          */
  #define I3CCORE_DMA_INT_MASKERR_INTMASKWE_DISABLED (0x0UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_INT_MASKERR_INTMASKWE_ENABLED (0x1UL) /*!< (unspecified)                                                 */


/* I3CCORE_DMA_INT_CLEARTFR: Each bit in the RawTfr and StatusTfr is cleared on the same cycle by writing a 1 to the
                              corresponding location in the this registers. */                                                    
                                                                                                                                  
  #define I3CCORE_DMA_INT_CLEARTFR_ResetValue (0x00000000UL) /*!< Reset value of CLEARTFR register.                            */

/* CLEAR @Bits 0..1 : Clear for IntTfr Interrupt */
  #define I3CCORE_DMA_INT_CLEARTFR_CLEAR_Pos (0UL)   /*!< Position of CLEAR field.                                             */
  #define I3CCORE_DMA_INT_CLEARTFR_CLEAR_Msk (0x3UL << I3CCORE_DMA_INT_CLEARTFR_CLEAR_Pos) /*!< Bit mask of CLEAR field.       */
  #define I3CCORE_DMA_INT_CLEARTFR_CLEAR_Min (0x0UL) /*!< Min enumerator value of CLEAR field.                                 */
  #define I3CCORE_DMA_INT_CLEARTFR_CLEAR_Max (0x1UL) /*!< Max enumerator value of CLEAR field.                                 */
  #define I3CCORE_DMA_INT_CLEARTFR_CLEAR_NOT_CLEAR (0x0UL) /*!< (unspecified)                                                  */
  #define I3CCORE_DMA_INT_CLEARTFR_CLEAR_CLEAR (0x1UL) /*!< (unspecified)                                                      */


/* I3CCORE_DMA_INT_CLEARBLOCK: Each bit in the RawBlock and StatusBlock is cleared on the same cycle by writing a 1 to the
                                corresponding location in the this registers. */                                                  
                                                                                                                                  
  #define I3CCORE_DMA_INT_CLEARBLOCK_ResetValue (0x00000000UL) /*!< Reset value of CLEARBLOCK register.                        */

/* CLEAR @Bits 0..1 : Clear for IntBlock Interrupt */
  #define I3CCORE_DMA_INT_CLEARBLOCK_CLEAR_Pos (0UL) /*!< Position of CLEAR field.                                             */
  #define I3CCORE_DMA_INT_CLEARBLOCK_CLEAR_Msk (0x3UL << I3CCORE_DMA_INT_CLEARBLOCK_CLEAR_Pos) /*!< Bit mask of CLEAR field.   */


/* I3CCORE_DMA_INT_CLEARSRCTRAN: Each bit in the RawSrcTran and StatusSrcTran is cleared on the same cycle by writing a 1 to the
                                  corresponding location in the this registers. */                                                
                                                                                                                                  
  #define I3CCORE_DMA_INT_CLEARSRCTRAN_ResetValue (0x00000000UL) /*!< Reset value of CLEARSRCTRAN register.                    */

/* CLEAR @Bits 0..1 : Clear for IntSrcTran Interrupt */
  #define I3CCORE_DMA_INT_CLEARSRCTRAN_CLEAR_Pos (0UL) /*!< Position of CLEAR field.                                           */
  #define I3CCORE_DMA_INT_CLEARSRCTRAN_CLEAR_Msk (0x3UL << I3CCORE_DMA_INT_CLEARSRCTRAN_CLEAR_Pos) /*!< Bit mask of CLEAR
                                                                            field.*/                                              
  #define I3CCORE_DMA_INT_CLEARSRCTRAN_CLEAR_Min (0x0UL) /*!< Min enumerator value of CLEAR field.                             */
  #define I3CCORE_DMA_INT_CLEARSRCTRAN_CLEAR_Max (0x1UL) /*!< Max enumerator value of CLEAR field.                             */
  #define I3CCORE_DMA_INT_CLEARSRCTRAN_CLEAR_NOT_CLEAR (0x0UL) /*!< (unspecified)                                              */
  #define I3CCORE_DMA_INT_CLEARSRCTRAN_CLEAR_CLEAR (0x1UL) /*!< (unspecified)                                                  */


