adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* I3CCORE_DMA_SWHANDSHAKE_REQDSTREG: A bit is assigned for each channel in this register. */
  #define I3CCORE_DMA_SWHANDSHAKE_REQDSTREG_ResetValue (0x00000000UL) /*!< Reset value of REQDSTREG register.                  */

/* DSTREQ @Bits 0..1 : Destination Software Transaction Request */
  #define I3CCORE_DMA_SWHANDSHAKE_REQDSTREG_DSTREQ_Pos (0UL) /*!< Position of DSTREQ field.                                    */
  #define I3CCORE_DMA_SWHANDSHAKE_REQDSTREG_DSTREQ_Msk (0x3UL << I3CCORE_DMA_SWHANDSHAKE_REQDSTREG_DSTREQ_Pos) /*!< Bit mask of
                                                                            DSTREQ field.*/                                       
  #define I3CCORE_DMA_SWHANDSHAKE_REQDSTREG_DSTREQ_Min (0x0UL) /*!< Min enumerator value of DSTREQ field.                      */
  #define I3CCORE_DMA_SWHANDSHAKE_REQDSTREG_DSTREQ_Max (0x1UL) /*!< Max enumerator value of DSTREQ field.                      */
  #define I3CCORE_DMA_SWHANDSHAKE_REQDSTREG_DSTREQ_INACTIVE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_SWHANDSHAKE_REQDSTREG_DSTREQ_ACTIVE (0x1UL) /*!< (unspecified)                                           */

/* RSVDREQDSTREG @Bits 2..7 : Reserved field - read-only */
  #define I3CCORE_DMA_SWHANDSHAKE_REQDSTREG_RSVDREQDSTREG_Pos (2UL) /*!< Position of RSVDREQDSTREG field.                      */
  #define I3CCORE_DMA_SWHANDSHAKE_REQDSTREG_RSVDREQDSTREG_Msk (0x3FUL << I3CCORE_DMA_SWHANDSHAKE_REQDSTREG_RSVDREQDSTREG_Pos)
                                                                            /*!< Bit mask of RSVDREQDSTREG field.*/               

/* DSTREQWE @Bits 8..9 : Destination Software Transaction Request write enable */
  #define I3CCORE_DMA_SWHANDSHAKE_REQDSTREG_DSTREQWE_Pos (8UL) /*!< Position of DSTREQWE field.                                */
  #define I3CCORE_DMA_SWHANDSHAKE_REQDSTREG_DSTREQWE_Msk (0x3UL << I3CCORE_DMA_SWHANDSHAKE_REQDSTREG_DSTREQWE_Pos) /*!< Bit mask
                                                                            of DSTREQWE field.*/                                  
  #define I3CCORE_DMA_SWHANDSHAKE_REQDSTREG_DSTREQWE_Min (0x0UL) /*!< Min enumerator value of DSTREQWE field.                  */
  #define I3CCORE_DMA_SWHANDSHAKE_REQDSTREG_DSTREQWE_Max (0x1UL) /*!< Max enumerator value of DSTREQWE field.                  */
  #define I3CCORE_DMA_SWHANDSHAKE_REQDSTREG_DSTREQWE_DISABLED (0x0UL) /*!< (unspecified)                                       */
  #define I3CCORE_DMA_SWHANDSHAKE_REQDSTREG_DSTREQWE_ENABLED (0x1UL) /*!< (unspecified)                                        */


/* I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG: A bit is assigned for each channel in this register. */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG_ResetValue (0x00000000UL) /*!< Reset value of SGLRQSRCREG register.              */

/* SRCSGLREQ @Bits 0..1 : Source Single Transaction Request */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG_SRCSGLREQ_Pos (0UL) /*!< Position of SRCSGLREQ field.                            */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG_SRCSGLREQ_Msk (0x3UL << I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG_SRCSGLREQ_Pos) /*!<
                                                                            Bit mask of SRCSGLREQ field.*/                        
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG_SRCSGLREQ_Min (0x0UL) /*!< Min enumerator value of SRCSGLREQ field.              */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG_SRCSGLREQ_Max (0x1UL) /*!< Max enumerator value of SRCSGLREQ field.              */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG_SRCSGLREQ_INACTIVE (0x0UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG_SRCSGLREQ_ACTIVE (0x1UL) /*!< (unspecified)                                      */

/* RSVDSGLRQSRCREG @Bits 2..7 : Reserved field - read-only */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG_RSVDSGLRQSRCREG_Pos (2UL) /*!< Position of RSVDSGLRQSRCREG field.                */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG_RSVDSGLRQSRCREG_Msk (0x3FUL << I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG_RSVDSGLRQSRCREG_Pos)
                                                                            /*!< Bit mask of RSVDSGLRQSRCREG field.*/             

/* SRCSGLREQWE @Bits 8..9 : Source Single Transaction Request write enable */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG_SRCSGLREQWE_Pos (8UL) /*!< Position of SRCSGLREQWE field.                        */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG_SRCSGLREQWE_Msk (0x3UL << I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG_SRCSGLREQWE_Pos)
                                                                            /*!< Bit mask of SRCSGLREQWE field.*/                 
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG_SRCSGLREQWE_Min (0x0UL) /*!< Min enumerator value of SRCSGLREQWE field.          */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG_SRCSGLREQWE_Max (0x1UL) /*!< Max enumerator value of SRCSGLREQWE field.          */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG_SRCSGLREQWE_DISABLED (0x0UL) /*!< (unspecified)                                  */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQSRCREG_SRCSGLREQWE_ENABLED (0x1UL) /*!< (unspecified)                                   */


/* I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG: A bit is assigned for each channel in this register. */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG_ResetValue (0x00000000UL) /*!< Reset value of SGLRQDSTREG register.              */

/* DSTSGLREQ @Bits 0..1 : Destination Single Transaction Request */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG_DSTSGLREQ_Pos (0UL) /*!< Position of DSTSGLREQ field.                            */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG_DSTSGLREQ_Msk (0x3UL << I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG_DSTSGLREQ_Pos) /*!<
                                                                            Bit mask of DSTSGLREQ field.*/                        
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG_DSTSGLREQ_Min (0x0UL) /*!< Min enumerator value of DSTSGLREQ field.              */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG_DSTSGLREQ_Max (0x1UL) /*!< Max enumerator value of DSTSGLREQ field.              */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG_DSTSGLREQ_INACTIVE (0x0UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG_DSTSGLREQ_ACTIVE (0x1UL) /*!< (unspecified)                                      */

/* RSVDSGLRQDSTREG @Bits 2..7 : Reserved field - read-only */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG_RSVDSGLRQDSTREG_Pos (2UL) /*!< Position of RSVDSGLRQDSTREG field.                */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG_RSVDSGLRQDSTREG_Msk (0x3FUL << I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG_RSVDSGLRQDSTREG_Pos)
                                                                            /*!< Bit mask of RSVDSGLRQDSTREG field.*/             

/* DSTSGLREQWE @Bits 8..9 : Destination Single Transaction Request write enable */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG_DSTSGLREQWE_Pos (8UL) /*!< Position of DSTSGLREQWE field.                        */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG_DSTSGLREQWE_Msk (0x3UL << I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG_DSTSGLREQWE_Pos)
                                                                            /*!< Bit mask of DSTSGLREQWE field.*/                 
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG_DSTSGLREQWE_Min (0x0UL) /*!< Min enumerator value of DSTSGLREQWE field.          */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG_DSTSGLREQWE_Max (0x1UL) /*!< Max enumerator value of DSTSGLREQWE field.          */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG_DSTSGLREQWE_DISABLED (0x0UL) /*!< (unspecified)                                  */
  #define I3CCORE_DMA_SWHANDSHAKE_SGLRQDSTREG_DSTSGLREQWE_ENABLED (0x1UL) /*!< (unspecified)                                   */


/* I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG: A bit is assigned for each channel in this register. */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG_ResetValue (0x00000000UL) /*!< Reset value of LSTSRCREG register.                  */

/* LSTSRC @Bits 0..1 : Source Last Transaction Request register */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG_LSTSRC_Pos (0UL) /*!< Position of LSTSRC field.                                    */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG_LSTSRC_Msk (0x3UL << I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG_LSTSRC_Pos) /*!< Bit mask of
                                                                            LSTSRC field.*/                                       
  #define I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG_LSTSRC_Min (0x0UL) /*!< Min enumerator value of LSTSRC field.                      */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG_LSTSRC_Max (0x1UL) /*!< Max enumerator value of LSTSRC field.                      */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG_LSTSRC_NOT_LAST (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG_LSTSRC_LAST (0x1UL) /*!< (unspecified)                                             */

/* RSVDLSTSRCREG @Bits 2..7 : Reserved field- read-only */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG_RSVDLSTSRCREG_Pos (2UL) /*!< Position of RSVDLSTSRCREG field.                      */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG_RSVDLSTSRCREG_Msk (0x3FUL << I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG_RSVDLSTSRCREG_Pos)
                                                                            /*!< Bit mask of RSVDLSTSRCREG field.*/               

