adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LSTSRCWE @Bits 8..9 : Source Last Transaction Request write enable */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG_LSTSRCWE_Pos (8UL) /*!< Position of LSTSRCWE field.                                */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG_LSTSRCWE_Msk (0x3UL << I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG_LSTSRCWE_Pos) /*!< Bit mask
                                                                            of LSTSRCWE field.*/                                  
  #define I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG_LSTSRCWE_Min (0x0UL) /*!< Min enumerator value of LSTSRCWE field.                  */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG_LSTSRCWE_Max (0x1UL) /*!< Max enumerator value of LSTSRCWE field.                  */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG_LSTSRCWE_DISABLED (0x0UL) /*!< (unspecified)                                       */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTSRCREG_LSTSRCWE_ENABLED (0x1UL) /*!< (unspecified)                                        */


/* I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG: A bit is assigned for each channel in this register. */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG_ResetValue (0x00000000UL) /*!< Reset value of LSTDSTREG register.                  */

/* LSTDST @Bits 0..1 : Destination Last Transaction Request */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG_LSTDST_Pos (0UL) /*!< Position of LSTDST field.                                    */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG_LSTDST_Msk (0x3UL << I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG_LSTDST_Pos) /*!< Bit mask of
                                                                            LSTDST field.*/                                       
  #define I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG_LSTDST_Min (0x0UL) /*!< Min enumerator value of LSTDST field.                      */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG_LSTDST_Max (0x1UL) /*!< Max enumerator value of LSTDST field.                      */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG_LSTDST_NOT_LAST (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG_LSTDST_LAST (0x1UL) /*!< (unspecified)                                             */

/* RSVDLSTDSTREG @Bits 2..7 : Reserved field - read-only */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG_RSVDLSTDSTREG_Pos (2UL) /*!< Position of RSVDLSTDSTREG field.                      */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG_RSVDLSTDSTREG_Msk (0x3FUL << I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG_RSVDLSTDSTREG_Pos)
                                                                            /*!< Bit mask of RSVDLSTDSTREG field.*/               

/* LSTDSTWE @Bits 8..9 : Source Last Transaction Request write enable */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG_LSTDSTWE_Pos (8UL) /*!< Position of LSTDSTWE field.                                */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG_LSTDSTWE_Msk (0x3UL << I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG_LSTDSTWE_Pos) /*!< Bit mask
                                                                            of LSTDSTWE field.*/                                  
  #define I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG_LSTDSTWE_Min (0x0UL) /*!< Min enumerator value of LSTDSTWE field.                  */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG_LSTDSTWE_Max (0x1UL) /*!< Max enumerator value of LSTDSTWE field.                  */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG_LSTDSTWE_DISABLED (0x0UL) /*!< (unspecified)                                       */
  #define I3CCORE_DMA_SWHANDSHAKE_LSTDSTREG_LSTDSTWE_ENABLED (0x1UL) /*!< (unspecified)                                        */



/* ================================================= Struct I3CCORE_DMA_MISC ================================================= */
/**
  * @brief MISC [I3CCORE_DMA_MISC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DMACFGREG;                         /*!< (@ 0x00000000) This register is used to enable the DW_ahb_dmac, which
                                                                         must be done before any channel activity can begin.*/    
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  CHENREG;                           /*!< (@ 0x00000008) This is the DW_ahb_dmac Channel Enable Register.      */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  DMAIDREG;                          /*!< (@ 0x00000010) This is the DW_ahb_dmac ID register, which is a
                                                                         read-only register that reads back the
                                                                         coreConsultant-configured hardcoded ID number,
                                                                         DMAH_ID_NUM.*/                                           
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  DMATESTREG;                        /*!< (@ 0x00000018) This register is used to put the AHB slave interface
                                                                         into test mode, during which the readback value of the
                                                                         writable registers match the value written, assuming
                                                                         the DW_ahb_dmac configuration has not optimized the
                                                                         same registers.*/                                        
  __IM  uint32_t  RESERVED3;
  __IOM uint32_t  DMALPTIMEOUTREG;                   /*!< (@ 0x00000020) This register holds the timeout value of Low Power
                                                                         Counter.*/                                               
  __IM  uint32_t  RESERVED4[4];
  __IOM uint32_t  DMACOMPPARAMS6L;                   /*!< (@ 0x00000034) DMA_COMP_PARAMS_6L is a constant read-only register
                                                                         that contains encoded information about the component
                                                                         parameter settings for Channel 7.*/                      
  __IOM uint32_t  DMACOMPPARAMS5L;                   /*!< (@ 0x00000038) DMA_COMP_PARAMS_5 is a constant read-only register that
                                                                         contains encoded information about the component
                                                                         parameter settings for Channel 5 and Channel 6.*/        
  __IOM uint32_t  DMACOMPPARAMS5H;                   /*!< (@ 0x0000003C) DMA_COMP_PARAMS_5 is a constant read-only register that
                                                                         contains encoded information about the component
                                                                         parameter settings for Channel 5 and Channel 6.*/        
  __IOM uint32_t  DMACOMPPARAMS4L;                   /*!< (@ 0x00000040) DMA_COMP_PARAMS_4 is a constant read-only register that
                                                                         contains encoded information about the component
                                                                         parameter settings for Channel 3 and Channel 4.*/        
  __IOM uint32_t  DMACOMPPARAMS4H;                   /*!< (@ 0x00000044) DMA_COMP_PARAMS_4 is a constant read-only register that
                                                                         contains encoded information about the component
                                                                         parameter settings for Channel 3 and Channel 4.*/        
  __IOM uint32_t  DMACOMPPARAMS3L;                   /*!< (@ 0x00000048) DMA_COMP_PARAMS_3 is a constant read-only register that
                                                                         contains encoded information about the component
                                                                         parameter settings for Channel 1 and Channel 2.*/        
  __IOM uint32_t  DMACOMPPARAMS3H;                   /*!< (@ 0x0000004C) DMA_COMP_PARAMS_3 is a constant read-only register that
                                                                         contains encoded information about the component
                                                                         parameter settings for Channel 1 and Channel 2.*/        
  __IOM uint32_t  DMACOMPPARAMS2L;                   /*!< (@ 0x00000050) DMA_COMP_PARAMS_2 is a constant read-only register that
                                                                         contains encoded information about the component
                                                                         parameter settings.*/                                    
  __IOM uint32_t  DMACOMPPARAMS2H;                   /*!< (@ 0x00000054) DMA_COMP_PARAMS_2 is a constant read-only register that
                                                                         contains encoded information about the component
                                                                         parameter settings.*/                                    
  __IOM uint32_t  DMACOMPPARAMS1L;                   /*!< (@ 0x00000058) DMA_COMP_PARAMS_1 is a constant read-only register that
                                                                         contains encoded information about the component
                                                                         parameter settings.*/                                    
  __IOM uint32_t  DMACOMPPARAMS1H;                   /*!< (@ 0x0000005C) DMA_COMP_PARAMS_1 is a constant read-only register that
                                                                         contains encoded information about the component
                                                                         parameter settings.*/                                    
  __IOM uint32_t  DMACOMPSID0;                       /*!< (@ 0x00000060) This is the DW_ahb_dmac Component Version register,
                                                                         which is a read-only register that specifies the
                                                                         component type.*/                                        
  __IOM uint32_t  DMACOMPSID1;                       /*!< (@ 0x00000064) This is the DW_ahb_dmac Component Version register,
                                                                         which is a read-only register that specifies the
                                                                         version of the packaged component.*/                     
} NRF_I3CCORE_DMA_MISC_Type;                         /*!< Size = 104 (0x068)                                                   */

/* I3CCORE_DMA_MISC_DMACFGREG: This register is used to enable the DW_ahb_dmac, which must be done before any channel activity
                                can begin. */                                                                                     
                                                                                                                                  
  #define I3CCORE_DMA_MISC_DMACFGREG_ResetValue (0x00000000UL) /*!< Reset value of DMACFGREG register.                         */

/* DMAEN @Bit 0 : DW_ahb_dmac Enable bit. */
  #define I3CCORE_DMA_MISC_DMACFGREG_DMAEN_Pos (0UL) /*!< Position of DMAEN field.                                             */
  #define I3CCORE_DMA_MISC_DMACFGREG_DMAEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACFGREG_DMAEN_Pos) /*!< Bit mask of DMAEN field.   */
  #define I3CCORE_DMA_MISC_DMACFGREG_DMAEN_Min (0x0UL) /*!< Min enumerator value of DMAEN field.                               */
  #define I3CCORE_DMA_MISC_DMACFGREG_DMAEN_Max (0x1UL) /*!< Max enumerator value of DMAEN field.                               */
  #define I3CCORE_DMA_MISC_DMACFGREG_DMAEN_DISABLED (0x0UL) /*!< (unspecified)                                                 */
  #define I3CCORE_DMA_MISC_DMACFGREG_DMAEN_ENABLED (0x1UL) /*!< (unspecified)                                                  */


/* I3CCORE_DMA_MISC_CHENREG: This is the DW_ahb_dmac Channel Enable Register. */
  #define I3CCORE_DMA_MISC_CHENREG_ResetValue (0x00000000UL) /*!< Reset value of CHENREG register.                             */

