adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CH7LOCKEN @Bit 10 : The value of this register is derived from the DMAH_CH7_LOCK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LOCKEN_Pos (10UL) /*!< Position of CH7LOCKEN field.                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LOCKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LOCKEN_Pos) /*!< Bit mask
                                                                            of CH7LOCKEN field.*/                                 
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LOCKEN_Min (0x0UL) /*!< Min enumerator value of CH7LOCKEN field.                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LOCKEN_Max (0x1UL) /*!< Max enumerator value of CH7LOCKEN field.                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LOCKEN_FALSE (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LOCKEN_TRUE (0x1UL) /*!< (unspecified)                                           */

/* CH7MULTIBLKEN @Bit 11 : The value of this register is derived from the DMAH_CH7_MULTI_BLK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MULTIBLKEN_Pos (11UL) /*!< Position of CH7MULTIBLKEN field.                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MULTIBLKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MULTIBLKEN_Pos) /*!<
                                                                            Bit mask of CH7MULTIBLKEN field.*/                    
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MULTIBLKEN_Min (0x0UL) /*!< Min enumerator value of CH7MULTIBLKEN field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MULTIBLKEN_Max (0x1UL) /*!< Max enumerator value of CH7MULTIBLKEN field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MULTIBLKEN_FALSE (0x0UL) /*!< (unspecified)                                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MULTIBLKEN_TRUE (0x1UL) /*!< (unspecified)                                       */

/* CH7CTLWBEN @Bit 12 : The value of this register is derived from the DMAH_CH7_CTL_WB_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7CTLWBEN_Pos (12UL) /*!< Position of CH7CTLWBEN field.                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7CTLWBEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7CTLWBEN_Pos) /*!< Bit
                                                                            mask of CH7CTLWBEN field.*/                           
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7CTLWBEN_Min (0x0UL) /*!< Min enumerator value of CH7CTLWBEN field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7CTLWBEN_Max (0x1UL) /*!< Max enumerator value of CH7CTLWBEN field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7CTLWBEN_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7CTLWBEN_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH7HCLLP @Bit 13 : The value of this register is derived from the DMAH_CH7_HC_LLP coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7HCLLP_Pos (13UL) /*!< Position of CH7HCLLP field.                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7HCLLP_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7HCLLP_Pos) /*!< Bit mask
                                                                            of CH7HCLLP field.*/                                  
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7HCLLP_Min (0x0UL) /*!< Min enumerator value of CH7HCLLP field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7HCLLP_Max (0x1UL) /*!< Max enumerator value of CH7HCLLP field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7HCLLP_PROGRAMMABLE (0x0UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7HCLLP_HARDCODED (0x1UL) /*!< (unspecified)                                       */

/* CH7FC @Bits 14..15 : The value of this register is derived from the DMAH_CH7_FC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FC_Pos (14UL) /*!< Position of CH7FC field.                                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FC_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FC_Pos) /*!< Bit mask of
                                                                            CH7FC field.*/                                        
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FC_Min (0x0UL) /*!< Min enumerator value of CH7FC field.                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FC_Max (0x3UL) /*!< Max enumerator value of CH7FC field.                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FC_FC_DMA (0x0UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FC_FC_SRC (0x1UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FC_FC_DST (0x2UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FC_FC_ANY (0x3UL) /*!< (unspecified)                                             */

/* CH7MAXMULTSIZE @Bits 16..18 : The value of this register is derived from the DMAH_CH7_MULT_SIZE coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_Pos (16UL) /*!< Position of CH7MAXMULTSIZE field.                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_Pos)
                                                                            /*!< Bit mask of CH7MAXMULTSIZE field.*/              
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_Min (0x0UL) /*!< Min enumerator value of CH7MAXMULTSIZE field.       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_Max (0x6UL) /*!< Max enumerator value of CH7MAXMULTSIZE field.       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_MAX_MULT_SIZE_4 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_MAX_MULT_SIZE_8 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_MAX_MULT_SIZE_16 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_MAX_MULT_SIZE_32 (0x3UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_MAX_MULT_SIZE_64 (0x4UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_MAX_MULT_SIZE_128 (0x5UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_MAX_MULT_SIZE_256 (0x6UL) /*!< (unspecified)                         */

/* CH7DMS @Bits 19..21 : The value of this register is derived from the DMAH_CH7_DMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_Pos (19UL) /*!< Position of CH7DMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_Pos) /*!< Bit mask of
                                                                            CH7DMS field.*/                                       
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_Min (0x0UL) /*!< Min enumerator value of CH7DMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_Max (0x4UL) /*!< Max enumerator value of CH7DMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

