adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CH7LMS @Bits 22..24 : The value of this register is derived from the DMAH_CH7_LMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_Pos (22UL) /*!< Position of CH7LMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_Pos) /*!< Bit mask of
                                                                            CH7LMS field.*/                                       
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_Min (0x0UL) /*!< Min enumerator value of CH7LMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_Max (0x4UL) /*!< Max enumerator value of CH7LMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH7SMS @Bits 25..27 : The value of this register is derived from the DMAH_CH7_SMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_Pos (25UL) /*!< Position of CH7SMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_Pos) /*!< Bit mask of
                                                                            CH7SMS field.*/                                       
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_Min (0x0UL) /*!< Min enumerator value of CH7SMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_Max (0x4UL) /*!< Max enumerator value of CH7SMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH7FIFODEPTH @Bits 28..30 : The value of this register is derived from the DMAH_CH7_FIFO_DEPTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_Pos (28UL) /*!< Position of CH7FIFODEPTH field.                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_Pos) /*!<
                                                                            Bit mask of CH7FIFODEPTH field.*/                     
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_Min (0x0UL) /*!< Min enumerator value of CH7FIFODEPTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_Max (0x5UL) /*!< Max enumerator value of CH7FIFODEPTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_FIFO_DEPTH_8 (0x0UL) /*!< (unspecified)                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_FIFO_DEPTH_16 (0x1UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_FIFO_DEPTH_32 (0x2UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_FIFO_DEPTH_64 (0x3UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_FIFO_DEPTH_128 (0x4UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_FIFO_DEPTH_256 (0x5UL) /*!< (unspecified)                              */


/* I3CCORE_DMA_MISC_DMACOMPPARAMS5L: DMA_COMP_PARAMS_5 is a constant read-only register that contains encoded information about
                                      the component parameter settings for Channel 5 and Channel 6. */                            
                                                                                                                                  
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_ResetValue (0x00000000UL) /*!< Reset value of DMACOMPPARAMS5L register.             */

/* CH6DTW @Bits 0..2 : The value of this register is derived from the DMAH_CH6_DTW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_Pos (0UL) /*!< Position of CH6DTW field.                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_Pos) /*!< Bit mask of
                                                                            CH6DTW field.*/                                       
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_Min (0x0UL) /*!< Min enumerator value of CH6DTW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_Max (0x6UL) /*!< Max enumerator value of CH6DTW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_TRANS_WIDTH_PROGRAMMABLE (0x0UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_TRANS_WIDTH_8 (0x1UL) /*!< (unspecified)                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_TRANS_WIDTH_16 (0x2UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_TRANS_WIDTH_32 (0x3UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_TRANS_WIDTH_64 (0x4UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_TRANS_WIDTH_128 (0x5UL) /*!< (unspecified)                                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_TRANS_WIDTH_256 (0x6UL) /*!< (unspecified)                                   */

/* CH6STW @Bits 3..5 : The value of this register is derived from the DMAH_CH6_STW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_Pos (3UL) /*!< Position of CH6STW field.                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_Pos) /*!< Bit mask of
                                                                            CH6STW field.*/                                       
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_Min (0x0UL) /*!< Min enumerator value of CH6STW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_Max (0x6UL) /*!< Max enumerator value of CH6STW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_TRANS_WIDTH_PROGRAMMABLE (0x0UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_TRANS_WIDTH_8 (0x1UL) /*!< (unspecified)                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_TRANS_WIDTH_16 (0x2UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_TRANS_WIDTH_32 (0x3UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_TRANS_WIDTH_64 (0x4UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_TRANS_WIDTH_128 (0x5UL) /*!< (unspecified)                                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_TRANS_WIDTH_256 (0x6UL) /*!< (unspecified)                                   */

