adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CH6STATDST @Bit 6 : The value of this register is derived from the DMAH_CH6_STAT_DST coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATDST_Pos (6UL) /*!< Position of CH6STATDST field.                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATDST_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATDST_Pos) /*!< Bit
                                                                            mask of CH6STATDST field.*/                           
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATDST_Min (0x0UL) /*!< Min enumerator value of CH6STATDST field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATDST_Max (0x1UL) /*!< Max enumerator value of CH6STATDST field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATDST_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATDST_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH6STATSRC @Bit 7 : The value of this register is derived from the DMAH_CH6_STAT_SRC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATSRC_Pos (7UL) /*!< Position of CH6STATSRC field.                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATSRC_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATSRC_Pos) /*!< Bit
                                                                            mask of CH6STATSRC field.*/                           
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATSRC_Min (0x0UL) /*!< Min enumerator value of CH6STATSRC field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATSRC_Max (0x1UL) /*!< Max enumerator value of CH6STATSRC field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATSRC_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATSRC_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH6DSTSCAEN @Bit 8 : The value of this register is derived from the DMAH_CH6_DST_SCA_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DSTSCAEN_Pos (8UL) /*!< Position of CH6DSTSCAEN field.                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DSTSCAEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DSTSCAEN_Pos) /*!< Bit
                                                                            mask of CH6DSTSCAEN field.*/                          
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DSTSCAEN_Min (0x0UL) /*!< Min enumerator value of CH6DSTSCAEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DSTSCAEN_Max (0x1UL) /*!< Max enumerator value of CH6DSTSCAEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DSTSCAEN_FALSE (0x0UL) /*!< (unspecified)                                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DSTSCAEN_TRUE (0x1UL) /*!< (unspecified)                                         */

/* CH6SRCGATEN @Bit 9 : The value of this register is derived from the CH6_SRC_GAT_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SRCGATEN_Pos (9UL) /*!< Position of CH6SRCGATEN field.                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SRCGATEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SRCGATEN_Pos) /*!< Bit
                                                                            mask of CH6SRCGATEN field.*/                          
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SRCGATEN_Min (0x0UL) /*!< Min enumerator value of CH6SRCGATEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SRCGATEN_Max (0x1UL) /*!< Max enumerator value of CH6SRCGATEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SRCGATEN_FALSE (0x0UL) /*!< (unspecified)                                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SRCGATEN_TRUE (0x1UL) /*!< (unspecified)                                         */

/* CH6LOCKEN @Bit 10 : The value of this register is derived from the DMAH_CH6_LOCK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6LOCKEN_Pos (10UL) /*!< Position of CH6LOCKEN field.                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6LOCKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6LOCKEN_Pos) /*!< Bit mask
                                                                            of CH6LOCKEN field.*/                                 
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6LOCKEN_Min (0x0UL) /*!< Min enumerator value of CH6LOCKEN field.                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6LOCKEN_Max (0x1UL) /*!< Max enumerator value of CH6LOCKEN field.                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6LOCKEN_FALSE (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6LOCKEN_TRUE (0x1UL) /*!< (unspecified)                                           */

/* CH6MULTIBLKEN @Bit 11 : The value of this register is derived from the DMAH_CH6_MULTI_BLK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MULTIBLKEN_Pos (11UL) /*!< Position of CH6MULTIBLKEN field.                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MULTIBLKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MULTIBLKEN_Pos) /*!<
                                                                            Bit mask of CH6MULTIBLKEN field.*/                    
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MULTIBLKEN_Min (0x0UL) /*!< Min enumerator value of CH6MULTIBLKEN field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MULTIBLKEN_Max (0x1UL) /*!< Max enumerator value of CH6MULTIBLKEN field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MULTIBLKEN_FALSE (0x0UL) /*!< (unspecified)                                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MULTIBLKEN_TRUE (0x1UL) /*!< (unspecified)                                       */

