adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CH2DSTSCAEN @Bit 8 : The value of this register is derived from the DMAH_CH2_DST_SCA_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DSTSCAEN_Pos (8UL) /*!< Position of CH2DSTSCAEN field.                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DSTSCAEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DSTSCAEN_Pos) /*!< Bit
                                                                            mask of CH2DSTSCAEN field.*/                          
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DSTSCAEN_Min (0x0UL) /*!< Min enumerator value of CH2DSTSCAEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DSTSCAEN_Max (0x1UL) /*!< Max enumerator value of CH2DSTSCAEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DSTSCAEN_FALSE (0x0UL) /*!< (unspecified)                                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DSTSCAEN_TRUE (0x1UL) /*!< (unspecified)                                         */

/* CH2SRCGATEN @Bit 9 : The value of this register is derived from the DMAH_CH2_SRC_GAT_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SRCGATEN_Pos (9UL) /*!< Position of CH2SRCGATEN field.                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SRCGATEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SRCGATEN_Pos) /*!< Bit
                                                                            mask of CH2SRCGATEN field.*/                          
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SRCGATEN_Min (0x0UL) /*!< Min enumerator value of CH2SRCGATEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SRCGATEN_Max (0x1UL) /*!< Max enumerator value of CH2SRCGATEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SRCGATEN_FALSE (0x0UL) /*!< (unspecified)                                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SRCGATEN_TRUE (0x1UL) /*!< (unspecified)                                         */

/* CH2LOCKEN @Bit 10 : The value of this register is derived from the DMAH_CH2_LOCK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LOCKEN_Pos (10UL) /*!< Position of CH2LOCKEN field.                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LOCKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LOCKEN_Pos) /*!< Bit mask
                                                                            of CH2LOCKEN field.*/                                 
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LOCKEN_Min (0x0UL) /*!< Min enumerator value of CH2LOCKEN field.                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LOCKEN_Max (0x1UL) /*!< Max enumerator value of CH2LOCKEN field.                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LOCKEN_FALSE (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LOCKEN_TRUE (0x1UL) /*!< (unspecified)                                           */

/* CH2MULTIBLKEN @Bit 11 : The value of this register is derived from the DMAH_CH2_MULTI_BLK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MULTIBLKEN_Pos (11UL) /*!< Position of CH2MULTIBLKEN field.                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MULTIBLKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MULTIBLKEN_Pos) /*!<
                                                                            Bit mask of CH2MULTIBLKEN field.*/                    
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MULTIBLKEN_Min (0x0UL) /*!< Min enumerator value of CH2MULTIBLKEN field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MULTIBLKEN_Max (0x1UL) /*!< Max enumerator value of CH2MULTIBLKEN field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MULTIBLKEN_FALSE (0x0UL) /*!< (unspecified)                                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MULTIBLKEN_TRUE (0x1UL) /*!< (unspecified)                                       */

/* CH2CTLWBEN @Bit 12 : The value of this register is derived from the DMAH_CH2_CTL_WB_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2CTLWBEN_Pos (12UL) /*!< Position of CH2CTLWBEN field.                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2CTLWBEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2CTLWBEN_Pos) /*!< Bit
                                                                            mask of CH2CTLWBEN field.*/                           
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2CTLWBEN_Min (0x0UL) /*!< Min enumerator value of CH2CTLWBEN field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2CTLWBEN_Max (0x1UL) /*!< Max enumerator value of CH2CTLWBEN field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2CTLWBEN_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2CTLWBEN_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH2HCLLP @Bit 13 : The value of this register is derived from the DMAH_CH2_HC_LLP coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2HCLLP_Pos (13UL) /*!< Position of CH2HCLLP field.                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2HCLLP_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2HCLLP_Pos) /*!< Bit mask
                                                                            of CH2HCLLP field.*/                                  
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2HCLLP_Min (0x0UL) /*!< Min enumerator value of CH2HCLLP field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2HCLLP_Max (0x1UL) /*!< Max enumerator value of CH2HCLLP field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2HCLLP_PROGRAMMABLE (0x0UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2HCLLP_HARDCODED (0x1UL) /*!< (unspecified)                                       */

