adamkondraciuk/nrfx/mdk/nrf7140_types.h
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_ResetValue (0x1109A203UL) /*!< Reset value of DMACOMPPARAMS3H register.             */

/* CH1DTW @Bits 0..2 : The value of this register is derived from the DMAH_CH1_DTW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_Pos (0UL) /*!< Position of CH1DTW field.                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_Pos) /*!< Bit mask of
                                                                            CH1DTW field.*/                                       
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_Min (0x0UL) /*!< Min enumerator value of CH1DTW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_Max (0x6UL) /*!< Max enumerator value of CH1DTW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_TRANS_WIDTH_PROGRAMMABLE (0x0UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_TRANS_WIDTH_8 (0x1UL) /*!< (unspecified)                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_TRANS_WIDTH_16 (0x2UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_TRANS_WIDTH_32 (0x3UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_TRANS_WIDTH_64 (0x4UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_TRANS_WIDTH_128 (0x5UL) /*!< (unspecified)                                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_TRANS_WIDTH_256 (0x6UL) /*!< (unspecified)                                   */

/* CH1STW @Bits 3..5 : The value of this register is derived from the DMAH_CH1_STW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_Pos (3UL) /*!< Position of CH1STW field.                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_Pos) /*!< Bit mask of
                                                                            CH1STW field.*/                                       
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_Min (0x0UL) /*!< Min enumerator value of CH1STW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_Max (0x6UL) /*!< Max enumerator value of CH1STW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_TRANS_WIDTH_PROGRAMMABLE (0x0UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_TRANS_WIDTH_8 (0x1UL) /*!< (unspecified)                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_TRANS_WIDTH_16 (0x2UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_TRANS_WIDTH_32 (0x3UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_TRANS_WIDTH_64 (0x4UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_TRANS_WIDTH_128 (0x5UL) /*!< (unspecified)                                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_TRANS_WIDTH_256 (0x6UL) /*!< (unspecified)                                   */

/* CH1STATDST @Bit 6 : The value of this register is derived from the DMAH_CH1_STAT_DST coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATDST_Pos (6UL) /*!< Position of CH1STATDST field.                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATDST_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATDST_Pos) /*!< Bit
                                                                            mask of CH1STATDST field.*/                           
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATDST_Min (0x0UL) /*!< Min enumerator value of CH1STATDST field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATDST_Max (0x1UL) /*!< Max enumerator value of CH1STATDST field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATDST_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATDST_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH1STATSRC @Bit 7 : The value of this register is derived from the DMAH_CH1_STAT_SRC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATSRC_Pos (7UL) /*!< Position of CH1STATSRC field.                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATSRC_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATSRC_Pos) /*!< Bit
                                                                            mask of CH1STATSRC field.*/                           
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATSRC_Min (0x0UL) /*!< Min enumerator value of CH1STATSRC field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATSRC_Max (0x1UL) /*!< Max enumerator value of CH1STATSRC field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATSRC_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATSRC_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH1DSTSCAEN @Bit 8 : The value of this register is derived from the DMAH_CH1_DST_SCA_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DSTSCAEN_Pos (8UL) /*!< Position of CH1DSTSCAEN field.                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DSTSCAEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DSTSCAEN_Pos) /*!< Bit
                                                                            mask of CH1DSTSCAEN field.*/                          
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DSTSCAEN_Min (0x0UL) /*!< Min enumerator value of CH1DSTSCAEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DSTSCAEN_Max (0x1UL) /*!< Max enumerator value of CH1DSTSCAEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DSTSCAEN_FALSE (0x0UL) /*!< (unspecified)                                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DSTSCAEN_TRUE (0x1UL) /*!< (unspecified)                                         */

/* CH1SRCGATEN @Bit 9 : The value of this register is derived from the DMAH_CH1_SRC_GAT_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SRCGATEN_Pos (9UL) /*!< Position of CH1SRCGATEN field.                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SRCGATEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SRCGATEN_Pos) /*!< Bit
                                                                            mask of CH1SRCGATEN field.*/                          
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SRCGATEN_Min (0x0UL) /*!< Min enumerator value of CH1SRCGATEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SRCGATEN_Max (0x1UL) /*!< Max enumerator value of CH1SRCGATEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SRCGATEN_FALSE (0x0UL) /*!< (unspecified)                                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SRCGATEN_TRUE (0x1UL) /*!< (unspecified)                                         */

