adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CH1LOCKEN @Bit 10 : The value of this register is derived from the DMAH_CH1_LOCK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LOCKEN_Pos (10UL) /*!< Position of CH1LOCKEN field.                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LOCKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LOCKEN_Pos) /*!< Bit mask
                                                                            of CH1LOCKEN field.*/                                 
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LOCKEN_Min (0x0UL) /*!< Min enumerator value of CH1LOCKEN field.                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LOCKEN_Max (0x1UL) /*!< Max enumerator value of CH1LOCKEN field.                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LOCKEN_FALSE (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LOCKEN_TRUE (0x1UL) /*!< (unspecified)                                           */

/* CH1MULTIBLKEN @Bit 11 : The value of this register is derived from the DMAH_CH1_MULTI_BLK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MULTIBLKEN_Pos (11UL) /*!< Position of CH1MULTIBLKEN field.                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MULTIBLKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MULTIBLKEN_Pos) /*!<
                                                                            Bit mask of CH1MULTIBLKEN field.*/                    
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MULTIBLKEN_Min (0x0UL) /*!< Min enumerator value of CH1MULTIBLKEN field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MULTIBLKEN_Max (0x1UL) /*!< Max enumerator value of CH1MULTIBLKEN field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MULTIBLKEN_FALSE (0x0UL) /*!< (unspecified)                                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MULTIBLKEN_TRUE (0x1UL) /*!< (unspecified)                                       */

/* CH1CTLWBEN @Bit 12 : The value of this register is derived from the DMAH_CH1_CTL_WB_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1CTLWBEN_Pos (12UL) /*!< Position of CH1CTLWBEN field.                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1CTLWBEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1CTLWBEN_Pos) /*!< Bit
                                                                            mask of CH1CTLWBEN field.*/                           
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1CTLWBEN_Min (0x0UL) /*!< Min enumerator value of CH1CTLWBEN field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1CTLWBEN_Max (0x1UL) /*!< Max enumerator value of CH1CTLWBEN field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1CTLWBEN_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1CTLWBEN_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH1HCLLP @Bit 13 : The value of this register is derived from the DMAH_CH1_HC_LLP coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1HCLLP_Pos (13UL) /*!< Position of CH1HCLLP field.                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1HCLLP_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1HCLLP_Pos) /*!< Bit mask
                                                                            of CH1HCLLP field.*/                                  
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1HCLLP_Min (0x0UL) /*!< Min enumerator value of CH1HCLLP field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1HCLLP_Max (0x1UL) /*!< Max enumerator value of CH1HCLLP field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1HCLLP_PROGRAMMABLE (0x0UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1HCLLP_HARDCODED (0x1UL) /*!< (unspecified)                                       */

/* CH1FC @Bits 14..15 : The value of this register is derived from the DMAH_CH1_FC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FC_Pos (14UL) /*!< Position of CH1FC field.                                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FC_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FC_Pos) /*!< Bit mask of
                                                                            CH1FC field.*/                                        
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FC_Min (0x0UL) /*!< Min enumerator value of CH1FC field.                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FC_Max (0x3UL) /*!< Max enumerator value of CH1FC field.                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FC_FC_DMA (0x0UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FC_FC_SRC (0x1UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FC_FC_DST (0x2UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FC_FC_ANY (0x3UL) /*!< (unspecified)                                             */

/* CH1MAXMULTSIZE @Bits 16..18 : The value of this register is derived from the DMAH_CH1_MULT_SIZE coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_Pos (16UL) /*!< Position of CH1MAXMULTSIZE field.                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_Pos)
                                                                            /*!< Bit mask of CH1MAXMULTSIZE field.*/              
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_Min (0x0UL) /*!< Min enumerator value of CH1MAXMULTSIZE field.       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_Max (0x6UL) /*!< Max enumerator value of CH1MAXMULTSIZE field.       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_MAX_MULT_SIZE_4 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_MAX_MULT_SIZE_8 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_MAX_MULT_SIZE_16 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_MAX_MULT_SIZE_32 (0x3UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_MAX_MULT_SIZE_64 (0x4UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_MAX_MULT_SIZE_128 (0x5UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_MAX_MULT_SIZE_256 (0x6UL) /*!< (unspecified)                         */

