adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CH1DMS @Bits 19..21 : The value of this register is derived from the DMAH_CH1_DMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_Pos (19UL) /*!< Position of CH1DMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_Pos) /*!< Bit mask of
                                                                            CH1DMS field.*/                                       
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_Min (0x0UL) /*!< Min enumerator value of CH1DMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_Max (0x4UL) /*!< Max enumerator value of CH1DMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH1LMS @Bits 22..24 : The value of this register is derived from the DMAH_CH1_LMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_Pos (22UL) /*!< Position of CH1LMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_Pos) /*!< Bit mask of
                                                                            CH1LMS field.*/                                       
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_Min (0x0UL) /*!< Min enumerator value of CH1LMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_Max (0x4UL) /*!< Max enumerator value of CH1LMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH1SMS @Bits 25..27 : The value of this register is derived from the DMAH_CH1_SMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_Pos (25UL) /*!< Position of CH1SMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_Pos) /*!< Bit mask of
                                                                            CH1SMS field.*/                                       
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_Min (0x0UL) /*!< Min enumerator value of CH1SMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_Max (0x4UL) /*!< Max enumerator value of CH1SMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH1FIFODEPTH @Bits 28..30 : The value of this register is derived from the DMAH_CH1_FIFO_DEPTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_Pos (28UL) /*!< Position of CH1FIFODEPTH field.                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_Pos) /*!<
                                                                            Bit mask of CH1FIFODEPTH field.*/                     
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_Min (0x0UL) /*!< Min enumerator value of CH1FIFODEPTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_Max (0x5UL) /*!< Max enumerator value of CH1FIFODEPTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_FIFO_DEPTH_8 (0x0UL) /*!< (unspecified)                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_FIFO_DEPTH_16 (0x1UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_FIFO_DEPTH_32 (0x2UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_FIFO_DEPTH_64 (0x3UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_FIFO_DEPTH_128 (0x4UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_FIFO_DEPTH_256 (0x5UL) /*!< (unspecified)                              */


/* I3CCORE_DMA_MISC_DMACOMPPARAMS2L: DMA_COMP_PARAMS_2 is a constant read-only register that contains encoded information about
                                      the component parameter settings. */                                                        
                                                                                                                                  
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_ResetValue (0x13016118UL) /*!< Reset value of DMACOMPPARAMS2L register.             */

