adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CH2MULTIBLKTYPE @Bits 8..11 : The values of these bit fields are derived from the DMAH_CH2_MULTI_BLK_TYPE coreConsultant
                                 parameter. */                                                                                    
                                                                                                                                  
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_Pos (8UL) /*!< Position of CH2MULTIBLKTYPE field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_Pos)
                                                                            /*!< Bit mask of CH2MULTIBLKTYPE field.*/             
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_Min (0x0UL) /*!< Min enumerator value of CH2MULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_Max (0x8UL) /*!< Max enumerator value of CH2MULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_PROGRAMMABLE (0x0UL) /*!< (unspecified)                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_CONT_RELOAD (0x1UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_RELOAD_CONT (0x2UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_RELOAD_RELOAD (0x3UL) /*!< (unspecified)                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_CONT_LLP (0x4UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_RELOAD_LLP (0x5UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_CNT_LLP (0x6UL) /*!< (unspecified)                                  */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_LLP_RELOAD (0x7UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_LLP_LLP (0x8UL) /*!< (unspecified)                                  */

/* CH3MULTIBLKTYPE @Bits 12..15 : The values of these bit fields are derived from the DMAH_CH3_MULTI_BLK_TYPE coreConsultant
                                  parameter. */                                                                                   
                                                                                                                                  
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_Pos (12UL) /*!< Position of CH3MULTIBLKTYPE field.                  */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_Pos)
                                                                            /*!< Bit mask of CH3MULTIBLKTYPE field.*/             
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_Min (0x0UL) /*!< Min enumerator value of CH3MULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_Max (0x8UL) /*!< Max enumerator value of CH3MULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_PROGRAMMABLE (0x0UL) /*!< (unspecified)                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_CONT_RELOAD (0x1UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_RELOAD_CONT (0x2UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_RELOAD_RELOAD (0x3UL) /*!< (unspecified)                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_CONT_LLP (0x4UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_RELOAD_LLP (0x5UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_CNT_LLP (0x6UL) /*!< (unspecified)                                  */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_LLP_RELOAD (0x7UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_LLP_LLP (0x8UL) /*!< (unspecified)                                  */

/* CH4MULTIBLKTYPE @Bits 16..19 : The values of these bit fields are derived from the DMAH_CH4_MULTI_BLK_TYPE coreConsultant
                                  parameter. */                                                                                   
                                                                                                                                  
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH4MULTIBLKTYPE_Pos (16UL) /*!< Position of CH4MULTIBLKTYPE field.                  */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH4MULTIBLKTYPE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH4MULTIBLKTYPE_Pos)
                                                                            /*!< Bit mask of CH4MULTIBLKTYPE field.*/             
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH4MULTIBLKTYPE_Min (0x0UL) /*!< Min enumerator value of CH4MULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH4MULTIBLKTYPE_Max (0x8UL) /*!< Max enumerator value of CH4MULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH4MULTIBLKTYPE_PROGRAMMABLE (0x0UL) /*!< (unspecified)                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH4MULTIBLKTYPE_CONT_RELOAD (0x1UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH4MULTIBLKTYPE_RELOAD_CONT (0x2UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH4MULTIBLKTYPE_RELOAD_RELOAD (0x3UL) /*!< (unspecified)                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH4MULTIBLKTYPE_CONT_LLP (0x4UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH4MULTIBLKTYPE_RELOAD_LLP (0x5UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH4MULTIBLKTYPE_CNT_LLP (0x6UL) /*!< (unspecified)                                  */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH4MULTIBLKTYPE_LLP_RELOAD (0x7UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH4MULTIBLKTYPE_LLP_LLP (0x8UL) /*!< (unspecified)                                  */

/* CH5MULTIBLKTYPE @Bits 20..23 : The values of these bit fields are derived from the DMAH_CH5_MULTI_BLK_TYPE coreConsultant
                                  parameter. */                                                                                   
                                                                                                                                  
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH5MULTIBLKTYPE_Pos (20UL) /*!< Position of CH5MULTIBLKTYPE field.                  */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH5MULTIBLKTYPE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH5MULTIBLKTYPE_Pos)
                                                                            /*!< Bit mask of CH5MULTIBLKTYPE field.*/             
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH5MULTIBLKTYPE_Min (0x0UL) /*!< Min enumerator value of CH5MULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH5MULTIBLKTYPE_Max (0x8UL) /*!< Max enumerator value of CH5MULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH5MULTIBLKTYPE_PROGRAMMABLE (0x0UL) /*!< (unspecified)                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH5MULTIBLKTYPE_CONT_RELOAD (0x1UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH5MULTIBLKTYPE_RELOAD_CONT (0x2UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH5MULTIBLKTYPE_RELOAD_RELOAD (0x3UL) /*!< (unspecified)                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH5MULTIBLKTYPE_CONT_LLP (0x4UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH5MULTIBLKTYPE_RELOAD_LLP (0x5UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH5MULTIBLKTYPE_CNT_LLP (0x6UL) /*!< (unspecified)                                  */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH5MULTIBLKTYPE_LLP_RELOAD (0x7UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH5MULTIBLKTYPE_LLP_LLP (0x8UL) /*!< (unspecified)                                  */

