adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CH6MULTIBLKTYPE @Bits 24..27 : The values of these bit fields are derived from the DMAH_CH6_MULTI_BLK_TYPE coreConsultant
                                  parameter. */                                                                                   
                                                                                                                                  
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_Pos (24UL) /*!< Position of CH6MULTIBLKTYPE field.                  */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_Pos)
                                                                            /*!< Bit mask of CH6MULTIBLKTYPE field.*/             
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_Min (0x0UL) /*!< Min enumerator value of CH6MULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_Max (0x8UL) /*!< Max enumerator value of CH6MULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_PROGRAMMABLE (0x0UL) /*!< (unspecified)                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_CONT_RELOAD (0x1UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_RELOAD_CONT (0x2UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_RELOAD_RELOAD (0x3UL) /*!< (unspecified)                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_CONT_LLP (0x4UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_RELOAD_LLP (0x5UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_CNT_LLP (0x6UL) /*!< (unspecified)                                  */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_LLP_RELOAD (0x7UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_LLP_LLP (0x8UL) /*!< (unspecified)                                  */

/* CH7MULTIBLKTYPE @Bits 28..31 : The values of these bit fields are derived from the DMAH_CH7_MULTI_BLK_TYPE coreConsultant
                                  parameter. */                                                                                   
                                                                                                                                  
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_Pos (28UL) /*!< Position of CH7MULTIBLKTYPE field.                  */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_Pos)
                                                                            /*!< Bit mask of CH7MULTIBLKTYPE field.*/             
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_Min (0x0UL) /*!< Min enumerator value of CH7MULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_Max (0x8UL) /*!< Max enumerator value of CH7MULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_PROGRAMMABLE (0x0UL) /*!< (unspecified)                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_CONT_RELOAD (0x1UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_RELOAD_CONT (0x2UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_RELOAD_RELOAD (0x3UL) /*!< (unspecified)                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_CONT_LLP (0x4UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_RELOAD_LLP (0x5UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_CNT_LLP (0x6UL) /*!< (unspecified)                                  */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_LLP_RELOAD (0x7UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_LLP_LLP (0x8UL) /*!< (unspecified)                                  */


/* I3CCORE_DMA_MISC_DMACOMPPARAMS1L: DMA_COMP_PARAMS_1 is a constant read-only register that contains encoded information about
                                      the component parameter settings. */                                                        
                                                                                                                                  
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_ResetValue (0x33333333UL) /*!< Reset value of DMACOMPPARAMS1L register.             */

/* CHOMAXBLKSIZE @Bits 0..3 : The values of these bit fields are derived from the DMAH_CH0_MAX_BLK_SIZE coreConsultant
                              parameter. */                                                                                       
                                                                                                                                  
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_Pos (0UL) /*!< Position of CHOMAXBLKSIZE field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_Pos) /*!<
                                                                            Bit mask of CHOMAXBLKSIZE field.*/                    
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_Min (0x0UL) /*!< Min enumerator value of CHOMAXBLKSIZE field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_Max (0xAUL) /*!< Max enumerator value of CHOMAXBLKSIZE field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_3 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_7 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_15 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_31 (0x3UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_63 (0x4UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_127 (0x5UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_255 (0x6UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_511 (0x7UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_1023 (0x8UL) /*!< (unspecified)                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_2047 (0x9UL) /*!< (unspecified)                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_4095 (0xAUL) /*!< (unspecified)                        */

