adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* I3CCORE_DMA_MISC_DMACOMPSID0: This is the DW_ahb_dmac Component Version register, which is a read-only register that
                                  specifies the component type. */                                                                
                                                                                                                                  
  #define I3CCORE_DMA_MISC_DMACOMPSID0_ResetValue (0x44571110UL) /*!< Reset value of DMACOMPSID0 register.                     */

/* DMACOMPTYPE @Bits 0..31 : DMA Component Type Number = `h44571110. */
  #define I3CCORE_DMA_MISC_DMACOMPSID0_DMACOMPTYPE_Pos (0UL) /*!< Position of DMACOMPTYPE field.                               */
  #define I3CCORE_DMA_MISC_DMACOMPSID0_DMACOMPTYPE_Msk (0xFFFFFFFFUL << I3CCORE_DMA_MISC_DMACOMPSID0_DMACOMPTYPE_Pos) /*!< Bit
                                                                            mask of DMACOMPTYPE field.*/                          


/* I3CCORE_DMA_MISC_DMACOMPSID1: This is the DW_ahb_dmac Component Version register, which is a read-only register that
                                  specifies the version of the packaged component. */                                             
                                                                                                                                  
  #define I3CCORE_DMA_MISC_DMACOMPSID1_ResetValue (0x3232322AUL) /*!< Reset value of DMACOMPSID1 register.                     */

/* DMACOMPVERSION @Bits 0..31 : DMA Component Version. */
  #define I3CCORE_DMA_MISC_DMACOMPSID1_DMACOMPVERSION_Pos (0UL) /*!< Position of DMACOMPVERSION field.                         */
  #define I3CCORE_DMA_MISC_DMACOMPSID1_DMACOMPVERSION_Msk (0xFFFFFFFFUL << I3CCORE_DMA_MISC_DMACOMPSID1_DMACOMPVERSION_Pos) /*!<
                                                                            Bit mask of DMACOMPVERSION field.*/                   



/* =================================================== Struct I3CCORE_DMA ==================================================== */
/**
  * @brief DMA [I3CCORE_DMA] (unspecified)
  */
typedef struct {
  __IOM NRF_I3CCORE_DMA_CH0_Type CH0;                /*!< (@ 0x00000000) (unspecified)                                         */
  __IM  uint32_t  RESERVED;
  __IOM NRF_I3CCORE_DMA_CH1_Type CH1;                /*!< (@ 0x00000058) (unspecified)                                         */
  __IM  uint32_t  RESERVED1[135];
  __IOM NRF_I3CCORE_DMA_INT_Type INT;                /*!< (@ 0x000002C0) (unspecified)                                         */
  __IM  uint32_t  RESERVED2;
  __IOM NRF_I3CCORE_DMA_SWHANDSHAKE_Type SWHANDSHAKE; /*!< (@ 0x00000368) (unspecified)                                        */
  __IM  uint32_t  RESERVED3;
  __IOM NRF_I3CCORE_DMA_MISC_Type MISC;              /*!< (@ 0x00000398) (unspecified)                                         */
} NRF_I3CCORE_DMA_Type;                              /*!< Size = 1024 (0x400)                                                  */

/* ===================================================== Struct I3CCORE ====================================================== */
/**
  * @brief I3CCORE
  */
  typedef struct {                                   /*!< I3CCORE Structure                                                    */
    __IOM NRF_I3CCORE_CORE_Type CORE;                /*!< (@ 0x00000000) (unspecified)                                         */
    __IM uint32_t RESERVED[390];
    __IOM NRF_I3CCORE_DMA_Type DMA;                  /*!< (@ 0x00000900) (unspecified)                                         */
  } NRF_I3CCORE_Type;                                /*!< Size = 3328 (0xD00)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        ICACHEDATA                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================== Struct ICACHEDATA_SET_WAY_DU =============================================== */
/**
  * @brief DU [ICACHEDATA_SET_WAY_DU] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DATA[2];                           /*!< (@ 0x00000000) Cache data bits for DATA[q] in DU[p] (DataUnit) of
                                                                         SET[n], WAY[o].*/                                        
} NRF_ICACHEDATA_SET_WAY_DU_Type;                    /*!< Size = 8 (0x008)                                                     */
  #define ICACHEDATA_SET_WAY_DU_MaxCount (4UL)       /*!< Max size of DU[4] array.                                             */

/* ICACHEDATA_SET_WAY_DU_DATA: Cache data bits for DATA[q] in DU[p] (DataUnit) of SET[n], WAY[o]. */
  #define ICACHEDATA_SET_WAY_DU_DATA_MaxCount (2UL)  /*!< Max size of DATA[2] array.                                           */
  #define ICACHEDATA_SET_WAY_DU_DATA_ResetValue (0x00000000UL) /*!< Reset value of DATA[2] register.                           */

/* Data @Bits 0..31 : Data */
  #define ICACHEDATA_SET_WAY_DU_DATA_Data_Pos (0UL)  /*!< Position of Data field.                                              */
  #define ICACHEDATA_SET_WAY_DU_DATA_Data_Msk (0xFFFFFFFFUL << ICACHEDATA_SET_WAY_DU_DATA_Data_Pos) /*!< Bit mask of Data
                                                                            field.*/                                              



/* ================================================ Struct ICACHEDATA_SET_WAY ================================================ */
/**
  * @brief WAY [ICACHEDATA_SET_WAY] (unspecified)
  */
typedef struct {
  __IOM NRF_ICACHEDATA_SET_WAY_DU_Type DU[4];        /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_ICACHEDATA_SET_WAY_Type;                       /*!< Size = 32 (0x020)                                                    */
