adamkondraciuk/nrfx/mdk/nrf7140_types.h
  #define IPCT_EVENTS_READY_MaxCount (16UL)          /*!< Max size of EVENTS_READY[16] array.                                  */
  #define IPCT_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY[16] register.                           */

/* EVENTS_READY @Bit 0 : Event received when hardware handshake of SEND task for IPCT source channel n is complete and a new
                         signal can be triggered on that channel. */                                                              
                                                                                                                                  
  #define IPCT_EVENTS_READY_EVENTS_READY_Pos (0UL)   /*!< Position of EVENTS_READY field.                                      */
  #define IPCT_EVENTS_READY_EVENTS_READY_Msk (0x1UL << IPCT_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of EVENTS_READY field.*/
  #define IPCT_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                          */
  #define IPCT_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                          */
  #define IPCT_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define IPCT_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                                */


/* IPCT_PUBLISH_RECEIVE: Publish configuration for event RECEIVE[n] */
  #define IPCT_PUBLISH_RECEIVE_MaxCount (16UL)       /*!< Max size of PUBLISH_RECEIVE[16] array.                               */
  #define IPCT_PUBLISH_RECEIVE_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RECEIVE[16] register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that event RECEIVE[n] will publish to */
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Msk (0xFFUL << IPCT_PUBLISH_RECEIVE_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Min (0x0UL)     /*!< Min value of CHIDX field.                                            */
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define IPCT_PUBLISH_RECEIVE_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define IPCT_PUBLISH_RECEIVE_EN_Msk (0x1UL << IPCT_PUBLISH_RECEIVE_EN_Pos) /*!< Bit mask of EN field.                        */
  #define IPCT_PUBLISH_RECEIVE_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define IPCT_PUBLISH_RECEIVE_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define IPCT_PUBLISH_RECEIVE_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define IPCT_PUBLISH_RECEIVE_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* IPCT_PUBLISH_READY: Publish configuration for event READY[n] */
  #define IPCT_PUBLISH_READY_MaxCount (16UL)         /*!< Max size of PUBLISH_READY[16] array.                                 */
  #define IPCT_PUBLISH_READY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_READY[16] register.                         */

/* CHIDX @Bits 0..7 : DPPI channel that event READY[n] will publish to */
  #define IPCT_PUBLISH_READY_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define IPCT_PUBLISH_READY_CHIDX_Msk (0xFFUL << IPCT_PUBLISH_READY_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define IPCT_PUBLISH_READY_CHIDX_Min (0x0UL)       /*!< Min value of CHIDX field.                                            */
  #define IPCT_PUBLISH_READY_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define IPCT_PUBLISH_READY_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define IPCT_PUBLISH_READY_EN_Msk (0x1UL << IPCT_PUBLISH_READY_EN_Pos) /*!< Bit mask of EN field.                            */
  #define IPCT_PUBLISH_READY_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define IPCT_PUBLISH_READY_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define IPCT_PUBLISH_READY_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define IPCT_PUBLISH_READY_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* IPCT_SHORTS: Shortcuts between local events and tasks */
  #define IPCT_SHORTS_ResetValue (0x00000000UL)      /*!< Reset value of SHORTS register.                                      */

/* RECEIVE0_FLUSH0 @Bit 0 : Shortcut between event RECEIVE[0] and task FLUSH[0] */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Pos (0UL)      /*!< Position of RECEIVE0_FLUSH0 field.                                   */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Msk (0x1UL << IPCT_SHORTS_RECEIVE0_FLUSH0_Pos) /*!< Bit mask of RECEIVE0_FLUSH0 field.   */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Min (0x0UL)    /*!< Min enumerator value of RECEIVE0_FLUSH0 field.                       */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Max (0x1UL)    /*!< Max enumerator value of RECEIVE0_FLUSH0 field.                       */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE1_FLUSH1 @Bit 1 : Shortcut between event RECEIVE[1] and task FLUSH[1] */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Pos (1UL)      /*!< Position of RECEIVE1_FLUSH1 field.                                   */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Msk (0x1UL << IPCT_SHORTS_RECEIVE1_FLUSH1_Pos) /*!< Bit mask of RECEIVE1_FLUSH1 field.   */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Min (0x0UL)    /*!< Min enumerator value of RECEIVE1_FLUSH1 field.                       */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Max (0x1UL)    /*!< Max enumerator value of RECEIVE1_FLUSH1 field.                       */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE2_FLUSH2 @Bit 2 : Shortcut between event RECEIVE[2] and task FLUSH[2] */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Pos (2UL)      /*!< Position of RECEIVE2_FLUSH2 field.                                   */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Msk (0x1UL << IPCT_SHORTS_RECEIVE2_FLUSH2_Pos) /*!< Bit mask of RECEIVE2_FLUSH2 field.   */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Min (0x0UL)    /*!< Min enumerator value of RECEIVE2_FLUSH2 field.                       */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Max (0x1UL)    /*!< Max enumerator value of RECEIVE2_FLUSH2 field.                       */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE3_FLUSH3 @Bit 3 : Shortcut between event RECEIVE[3] and task FLUSH[3] */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Pos (3UL)      /*!< Position of RECEIVE3_FLUSH3 field.                                   */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Msk (0x1UL << IPCT_SHORTS_RECEIVE3_FLUSH3_Pos) /*!< Bit mask of RECEIVE3_FLUSH3 field.   */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Min (0x0UL)    /*!< Min enumerator value of RECEIVE3_FLUSH3 field.                       */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Max (0x1UL)    /*!< Max enumerator value of RECEIVE3_FLUSH3 field.                       */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE4_FLUSH4 @Bit 4 : Shortcut between event RECEIVE[4] and task FLUSH[4] */
  #define IPCT_SHORTS_RECEIVE4_FLUSH4_Pos (4UL)      /*!< Position of RECEIVE4_FLUSH4 field.                                   */
  #define IPCT_SHORTS_RECEIVE4_FLUSH4_Msk (0x1UL << IPCT_SHORTS_RECEIVE4_FLUSH4_Pos) /*!< Bit mask of RECEIVE4_FLUSH4 field.   */
  #define IPCT_SHORTS_RECEIVE4_FLUSH4_Min (0x0UL)    /*!< Min enumerator value of RECEIVE4_FLUSH4 field.                       */
  #define IPCT_SHORTS_RECEIVE4_FLUSH4_Max (0x1UL)    /*!< Max enumerator value of RECEIVE4_FLUSH4 field.                       */
  #define IPCT_SHORTS_RECEIVE4_FLUSH4_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE4_FLUSH4_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE5_FLUSH5 @Bit 5 : Shortcut between event RECEIVE[5] and task FLUSH[5] */
  #define IPCT_SHORTS_RECEIVE5_FLUSH5_Pos (5UL)      /*!< Position of RECEIVE5_FLUSH5 field.                                   */
  #define IPCT_SHORTS_RECEIVE5_FLUSH5_Msk (0x1UL << IPCT_SHORTS_RECEIVE5_FLUSH5_Pos) /*!< Bit mask of RECEIVE5_FLUSH5 field.   */
  #define IPCT_SHORTS_RECEIVE5_FLUSH5_Min (0x0UL)    /*!< Min enumerator value of RECEIVE5_FLUSH5 field.                       */
  #define IPCT_SHORTS_RECEIVE5_FLUSH5_Max (0x1UL)    /*!< Max enumerator value of RECEIVE5_FLUSH5 field.                       */
  #define IPCT_SHORTS_RECEIVE5_FLUSH5_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE5_FLUSH5_Enabled (0x1UL) /*!< Enable shortcut                                                     */

