adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* READY1 @Bit 17 : Enable or disable interrupt for event READY[1] */
  #define IPCT_INTEN1_READY1_Pos (17UL)              /*!< Position of READY1 field.                                            */
  #define IPCT_INTEN1_READY1_Msk (0x1UL << IPCT_INTEN1_READY1_Pos) /*!< Bit mask of READY1 field.                              */
  #define IPCT_INTEN1_READY1_Min (0x0UL)             /*!< Min enumerator value of READY1 field.                                */
  #define IPCT_INTEN1_READY1_Max (0x1UL)             /*!< Max enumerator value of READY1 field.                                */
  #define IPCT_INTEN1_READY1_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN1_READY1_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY2 @Bit 18 : Enable or disable interrupt for event READY[2] */
  #define IPCT_INTEN1_READY2_Pos (18UL)              /*!< Position of READY2 field.                                            */
  #define IPCT_INTEN1_READY2_Msk (0x1UL << IPCT_INTEN1_READY2_Pos) /*!< Bit mask of READY2 field.                              */
  #define IPCT_INTEN1_READY2_Min (0x0UL)             /*!< Min enumerator value of READY2 field.                                */
  #define IPCT_INTEN1_READY2_Max (0x1UL)             /*!< Max enumerator value of READY2 field.                                */
  #define IPCT_INTEN1_READY2_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN1_READY2_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY3 @Bit 19 : Enable or disable interrupt for event READY[3] */
  #define IPCT_INTEN1_READY3_Pos (19UL)              /*!< Position of READY3 field.                                            */
  #define IPCT_INTEN1_READY3_Msk (0x1UL << IPCT_INTEN1_READY3_Pos) /*!< Bit mask of READY3 field.                              */
  #define IPCT_INTEN1_READY3_Min (0x0UL)             /*!< Min enumerator value of READY3 field.                                */
  #define IPCT_INTEN1_READY3_Max (0x1UL)             /*!< Max enumerator value of READY3 field.                                */
  #define IPCT_INTEN1_READY3_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN1_READY3_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY4 @Bit 20 : Enable or disable interrupt for event READY[4] */
  #define IPCT_INTEN1_READY4_Pos (20UL)              /*!< Position of READY4 field.                                            */
  #define IPCT_INTEN1_READY4_Msk (0x1UL << IPCT_INTEN1_READY4_Pos) /*!< Bit mask of READY4 field.                              */
  #define IPCT_INTEN1_READY4_Min (0x0UL)             /*!< Min enumerator value of READY4 field.                                */
  #define IPCT_INTEN1_READY4_Max (0x1UL)             /*!< Max enumerator value of READY4 field.                                */
  #define IPCT_INTEN1_READY4_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN1_READY4_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY5 @Bit 21 : Enable or disable interrupt for event READY[5] */
  #define IPCT_INTEN1_READY5_Pos (21UL)              /*!< Position of READY5 field.                                            */
  #define IPCT_INTEN1_READY5_Msk (0x1UL << IPCT_INTEN1_READY5_Pos) /*!< Bit mask of READY5 field.                              */
  #define IPCT_INTEN1_READY5_Min (0x0UL)             /*!< Min enumerator value of READY5 field.                                */
  #define IPCT_INTEN1_READY5_Max (0x1UL)             /*!< Max enumerator value of READY5 field.                                */
  #define IPCT_INTEN1_READY5_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN1_READY5_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY6 @Bit 22 : Enable or disable interrupt for event READY[6] */
  #define IPCT_INTEN1_READY6_Pos (22UL)              /*!< Position of READY6 field.                                            */
  #define IPCT_INTEN1_READY6_Msk (0x1UL << IPCT_INTEN1_READY6_Pos) /*!< Bit mask of READY6 field.                              */
  #define IPCT_INTEN1_READY6_Min (0x0UL)             /*!< Min enumerator value of READY6 field.                                */
  #define IPCT_INTEN1_READY6_Max (0x1UL)             /*!< Max enumerator value of READY6 field.                                */
  #define IPCT_INTEN1_READY6_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN1_READY6_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY7 @Bit 23 : Enable or disable interrupt for event READY[7] */
  #define IPCT_INTEN1_READY7_Pos (23UL)              /*!< Position of READY7 field.                                            */
  #define IPCT_INTEN1_READY7_Msk (0x1UL << IPCT_INTEN1_READY7_Pos) /*!< Bit mask of READY7 field.                              */
  #define IPCT_INTEN1_READY7_Min (0x0UL)             /*!< Min enumerator value of READY7 field.                                */
  #define IPCT_INTEN1_READY7_Max (0x1UL)             /*!< Max enumerator value of READY7 field.                                */
  #define IPCT_INTEN1_READY7_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN1_READY7_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY8 @Bit 24 : Enable or disable interrupt for event READY[8] */
  #define IPCT_INTEN1_READY8_Pos (24UL)              /*!< Position of READY8 field.                                            */
  #define IPCT_INTEN1_READY8_Msk (0x1UL << IPCT_INTEN1_READY8_Pos) /*!< Bit mask of READY8 field.                              */
  #define IPCT_INTEN1_READY8_Min (0x0UL)             /*!< Min enumerator value of READY8 field.                                */
  #define IPCT_INTEN1_READY8_Max (0x1UL)             /*!< Max enumerator value of READY8 field.                                */
  #define IPCT_INTEN1_READY8_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN1_READY8_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY9 @Bit 25 : Enable or disable interrupt for event READY[9] */
  #define IPCT_INTEN1_READY9_Pos (25UL)              /*!< Position of READY9 field.                                            */
  #define IPCT_INTEN1_READY9_Msk (0x1UL << IPCT_INTEN1_READY9_Pos) /*!< Bit mask of READY9 field.                              */
  #define IPCT_INTEN1_READY9_Min (0x0UL)             /*!< Min enumerator value of READY9 field.                                */
  #define IPCT_INTEN1_READY9_Max (0x1UL)             /*!< Max enumerator value of READY9 field.                                */
  #define IPCT_INTEN1_READY9_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN1_READY9_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY10 @Bit 26 : Enable or disable interrupt for event READY[10] */
  #define IPCT_INTEN1_READY10_Pos (26UL)             /*!< Position of READY10 field.                                           */
  #define IPCT_INTEN1_READY10_Msk (0x1UL << IPCT_INTEN1_READY10_Pos) /*!< Bit mask of READY10 field.                           */
  #define IPCT_INTEN1_READY10_Min (0x0UL)            /*!< Min enumerator value of READY10 field.                               */
  #define IPCT_INTEN1_READY10_Max (0x1UL)            /*!< Max enumerator value of READY10 field.                               */
  #define IPCT_INTEN1_READY10_Disabled (0x0UL)       /*!< Disable                                                              */
  #define IPCT_INTEN1_READY10_Enabled (0x1UL)        /*!< Enable                                                               */

/* READY11 @Bit 27 : Enable or disable interrupt for event READY[11] */
  #define IPCT_INTEN1_READY11_Pos (27UL)             /*!< Position of READY11 field.                                           */
  #define IPCT_INTEN1_READY11_Msk (0x1UL << IPCT_INTEN1_READY11_Pos) /*!< Bit mask of READY11 field.                           */
  #define IPCT_INTEN1_READY11_Min (0x0UL)            /*!< Min enumerator value of READY11 field.                               */
  #define IPCT_INTEN1_READY11_Max (0x1UL)            /*!< Max enumerator value of READY11 field.                               */
  #define IPCT_INTEN1_READY11_Disabled (0x0UL)       /*!< Disable                                                              */
  #define IPCT_INTEN1_READY11_Enabled (0x1UL)        /*!< Enable                                                               */

