adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DUV2 @Bit 26 : Data unit valid info. */
  #define L2CACHEINFO_SET_WAY_INFO_DUV2_Pos (26UL)   /*!< Position of DUV2 field.                                              */
  #define L2CACHEINFO_SET_WAY_INFO_DUV2_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_DUV2_Pos) /*!< Bit mask of DUV2 field.          */
  #define L2CACHEINFO_SET_WAY_INFO_DUV2_Min (0x0UL)  /*!< Min enumerator value of DUV2 field.                                  */
  #define L2CACHEINFO_SET_WAY_INFO_DUV2_Max (0x1UL)  /*!< Max enumerator value of DUV2 field.                                  */
  #define L2CACHEINFO_SET_WAY_INFO_DUV2_Invalid (0x0UL) /*!< Invalid data unit                                                 */
  #define L2CACHEINFO_SET_WAY_INFO_DUV2_Valid (0x1UL) /*!< Valid data unit                                                     */

/* DUV3 @Bit 27 : Data unit valid info. */
  #define L2CACHEINFO_SET_WAY_INFO_DUV3_Pos (27UL)   /*!< Position of DUV3 field.                                              */
  #define L2CACHEINFO_SET_WAY_INFO_DUV3_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_DUV3_Pos) /*!< Bit mask of DUV3 field.          */
  #define L2CACHEINFO_SET_WAY_INFO_DUV3_Min (0x0UL)  /*!< Min enumerator value of DUV3 field.                                  */
  #define L2CACHEINFO_SET_WAY_INFO_DUV3_Max (0x1UL)  /*!< Max enumerator value of DUV3 field.                                  */
  #define L2CACHEINFO_SET_WAY_INFO_DUV3_Invalid (0x0UL) /*!< Invalid data unit                                                 */
  #define L2CACHEINFO_SET_WAY_INFO_DUV3_Valid (0x1UL) /*!< Valid data unit                                                     */

/* V @Bit 30 : Line valid bit. */
  #define L2CACHEINFO_SET_WAY_INFO_V_Pos (30UL)      /*!< Position of V field.                                                 */
  #define L2CACHEINFO_SET_WAY_INFO_V_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_V_Pos) /*!< Bit mask of V field.                   */
  #define L2CACHEINFO_SET_WAY_INFO_V_Min (0x0UL)     /*!< Min enumerator value of V field.                                     */
  #define L2CACHEINFO_SET_WAY_INFO_V_Max (0x1UL)     /*!< Max enumerator value of V field.                                     */
  #define L2CACHEINFO_SET_WAY_INFO_V_Invalid (0x0UL) /*!< Invalid cache line                                                   */
  #define L2CACHEINFO_SET_WAY_INFO_V_Valid (0x1UL)   /*!< Valid cache line                                                     */

/* MRU @Bit 31 : Most recently used way. */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Pos (31UL)    /*!< Position of MRU field.                                               */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_MRU_Pos) /*!< Bit mask of MRU field.             */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Min (0x0UL)   /*!< Min enumerator value of MRU field.                                   */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Max (0x1UL)   /*!< Max enumerator value of MRU field.                                   */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Way0 (0x0UL)  /*!< Way0 was most recently used                                          */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Way1 (0x1UL)  /*!< Way1 was most recently used                                          */



/* ================================================= Struct L2CACHEINFO_SET ================================================== */
/**
  * @brief SET [L2CACHEINFO_SET] (unspecified)
  */
typedef struct {
  __IOM NRF_L2CACHEINFO_SET_WAY_Type WAY[2];         /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_L2CACHEINFO_SET_Type;                          /*!< Size = 8 (0x008)                                                     */
  #define L2CACHEINFO_SET_MaxCount (1024UL)          /*!< Max size of SET[1024] array.                                         */

/* =================================================== Struct L2CACHEINFO ==================================================== */
/**
  * @brief CACHEINFO
  */
  typedef struct {                                   /*!< L2CACHEINFO Structure                                                */
    __IOM NRF_L2CACHEINFO_SET_Type SET[1024];        /*!< (@ 0x00000000) (unspecified)                                         */
  } NRF_L2CACHEINFO_Type;                            /*!< Size = 8192 (0x2000)                                                 */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           LFRC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct LFRC_CONFIG ==================================================== */
/**
  * @brief CONFIG [LFRC_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000000) Override the configuration                            */
} NRF_LFRC_CONFIG_Type;                              /*!< Size = 4 (0x004)                                                     */

/* LFRC_CONFIG_CFG: Override the configuration */
  #define LFRC_CONFIG_CFG_ResetValue (0x00000000UL)  /*!< Reset value of CFG register.                                         */

/* DOUBLETAILCURRENT @Bit 0 : Double tail current in comparator CMPX_INT, only for debugging purposes. */
  #define LFRC_CONFIG_CFG_DOUBLETAILCURRENT_Pos (0UL) /*!< Position of DOUBLETAILCURRENT field.                                */
  #define LFRC_CONFIG_CFG_DOUBLETAILCURRENT_Msk (0x1UL << LFRC_CONFIG_CFG_DOUBLETAILCURRENT_Pos) /*!< Bit mask of
                                                                            DOUBLETAILCURRENT field.*/                            
  #define LFRC_CONFIG_CFG_DOUBLETAILCURRENT_Min (0x0UL) /*!< Min enumerator value of DOUBLETAILCURRENT field.                  */
  #define LFRC_CONFIG_CFG_DOUBLETAILCURRENT_Max (0x1UL) /*!< Max enumerator value of DOUBLETAILCURRENT field.                  */
  #define LFRC_CONFIG_CFG_DOUBLETAILCURRENT_Disabled (0x0UL) /*!< Disabled                                                     */
  #define LFRC_CONFIG_CFG_DOUBLETAILCURRENT_Enabled (0x1UL) /*!< Enabled                                                       */

/* CONTINUOUSTAILBIAS @Bit 1 : Enable continuous tail bias in comparator CMPX_INT, only for debugging purposes. */
  #define LFRC_CONFIG_CFG_CONTINUOUSTAILBIAS_Pos (1UL) /*!< Position of CONTINUOUSTAILBIAS field.                              */
  #define LFRC_CONFIG_CFG_CONTINUOUSTAILBIAS_Msk (0x1UL << LFRC_CONFIG_CFG_CONTINUOUSTAILBIAS_Pos) /*!< Bit mask of
                                                                            CONTINUOUSTAILBIAS field.*/                           
  #define LFRC_CONFIG_CFG_CONTINUOUSTAILBIAS_Min (0x0UL) /*!< Min enumerator value of CONTINUOUSTAILBIAS field.                */
  #define LFRC_CONFIG_CFG_CONTINUOUSTAILBIAS_Max (0x1UL) /*!< Max enumerator value of CONTINUOUSTAILBIAS field.                */
  #define LFRC_CONFIG_CFG_CONTINUOUSTAILBIAS_Disabled (0x0UL) /*!< Disabled                                                    */
  #define LFRC_CONFIG_CFG_CONTINUOUSTAILBIAS_Enabled (0x1UL) /*!< Enabled                                                      */

/* ENABLERETENTION @Bit 2 : Enable retention for CAL */
  #define LFRC_CONFIG_CFG_ENABLERETENTION_Pos (2UL)  /*!< Position of ENABLERETENTION field.                                   */
  #define LFRC_CONFIG_CFG_ENABLERETENTION_Msk (0x1UL << LFRC_CONFIG_CFG_ENABLERETENTION_Pos) /*!< Bit mask of ENABLERETENTION
                                                                            field.*/                                              
  #define LFRC_CONFIG_CFG_ENABLERETENTION_Min (0x0UL) /*!< Min enumerator value of ENABLERETENTION field.                      */
  #define LFRC_CONFIG_CFG_ENABLERETENTION_Max (0x1UL) /*!< Max enumerator value of ENABLERETENTION field.                      */
  #define LFRC_CONFIG_CFG_ENABLERETENTION_Disabled (0x0UL) /*!< Disabled                                                       */
  #define LFRC_CONFIG_CFG_ENABLERETENTION_Enabled (0x1UL) /*!< Enabled                                                         */

/* SPARE @Bit 3 : Spare general purpose configuration bits. Register in NVM. */
  #define LFRC_CONFIG_CFG_SPARE_Pos (3UL)            /*!< Position of SPARE field.                                             */
  #define LFRC_CONFIG_CFG_SPARE_Msk (0x1UL << LFRC_CONFIG_CFG_SPARE_Pos) /*!< Bit mask of SPARE field.                         */
  #define LFRC_CONFIG_CFG_SPARE_Min (0x0UL)          /*!< Min enumerator value of SPARE field.                                 */
  #define LFRC_CONFIG_CFG_SPARE_Max (0x1UL)          /*!< Max enumerator value of SPARE field.                                 */
  #define LFRC_CONFIG_CFG_SPARE_Disabled (0x0UL)     /*!< Disabled                                                             */
  #define LFRC_CONFIG_CFG_SPARE_Enabled (0x1UL)      /*!< Enabled                                                              */



/* ===================================================== Struct LFRC_CAL ===================================================== */
/**
  * @brief CAL [LFRC_CAL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LENGTH;                            /*!< (@ 0x00000000) Measurement cycle count length used while calibration */
  __IOM uint32_t  TRIMLIMITLO;                       /*!< (@ 0x00000004) Lower trim limit                                      */
  __IOM uint32_t  TRIMLIMITHI;                       /*!< (@ 0x00000008) Higher trim limit                                     */
  __IM  uint32_t  RESULT[2];                         /*!< (@ 0x0000000C) Calibration result from CAL=n                         */
  __IM  uint32_t  NHI;                               /*!< (@ 0x00000014) Number of cycles when the CAL signal is high          */
  __IOM uint32_t  LFRCOSCTRIM;                       /*!< (@ 0x00000018) Initial coarse frequency trimming value for the
                                                                         oscillator.*/                                            
} NRF_LFRC_CAL_Type;                                 /*!< Size = 28 (0x01C)                                                    */

/* LFRC_CAL_LENGTH: Measurement cycle count length used while calibration */
  #define LFRC_CAL_LENGTH_ResetValue (0x00000002UL)  /*!< Reset value of LENGTH register.                                      */

/* LENGTH @Bits 0..2 : Number of cycles */
  #define LFRC_CAL_LENGTH_LENGTH_Pos (0UL)           /*!< Position of LENGTH field.                                            */
  #define LFRC_CAL_LENGTH_LENGTH_Msk (0x7UL << LFRC_CAL_LENGTH_LENGTH_Pos) /*!< Bit mask of LENGTH field.                      */
  #define LFRC_CAL_LENGTH_LENGTH_Min (0x0UL)         /*!< Min enumerator value of LENGTH field.                                */
  #define LFRC_CAL_LENGTH_LENGTH_Max (0x3UL)         /*!< Max enumerator value of LENGTH field.                                */
  #define LFRC_CAL_LENGTH_LENGTH_N64 (0x0UL)         /*!< 64 cycles                                                            */
  #define LFRC_CAL_LENGTH_LENGTH_N128 (0x1UL)        /*!< 128 cycles                                                           */
  #define LFRC_CAL_LENGTH_LENGTH_N256 (0x2UL)        /*!< 256 cycles                                                           */
  #define LFRC_CAL_LENGTH_LENGTH_N512 (0x3UL)        /*!< 512 cycles                                                           */


/* LFRC_CAL_TRIMLIMITLO: Lower trim limit */
  #define LFRC_CAL_TRIMLIMITLO_ResetValue (0x00000000UL) /*!< Reset value of TRIMLIMITLO register.                             */

/* VALUE @Bits 0..17 : TRIM limit value. */
  #define LFRC_CAL_TRIMLIMITLO_VALUE_Pos (0UL)       /*!< Position of VALUE field.                                             */
  #define LFRC_CAL_TRIMLIMITLO_VALUE_Msk (0x3FFFFUL << LFRC_CAL_TRIMLIMITLO_VALUE_Pos) /*!< Bit mask of VALUE field.           */


/* LFRC_CAL_TRIMLIMITHI: Higher trim limit */
  #define LFRC_CAL_TRIMLIMITHI_ResetValue (0x0003FFFFUL) /*!< Reset value of TRIMLIMITHI register.                             */

