adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VALUE @Bits 0..17 : TRIM limit value */
  #define LFRC_CAL_TRIMLIMITHI_VALUE_Pos (0UL)       /*!< Position of VALUE field.                                             */
  #define LFRC_CAL_TRIMLIMITHI_VALUE_Msk (0x3FFFFUL << LFRC_CAL_TRIMLIMITHI_VALUE_Pos) /*!< Bit mask of VALUE field.           */


/* LFRC_CAL_RESULT: Calibration result from CAL=n */
  #define LFRC_CAL_RESULT_MaxCount (2UL)             /*!< Max size of RESULT[2] array.                                         */
  #define LFRC_CAL_RESULT_ResetValue (0x00000000UL)  /*!< Reset value of RESULT[2] register.                                   */

/* RESULT @Bits 0..31 : The result in 16MHz clock cycles */
  #define LFRC_CAL_RESULT_RESULT_Pos (0UL)           /*!< Position of RESULT field.                                            */
  #define LFRC_CAL_RESULT_RESULT_Msk (0xFFFFFFFFUL << LFRC_CAL_RESULT_RESULT_Pos) /*!< Bit mask of RESULT field.               */


/* LFRC_CAL_NHI: Number of cycles when the CAL signal is high */
  #define LFRC_CAL_NHI_ResetValue (0x00000000UL)     /*!< Reset value of NHI register.                                         */

/* NHI @Bits 0..11 : Number of cycles */
  #define LFRC_CAL_NHI_NHI_Pos (0UL)                 /*!< Position of NHI field.                                               */
  #define LFRC_CAL_NHI_NHI_Msk (0xFFFUL << LFRC_CAL_NHI_NHI_Pos) /*!< Bit mask of NHI field.                                   */


/* LFRC_CAL_LFRCOSCTRIM: Initial coarse frequency trimming value for the oscillator. */
  #define LFRC_CAL_LFRCOSCTRIM_ResetValue (0x0000000AUL) /*!< Reset value of LFRCOSCTRIM register.                             */

/* VAL @Bits 0..5 : TRIM value */
  #define LFRC_CAL_LFRCOSCTRIM_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define LFRC_CAL_LFRCOSCTRIM_VAL_Msk (0x3FUL << LFRC_CAL_LFRCOSCTRIM_VAL_Pos) /*!< Bit mask of VAL field.                    */
  #define LFRC_CAL_LFRCOSCTRIM_VAL_Min (0xFFFFFFECUL) /*!< Min value of VAL field.                                             */
  #define LFRC_CAL_LFRCOSCTRIM_VAL_Max (0x9UL)       /*!< Max size of VAL field.                                               */



/* ================================================== Struct LFRC_OVERRIDE =================================================== */
/**
  * @brief OVERRIDE [LFRC_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SYNC;                              /*!< (@ 0x00000000) Override the SYNC signal to the LFRC32K analog module */
  __IOM uint32_t  CAL;                               /*!< (@ 0x00000004) Override the CAL signal to the LFRC32K analog module  */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000008) Override the RETAIN signal to the LFRC32K analog
                                                                         module*/                                                 
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x0000000C) Override the PWRUP signal to the LFRC32K analog module*/
  __IOM uint32_t  TRIM;                              /*!< (@ 0x00000010) Override the TRIM[5:0] signal to the LFRC32K analog
                                                                         module*/                                                 
  __IOM uint32_t  READY;                             /*!< (@ 0x00000014) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x00000018) Override the SETTLED signal from the analog module    */
} NRF_LFRC_OVERRIDE_Type;                            /*!< Size = 28 (0x01C)                                                    */

/* LFRC_OVERRIDE_SYNC: Override the SYNC signal to the LFRC32K analog module */
  #define LFRC_OVERRIDE_SYNC_ResetValue (0x00000000UL) /*!< Reset value of SYNC register.                                      */

/* VAL @Bit 0 : Override value for the signal */
  #define LFRC_OVERRIDE_SYNC_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define LFRC_OVERRIDE_SYNC_VAL_Msk (0x1UL << LFRC_OVERRIDE_SYNC_VAL_Pos) /*!< Bit mask of VAL field.                         */

/* EN @Bit 31 : Enable the override */
  #define LFRC_OVERRIDE_SYNC_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define LFRC_OVERRIDE_SYNC_EN_Msk (0x1UL << LFRC_OVERRIDE_SYNC_EN_Pos) /*!< Bit mask of EN field.                            */
  #define LFRC_OVERRIDE_SYNC_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define LFRC_OVERRIDE_SYNC_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define LFRC_OVERRIDE_SYNC_EN_Disabled (0x0UL)     /*!< Override is disabled                                                 */
  #define LFRC_OVERRIDE_SYNC_EN_Enabled (0x1UL)      /*!< Override is enabled                                                  */


/* LFRC_OVERRIDE_CAL: Override the CAL signal to the LFRC32K analog module */
  #define LFRC_OVERRIDE_CAL_ResetValue (0x00000000UL) /*!< Reset value of CAL register.                                        */

/* VAL @Bit 0 : Override value for the signal */
  #define LFRC_OVERRIDE_CAL_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define LFRC_OVERRIDE_CAL_VAL_Msk (0x1UL << LFRC_OVERRIDE_CAL_VAL_Pos) /*!< Bit mask of VAL field.                           */

/* EN @Bit 31 : Enable the override */
  #define LFRC_OVERRIDE_CAL_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define LFRC_OVERRIDE_CAL_EN_Msk (0x1UL << LFRC_OVERRIDE_CAL_EN_Pos) /*!< Bit mask of EN field.                              */
  #define LFRC_OVERRIDE_CAL_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define LFRC_OVERRIDE_CAL_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define LFRC_OVERRIDE_CAL_EN_Disabled (0x0UL)      /*!< Override is disabled                                                 */
  #define LFRC_OVERRIDE_CAL_EN_Enabled (0x1UL)       /*!< Override is enabled                                                  */


