adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LFRC_OVERRIDE_RETAIN: Override the RETAIN signal to the LFRC32K analog module */
  #define LFRC_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                                  */

/* VAL @Bit 0 : Override value for the signal */
  #define LFRC_OVERRIDE_RETAIN_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define LFRC_OVERRIDE_RETAIN_VAL_Msk (0x1UL << LFRC_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define LFRC_OVERRIDE_RETAIN_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define LFRC_OVERRIDE_RETAIN_EN_Msk (0x1UL << LFRC_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.                        */
  #define LFRC_OVERRIDE_RETAIN_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define LFRC_OVERRIDE_RETAIN_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define LFRC_OVERRIDE_RETAIN_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define LFRC_OVERRIDE_RETAIN_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


/* LFRC_OVERRIDE_PWRUP: Override the PWRUP signal to the LFRC32K analog module */
  #define LFRC_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                    */

/* VAL @Bit 0 : Override value for the signal */
  #define LFRC_OVERRIDE_PWRUP_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define LFRC_OVERRIDE_PWRUP_VAL_Msk (0x1UL << LFRC_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.                       */

/* EN @Bit 31 : Enable the override */
  #define LFRC_OVERRIDE_PWRUP_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define LFRC_OVERRIDE_PWRUP_EN_Msk (0x1UL << LFRC_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                          */
  #define LFRC_OVERRIDE_PWRUP_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define LFRC_OVERRIDE_PWRUP_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define LFRC_OVERRIDE_PWRUP_EN_Disabled (0x0UL)    /*!< Override is disabled                                                 */
  #define LFRC_OVERRIDE_PWRUP_EN_Enabled (0x1UL)     /*!< Override is enabled                                                  */


/* LFRC_OVERRIDE_TRIM: Override the TRIM[5:0] signal to the LFRC32K analog module */
  #define LFRC_OVERRIDE_TRIM_ResetValue (0x00000000UL) /*!< Reset value of TRIM register.                                      */

/* VAL @Bits 0..5 : TRIM value */
  #define LFRC_OVERRIDE_TRIM_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define LFRC_OVERRIDE_TRIM_VAL_Msk (0x3FUL << LFRC_OVERRIDE_TRIM_VAL_Pos) /*!< Bit mask of VAL field.                        */
  #define LFRC_OVERRIDE_TRIM_VAL_Min (0xFFFFFFECUL)  /*!< Min value of VAL field.                                              */
  #define LFRC_OVERRIDE_TRIM_VAL_Max (0x9UL)         /*!< Max size of VAL field.                                               */

/* EN @Bit 31 : Enable the override */
  #define LFRC_OVERRIDE_TRIM_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define LFRC_OVERRIDE_TRIM_EN_Msk (0x1UL << LFRC_OVERRIDE_TRIM_EN_Pos) /*!< Bit mask of EN field.                            */
  #define LFRC_OVERRIDE_TRIM_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define LFRC_OVERRIDE_TRIM_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define LFRC_OVERRIDE_TRIM_EN_Disabled (0x0UL)     /*!< Override is disabled                                                 */
  #define LFRC_OVERRIDE_TRIM_EN_Enabled (0x1UL)      /*!< Override is enabled                                                  */


/* LFRC_OVERRIDE_READY: Override the READY signal from the analog module */
  #define LFRC_OVERRIDE_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                                    */

/* VAL @Bit 0 : Current value of the signal */
  #define LFRC_OVERRIDE_READY_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define LFRC_OVERRIDE_READY_VAL_Msk (0x1UL << LFRC_OVERRIDE_READY_VAL_Pos) /*!< Bit mask of VAL field.                       */

/* EN @Bit 31 : Enable the override */
  #define LFRC_OVERRIDE_READY_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define LFRC_OVERRIDE_READY_EN_Msk (0x1UL << LFRC_OVERRIDE_READY_EN_Pos) /*!< Bit mask of EN field.                          */
  #define LFRC_OVERRIDE_READY_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define LFRC_OVERRIDE_READY_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define LFRC_OVERRIDE_READY_EN_Disabled (0x0UL)    /*!< Override is disabled                                                 */
  #define LFRC_OVERRIDE_READY_EN_Enabled (0x1UL)     /*!< Override is enabled                                                  */


/* LFRC_OVERRIDE_SETTLED: Override the SETTLED signal from the analog module */
  #define LFRC_OVERRIDE_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of SETTLED register.                                */

/* VAL @Bit 0 : Current value of the signal */
  #define LFRC_OVERRIDE_SETTLED_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define LFRC_OVERRIDE_SETTLED_VAL_Msk (0x1UL << LFRC_OVERRIDE_SETTLED_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define LFRC_OVERRIDE_SETTLED_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define LFRC_OVERRIDE_SETTLED_EN_Msk (0x1UL << LFRC_OVERRIDE_SETTLED_EN_Pos) /*!< Bit mask of EN field.                      */
  #define LFRC_OVERRIDE_SETTLED_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define LFRC_OVERRIDE_SETTLED_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define LFRC_OVERRIDE_SETTLED_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define LFRC_OVERRIDE_SETTLED_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */



/* ===================================================== Struct LFRC_DFT ===================================================== */
/**
  * @brief DFT [LFRC_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTBCONFIG;                         /*!< (@ 0x00000010) Digital Test Bus (DTB0-3) configuration               */
  __IM  uint32_t  RESERVED1[7];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
} NRF_LFRC_DFT_Type;                                 /*!< Size = 52 (0x034)                                                    */

/* LFRC_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define LFRC_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                               */

