adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EN @Bit 31 : Enable the analog test bus */
  #define LFRC_DFT_ATB0CONFIG_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define LFRC_DFT_ATB0CONFIG_EN_Msk (0x1UL << LFRC_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                          */
  #define LFRC_DFT_ATB0CONFIG_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define LFRC_DFT_ATB0CONFIG_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define LFRC_DFT_ATB0CONFIG_EN_Disabled (0x0UL)    /*!< Analog test bus is disabled                                          */
  #define LFRC_DFT_ATB0CONFIG_EN_Enabled (0x1UL)     /*!< Connect output from built-in ULP regulator to the analog test bus
                                                          (ATB0)*/                                                                


/* LFRC_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define LFRC_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                               */

/* EN @Bit 31 : Enable the analog test bus */
  #define LFRC_DFT_ATB1CONFIG_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define LFRC_DFT_ATB1CONFIG_EN_Msk (0x1UL << LFRC_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                          */
  #define LFRC_DFT_ATB1CONFIG_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define LFRC_DFT_ATB1CONFIG_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define LFRC_DFT_ATB1CONFIG_EN_Disabled (0x0UL)    /*!< Analog test bus is disabled                                          */
  #define LFRC_DFT_ATB1CONFIG_EN_Enabled (0x1UL)     /*!< Connect 50nA bias current from reference current generator to the
                                                          analog test bus (ATB1)*/                                                


/* LFRC_DFT_DTBCONFIG: Digital Test Bus (DTB0-3) configuration */
  #define LFRC_DFT_DTBCONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTBCONFIG register.                                 */

/* SELMUX @Bit 0 : Select multiplexer for DTB0 */
  #define LFRC_DFT_DTBCONFIG_SELMUX_Pos (0UL)        /*!< Position of SELMUX field.                                            */
  #define LFRC_DFT_DTBCONFIG_SELMUX_Msk (0x1UL << LFRC_DFT_DTBCONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.                */
  #define LFRC_DFT_DTBCONFIG_SELMUX_Min (0x0UL)      /*!< Min enumerator value of SELMUX field.                                */
  #define LFRC_DFT_DTBCONFIG_SELMUX_Max (0x1UL)      /*!< Max enumerator value of SELMUX field.                                */
  #define LFRC_DFT_DTBCONFIG_SELMUX_CONFIG0 (0x0UL)  /*!< Configuration 0 selected                                             */
  #define LFRC_DFT_DTBCONFIG_SELMUX_CONFIG1 (0x1UL)  /*!< Configuration 1 selected                                             */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit on DTB3 */
  #define LFRC_DFT_DTBCONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                      */
  #define LFRC_DFT_DTBCONFIG_PWRUPDELTEST_Msk (0x1UL << LFRC_DFT_DTBCONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of PWRUPDELTEST
                                                                            field.*/                                              
  #define LFRC_DFT_DTBCONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                         */
  #define LFRC_DFT_DTBCONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                         */
  #define LFRC_DFT_DTBCONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                           */
  #define LFRC_DFT_DTBCONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                             */

/* ENABLEDTB0 @Bit 28 : Enable the digital test bus 0 (DTB0) */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB0_Pos (28UL)   /*!< Position of ENABLEDTB0 field.                                        */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB0_Msk (0x1UL << LFRC_DFT_DTBCONFIG_ENABLEDTB0_Pos) /*!< Bit mask of ENABLEDTB0 field.    */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB0_Min (0x0UL)  /*!< Min enumerator value of ENABLEDTB0 field.                            */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB0_Max (0x1UL)  /*!< Max enumerator value of ENABLEDTB0 field.                            */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB0_Disabled (0x0UL) /*!< Digital test bus is disabled                                     */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB0_Enabled (0x1UL) /*!< Digital test bus is enabled                                       */

/* ENABLEDTB1 @Bit 29 : Enable the digital test bus 1 (DTB1) */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB1_Pos (29UL)   /*!< Position of ENABLEDTB1 field.                                        */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB1_Msk (0x1UL << LFRC_DFT_DTBCONFIG_ENABLEDTB1_Pos) /*!< Bit mask of ENABLEDTB1 field.    */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB1_Min (0x0UL)  /*!< Min enumerator value of ENABLEDTB1 field.                            */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB1_Max (0x1UL)  /*!< Max enumerator value of ENABLEDTB1 field.                            */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB1_Disabled (0x0UL) /*!< Digital test bus is disabled                                     */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB1_Enabled (0x1UL) /*!< Digital test bus is enabled                                       */

/* ENABLEDTB2 @Bit 30 : Enable the digital test bus 2 (DTB2) */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB2_Pos (30UL)   /*!< Position of ENABLEDTB2 field.                                        */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB2_Msk (0x1UL << LFRC_DFT_DTBCONFIG_ENABLEDTB2_Pos) /*!< Bit mask of ENABLEDTB2 field.    */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB2_Min (0x0UL)  /*!< Min enumerator value of ENABLEDTB2 field.                            */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB2_Max (0x1UL)  /*!< Max enumerator value of ENABLEDTB2 field.                            */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB2_Disabled (0x0UL) /*!< Digital test bus is disabled                                     */
  #define LFRC_DFT_DTBCONFIG_ENABLEDTB2_Enabled (0x1UL) /*!< Digital test bus is enabled                                       */

