adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LFXO_OVERRIDE_MODE: Override the MODE signal to the analog module */
  #define LFXO_OVERRIDE_MODE_ResetValue (0x00000000UL) /*!< Reset value of MODE register.                                      */

/* VAL @Bit 0 : Value */
  #define LFXO_OVERRIDE_MODE_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define LFXO_OVERRIDE_MODE_VAL_Msk (0x1UL << LFXO_OVERRIDE_MODE_VAL_Pos) /*!< Bit mask of VAL field.                         */

/* EN @Bit 31 : Enable the override */
  #define LFXO_OVERRIDE_MODE_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define LFXO_OVERRIDE_MODE_EN_Msk (0x1UL << LFXO_OVERRIDE_MODE_EN_Pos) /*!< Bit mask of EN field.                            */
  #define LFXO_OVERRIDE_MODE_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_MODE_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_MODE_EN_Disabled (0x0UL)     /*!< Override is disabled                                                 */
  #define LFXO_OVERRIDE_MODE_EN_Enabled (0x1UL)      /*!< Override is enabled                                                  */


/* LFXO_OVERRIDE_BYPASS: Override the BYPASS signal to the analog module */
  #define LFXO_OVERRIDE_BYPASS_ResetValue (0x00000000UL) /*!< Reset value of BYPASS register.                                  */

/* VAL @Bit 0 : Value */
  #define LFXO_OVERRIDE_BYPASS_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define LFXO_OVERRIDE_BYPASS_VAL_Msk (0x1UL << LFXO_OVERRIDE_BYPASS_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define LFXO_OVERRIDE_BYPASS_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define LFXO_OVERRIDE_BYPASS_EN_Msk (0x1UL << LFXO_OVERRIDE_BYPASS_EN_Pos) /*!< Bit mask of EN field.                        */
  #define LFXO_OVERRIDE_BYPASS_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_BYPASS_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_BYPASS_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define LFXO_OVERRIDE_BYPASS_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


/* LFXO_OVERRIDE_OUTSEL: Override the OUTSEL[1:0] signal to the analog module */
  #define LFXO_OVERRIDE_OUTSEL_ResetValue (0x00000000UL) /*!< Reset value of OUTSEL register.                                  */

/* VAL @Bits 0..1 : Value */
  #define LFXO_OVERRIDE_OUTSEL_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define LFXO_OVERRIDE_OUTSEL_VAL_Msk (0x3UL << LFXO_OVERRIDE_OUTSEL_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define LFXO_OVERRIDE_OUTSEL_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define LFXO_OVERRIDE_OUTSEL_EN_Msk (0x1UL << LFXO_OVERRIDE_OUTSEL_EN_Pos) /*!< Bit mask of EN field.                        */
  #define LFXO_OVERRIDE_OUTSEL_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_OUTSEL_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_OUTSEL_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define LFXO_OVERRIDE_OUTSEL_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


/* LFXO_OVERRIDE_S2SHPMODE: Override the S2S_HPMODE signal to the analog module */
  #define LFXO_OVERRIDE_S2SHPMODE_ResetValue (0x00000000UL) /*!< Reset value of S2SHPMODE register.                            */

/* VAL @Bit 0 : Value */
  #define LFXO_OVERRIDE_S2SHPMODE_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define LFXO_OVERRIDE_S2SHPMODE_VAL_Msk (0x1UL << LFXO_OVERRIDE_S2SHPMODE_VAL_Pos) /*!< Bit mask of VAL field.               */

/* EN @Bit 31 : Enable the override */
  #define LFXO_OVERRIDE_S2SHPMODE_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define LFXO_OVERRIDE_S2SHPMODE_EN_Msk (0x1UL << LFXO_OVERRIDE_S2SHPMODE_EN_Pos) /*!< Bit mask of EN field.                  */
  #define LFXO_OVERRIDE_S2SHPMODE_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_S2SHPMODE_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_S2SHPMODE_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define LFXO_OVERRIDE_S2SHPMODE_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */


/* LFXO_OVERRIDE_PIXOPWRUP: Override the PIXO_PWRUP signal to the analog module */
  #define LFXO_OVERRIDE_PIXOPWRUP_ResetValue (0x00000000UL) /*!< Reset value of PIXOPWRUP register.                            */

/* VAL @Bit 0 : Value */
  #define LFXO_OVERRIDE_PIXOPWRUP_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define LFXO_OVERRIDE_PIXOPWRUP_VAL_Msk (0x1UL << LFXO_OVERRIDE_PIXOPWRUP_VAL_Pos) /*!< Bit mask of VAL field.               */

/* EN @Bit 31 : Enable the override */
  #define LFXO_OVERRIDE_PIXOPWRUP_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define LFXO_OVERRIDE_PIXOPWRUP_EN_Msk (0x1UL << LFXO_OVERRIDE_PIXOPWRUP_EN_Pos) /*!< Bit mask of EN field.                  */
  #define LFXO_OVERRIDE_PIXOPWRUP_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PIXOPWRUP_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PIXOPWRUP_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define LFXO_OVERRIDE_PIXOPWRUP_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */


