adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LFXO_OVERRIDE_PIXOSTARTUP: Override the PIXO_STARTUP signal to the analog module */
  #define LFXO_OVERRIDE_PIXOSTARTUP_ResetValue (0x00000000UL) /*!< Reset value of PIXOSTARTUP register.                        */

/* VAL @Bit 0 : Value */
  #define LFXO_OVERRIDE_PIXOSTARTUP_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define LFXO_OVERRIDE_PIXOSTARTUP_VAL_Msk (0x1UL << LFXO_OVERRIDE_PIXOSTARTUP_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define LFXO_OVERRIDE_PIXOSTARTUP_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define LFXO_OVERRIDE_PIXOSTARTUP_EN_Msk (0x1UL << LFXO_OVERRIDE_PIXOSTARTUP_EN_Pos) /*!< Bit mask of EN field.              */
  #define LFXO_OVERRIDE_PIXOSTARTUP_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PIXOSTARTUP_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PIXOSTARTUP_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define LFXO_OVERRIDE_PIXOSTARTUP_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* LFXO_OVERRIDE_PIERCESTARTUP: Override the PIERCE_STARTUP signal to the analog module */
  #define LFXO_OVERRIDE_PIERCESTARTUP_ResetValue (0x00000000UL) /*!< Reset value of PIERCESTARTUP register.                    */

/* VAL @Bit 0 : Value */
  #define LFXO_OVERRIDE_PIERCESTARTUP_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define LFXO_OVERRIDE_PIERCESTARTUP_VAL_Msk (0x1UL << LFXO_OVERRIDE_PIERCESTARTUP_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : Enable the override */
  #define LFXO_OVERRIDE_PIERCESTARTUP_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define LFXO_OVERRIDE_PIERCESTARTUP_EN_Msk (0x1UL << LFXO_OVERRIDE_PIERCESTARTUP_EN_Pos) /*!< Bit mask of EN field.          */
  #define LFXO_OVERRIDE_PIERCESTARTUP_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PIERCESTARTUP_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PIERCESTARTUP_EN_Disabled (0x0UL) /*!< Override is disabled                                            */
  #define LFXO_OVERRIDE_PIERCESTARTUP_EN_Enabled (0x1UL) /*!< Override is enabled                                              */


/* LFXO_OVERRIDE_PIERCEIDAC: Override the PIERCE_IDAC signal to the analog module */
  #define LFXO_OVERRIDE_PIERCEIDAC_ResetValue (0x00000000UL) /*!< Reset value of PIERCEIDAC register.                          */

/* VAL @Bits 0..4 : Value */
  #define LFXO_OVERRIDE_PIERCEIDAC_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define LFXO_OVERRIDE_PIERCEIDAC_VAL_Msk (0x1FUL << LFXO_OVERRIDE_PIERCEIDAC_VAL_Pos) /*!< Bit mask of VAL field.            */

/* EN @Bit 31 : Enable the override */
  #define LFXO_OVERRIDE_PIERCEIDAC_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define LFXO_OVERRIDE_PIERCEIDAC_EN_Msk (0x1UL << LFXO_OVERRIDE_PIERCEIDAC_EN_Pos) /*!< Bit mask of EN field.                */
  #define LFXO_OVERRIDE_PIERCEIDAC_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PIERCEIDAC_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PIERCEIDAC_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define LFXO_OVERRIDE_PIERCEIDAC_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* LFXO_OVERRIDE_PDEN: Override the PD_EN signal to the analog module */
  #define LFXO_OVERRIDE_PDEN_ResetValue (0x00000000UL) /*!< Reset value of PDEN register.                                      */

/* VAL @Bit 0 : Value */
  #define LFXO_OVERRIDE_PDEN_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define LFXO_OVERRIDE_PDEN_VAL_Msk (0x1UL << LFXO_OVERRIDE_PDEN_VAL_Pos) /*!< Bit mask of VAL field.                         */

/* EN @Bit 31 : Enable the override */
  #define LFXO_OVERRIDE_PDEN_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define LFXO_OVERRIDE_PDEN_EN_Msk (0x1UL << LFXO_OVERRIDE_PDEN_EN_Pos) /*!< Bit mask of EN field.                            */
  #define LFXO_OVERRIDE_PDEN_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PDEN_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PDEN_EN_Disabled (0x0UL)     /*!< Override is disabled                                                 */
  #define LFXO_OVERRIDE_PDEN_EN_Enabled (0x1UL)      /*!< Override is enabled                                                  */


/* LFXO_OVERRIDE_CLOAD: Override the CLOAD signal to the analog module */
  #define LFXO_OVERRIDE_CLOAD_ResetValue (0x00000000UL) /*!< Reset value of CLOAD register.                                    */

/* VAL @Bits 0..4 : Value */
  #define LFXO_OVERRIDE_CLOAD_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define LFXO_OVERRIDE_CLOAD_VAL_Msk (0x1FUL << LFXO_OVERRIDE_CLOAD_VAL_Pos) /*!< Bit mask of VAL field.                      */

/* EN @Bit 31 : Enable the override */
  #define LFXO_OVERRIDE_CLOAD_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define LFXO_OVERRIDE_CLOAD_EN_Msk (0x1UL << LFXO_OVERRIDE_CLOAD_EN_Pos) /*!< Bit mask of EN field.                          */
  #define LFXO_OVERRIDE_CLOAD_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_CLOAD_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_CLOAD_EN_Disabled (0x0UL)    /*!< Override is disabled                                                 */
  #define LFXO_OVERRIDE_CLOAD_EN_Enabled (0x1UL)     /*!< Override is enabled                                                  */


