adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LFXO_OVERRIDE_READY: Override the READY signal from the analog module */
  #define LFXO_OVERRIDE_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                                    */

/* VAL @Bit 0 : Current value of the signal */
  #define LFXO_OVERRIDE_READY_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define LFXO_OVERRIDE_READY_VAL_Msk (0x1UL << LFXO_OVERRIDE_READY_VAL_Pos) /*!< Bit mask of VAL field.                       */

/* EN @Bit 31 : Enable the override */
  #define LFXO_OVERRIDE_READY_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define LFXO_OVERRIDE_READY_EN_Msk (0x1UL << LFXO_OVERRIDE_READY_EN_Pos) /*!< Bit mask of EN field.                          */
  #define LFXO_OVERRIDE_READY_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_READY_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_READY_EN_Disabled (0x0UL)    /*!< Override is disabled                                                 */
  #define LFXO_OVERRIDE_READY_EN_Enabled (0x1UL)     /*!< Override is enabled                                                  */


/* LFXO_OVERRIDE_SETTLED: Override the SETTLED signal from the analog module */
  #define LFXO_OVERRIDE_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of SETTLED register.                                */

/* VAL @Bit 0 : Current value of the signal */
  #define LFXO_OVERRIDE_SETTLED_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define LFXO_OVERRIDE_SETTLED_VAL_Msk (0x1UL << LFXO_OVERRIDE_SETTLED_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define LFXO_OVERRIDE_SETTLED_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define LFXO_OVERRIDE_SETTLED_EN_Msk (0x1UL << LFXO_OVERRIDE_SETTLED_EN_Pos) /*!< Bit mask of EN field.                      */
  #define LFXO_OVERRIDE_SETTLED_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_SETTLED_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_SETTLED_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define LFXO_OVERRIDE_SETTLED_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */


/* LFXO_OVERRIDE_PIXOACK: Override the PIXO_ACK signal from the analog module */
  #define LFXO_OVERRIDE_PIXOACK_ResetValue (0x00000000UL) /*!< Reset value of PIXOACK register.                                */

/* VAL @Bits 0..1 : Current value of the signal */
  #define LFXO_OVERRIDE_PIXOACK_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define LFXO_OVERRIDE_PIXOACK_VAL_Msk (0x3UL << LFXO_OVERRIDE_PIXOACK_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define LFXO_OVERRIDE_PIXOACK_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define LFXO_OVERRIDE_PIXOACK_EN_Msk (0x1UL << LFXO_OVERRIDE_PIXOACK_EN_Pos) /*!< Bit mask of EN field.                      */
  #define LFXO_OVERRIDE_PIXOACK_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PIXOACK_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PIXOACK_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define LFXO_OVERRIDE_PIXOACK_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */


/* LFXO_OVERRIDE_PDSETTLED: Override the PD_SETTLED signal from the analog module */
  #define LFXO_OVERRIDE_PDSETTLED_ResetValue (0x00000000UL) /*!< Reset value of PDSETTLED register.                            */

/* VAL @Bit 0 : Current value of the signal */
  #define LFXO_OVERRIDE_PDSETTLED_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define LFXO_OVERRIDE_PDSETTLED_VAL_Msk (0x1UL << LFXO_OVERRIDE_PDSETTLED_VAL_Pos) /*!< Bit mask of VAL field.               */

/* EN @Bit 31 : Enable the override */
  #define LFXO_OVERRIDE_PDSETTLED_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define LFXO_OVERRIDE_PDSETTLED_EN_Msk (0x1UL << LFXO_OVERRIDE_PDSETTLED_EN_Pos) /*!< Bit mask of EN field.                  */
  #define LFXO_OVERRIDE_PDSETTLED_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PDSETTLED_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PDSETTLED_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define LFXO_OVERRIDE_PDSETTLED_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */


/* LFXO_OVERRIDE_PDOUTLOWER: Override the PD_OUT_LOWER signal from the analog module */
  #define LFXO_OVERRIDE_PDOUTLOWER_ResetValue (0x00000000UL) /*!< Reset value of PDOUTLOWER register.                          */

/* VAL @Bit 0 : Current value of the signal */
  #define LFXO_OVERRIDE_PDOUTLOWER_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define LFXO_OVERRIDE_PDOUTLOWER_VAL_Msk (0x1UL << LFXO_OVERRIDE_PDOUTLOWER_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define LFXO_OVERRIDE_PDOUTLOWER_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define LFXO_OVERRIDE_PDOUTLOWER_EN_Msk (0x1UL << LFXO_OVERRIDE_PDOUTLOWER_EN_Pos) /*!< Bit mask of EN field.                */
  #define LFXO_OVERRIDE_PDOUTLOWER_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PDOUTLOWER_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PDOUTLOWER_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define LFXO_OVERRIDE_PDOUTLOWER_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* LFXO_OVERRIDE_PDOUTUPPER: Override the PD_OUT_UPPER signal from the analog module */
  #define LFXO_OVERRIDE_PDOUTUPPER_ResetValue (0x00000000UL) /*!< Reset value of PDOUTUPPER register.                          */

/* VAL @Bit 0 : Current value of the signal */
  #define LFXO_OVERRIDE_PDOUTUPPER_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define LFXO_OVERRIDE_PDOUTUPPER_VAL_Msk (0x1UL << LFXO_OVERRIDE_PDOUTUPPER_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define LFXO_OVERRIDE_PDOUTUPPER_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define LFXO_OVERRIDE_PDOUTUPPER_EN_Msk (0x1UL << LFXO_OVERRIDE_PDOUTUPPER_EN_Pos) /*!< Bit mask of EN field.                */
  #define LFXO_OVERRIDE_PDOUTUPPER_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PDOUTUPPER_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define LFXO_OVERRIDE_PDOUTUPPER_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define LFXO_OVERRIDE_PDOUTUPPER_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */



/* ===================================================== Struct LFXO_DFT ===================================================== */
/**
  * @brief DFT [LFXO_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
  __IOM uint32_t  DTB2CONFIG;                        /*!< (@ 0x00000018) Digital Test Bus 2 (DTB2) configuration               */
  __IOM uint32_t  DTB3CONFIG;                        /*!< (@ 0x0000001C) Digital Test Bus 3 (DTB3) configuration               */
  __IM  uint32_t  RESERVED1[4];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
} NRF_LFXO_DFT_Type;                                 /*!< Size = 52 (0x034)                                                    */

/* LFXO_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define LFXO_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                               */

/* SELMUX @Bits 0..2 : Select multiplexer for ATB0 */
  #define LFXO_DFT_ATB0CONFIG_SELMUX_Pos (0UL)       /*!< Position of SELMUX field.                                            */
  #define LFXO_DFT_ATB0CONFIG_SELMUX_Msk (0x7UL << LFXO_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.              */
  #define LFXO_DFT_ATB0CONFIG_SELMUX_Min (0x0UL)     /*!< Min enumerator value of SELMUX field.                                */
  #define LFXO_DFT_ATB0CONFIG_SELMUX_Max (0x5UL)     /*!< Max enumerator value of SELMUX field.                                */
  #define LFXO_DFT_ATB0CONFIG_SELMUX_XC1 (0x0UL)     /*!< Functional tests/main production test                                */
  #define LFXO_DFT_ATB0CONFIG_SELMUX_XC2 (0x1UL)     /*!< Test/trim peak detector                                              */
  #define LFXO_DFT_ATB0CONFIG_SELMUX_ITEST (0x2UL)   /*!< Test/trim current generator (or possibly IDAC).                      */
  #define LFXO_DFT_ATB0CONFIG_SELMUX_VDDINT0V8 (0x4UL) /*!< Measure current consumption VDD_INT_0V8.                           */
  #define LFXO_DFT_ATB0CONFIG_SELMUX_VDDINT1V8 (0x5UL) /*!< Measure current consumption VDD_INT_1V8.                           */

