adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PDSETTLED @Bit 4 : Current value of the PD_SETTLED signal from the analog module */
  #define LFXO_STATUSANA_PDSETTLED_Pos (4UL)         /*!< Position of PDSETTLED field.                                         */
  #define LFXO_STATUSANA_PDSETTLED_Msk (0x1UL << LFXO_STATUSANA_PDSETTLED_Pos) /*!< Bit mask of PDSETTLED field.               */

/* PDOUTLOWER @Bit 5 : Current value of the PD_OUT_LOWER signal from the analog module */
  #define LFXO_STATUSANA_PDOUTLOWER_Pos (5UL)        /*!< Position of PDOUTLOWER field.                                        */
  #define LFXO_STATUSANA_PDOUTLOWER_Msk (0x1UL << LFXO_STATUSANA_PDOUTLOWER_Pos) /*!< Bit mask of PDOUTLOWER field.            */

/* PDOUTUPPER @Bit 6 : Current value of the PD_OUT_UPPER signal from the analog module */
  #define LFXO_STATUSANA_PDOUTUPPER_Pos (6UL)        /*!< Position of PDOUTUPPER field.                                        */
  #define LFXO_STATUSANA_PDOUTUPPER_Msk (0x1UL << LFXO_STATUSANA_PDOUTUPPER_Pos) /*!< Bit mask of PDOUTUPPER field.            */


/* LFXO_MIRROR: Enable LOCK for mirrored registers */
  #define LFXO_MIRROR_ResetValue (0x00000001UL)      /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define LFXO_MIRROR_LOCK_Pos (0UL)                 /*!< Position of LOCK field.                                              */
  #define LFXO_MIRROR_LOCK_Msk (0x1UL << LFXO_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                                    */
  #define LFXO_MIRROR_LOCK_Min (0x0UL)               /*!< Min enumerator value of LOCK field.                                  */
  #define LFXO_MIRROR_LOCK_Max (0x1UL)               /*!< Max enumerator value of LOCK field.                                  */
  #define LFXO_MIRROR_LOCK_Disabled (0x0UL)          /*!< Lock disabled                                                        */
  #define LFXO_MIRROR_LOCK_Enabled (0x1UL)           /*!< Lock enabled                                                         */


/* LFXO_CLOAD: Internal capacitive load */
  #define LFXO_CLOAD_ResetValue (0x00000000UL)       /*!< Reset value of CLOAD register.                                       */

/* VAL0 @Bits 0..3 : Capacitive load value */
  #define LFXO_CLOAD_VAL0_Pos (0UL)                  /*!< Position of VAL0 field.                                              */
  #define LFXO_CLOAD_VAL0_Msk (0xFUL << LFXO_CLOAD_VAL0_Pos) /*!< Bit mask of VAL0 field.                                      */
  #define LFXO_CLOAD_VAL0_Min (0xFFFFFFFFUL)         /*!< Min value of VAL0 field.                                             */
  #define LFXO_CLOAD_VAL0_Max (0xFFFFFFFFUL)         /*!< Max size of VAL0 field.                                              */

/* VAL1 @Bit 4 : Capacitive load value */
  #define LFXO_CLOAD_VAL1_Pos (4UL)                  /*!< Position of VAL1 field.                                              */
  #define LFXO_CLOAD_VAL1_Msk (0x1UL << LFXO_CLOAD_VAL1_Pos) /*!< Bit mask of VAL1 field.                                      */
  #define LFXO_CLOAD_VAL1_Min (0x0UL)                /*!< Min value of VAL1 field.                                             */
  #define LFXO_CLOAD_VAL1_Max (0x1UL)                /*!< Max size of VAL1 field.                                              */


/* LFXO_AMPLITUDECTRL: Amplitude control */
  #define LFXO_AMPLITUDECTRL_ResetValue (0x00000000UL) /*!< Reset value of AMPLITUDECTRL register.                             */

/* INTERVAL @Bits 0..4 : Amplitude check interval */
  #define LFXO_AMPLITUDECTRL_INTERVAL_Pos (0UL)      /*!< Position of INTERVAL field.                                          */
  #define LFXO_AMPLITUDECTRL_INTERVAL_Msk (0x1FUL << LFXO_AMPLITUDECTRL_INTERVAL_Pos) /*!< Bit mask of INTERVAL field.         */
  #define LFXO_AMPLITUDECTRL_INTERVAL_Min (0x0UL)    /*!< Min value of INTERVAL field.                                         */
  #define LFXO_AMPLITUDECTRL_INTERVAL_Max (0x1FUL)   /*!< Max size of INTERVAL field.                                          */

/* STEP @Bits 8..10 : Step to adjust the IDAC when the peak detector triggers */
  #define LFXO_AMPLITUDECTRL_STEP_Pos (8UL)          /*!< Position of STEP field.                                              */
  #define LFXO_AMPLITUDECTRL_STEP_Msk (0x7UL << LFXO_AMPLITUDECTRL_STEP_Pos) /*!< Bit mask of STEP field.                      */
  #define LFXO_AMPLITUDECTRL_STEP_Min (0x0UL)        /*!< Min value of STEP field.                                             */
  #define LFXO_AMPLITUDECTRL_STEP_Max (0x7UL)        /*!< Max size of STEP field.                                              */

/* IDACINIT @Bits 16..20 : Initial IDAC code for the pierce oscillator */
  #define LFXO_AMPLITUDECTRL_IDACINIT_Pos (16UL)     /*!< Position of IDACINIT field.                                          */
  #define LFXO_AMPLITUDECTRL_IDACINIT_Msk (0x1FUL << LFXO_AMPLITUDECTRL_IDACINIT_Pos) /*!< Bit mask of IDACINIT field.         */
  #define LFXO_AMPLITUDECTRL_IDACINIT_Min (0x0UL)    /*!< Min value of IDACINIT field.                                         */
  #define LFXO_AMPLITUDECTRL_IDACINIT_Max (0x1FUL)   /*!< Max size of IDACINIT field.                                          */

/* PDCTRL @Bit 24 : Peak detector control */
  #define LFXO_AMPLITUDECTRL_PDCTRL_Pos (24UL)       /*!< Position of PDCTRL field.                                            */
  #define LFXO_AMPLITUDECTRL_PDCTRL_Msk (0x1UL << LFXO_AMPLITUDECTRL_PDCTRL_Pos) /*!< Bit mask of PDCTRL field.                */
  #define LFXO_AMPLITUDECTRL_PDCTRL_Min (0x0UL)      /*!< Min enumerator value of PDCTRL field.                                */
  #define LFXO_AMPLITUDECTRL_PDCTRL_Max (0x1UL)      /*!< Max enumerator value of PDCTRL field.                                */
  #define LFXO_AMPLITUDECTRL_PDCTRL_Disabled (0x0UL) /*!< Peak detector disabled                                               */
  #define LFXO_AMPLITUDECTRL_PDCTRL_Enabled (0x1UL)  /*!< Peak detector enabled                                                */


