adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LFXO_PWRUPCTRL: Power up control */
  #define LFXO_PWRUPCTRL_ResetValue (0x00000000UL)   /*!< Reset value of PWRUPCTRL register.                                   */

/* CTRL @Bits 0..1 : Power up control */
  #define LFXO_PWRUPCTRL_CTRL_Pos (0UL)              /*!< Position of CTRL field.                                              */
  #define LFXO_PWRUPCTRL_CTRL_Msk (0x3UL << LFXO_PWRUPCTRL_CTRL_Pos) /*!< Bit mask of CTRL field.                              */
  #define LFXO_PWRUPCTRL_CTRL_Min (0x0UL)            /*!< Min enumerator value of CTRL field.                                  */
  #define LFXO_PWRUPCTRL_CTRL_Max (0x2UL)            /*!< Max enumerator value of CTRL field.                                  */
  #define LFXO_PWRUPCTRL_CTRL_Auto (0x0UL)           /*!< Automatically handled by the peripheral                              */
  #define LFXO_PWRUPCTRL_CTRL_PowerUp (0x1UL)        /*!< Power up                                                             */
  #define LFXO_PWRUPCTRL_CTRL_PowerDown (0x2UL)      /*!< Power down                                                           */


/* LFXO_MODE: LFXO mode */
  #define LFXO_MODE_ResetValue (0x00000000UL)        /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..1 : Mode */
  #define LFXO_MODE_MODE_Pos (0UL)                   /*!< Position of MODE field.                                              */
  #define LFXO_MODE_MODE_Msk (0x3UL << LFXO_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                        */
  #define LFXO_MODE_MODE_Min (0x0UL)                 /*!< Min enumerator value of MODE field.                                  */
  #define LFXO_MODE_MODE_Max (0x3UL)                 /*!< Max enumerator value of MODE field.                                  */
  #define LFXO_MODE_MODE_Pierce (0x0UL)              /*!< Pierce mode                                                          */
  #define LFXO_MODE_MODE_Pixo (0x1UL)                /*!< PIXO mode                                                            */
  #define LFXO_MODE_MODE_ExternalSine (0x2UL)        /*!< External sine wave clock                                             */
  #define LFXO_MODE_MODE_ExternalSquare (0x3UL)      /*!< External square wave clock                                           */

/* HPMODE @Bit 4 : High performance mode */
  #define LFXO_MODE_HPMODE_Pos (4UL)                 /*!< Position of HPMODE field.                                            */
  #define LFXO_MODE_HPMODE_Msk (0x1UL << LFXO_MODE_HPMODE_Pos) /*!< Bit mask of HPMODE field.                                  */
  #define LFXO_MODE_HPMODE_Min (0x0UL)               /*!< Min enumerator value of HPMODE field.                                */
  #define LFXO_MODE_HPMODE_Max (0x1UL)               /*!< Max enumerator value of HPMODE field.                                */
  #define LFXO_MODE_HPMODE_Disabled (0x0UL)          /*!< Disable high performance mode                                        */
  #define LFXO_MODE_HPMODE_Enabled (0x1UL)           /*!< Enable high performance mode                                         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          LPCOMP                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct LPCOMP_OVERRIDE ================================================== */
/**
  * @brief OVERRIDE [LPCOMP_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signals to the analog modules      */
  __IOM uint32_t  CONFIGVOLTLVL;                     /*!< (@ 0x00000004) Override LPCMP_INSEL_RET_0V8 and GPCMP_CTRL_RET_0V8[0]*/
} NRF_LPCOMP_OVERRIDE_Type;                          /*!< Size = 8 (0x008)                                                     */

/* LPCOMP_OVERRIDE_PWRUP: Override the PWRUP signals to the analog modules */
  #define LPCOMP_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                  */

/* WUCMP @Bit 0 : Override value for PWRUP_LPCMP_AO_0V8 */
  #define LPCOMP_OVERRIDE_PWRUP_WUCMP_Pos (0UL)      /*!< Position of WUCMP field.                                             */
  #define LPCOMP_OVERRIDE_PWRUP_WUCMP_Msk (0x1UL << LPCOMP_OVERRIDE_PWRUP_WUCMP_Pos) /*!< Bit mask of WUCMP field.             */

/* GPCMP @Bit 1 : Override value for PWRUP_GPCMP_AO_0V8 */
  #define LPCOMP_OVERRIDE_PWRUP_GPCMP_Pos (1UL)      /*!< Position of GPCMP field.                                             */
  #define LPCOMP_OVERRIDE_PWRUP_GPCMP_Msk (0x1UL << LPCOMP_OVERRIDE_PWRUP_GPCMP_Pos) /*!< Bit mask of GPCMP field.             */

/* EN @Bit 31 : Enable the overrides */
  #define LPCOMP_OVERRIDE_PWRUP_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define LPCOMP_OVERRIDE_PWRUP_EN_Msk (0x1UL << LPCOMP_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                      */
  #define LPCOMP_OVERRIDE_PWRUP_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define LPCOMP_OVERRIDE_PWRUP_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define LPCOMP_OVERRIDE_PWRUP_EN_Disabled (0x0UL)  /*!< Overrides are disabled                                               */
  #define LPCOMP_OVERRIDE_PWRUP_EN_Enabled (0x1UL)   /*!< Overrides are enabled                                                */


/* LPCOMP_OVERRIDE_CONFIGVOLTLVL: Override LPCMP_INSEL_RET_0V8 and GPCMP_CTRL_RET_0V8[0] */
  #define LPCOMP_OVERRIDE_CONFIGVOLTLVL_ResetValue (0x00000000UL) /*!< Reset value of CONFIGVOLTLVL register.                  */

/* VAL @Bit 0 : Override value for the signal */
  #define LPCOMP_OVERRIDE_CONFIGVOLTLVL_VAL_Pos (0UL) /*!< Position of VAL field.                                              */
  #define LPCOMP_OVERRIDE_CONFIGVOLTLVL_VAL_Msk (0x1UL << LPCOMP_OVERRIDE_CONFIGVOLTLVL_VAL_Pos) /*!< Bit mask of VAL field.   */

/* EN @Bit 31 : Enable the override */
  #define LPCOMP_OVERRIDE_CONFIGVOLTLVL_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define LPCOMP_OVERRIDE_CONFIGVOLTLVL_EN_Msk (0x1UL << LPCOMP_OVERRIDE_CONFIGVOLTLVL_EN_Pos) /*!< Bit mask of EN field.      */
  #define LPCOMP_OVERRIDE_CONFIGVOLTLVL_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define LPCOMP_OVERRIDE_CONFIGVOLTLVL_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define LPCOMP_OVERRIDE_CONFIGVOLTLVL_EN_Disabled (0x0UL) /*!< Override is disabled                                          */
  #define LPCOMP_OVERRIDE_CONFIGVOLTLVL_EN_Enabled (0x1UL) /*!< Override is enabled                                            */



/* ==================================================== Struct LPCOMP_DFT ==================================================== */
/**
  * @brief DFT [LPCOMP_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IM  uint32_t  RESERVED[3];
  __IOM uint32_t  DTBCONFIG;                         /*!< (@ 0x00000010) Digital Test Bus (DTB0-3) configuration               */
} NRF_LPCOMP_DFT_Type;                               /*!< Size = 20 (0x014)                                                    */

/* LPCOMP_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define LPCOMP_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                             */

