adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ENABLE1 @Bit 1 : Request power domain[1] ON */
  #define LRCCONF_OTHERON_ENABLE1_Pos (1UL)          /*!< Position of ENABLE1 field.                                           */
  #define LRCCONF_OTHERON_ENABLE1_Msk (0x1UL << LRCCONF_OTHERON_ENABLE1_Pos) /*!< Bit mask of ENABLE1 field.                   */
  #define LRCCONF_OTHERON_ENABLE1_Min (0x0UL)        /*!< Min enumerator value of ENABLE1 field.                               */
  #define LRCCONF_OTHERON_ENABLE1_Max (0x1UL)        /*!< Max enumerator value of ENABLE1 field.                               */
  #define LRCCONF_OTHERON_ENABLE1_Automatic (0x0UL)  /*!< Automatic power control enabled                                      */
  #define LRCCONF_OTHERON_ENABLE1_AlwaysOn (0x1UL)   /*!< Request to keep the other power domain ON even though there is no
                                                          request*/                                                               

/* ENABLE2 @Bit 2 : Request power domain[2] ON */
  #define LRCCONF_OTHERON_ENABLE2_Pos (2UL)          /*!< Position of ENABLE2 field.                                           */
  #define LRCCONF_OTHERON_ENABLE2_Msk (0x1UL << LRCCONF_OTHERON_ENABLE2_Pos) /*!< Bit mask of ENABLE2 field.                   */
  #define LRCCONF_OTHERON_ENABLE2_Min (0x0UL)        /*!< Min enumerator value of ENABLE2 field.                               */
  #define LRCCONF_OTHERON_ENABLE2_Max (0x1UL)        /*!< Max enumerator value of ENABLE2 field.                               */
  #define LRCCONF_OTHERON_ENABLE2_Automatic (0x0UL)  /*!< Automatic power control enabled                                      */
  #define LRCCONF_OTHERON_ENABLE2_AlwaysOn (0x1UL)   /*!< Request to keep the other power domain ON even though there is no
                                                          request*/                                                               

/* ENABLE3 @Bit 3 : Request power domain[3] ON */
  #define LRCCONF_OTHERON_ENABLE3_Pos (3UL)          /*!< Position of ENABLE3 field.                                           */
  #define LRCCONF_OTHERON_ENABLE3_Msk (0x1UL << LRCCONF_OTHERON_ENABLE3_Pos) /*!< Bit mask of ENABLE3 field.                   */
  #define LRCCONF_OTHERON_ENABLE3_Min (0x0UL)        /*!< Min enumerator value of ENABLE3 field.                               */
  #define LRCCONF_OTHERON_ENABLE3_Max (0x1UL)        /*!< Max enumerator value of ENABLE3 field.                               */
  #define LRCCONF_OTHERON_ENABLE3_Automatic (0x0UL)  /*!< Automatic power control enabled                                      */
  #define LRCCONF_OTHERON_ENABLE3_AlwaysOn (0x1UL)   /*!< Request to keep the other power domain ON even though there is no
                                                          request*/                                                               

/* ENABLE4 @Bit 4 : Request power domain[4] ON */
  #define LRCCONF_OTHERON_ENABLE4_Pos (4UL)          /*!< Position of ENABLE4 field.                                           */
  #define LRCCONF_OTHERON_ENABLE4_Msk (0x1UL << LRCCONF_OTHERON_ENABLE4_Pos) /*!< Bit mask of ENABLE4 field.                   */
  #define LRCCONF_OTHERON_ENABLE4_Min (0x0UL)        /*!< Min enumerator value of ENABLE4 field.                               */
  #define LRCCONF_OTHERON_ENABLE4_Max (0x1UL)        /*!< Max enumerator value of ENABLE4 field.                               */
  #define LRCCONF_OTHERON_ENABLE4_Automatic (0x0UL)  /*!< Automatic power control enabled                                      */
  #define LRCCONF_OTHERON_ENABLE4_AlwaysOn (0x1UL)   /*!< Request to keep the other power domain ON even though there is no
                                                          request*/                                                               

/* ENABLE5 @Bit 5 : Request power domain[5] ON */
  #define LRCCONF_OTHERON_ENABLE5_Pos (5UL)          /*!< Position of ENABLE5 field.                                           */
  #define LRCCONF_OTHERON_ENABLE5_Msk (0x1UL << LRCCONF_OTHERON_ENABLE5_Pos) /*!< Bit mask of ENABLE5 field.                   */
  #define LRCCONF_OTHERON_ENABLE5_Min (0x0UL)        /*!< Min enumerator value of ENABLE5 field.                               */
  #define LRCCONF_OTHERON_ENABLE5_Max (0x1UL)        /*!< Max enumerator value of ENABLE5 field.                               */
  #define LRCCONF_OTHERON_ENABLE5_Automatic (0x0UL)  /*!< Automatic power control enabled                                      */
  #define LRCCONF_OTHERON_ENABLE5_AlwaysOn (0x1UL)   /*!< Request to keep the other power domain ON even though there is no
                                                          request*/                                                               

/* ENABLE6 @Bit 6 : Request power domain[6] ON */
  #define LRCCONF_OTHERON_ENABLE6_Pos (6UL)          /*!< Position of ENABLE6 field.                                           */
  #define LRCCONF_OTHERON_ENABLE6_Msk (0x1UL << LRCCONF_OTHERON_ENABLE6_Pos) /*!< Bit mask of ENABLE6 field.                   */
  #define LRCCONF_OTHERON_ENABLE6_Min (0x0UL)        /*!< Min enumerator value of ENABLE6 field.                               */
  #define LRCCONF_OTHERON_ENABLE6_Max (0x1UL)        /*!< Max enumerator value of ENABLE6 field.                               */
  #define LRCCONF_OTHERON_ENABLE6_Automatic (0x0UL)  /*!< Automatic power control enabled                                      */
  #define LRCCONF_OTHERON_ENABLE6_AlwaysOn (0x1UL)   /*!< Request to keep the other power domain ON even though there is no
                                                          request*/                                                               

/* ENABLE7 @Bit 7 : Request power domain[7] ON */
  #define LRCCONF_OTHERON_ENABLE7_Pos (7UL)          /*!< Position of ENABLE7 field.                                           */
  #define LRCCONF_OTHERON_ENABLE7_Msk (0x1UL << LRCCONF_OTHERON_ENABLE7_Pos) /*!< Bit mask of ENABLE7 field.                   */
  #define LRCCONF_OTHERON_ENABLE7_Min (0x0UL)        /*!< Min enumerator value of ENABLE7 field.                               */
  #define LRCCONF_OTHERON_ENABLE7_Max (0x1UL)        /*!< Max enumerator value of ENABLE7 field.                               */
  #define LRCCONF_OTHERON_ENABLE7_Automatic (0x0UL)  /*!< Automatic power control enabled                                      */
  #define LRCCONF_OTHERON_ENABLE7_AlwaysOn (0x1UL)   /*!< Request to keep the other power domain ON even though there is no
                                                          request*/                                                               

/* ENABLE8 @Bit 8 : Request power domain[8] ON */
  #define LRCCONF_OTHERON_ENABLE8_Pos (8UL)          /*!< Position of ENABLE8 field.                                           */
  #define LRCCONF_OTHERON_ENABLE8_Msk (0x1UL << LRCCONF_OTHERON_ENABLE8_Pos) /*!< Bit mask of ENABLE8 field.                   */
  #define LRCCONF_OTHERON_ENABLE8_Min (0x0UL)        /*!< Min enumerator value of ENABLE8 field.                               */
  #define LRCCONF_OTHERON_ENABLE8_Max (0x1UL)        /*!< Max enumerator value of ENABLE8 field.                               */
  #define LRCCONF_OTHERON_ENABLE8_Automatic (0x0UL)  /*!< Automatic power control enabled                                      */
  #define LRCCONF_OTHERON_ENABLE8_AlwaysOn (0x1UL)   /*!< Request to keep the other power domain ON even though there is no
                                                          request*/                                                               

/* ENABLE9 @Bit 9 : Request power domain[9] ON */
  #define LRCCONF_OTHERON_ENABLE9_Pos (9UL)          /*!< Position of ENABLE9 field.                                           */
  #define LRCCONF_OTHERON_ENABLE9_Msk (0x1UL << LRCCONF_OTHERON_ENABLE9_Pos) /*!< Bit mask of ENABLE9 field.                   */
  #define LRCCONF_OTHERON_ENABLE9_Min (0x0UL)        /*!< Min enumerator value of ENABLE9 field.                               */
  #define LRCCONF_OTHERON_ENABLE9_Max (0x1UL)        /*!< Max enumerator value of ENABLE9 field.                               */
  #define LRCCONF_OTHERON_ENABLE9_Automatic (0x0UL)  /*!< Automatic power control enabled                                      */
  #define LRCCONF_OTHERON_ENABLE9_AlwaysOn (0x1UL)   /*!< Request to keep the other power domain ON even though there is no
                                                          request*/                                                               

/* ENABLE10 @Bit 10 : Request power domain[10] ON */
  #define LRCCONF_OTHERON_ENABLE10_Pos (10UL)        /*!< Position of ENABLE10 field.                                          */
  #define LRCCONF_OTHERON_ENABLE10_Msk (0x1UL << LRCCONF_OTHERON_ENABLE10_Pos) /*!< Bit mask of ENABLE10 field.                */
  #define LRCCONF_OTHERON_ENABLE10_Min (0x0UL)       /*!< Min enumerator value of ENABLE10 field.                              */
  #define LRCCONF_OTHERON_ENABLE10_Max (0x1UL)       /*!< Max enumerator value of ENABLE10 field.                              */
  #define LRCCONF_OTHERON_ENABLE10_Automatic (0x0UL) /*!< Automatic power control enabled                                      */
  #define LRCCONF_OTHERON_ENABLE10_AlwaysOn (0x1UL)  /*!< Request to keep the other power domain ON even though there is no
                                                          request*/                                                               

/* ENABLE11 @Bit 11 : Request power domain[11] ON */
  #define LRCCONF_OTHERON_ENABLE11_Pos (11UL)        /*!< Position of ENABLE11 field.                                          */
  #define LRCCONF_OTHERON_ENABLE11_Msk (0x1UL << LRCCONF_OTHERON_ENABLE11_Pos) /*!< Bit mask of ENABLE11 field.                */
  #define LRCCONF_OTHERON_ENABLE11_Min (0x0UL)       /*!< Min enumerator value of ENABLE11 field.                              */
  #define LRCCONF_OTHERON_ENABLE11_Max (0x1UL)       /*!< Max enumerator value of ENABLE11 field.                              */
  #define LRCCONF_OTHERON_ENABLE11_Automatic (0x0UL) /*!< Automatic power control enabled                                      */
  #define LRCCONF_OTHERON_ENABLE11_AlwaysOn (0x1UL)  /*!< Request to keep the other power domain ON even though there is no
                                                          request*/                                                               

/* ENABLE12 @Bit 12 : Request power domain[12] ON */
  #define LRCCONF_OTHERON_ENABLE12_Pos (12UL)        /*!< Position of ENABLE12 field.                                          */
  #define LRCCONF_OTHERON_ENABLE12_Msk (0x1UL << LRCCONF_OTHERON_ENABLE12_Pos) /*!< Bit mask of ENABLE12 field.                */
  #define LRCCONF_OTHERON_ENABLE12_Min (0x0UL)       /*!< Min enumerator value of ENABLE12 field.                              */
  #define LRCCONF_OTHERON_ENABLE12_Max (0x1UL)       /*!< Max enumerator value of ENABLE12 field.                              */
  #define LRCCONF_OTHERON_ENABLE12_Automatic (0x0UL) /*!< Automatic power control enabled                                      */
  #define LRCCONF_OTHERON_ENABLE12_AlwaysOn (0x1UL)  /*!< Request to keep the other power domain ON even though there is no
                                                          request*/                                                               

/* ENABLE13 @Bit 13 : Request power domain[13] ON */
  #define LRCCONF_OTHERON_ENABLE13_Pos (13UL)        /*!< Position of ENABLE13 field.                                          */
  #define LRCCONF_OTHERON_ENABLE13_Msk (0x1UL << LRCCONF_OTHERON_ENABLE13_Pos) /*!< Bit mask of ENABLE13 field.                */
  #define LRCCONF_OTHERON_ENABLE13_Min (0x0UL)       /*!< Min enumerator value of ENABLE13 field.                              */
  #define LRCCONF_OTHERON_ENABLE13_Max (0x1UL)       /*!< Max enumerator value of ENABLE13 field.                              */
  #define LRCCONF_OTHERON_ENABLE13_Automatic (0x0UL) /*!< Automatic power control enabled                                      */
  #define LRCCONF_OTHERON_ENABLE13_AlwaysOn (0x1UL)  /*!< Request to keep the other power domain ON even though there is no
                                                          request*/                                                               

/* ENABLE14 @Bit 14 : Request power domain[14] ON */
  #define LRCCONF_OTHERON_ENABLE14_Pos (14UL)        /*!< Position of ENABLE14 field.                                          */
  #define LRCCONF_OTHERON_ENABLE14_Msk (0x1UL << LRCCONF_OTHERON_ENABLE14_Pos) /*!< Bit mask of ENABLE14 field.                */
  #define LRCCONF_OTHERON_ENABLE14_Min (0x0UL)       /*!< Min enumerator value of ENABLE14 field.                              */
  #define LRCCONF_OTHERON_ENABLE14_Max (0x1UL)       /*!< Max enumerator value of ENABLE14 field.                              */
  #define LRCCONF_OTHERON_ENABLE14_Automatic (0x0UL) /*!< Automatic power control enabled                                      */
  #define LRCCONF_OTHERON_ENABLE14_AlwaysOn (0x1UL)  /*!< Request to keep the other power domain ON even though there is no
                                                          request*/                                                               

