adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ENABLE15 @Bit 15 : Request power domain[15] ON */
  #define LRCCONF_OTHERON_ENABLE15_Pos (15UL)        /*!< Position of ENABLE15 field.                                          */
  #define LRCCONF_OTHERON_ENABLE15_Msk (0x1UL << LRCCONF_OTHERON_ENABLE15_Pos) /*!< Bit mask of ENABLE15 field.                */
  #define LRCCONF_OTHERON_ENABLE15_Min (0x0UL)       /*!< Min enumerator value of ENABLE15 field.                              */
  #define LRCCONF_OTHERON_ENABLE15_Max (0x1UL)       /*!< Max enumerator value of ENABLE15 field.                              */
  #define LRCCONF_OTHERON_ENABLE15_Automatic (0x0UL) /*!< Automatic power control enabled                                      */
  #define LRCCONF_OTHERON_ENABLE15_AlwaysOn (0x1UL)  /*!< Request to keep the other power domain ON even though there is no
                                                          request*/                                                               


/* LRCCONF_AX2XWAITSTATES: AX2X bridge waitstates for the domain [n], where n is the Domain ID. */
  #define LRCCONF_AX2XWAITSTATES_MaxCount (16UL)     /*!< Max size of AX2XWAITSTATES[16] array.                                */
  #define LRCCONF_AX2XWAITSTATES_ResetValue (0x00000007UL) /*!< Reset value of AX2XWAITSTATES[16] register.                    */

/* WAITSTATES @Bits 0..2 : Number of waitstates */
  #define LRCCONF_AX2XWAITSTATES_WAITSTATES_Pos (0UL) /*!< Position of WAITSTATES field.                                       */
  #define LRCCONF_AX2XWAITSTATES_WAITSTATES_Msk (0x7UL << LRCCONF_AX2XWAITSTATES_WAITSTATES_Pos) /*!< Bit mask of WAITSTATES
                                                                            field.*/                                              


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           MBIAS                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct MBIAS_CONFIG =================================================== */
/**
  * @brief CONFIG [MBIAS_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000000) MBIAS configuration                                   */
} NRF_MBIAS_CONFIG_Type;                             /*!< Size = 4 (0x004)                                                     */

/* MBIAS_CONFIG_CFG: MBIAS configuration */
  #define MBIAS_CONFIG_CFG_ResetValue (0x00000000UL) /*!< Reset value of CFG register.                                         */

/* DOUBLEACQ @Bit 0 : Double the acquisition time in refresh mode */
  #define MBIAS_CONFIG_CFG_DOUBLEACQ_Pos (0UL)       /*!< Position of DOUBLEACQ field.                                         */
  #define MBIAS_CONFIG_CFG_DOUBLEACQ_Msk (0x1UL << MBIAS_CONFIG_CFG_DOUBLEACQ_Pos) /*!< Bit mask of DOUBLEACQ field.           */
  #define MBIAS_CONFIG_CFG_DOUBLEACQ_Min (0x0UL)     /*!< Min enumerator value of DOUBLEACQ field.                             */
  #define MBIAS_CONFIG_CFG_DOUBLEACQ_Max (0x1UL)     /*!< Max enumerator value of DOUBLEACQ field.                             */
  #define MBIAS_CONFIG_CFG_DOUBLEACQ_Disabled (0x0UL) /*!< Double the acquisition time in refresh modet is disabled            */
  #define MBIAS_CONFIG_CFG_DOUBLEACQ_Enabled (0x1UL) /*!< Double the acquisition time in refresh mode is enabled               */



/* ==================================================== Struct MBIAS_TRIM ==================================================== */
/**
  * @brief TRIM [MBIAS_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MBIASIBPP;                         /*!< (@ 0x00000000) IBPP current trimming                                 */
  __IOM uint32_t  MBIASIBPSR;                        /*!< (@ 0x00000004) IBPSR current and VREF voltage trimming               */
  __IM  uint32_t  RESERVED;
} NRF_MBIAS_TRIM_Type;                               /*!< Size = 12 (0x00C)                                                    */

/* MBIAS_TRIM_MBIASIBPP: IBPP current trimming */
  #define MBIAS_TRIM_MBIASIBPP_ResetValue (0x00000001UL) /*!< Reset value of MBIASIBPP register.                               */

/* VAL @Bits 0..2 : IBPP Current trimming value */
  #define MBIAS_TRIM_MBIASIBPP_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define MBIAS_TRIM_MBIASIBPP_VAL_Msk (0x7UL << MBIAS_TRIM_MBIASIBPP_VAL_Pos) /*!< Bit mask of VAL field.                     */
  #define MBIAS_TRIM_MBIASIBPP_VAL_Min (0x0UL)       /*!< Min enumerator value of VAL field.                                   */
  #define MBIAS_TRIM_MBIASIBPP_VAL_Max (0x7UL)       /*!< Max enumerator value of VAL field.                                   */
  #define MBIAS_TRIM_MBIASIBPP_VAL_Normal (0x0UL)    /*!< Normal trim value                                                    */
  #define MBIAS_TRIM_MBIASIBPP_VAL_Val23 (0x1UL)     /*!< The trim value is 23 percent                                         */
  #define MBIAS_TRIM_MBIASIBPP_VAL_Val54 (0x2UL)     /*!< The trim value is 54 percent                                         */
  #define MBIAS_TRIM_MBIASIBPP_VAL_Val98 (0x3UL)     /*!< The trim value is 98 percent                                         */
  #define MBIAS_TRIM_MBIASIBPP_VAL_ValNeg51 (0x4UL)  /*!< The trim value is -51 percent                                        */
  #define MBIAS_TRIM_MBIASIBPP_VAL_ValNeg42 (0x5UL)  /*!< The trim value is -42 percent                                        */
  #define MBIAS_TRIM_MBIASIBPP_VAL_ValNeg31 (0x6UL)  /*!< The trim value is -31 percent                                        */
  #define MBIAS_TRIM_MBIASIBPP_VAL_ValNeg18 (0x7UL)  /*!< The trim value is -18 percent                                        */


/* MBIAS_TRIM_MBIASIBPSR: IBPSR current and VREF voltage trimming */
  #define MBIAS_TRIM_MBIASIBPSR_ResetValue (0x00000000UL) /*!< Reset value of MBIASIBPSR register.                             */

/* VAL @Bits 0..4 : IBPSR current and VREF voltage trimming value */
  #define MBIAS_TRIM_MBIASIBPSR_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define MBIAS_TRIM_MBIASIBPSR_VAL_Msk (0x1FUL << MBIAS_TRIM_MBIASIBPSR_VAL_Pos) /*!< Bit mask of VAL field.                  */
  #define MBIAS_TRIM_MBIASIBPSR_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                            */
  #define MBIAS_TRIM_MBIASIBPSR_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                             */



/* ================================================== Struct MBIAS_OVERRIDE ================================================== */
/**
  * @brief OVERRIDE [MBIAS_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUPIBPP;                         /*!< (@ 0x00000000) Override the PWRUP_IBPP signal to the analog module   */
  __IOM uint32_t  PWRUPIBPSR;                        /*!< (@ 0x00000004) Override the PWRUP_IBPSR signal to the analog module  */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000008) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  MODE;                              /*!< (@ 0x0000000C) Override the MODE signal to the analog module         */
  __IOM uint32_t  READYIBPP;                         /*!< (@ 0x00000010) Override the READY_IBPP signal from the analog module */
  __IOM uint32_t  READYIBPSR;                        /*!< (@ 0x00000014) Override the READY_IBPSR signal from the analog module*/
  __IOM uint32_t  SETTLEDIBPSR;                      /*!< (@ 0x00000018) Override the SETTLED_IBPSR signal from the analog
                                                                         module*/                                                 
} NRF_MBIAS_OVERRIDE_Type;                           /*!< Size = 28 (0x01C)                                                    */

