adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SELMUX @Bits 0..1 : Select multiplexer for ATB0 */
  #define MBIAS_DFT_ATB0CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define MBIAS_DFT_ATB0CONFIG_SELMUX_Msk (0x3UL << MBIAS_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define MBIAS_DFT_ATB0CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define MBIAS_DFT_ATB0CONFIG_SELMUX_Max (0x3UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define MBIAS_DFT_ATB0CONFIG_SELMUX_None (0x0UL)   /*!< None selected                                                        */
  #define MBIAS_DFT_ATB0CONFIG_SELMUX_ConnectAVSS (0x1UL) /*!< Connect AVSS                                                    */
  #define MBIAS_DFT_ATB0CONFIG_SELMUX_Connect8uAIBPSRcurrent (0x2UL) /*!< Connect 8uA IBPSR current                            */
  #define MBIAS_DFT_ATB0CONFIG_SELMUX_Connect50nAIBPPcurrent (0x3UL) /*!< Connect 50nA IBPP current                            */

/* EN @Bit 31 : Enable the analog test bus */
  #define MBIAS_DFT_ATB0CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define MBIAS_DFT_ATB0CONFIG_EN_Msk (0x1UL << MBIAS_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define MBIAS_DFT_ATB0CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define MBIAS_DFT_ATB0CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define MBIAS_DFT_ATB0CONFIG_EN_Disabled (0x0UL)   /*!< Analog test bus is disabled                                          */
  #define MBIAS_DFT_ATB0CONFIG_EN_Enabled (0x1UL)    /*!< Analog test bus is enabled                                           */


/* MBIAS_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define MBIAS_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                              */

/* SELMUX @Bit 0 : Select multiplexer for ATB1 */
  #define MBIAS_DFT_ATB1CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define MBIAS_DFT_ATB1CONFIG_SELMUX_Msk (0x1UL << MBIAS_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define MBIAS_DFT_ATB1CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define MBIAS_DFT_ATB1CONFIG_SELMUX_Max (0x1UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define MBIAS_DFT_ATB1CONFIG_SELMUX_ConnectbufVREF0V9RFR (0x0UL) /*!< Connect buffered VREF_0V9_RFR                          */
  #define MBIAS_DFT_ATB1CONFIG_SELMUX_ConnectbufVREF0V9 (0x1UL) /*!< Connect buffered VREF_0V9                                 */

/* EN @Bit 31 : Enable the analog test bus */
  #define MBIAS_DFT_ATB1CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define MBIAS_DFT_ATB1CONFIG_EN_Msk (0x1UL << MBIAS_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define MBIAS_DFT_ATB1CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define MBIAS_DFT_ATB1CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define MBIAS_DFT_ATB1CONFIG_EN_Disabled (0x0UL)   /*!< Analog test bus is disabled                                          */
  #define MBIAS_DFT_ATB1CONFIG_EN_Enabled (0x1UL)    /*!< Analog test bus is enabled                                           */


/* MBIAS_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define MBIAS_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                              */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB0 */
  #define MBIAS_DFT_DTB0CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define MBIAS_DFT_DTB0CONFIG_SELMUX_Msk (0x3UL << MBIAS_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define MBIAS_DFT_DTB0CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define MBIAS_DFT_DTB0CONFIG_SELMUX_Max (0x3UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define MBIAS_DFT_DTB0CONFIG_SELMUX_READYIBPP (0x0UL) /*!< READYIBPP selected                                                */
  #define MBIAS_DFT_DTB0CONFIG_SELMUX_READYIBPSR (0x1UL) /*!< READYIBPSR selected                                              */
  #define MBIAS_DFT_DTB0CONFIG_SELMUX_SETTLEDIBPSRDIG (0x2UL) /*!< SETTLEDIBPSRDIG selected                                    */
  #define MBIAS_DFT_DTB0CONFIG_SELMUX_SETTLEDIBPSRANA (0x3UL) /*!< SETTLEDIBPSRANA selected                                    */

/* EN @Bit 31 : Enable the digital test bus */
  #define MBIAS_DFT_DTB0CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define MBIAS_DFT_DTB0CONFIG_EN_Msk (0x1UL << MBIAS_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define MBIAS_DFT_DTB0CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define MBIAS_DFT_DTB0CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define MBIAS_DFT_DTB0CONFIG_EN_Disabled (0x0UL)   /*!< Digital test bus is disabled                                         */
  #define MBIAS_DFT_DTB0CONFIG_EN_Enabled (0x1UL)    /*!< Digital test bus is enabled                                          */


/* MBIAS_DFT_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define MBIAS_DFT_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                              */

/* SELMUX @Bit 0 : Select multiplexer for DTB1 */
  #define MBIAS_DFT_DTB1CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define MBIAS_DFT_DTB1CONFIG_SELMUX_Msk (0x1UL << MBIAS_DFT_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define MBIAS_DFT_DTB1CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define MBIAS_DFT_DTB1CONFIG_SELMUX_Max (0x1UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define MBIAS_DFT_DTB1CONFIG_SELMUX_OSCRFRANA (0x0UL) /*!< OSCRFRANA selected                                                */
  #define MBIAS_DFT_DTB1CONFIG_SELMUX_SETTLEDIBPSR (0x1UL) /*!< SETTLEDIBPSR selected                                          */

