adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* READYIBPSR @Bit 1 : Enable or disable interrupt for event READYIBPSR */
  #define MBIAS_INTEN_READYIBPSR_Pos (1UL)           /*!< Position of READYIBPSR field.                                        */
  #define MBIAS_INTEN_READYIBPSR_Msk (0x1UL << MBIAS_INTEN_READYIBPSR_Pos) /*!< Bit mask of READYIBPSR field.                  */
  #define MBIAS_INTEN_READYIBPSR_Min (0x0UL)         /*!< Min enumerator value of READYIBPSR field.                            */
  #define MBIAS_INTEN_READYIBPSR_Max (0x1UL)         /*!< Max enumerator value of READYIBPSR field.                            */
  #define MBIAS_INTEN_READYIBPSR_Disabled (0x0UL)    /*!< Disable                                                              */
  #define MBIAS_INTEN_READYIBPSR_Enabled (0x1UL)     /*!< Enable                                                               */


/* MBIAS_INTENSET: Enable interrupt */
  #define MBIAS_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* READYIBPP @Bit 0 : Write '1' to enable interrupt for event READYIBPP */
  #define MBIAS_INTENSET_READYIBPP_Pos (0UL)         /*!< Position of READYIBPP field.                                         */
  #define MBIAS_INTENSET_READYIBPP_Msk (0x1UL << MBIAS_INTENSET_READYIBPP_Pos) /*!< Bit mask of READYIBPP field.               */
  #define MBIAS_INTENSET_READYIBPP_Min (0x0UL)       /*!< Min enumerator value of READYIBPP field.                             */
  #define MBIAS_INTENSET_READYIBPP_Max (0x1UL)       /*!< Max enumerator value of READYIBPP field.                             */
  #define MBIAS_INTENSET_READYIBPP_Set (0x1UL)       /*!< Enable                                                               */
  #define MBIAS_INTENSET_READYIBPP_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define MBIAS_INTENSET_READYIBPP_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* READYIBPSR @Bit 1 : Write '1' to enable interrupt for event READYIBPSR */
  #define MBIAS_INTENSET_READYIBPSR_Pos (1UL)        /*!< Position of READYIBPSR field.                                        */
  #define MBIAS_INTENSET_READYIBPSR_Msk (0x1UL << MBIAS_INTENSET_READYIBPSR_Pos) /*!< Bit mask of READYIBPSR field.            */
  #define MBIAS_INTENSET_READYIBPSR_Min (0x0UL)      /*!< Min enumerator value of READYIBPSR field.                            */
  #define MBIAS_INTENSET_READYIBPSR_Max (0x1UL)      /*!< Max enumerator value of READYIBPSR field.                            */
  #define MBIAS_INTENSET_READYIBPSR_Set (0x1UL)      /*!< Enable                                                               */
  #define MBIAS_INTENSET_READYIBPSR_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MBIAS_INTENSET_READYIBPSR_Enabled (0x1UL)  /*!< Read: Enabled                                                        */


/* MBIAS_INTENCLR: Disable interrupt */
  #define MBIAS_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* READYIBPP @Bit 0 : Write '1' to disable interrupt for event READYIBPP */
  #define MBIAS_INTENCLR_READYIBPP_Pos (0UL)         /*!< Position of READYIBPP field.                                         */
  #define MBIAS_INTENCLR_READYIBPP_Msk (0x1UL << MBIAS_INTENCLR_READYIBPP_Pos) /*!< Bit mask of READYIBPP field.               */
  #define MBIAS_INTENCLR_READYIBPP_Min (0x0UL)       /*!< Min enumerator value of READYIBPP field.                             */
  #define MBIAS_INTENCLR_READYIBPP_Max (0x1UL)       /*!< Max enumerator value of READYIBPP field.                             */
  #define MBIAS_INTENCLR_READYIBPP_Clear (0x1UL)     /*!< Disable                                                              */
  #define MBIAS_INTENCLR_READYIBPP_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define MBIAS_INTENCLR_READYIBPP_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* READYIBPSR @Bit 1 : Write '1' to disable interrupt for event READYIBPSR */
  #define MBIAS_INTENCLR_READYIBPSR_Pos (1UL)        /*!< Position of READYIBPSR field.                                        */
  #define MBIAS_INTENCLR_READYIBPSR_Msk (0x1UL << MBIAS_INTENCLR_READYIBPSR_Pos) /*!< Bit mask of READYIBPSR field.            */
  #define MBIAS_INTENCLR_READYIBPSR_Min (0x0UL)      /*!< Min enumerator value of READYIBPSR field.                            */
  #define MBIAS_INTENCLR_READYIBPSR_Max (0x1UL)      /*!< Max enumerator value of READYIBPSR field.                            */
  #define MBIAS_INTENCLR_READYIBPSR_Clear (0x1UL)    /*!< Disable                                                              */
  #define MBIAS_INTENCLR_READYIBPSR_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MBIAS_INTENCLR_READYIBPSR_Enabled (0x1UL)  /*!< Read: Enabled                                                        */


/* MBIAS_INTPEND: Pending interrupts */
  #define MBIAS_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* READYIBPP @Bit 0 : Read pending status of interrupt for event READYIBPP */
  #define MBIAS_INTPEND_READYIBPP_Pos (0UL)          /*!< Position of READYIBPP field.                                         */
  #define MBIAS_INTPEND_READYIBPP_Msk (0x1UL << MBIAS_INTPEND_READYIBPP_Pos) /*!< Bit mask of READYIBPP field.                 */
  #define MBIAS_INTPEND_READYIBPP_Min (0x0UL)        /*!< Min enumerator value of READYIBPP field.                             */
  #define MBIAS_INTPEND_READYIBPP_Max (0x1UL)        /*!< Max enumerator value of READYIBPP field.                             */
  #define MBIAS_INTPEND_READYIBPP_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define MBIAS_INTPEND_READYIBPP_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* READYIBPSR @Bit 1 : Read pending status of interrupt for event READYIBPSR */
  #define MBIAS_INTPEND_READYIBPSR_Pos (1UL)         /*!< Position of READYIBPSR field.                                        */
  #define MBIAS_INTPEND_READYIBPSR_Msk (0x1UL << MBIAS_INTPEND_READYIBPSR_Pos) /*!< Bit mask of READYIBPSR field.              */
  #define MBIAS_INTPEND_READYIBPSR_Min (0x0UL)       /*!< Min enumerator value of READYIBPSR field.                            */
  #define MBIAS_INTPEND_READYIBPSR_Max (0x1UL)       /*!< Max enumerator value of READYIBPSR field.                            */
  #define MBIAS_INTPEND_READYIBPSR_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define MBIAS_INTPEND_READYIBPSR_Pending (0x1UL)   /*!< Read: Pending                                                        */


/* MBIAS_STATUS: MBIAS status */
  #define MBIAS_STATUS_ResetValue (0x00000000UL)     /*!< Reset value of STATUS register.                                      */

/* MODE @Bit 0 : Current MBIAS mode */
  #define MBIAS_STATUS_MODE_Pos (0UL)                /*!< Position of MODE field.                                              */
  #define MBIAS_STATUS_MODE_Msk (0x1UL << MBIAS_STATUS_MODE_Pos) /*!< Bit mask of MODE field.                                  */
  #define MBIAS_STATUS_MODE_Min (0x0UL)              /*!< Min enumerator value of MODE field.                                  */
  #define MBIAS_STATUS_MODE_Max (0x1UL)              /*!< Max enumerator value of MODE field.                                  */
  #define MBIAS_STATUS_MODE_Normal (0x0UL)           /*!< Normal mode                                                          */
  #define MBIAS_STATUS_MODE_Refresh (0x1UL)          /*!< Refresh mode                                                         */


/* MBIAS_STATUSANA: Status of analog module output signals */
  #define MBIAS_STATUSANA_ResetValue (0x00000000UL)  /*!< Reset value of STATUSANA register.                                   */

