adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* READYIBPP @Bit 0 : Current value of the READY_IBPP signal from the analog module */
  #define MBIAS_STATUSANA_READYIBPP_Pos (0UL)        /*!< Position of READYIBPP field.                                         */
  #define MBIAS_STATUSANA_READYIBPP_Msk (0x1UL << MBIAS_STATUSANA_READYIBPP_Pos) /*!< Bit mask of READYIBPP field.             */

/* READYIBPSR @Bit 1 : Current value of the READY_IBPSR signal from the analog module */
  #define MBIAS_STATUSANA_READYIBPSR_Pos (1UL)       /*!< Position of READYIBPSR field.                                        */
  #define MBIAS_STATUSANA_READYIBPSR_Msk (0x1UL << MBIAS_STATUSANA_READYIBPSR_Pos) /*!< Bit mask of READYIBPSR field.          */

/* SETTLEDIBPSR @Bit 2 : Current value of the SETTLED_IBPSR signal from the analog module */
  #define MBIAS_STATUSANA_SETTLEDIBPSR_Pos (2UL)     /*!< Position of SETTLEDIBPSR field.                                      */
  #define MBIAS_STATUSANA_SETTLEDIBPSR_Msk (0x1UL << MBIAS_STATUSANA_SETTLEDIBPSR_Pos) /*!< Bit mask of SETTLEDIBPSR field.    */


/* MBIAS_MIRROR: Enable LOCK for mirrored registers */
  #define MBIAS_MIRROR_ResetValue (0x00000001UL)     /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define MBIAS_MIRROR_LOCK_Pos (0UL)                /*!< Position of LOCK field.                                              */
  #define MBIAS_MIRROR_LOCK_Msk (0x1UL << MBIAS_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                                  */
  #define MBIAS_MIRROR_LOCK_Min (0x0UL)              /*!< Min enumerator value of LOCK field.                                  */
  #define MBIAS_MIRROR_LOCK_Max (0x1UL)              /*!< Max enumerator value of LOCK field.                                  */
  #define MBIAS_MIRROR_LOCK_Disabled (0x0UL)         /*!< Lock disabled                                                        */
  #define MBIAS_MIRROR_LOCK_Enabled (0x1UL)          /*!< Lock enabled                                                         */


/* MBIAS_MODE: MBIAS mode */
  #define MBIAS_MODE_ResetValue (0x00000000UL)       /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..1 : Mode */
  #define MBIAS_MODE_MODE_Pos (0UL)                  /*!< Position of MODE field.                                              */
  #define MBIAS_MODE_MODE_Msk (0x3UL << MBIAS_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                      */
  #define MBIAS_MODE_MODE_Min (0x0UL)                /*!< Min enumerator value of MODE field.                                  */
  #define MBIAS_MODE_MODE_Max (0x2UL)                /*!< Max enumerator value of MODE field.                                  */
  #define MBIAS_MODE_MODE_Auto (0x0UL)               /*!< Automatically handled by the peripheral                              */
  #define MBIAS_MODE_MODE_Normal (0x1UL)             /*!< Normal mode - IBPSR current are continuous ON                        */
  #define MBIAS_MODE_MODE_Refresh (0x2UL)            /*!< Refresh mode - IBPSR currents are duty cycled                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           MCPLL                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct MCPLL_CONTROL =================================================== */
/**
  * @brief CONTROL [MCPLL_CONTROL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INT;                               /*!< (@ 0x00000000) Integer part of the control word.                     */
  __IOM uint32_t  FRAC;                              /*!< (@ 0x00000004) Fractional part of the control word.                  */
} NRF_MCPLL_CONTROL_Type;                            /*!< Size = 8 (0x008)                                                     */

/* MCPLL_CONTROL_INT: Integer part of the control word. */
  #define MCPLL_CONTROL_INT_ResetValue (0x00000012UL) /*!< Reset value of INT register.                                        */

/* INT @Bits 0..5 : Integer part of the control word */
  #define MCPLL_CONTROL_INT_INT_Pos (0UL)            /*!< Position of INT field.                                               */
  #define MCPLL_CONTROL_INT_INT_Msk (0x3FUL << MCPLL_CONTROL_INT_INT_Pos) /*!< Bit mask of INT field.                          */


/* MCPLL_CONTROL_FRAC: Fractional part of the control word. */
  #define MCPLL_CONTROL_FRAC_ResetValue (0x00199999UL) /*!< Reset value of FRAC register.                                      */

/* FRAC @Bits 0..22 : Fractional part of the control word */
  #define MCPLL_CONTROL_FRAC_FRAC_Pos (0UL)          /*!< Position of FRAC field.                                              */
  #define MCPLL_CONTROL_FRAC_FRAC_Msk (0x7FFFFFUL << MCPLL_CONTROL_FRAC_FRAC_Pos) /*!< Bit mask of FRAC field.                 */



/* ================================================== Struct MCPLL_OVERRIDE ================================================== */
/**
  * @brief OVERRIDE [MCPLL_OVERRIDE] Override mechanism
  */
typedef struct {
  __IOM uint32_t  INLOCK;                            /*!< (@ 0x00000000) Override for MCPLL inLock                             */
  __IOM uint32_t  HFXOREQ;                           /*!< (@ 0x00000004) Override for HFXO controls                            */
  __IOM uint32_t  REQUESTS;                          /*!< (@ 0x00000008) Override for request signals                          */
  __IOM uint32_t  MCPLLANA;                          /*!< (@ 0x0000000C) Override for MCPLL analog controls                    */
  __IOM uint32_t  MCPLLDIG;                          /*!< (@ 0x00000010) Override for MCPLL digital controls                   */
} NRF_MCPLL_OVERRIDE_Type;                           /*!< Size = 20 (0x014)                                                    */

/* MCPLL_OVERRIDE_INLOCK: Override for MCPLL inLock */
  #define MCPLL_OVERRIDE_INLOCK_ResetValue (0x00000000UL) /*!< Reset value of INLOCK register.                                 */

/* FORCEINLOCK @Bit 0 : Force inlock value from analog to high */
  #define MCPLL_OVERRIDE_INLOCK_FORCEINLOCK_Pos (0UL) /*!< Position of FORCEINLOCK field.                                      */
  #define MCPLL_OVERRIDE_INLOCK_FORCEINLOCK_Msk (0x1UL << MCPLL_OVERRIDE_INLOCK_FORCEINLOCK_Pos) /*!< Bit mask of FORCEINLOCK
                                                                            field.*/                                              


/* MCPLL_OVERRIDE_HFXOREQ: Override for HFXO controls */
  #define MCPLL_OVERRIDE_HFXOREQ_ResetValue (0x00000000UL) /*!< Reset value of HFXOREQ register.                               */

/* REQ_HFXO @Bits 0..1 : Override for HFXO request */
  #define MCPLL_OVERRIDE_HFXOREQ_REQ_HFXO_Pos (0UL)  /*!< Position of REQ_HFXO field.                                          */
  #define MCPLL_OVERRIDE_HFXOREQ_REQ_HFXO_Msk (0x3UL << MCPLL_OVERRIDE_HFXOREQ_REQ_HFXO_Pos) /*!< Bit mask of REQ_HFXO field.  */
  #define MCPLL_OVERRIDE_HFXOREQ_REQ_HFXO_Min (0x0UL) /*!< Min enumerator value of REQ_HFXO field.                             */
  #define MCPLL_OVERRIDE_HFXOREQ_REQ_HFXO_Max (0x3UL) /*!< Max enumerator value of REQ_HFXO field.                             */
  #define MCPLL_OVERRIDE_HFXOREQ_REQ_HFXO_NORMAL (0x0UL) /*!< Crystal is requested according to MCPLL FSM                      */
  #define MCPLL_OVERRIDE_HFXOREQ_REQ_HFXO_UNUSED (0x1UL) /*!< Crystal is requested according to MCPLL FSM                      */
  #define MCPLL_OVERRIDE_HFXOREQ_REQ_HFXO_BLOCKED (0x2UL) /*!< Crystal is not requested                                        */
  #define MCPLL_OVERRIDE_HFXOREQ_REQ_HFXO_FORCED (0x3UL) /*!< Crystal is requested                                             */

/* READY_HFXO @Bits 2..3 : Override for HFXO ready */
  #define MCPLL_OVERRIDE_HFXOREQ_READY_HFXO_Pos (2UL) /*!< Position of READY_HFXO field.                                       */
  #define MCPLL_OVERRIDE_HFXOREQ_READY_HFXO_Msk (0x3UL << MCPLL_OVERRIDE_HFXOREQ_READY_HFXO_Pos) /*!< Bit mask of READY_HFXO
                                                                            field.*/                                              
  #define MCPLL_OVERRIDE_HFXOREQ_READY_HFXO_Min (0x0UL) /*!< Min enumerator value of READY_HFXO field.                         */
  #define MCPLL_OVERRIDE_HFXOREQ_READY_HFXO_Max (0x3UL) /*!< Max enumerator value of READY_HFXO field.                         */
  #define MCPLL_OVERRIDE_HFXOREQ_READY_HFXO_NORMAL (0x0UL) /*!< Ready is provided by crystal to MCPLL FSM                      */
  #define MCPLL_OVERRIDE_HFXOREQ_READY_HFXO_UNUSED (0x1UL) /*!< Ready is provided by crystal to MCPLL FSM                      */
  #define MCPLL_OVERRIDE_HFXOREQ_READY_HFXO_BLOCKED (0x2UL) /*!< Ready signal from crystal is forced low                       */
  #define MCPLL_OVERRIDE_HFXOREQ_READY_HFXO_FORCED (0x3UL) /*!< Ready signal from crystal is forced high                       */


/* MCPLL_OVERRIDE_REQUESTS: Override for request signals */
  #define MCPLL_OVERRIDE_REQUESTS_ResetValue (0x00000000UL) /*!< Reset value of REQUESTS register.                             */

/* REQ_MCPLL @Bit 0 : Override for REQ_MCPLL */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_MCPLL_Pos (0UL) /*!< Position of REQ_MCPLL field.                                        */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_MCPLL_Msk (0x1UL << MCPLL_OVERRIDE_REQUESTS_REQ_MCPLL_Pos) /*!< Bit mask of REQ_MCPLL
                                                                            field.*/                                              
  #define MCPLL_OVERRIDE_REQUESTS_REQ_MCPLL_Min (0x0UL) /*!< Min enumerator value of REQ_MCPLL field.                          */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_MCPLL_Max (0x1UL) /*!< Max enumerator value of REQ_MCPLL field.                          */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_MCPLL_NORMAL (0x0UL) /*!< REQ_MCPLL from HW requests MCPLL normally                      */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_MCPLL_BLOCK (0x1UL) /*!< REQ_MCPLL from HW is blocked and doesn`t start MCPLL            */

/* REQ_OUTA @Bits 1..2 : Override for REQ_OUTA */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTA_Pos (1UL) /*!< Position of REQ_OUTA field.                                          */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTA_Msk (0x3UL << MCPLL_OVERRIDE_REQUESTS_REQ_OUTA_Pos) /*!< Bit mask of REQ_OUTA field.*/
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTA_Min (0x0UL) /*!< Min enumerator value of REQ_OUTA field.                            */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTA_Max (0x3UL) /*!< Max enumerator value of REQ_OUTA field.                            */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTA_NORMAL (0x0UL) /*!< REQ_OUTA from HW requests OUTA normally                         */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTA_UNUSED (0x1UL) /*!< REQ_OUTA from HW requests OUTA normally                         */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTA_BLOCKED (0x2UL) /*!< REQ_OUTA from HW is blocked and OUTA buffer is disabled        */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTA_FORCED (0x3UL) /*!< REQ_OUTA from HW is forced and OUTA buffer is enabled           */

/* REQ_OUTB @Bits 3..4 : Override for REQ_OUTB */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTB_Pos (3UL) /*!< Position of REQ_OUTB field.                                          */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTB_Msk (0x3UL << MCPLL_OVERRIDE_REQUESTS_REQ_OUTB_Pos) /*!< Bit mask of REQ_OUTB field.*/
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTB_Min (0x0UL) /*!< Min enumerator value of REQ_OUTB field.                            */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTB_Max (0x3UL) /*!< Max enumerator value of REQ_OUTB field.                            */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTB_NORMAL (0x0UL) /*!< REQ_OUTB from HW requests OUTB normally                         */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTB_UNUSED (0x1UL) /*!< REQ_OUTB from HW requests OUTB normally                         */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTB_BLOCKED (0x2UL) /*!< REQ_OUTB from HW is blocked and OUTB buffer is disabled        */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTB_FORCED (0x3UL) /*!< REQ_OUTB from HW is forced and OUTB buffer is enabled           */

/* REQ_OUTC @Bits 5..6 : Override for REQ_OUTC */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTC_Pos (5UL) /*!< Position of REQ_OUTC field.                                          */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTC_Msk (0x3UL << MCPLL_OVERRIDE_REQUESTS_REQ_OUTC_Pos) /*!< Bit mask of REQ_OUTC field.*/
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTC_Min (0x0UL) /*!< Min enumerator value of REQ_OUTC field.                            */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTC_Max (0x3UL) /*!< Max enumerator value of REQ_OUTC field.                            */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTC_NORMAL (0x0UL) /*!< REQ_OUTC from HW requests OUTC normally                         */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTC_UNUSED (0x1UL) /*!< REQ_OUTC from HW requests OUTC normally                         */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTC_BLOCKED (0x2UL) /*!< REQ_OUTC from HW is blocked and OUTC buffer is disabled        */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTC_FORCED (0x3UL) /*!< REQ_OUTC from HW is forced and OUTC buffer is enabled           */

