adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQ_OUTD @Bits 7..8 : Override for REQ_OUTD */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTD_Pos (7UL) /*!< Position of REQ_OUTD field.                                          */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTD_Msk (0x3UL << MCPLL_OVERRIDE_REQUESTS_REQ_OUTD_Pos) /*!< Bit mask of REQ_OUTD field.*/
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTD_Min (0x0UL) /*!< Min enumerator value of REQ_OUTD field.                            */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTD_Max (0x3UL) /*!< Max enumerator value of REQ_OUTD field.                            */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTD_NORMAL (0x0UL) /*!< REQ_OUTD from HW requests OUTD normally                         */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTD_UNUSED (0x1UL) /*!< REQ_OUTD from HW requests OUTD normally                         */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTD_BLOCKED (0x2UL) /*!< REQ_OUTD from HW is blocked and OUTD buffer is disabled        */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_OUTD_FORCED (0x3UL) /*!< REQ_OUTD from HW is forced and OUTD buffer is enabled           */

/* REQ_TESTOUT @Bits 9..10 : Override for REQ_TESTOUT */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_TESTOUT_Pos (9UL) /*!< Position of REQ_TESTOUT field.                                    */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_TESTOUT_Msk (0x3UL << MCPLL_OVERRIDE_REQUESTS_REQ_TESTOUT_Pos) /*!< Bit mask of
                                                                            REQ_TESTOUT field.*/                                  
  #define MCPLL_OVERRIDE_REQUESTS_REQ_TESTOUT_Min (0x0UL) /*!< Min enumerator value of REQ_TESTOUT field.                      */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_TESTOUT_Max (0x3UL) /*!< Max enumerator value of REQ_TESTOUT field.                      */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_TESTOUT_NORMAL (0x0UL) /*!< REQ_TESTOUT from HW requests TESTOUT normally                */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_TESTOUT_UNUSED (0x1UL) /*!< REQ_TESTOUT from HW requests TESTOUT normally                */
  #define MCPLL_OVERRIDE_REQUESTS_REQ_TESTOUT_BLOCKED (0x2UL) /*!< REQ_TESTOUT from HW is blocked and TESTOUT buffer is
                                                                   disabled*/                                                     
  #define MCPLL_OVERRIDE_REQUESTS_REQ_TESTOUT_FORCED (0x3UL) /*!< REQ_TESTOUT from HW is forced and TESTOUT buffer is enabled  */


/* MCPLL_OVERRIDE_MCPLLANA: Override for MCPLL analog controls */
  #define MCPLL_OVERRIDE_MCPLLANA_ResetValue (0x00000000UL) /*!< Reset value of MCPLLANA register.                             */

/* ENABLE @Bit 0 : Enable override */
  #define MCPLL_OVERRIDE_MCPLLANA_ENABLE_Pos (0UL)   /*!< Position of ENABLE field.                                            */
  #define MCPLL_OVERRIDE_MCPLLANA_ENABLE_Msk (0x1UL << MCPLL_OVERRIDE_MCPLLANA_ENABLE_Pos) /*!< Bit mask of ENABLE field.      */
  #define MCPLL_OVERRIDE_MCPLLANA_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                                */
  #define MCPLL_OVERRIDE_MCPLLANA_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                                */
  #define MCPLL_OVERRIDE_MCPLLANA_ENABLE_NoOverride (0x0UL) /*!< No override enabled                                           */
  #define MCPLL_OVERRIDE_MCPLLANA_ENABLE_Override (0x1UL) /*!< All overrides in this register are enabled                      */

/* LDO_ENABLE @Bit 1 : LDO enable override value */
  #define MCPLL_OVERRIDE_MCPLLANA_LDO_ENABLE_Pos (1UL) /*!< Position of LDO_ENABLE field.                                      */
  #define MCPLL_OVERRIDE_MCPLLANA_LDO_ENABLE_Msk (0x1UL << MCPLL_OVERRIDE_MCPLLANA_LDO_ENABLE_Pos) /*!< Bit mask of LDO_ENABLE
                                                                            field.*/                                              
  #define MCPLL_OVERRIDE_MCPLLANA_LDO_ENABLE_Min (0x0UL) /*!< Min enumerator value of LDO_ENABLE field.                        */
  #define MCPLL_OVERRIDE_MCPLLANA_LDO_ENABLE_Max (0x1UL) /*!< Max enumerator value of LDO_ENABLE field.                        */
  #define MCPLL_OVERRIDE_MCPLLANA_LDO_ENABLE_OFF (0x0UL) /*!< Force LDO_ENABLE low                                             */
  #define MCPLL_OVERRIDE_MCPLLANA_LDO_ENABLE_ON (0x1UL) /*!< Force LDO_ENABLE high                                             */

/* PWRUP @Bit 2 : Override for PWRUP_MCPLL */
  #define MCPLL_OVERRIDE_MCPLLANA_PWRUP_Pos (2UL)    /*!< Position of PWRUP field.                                             */
  #define MCPLL_OVERRIDE_MCPLLANA_PWRUP_Msk (0x1UL << MCPLL_OVERRIDE_MCPLLANA_PWRUP_Pos) /*!< Bit mask of PWRUP field.         */
  #define MCPLL_OVERRIDE_MCPLLANA_PWRUP_Min (0x0UL)  /*!< Min enumerator value of PWRUP field.                                 */
  #define MCPLL_OVERRIDE_MCPLLANA_PWRUP_Max (0x1UL)  /*!< Max enumerator value of PWRUP field.                                 */
  #define MCPLL_OVERRIDE_MCPLLANA_PWRUP_OFF (0x0UL)  /*!< Force PWRUP_MCPLL low                                                */
  #define MCPLL_OVERRIDE_MCPLLANA_PWRUP_ON (0x1UL)   /*!< Force PWRUP_MCPLL high                                               */

/* CORE_ENABLE @Bit 3 : Override for CORE_ENABLE */
  #define MCPLL_OVERRIDE_MCPLLANA_CORE_ENABLE_Pos (3UL) /*!< Position of CORE_ENABLE field.                                    */
  #define MCPLL_OVERRIDE_MCPLLANA_CORE_ENABLE_Msk (0x1UL << MCPLL_OVERRIDE_MCPLLANA_CORE_ENABLE_Pos) /*!< Bit mask of
                                                                            CORE_ENABLE field.*/                                  
  #define MCPLL_OVERRIDE_MCPLLANA_CORE_ENABLE_Min (0x0UL) /*!< Min enumerator value of CORE_ENABLE field.                      */
  #define MCPLL_OVERRIDE_MCPLLANA_CORE_ENABLE_Max (0x1UL) /*!< Max enumerator value of CORE_ENABLE field.                      */
  #define MCPLL_OVERRIDE_MCPLLANA_CORE_ENABLE_OFF (0x0UL) /*!< Force CORE_ENABLE low                                           */
  #define MCPLL_OVERRIDE_MCPLLANA_CORE_ENABLE_ON (0x1UL) /*!< Force CORE_ENABLE high                                           */

