adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TASKS_START @Bit 0 : Start MCPLL */
  #define MCPLL_TASKS_START_TASKS_START_Pos (0UL)    /*!< Position of TASKS_START field.                                       */
  #define MCPLL_TASKS_START_TASKS_START_Msk (0x1UL << MCPLL_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.   */
  #define MCPLL_TASKS_START_TASKS_START_Min (0x1UL)  /*!< Min enumerator value of TASKS_START field.                           */
  #define MCPLL_TASKS_START_TASKS_START_Max (0x1UL)  /*!< Max enumerator value of TASKS_START field.                           */
  #define MCPLL_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* MCPLL_TASKS_UPDATE: Update CONTROL.FRAC and CONTROL.INT values */
  #define MCPLL_TASKS_UPDATE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_UPDATE register.                              */

/* TASKS_UPDATE @Bit 0 : Update CONTROL.FRAC and CONTROL.INT values */
  #define MCPLL_TASKS_UPDATE_TASKS_UPDATE_Pos (0UL)  /*!< Position of TASKS_UPDATE field.                                      */
  #define MCPLL_TASKS_UPDATE_TASKS_UPDATE_Msk (0x1UL << MCPLL_TASKS_UPDATE_TASKS_UPDATE_Pos) /*!< Bit mask of TASKS_UPDATE
                                                                            field.*/                                              
  #define MCPLL_TASKS_UPDATE_TASKS_UPDATE_Min (0x1UL) /*!< Min enumerator value of TASKS_UPDATE field.                         */
  #define MCPLL_TASKS_UPDATE_TASKS_UPDATE_Max (0x1UL) /*!< Max enumerator value of TASKS_UPDATE field.                         */
  #define MCPLL_TASKS_UPDATE_TASKS_UPDATE_Trigger (0x1UL) /*!< Trigger task                                                    */


/* MCPLL_TASKS_STOP: Cancels the START task. MCPLL may be still enabled if requested by HW. */
  #define MCPLL_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Cancels the START task. MCPLL may be still enabled if requested by HW. */
  #define MCPLL_TASKS_STOP_TASKS_STOP_Pos (0UL)      /*!< Position of TASKS_STOP field.                                        */
  #define MCPLL_TASKS_STOP_TASKS_STOP_Msk (0x1UL << MCPLL_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.        */
  #define MCPLL_TASKS_STOP_TASKS_STOP_Min (0x1UL)    /*!< Min enumerator value of TASKS_STOP field.                            */
  #define MCPLL_TASKS_STOP_TASKS_STOP_Max (0x1UL)    /*!< Max enumerator value of TASKS_STOP field.                            */
  #define MCPLL_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* MCPLL_SUBSCRIBE_START: Subscribe configuration for task START */
  #define MCPLL_SUBSCRIBE_START_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_START register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define MCPLL_SUBSCRIBE_START_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define MCPLL_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << MCPLL_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define MCPLL_SUBSCRIBE_START_CHIDX_Min (0x0UL)    /*!< Min value of CHIDX field.                                            */
  #define MCPLL_SUBSCRIBE_START_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define MCPLL_SUBSCRIBE_START_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define MCPLL_SUBSCRIBE_START_EN_Msk (0x1UL << MCPLL_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field.                      */
  #define MCPLL_SUBSCRIBE_START_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define MCPLL_SUBSCRIBE_START_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define MCPLL_SUBSCRIBE_START_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define MCPLL_SUBSCRIBE_START_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* MCPLL_SUBSCRIBE_UPDATE: Subscribe configuration for task UPDATE */
  #define MCPLL_SUBSCRIBE_UPDATE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_UPDATE register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that task UPDATE will subscribe to */
  #define MCPLL_SUBSCRIBE_UPDATE_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define MCPLL_SUBSCRIBE_UPDATE_CHIDX_Msk (0xFFUL << MCPLL_SUBSCRIBE_UPDATE_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define MCPLL_SUBSCRIBE_UPDATE_CHIDX_Min (0x0UL)   /*!< Min value of CHIDX field.                                            */
  #define MCPLL_SUBSCRIBE_UPDATE_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define MCPLL_SUBSCRIBE_UPDATE_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define MCPLL_SUBSCRIBE_UPDATE_EN_Msk (0x1UL << MCPLL_SUBSCRIBE_UPDATE_EN_Pos) /*!< Bit mask of EN field.                    */
  #define MCPLL_SUBSCRIBE_UPDATE_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define MCPLL_SUBSCRIBE_UPDATE_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define MCPLL_SUBSCRIBE_UPDATE_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define MCPLL_SUBSCRIBE_UPDATE_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* MCPLL_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define MCPLL_SUBSCRIBE_STOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOP register.                          */

