adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define MCPLL_SUBSCRIBE_STOP_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define MCPLL_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << MCPLL_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define MCPLL_SUBSCRIBE_STOP_CHIDX_Min (0x0UL)     /*!< Min value of CHIDX field.                                            */
  #define MCPLL_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define MCPLL_SUBSCRIBE_STOP_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define MCPLL_SUBSCRIBE_STOP_EN_Msk (0x1UL << MCPLL_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field.                        */
  #define MCPLL_SUBSCRIBE_STOP_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define MCPLL_SUBSCRIBE_STOP_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define MCPLL_SUBSCRIBE_STOP_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define MCPLL_SUBSCRIBE_STOP_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* MCPLL_EVENTS_STARTED: MCPLL start sequence completed. Clock is running. */
  #define MCPLL_EVENTS_STARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STARTED register.                          */

/* EVENTS_STARTED @Bit 0 : MCPLL start sequence completed. Clock is running. */
  #define MCPLL_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL) /*!< Position of EVENTS_STARTED field.                                 */
  #define MCPLL_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << MCPLL_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/                               
  #define MCPLL_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STARTED field.                   */
  #define MCPLL_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STARTED field.                   */
  #define MCPLL_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define MCPLL_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL) /*!< Event generated                                           */


/* MCPLL_EVENTS_LOCKTIMEOUT: Error event, lock was not achieved in given timeout limit (LOCKTIMEOUT) */
  #define MCPLL_EVENTS_LOCKTIMEOUT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_LOCKTIMEOUT register.                  */

/* EVENTS_LOCKTIMEOUT @Bit 0 : Error event, lock was not achieved in given timeout limit (LOCKTIMEOUT) */
  #define MCPLL_EVENTS_LOCKTIMEOUT_EVENTS_LOCKTIMEOUT_Pos (0UL) /*!< Position of EVENTS_LOCKTIMEOUT field.                     */
  #define MCPLL_EVENTS_LOCKTIMEOUT_EVENTS_LOCKTIMEOUT_Msk (0x1UL << MCPLL_EVENTS_LOCKTIMEOUT_EVENTS_LOCKTIMEOUT_Pos) /*!< Bit
                                                                            mask of EVENTS_LOCKTIMEOUT field.*/                   
  #define MCPLL_EVENTS_LOCKTIMEOUT_EVENTS_LOCKTIMEOUT_Min (0x0UL) /*!< Min enumerator value of EVENTS_LOCKTIMEOUT field.       */
  #define MCPLL_EVENTS_LOCKTIMEOUT_EVENTS_LOCKTIMEOUT_Max (0x1UL) /*!< Max enumerator value of EVENTS_LOCKTIMEOUT field.       */
  #define MCPLL_EVENTS_LOCKTIMEOUT_EVENTS_LOCKTIMEOUT_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define MCPLL_EVENTS_LOCKTIMEOUT_EVENTS_LOCKTIMEOUT_Generated (0x1UL) /*!< Event generated                                   */


/* MCPLL_EVENTS_LOCKLOST: Error event, MCPLL no longer in lock */
  #define MCPLL_EVENTS_LOCKLOST_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_LOCKLOST register.                        */

/* EVENTS_LOCKLOST @Bit 0 : Error event, MCPLL no longer in lock */
  #define MCPLL_EVENTS_LOCKLOST_EVENTS_LOCKLOST_Pos (0UL) /*!< Position of EVENTS_LOCKLOST field.                              */
  #define MCPLL_EVENTS_LOCKLOST_EVENTS_LOCKLOST_Msk (0x1UL << MCPLL_EVENTS_LOCKLOST_EVENTS_LOCKLOST_Pos) /*!< Bit mask of
                                                                            EVENTS_LOCKLOST field.*/                              
  #define MCPLL_EVENTS_LOCKLOST_EVENTS_LOCKLOST_Min (0x0UL) /*!< Min enumerator value of EVENTS_LOCKLOST field.                */
  #define MCPLL_EVENTS_LOCKLOST_EVENTS_LOCKLOST_Max (0x1UL) /*!< Max enumerator value of EVENTS_LOCKLOST field.                */
  #define MCPLL_EVENTS_LOCKLOST_EVENTS_LOCKLOST_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define MCPLL_EVENTS_LOCKLOST_EVENTS_LOCKLOST_Generated (0x1UL) /*!< Event generated                                         */


/* MCPLL_PUBLISH_STARTED: Publish configuration for event STARTED */
  #define MCPLL_PUBLISH_STARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STARTED register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event STARTED will publish to */
  #define MCPLL_PUBLISH_STARTED_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define MCPLL_PUBLISH_STARTED_CHIDX_Msk (0xFFUL << MCPLL_PUBLISH_STARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define MCPLL_PUBLISH_STARTED_CHIDX_Min (0x0UL)    /*!< Min value of CHIDX field.                                            */
  #define MCPLL_PUBLISH_STARTED_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define MCPLL_PUBLISH_STARTED_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define MCPLL_PUBLISH_STARTED_EN_Msk (0x1UL << MCPLL_PUBLISH_STARTED_EN_Pos) /*!< Bit mask of EN field.                      */
  #define MCPLL_PUBLISH_STARTED_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define MCPLL_PUBLISH_STARTED_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define MCPLL_PUBLISH_STARTED_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define MCPLL_PUBLISH_STARTED_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


