adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* MCPLL_PUBLISH_LOCKTIMEOUT: Publish configuration for event LOCKTIMEOUT */
  #define MCPLL_PUBLISH_LOCKTIMEOUT_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_LOCKTIMEOUT register.                */

/* CHIDX @Bits 0..7 : DPPI channel that event LOCKTIMEOUT will publish to */
  #define MCPLL_PUBLISH_LOCKTIMEOUT_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define MCPLL_PUBLISH_LOCKTIMEOUT_CHIDX_Msk (0xFFUL << MCPLL_PUBLISH_LOCKTIMEOUT_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define MCPLL_PUBLISH_LOCKTIMEOUT_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                           */
  #define MCPLL_PUBLISH_LOCKTIMEOUT_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define MCPLL_PUBLISH_LOCKTIMEOUT_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define MCPLL_PUBLISH_LOCKTIMEOUT_EN_Msk (0x1UL << MCPLL_PUBLISH_LOCKTIMEOUT_EN_Pos) /*!< Bit mask of EN field.              */
  #define MCPLL_PUBLISH_LOCKTIMEOUT_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define MCPLL_PUBLISH_LOCKTIMEOUT_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define MCPLL_PUBLISH_LOCKTIMEOUT_EN_Disabled (0x0UL) /*!< Disable publishing                                                */
  #define MCPLL_PUBLISH_LOCKTIMEOUT_EN_Enabled (0x1UL) /*!< Enable publishing                                                  */


/* MCPLL_PUBLISH_LOCKLOST: Publish configuration for event LOCKLOST */
  #define MCPLL_PUBLISH_LOCKLOST_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_LOCKLOST register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that event LOCKLOST will publish to */
  #define MCPLL_PUBLISH_LOCKLOST_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define MCPLL_PUBLISH_LOCKLOST_CHIDX_Msk (0xFFUL << MCPLL_PUBLISH_LOCKLOST_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define MCPLL_PUBLISH_LOCKLOST_CHIDX_Min (0x0UL)   /*!< Min value of CHIDX field.                                            */
  #define MCPLL_PUBLISH_LOCKLOST_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define MCPLL_PUBLISH_LOCKLOST_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define MCPLL_PUBLISH_LOCKLOST_EN_Msk (0x1UL << MCPLL_PUBLISH_LOCKLOST_EN_Pos) /*!< Bit mask of EN field.                    */
  #define MCPLL_PUBLISH_LOCKLOST_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define MCPLL_PUBLISH_LOCKLOST_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define MCPLL_PUBLISH_LOCKLOST_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define MCPLL_PUBLISH_LOCKLOST_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* MCPLL_INTEN: Enable or disable interrupt */
  #define MCPLL_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* STARTED @Bit 0 : Enable or disable interrupt for event STARTED */
  #define MCPLL_INTEN_STARTED_Pos (0UL)              /*!< Position of STARTED field.                                           */
  #define MCPLL_INTEN_STARTED_Msk (0x1UL << MCPLL_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field.                           */
  #define MCPLL_INTEN_STARTED_Min (0x0UL)            /*!< Min enumerator value of STARTED field.                               */
  #define MCPLL_INTEN_STARTED_Max (0x1UL)            /*!< Max enumerator value of STARTED field.                               */
  #define MCPLL_INTEN_STARTED_Disabled (0x0UL)       /*!< Disable                                                              */
  #define MCPLL_INTEN_STARTED_Enabled (0x1UL)        /*!< Enable                                                               */

/* LOCKTIMEOUT @Bit 1 : Enable or disable interrupt for event LOCKTIMEOUT */
  #define MCPLL_INTEN_LOCKTIMEOUT_Pos (1UL)          /*!< Position of LOCKTIMEOUT field.                                       */
  #define MCPLL_INTEN_LOCKTIMEOUT_Msk (0x1UL << MCPLL_INTEN_LOCKTIMEOUT_Pos) /*!< Bit mask of LOCKTIMEOUT field.               */
  #define MCPLL_INTEN_LOCKTIMEOUT_Min (0x0UL)        /*!< Min enumerator value of LOCKTIMEOUT field.                           */
  #define MCPLL_INTEN_LOCKTIMEOUT_Max (0x1UL)        /*!< Max enumerator value of LOCKTIMEOUT field.                           */
  #define MCPLL_INTEN_LOCKTIMEOUT_Disabled (0x0UL)   /*!< Disable                                                              */
  #define MCPLL_INTEN_LOCKTIMEOUT_Enabled (0x1UL)    /*!< Enable                                                               */

/* LOCKLOST @Bit 2 : Enable or disable interrupt for event LOCKLOST */
  #define MCPLL_INTEN_LOCKLOST_Pos (2UL)             /*!< Position of LOCKLOST field.                                          */
  #define MCPLL_INTEN_LOCKLOST_Msk (0x1UL << MCPLL_INTEN_LOCKLOST_Pos) /*!< Bit mask of LOCKLOST field.                        */
  #define MCPLL_INTEN_LOCKLOST_Min (0x0UL)           /*!< Min enumerator value of LOCKLOST field.                              */
  #define MCPLL_INTEN_LOCKLOST_Max (0x1UL)           /*!< Max enumerator value of LOCKLOST field.                              */
  #define MCPLL_INTEN_LOCKLOST_Disabled (0x0UL)      /*!< Disable                                                              */
  #define MCPLL_INTEN_LOCKLOST_Enabled (0x1UL)       /*!< Enable                                                               */


/* MCPLL_INTENSET: Enable interrupt */
  #define MCPLL_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* STARTED @Bit 0 : Write '1' to enable interrupt for event STARTED */
  #define MCPLL_INTENSET_STARTED_Pos (0UL)           /*!< Position of STARTED field.                                           */
  #define MCPLL_INTENSET_STARTED_Msk (0x1UL << MCPLL_INTENSET_STARTED_Pos) /*!< Bit mask of STARTED field.                     */
  #define MCPLL_INTENSET_STARTED_Min (0x0UL)         /*!< Min enumerator value of STARTED field.                               */
  #define MCPLL_INTENSET_STARTED_Max (0x1UL)         /*!< Max enumerator value of STARTED field.                               */
  #define MCPLL_INTENSET_STARTED_Set (0x1UL)         /*!< Enable                                                               */
  #define MCPLL_INTENSET_STARTED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MCPLL_INTENSET_STARTED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* LOCKTIMEOUT @Bit 1 : Write '1' to enable interrupt for event LOCKTIMEOUT */
  #define MCPLL_INTENSET_LOCKTIMEOUT_Pos (1UL)       /*!< Position of LOCKTIMEOUT field.                                       */
  #define MCPLL_INTENSET_LOCKTIMEOUT_Msk (0x1UL << MCPLL_INTENSET_LOCKTIMEOUT_Pos) /*!< Bit mask of LOCKTIMEOUT field.         */
  #define MCPLL_INTENSET_LOCKTIMEOUT_Min (0x0UL)     /*!< Min enumerator value of LOCKTIMEOUT field.                           */
  #define MCPLL_INTENSET_LOCKTIMEOUT_Max (0x1UL)     /*!< Max enumerator value of LOCKTIMEOUT field.                           */
  #define MCPLL_INTENSET_LOCKTIMEOUT_Set (0x1UL)     /*!< Enable                                                               */
  #define MCPLL_INTENSET_LOCKTIMEOUT_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define MCPLL_INTENSET_LOCKTIMEOUT_Enabled (0x1UL) /*!< Read: Enabled                                                        */

