adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LOCKLOST @Bit 2 : Write '1' to enable interrupt for event LOCKLOST */
  #define MCPLL_INTENSET_LOCKLOST_Pos (2UL)          /*!< Position of LOCKLOST field.                                          */
  #define MCPLL_INTENSET_LOCKLOST_Msk (0x1UL << MCPLL_INTENSET_LOCKLOST_Pos) /*!< Bit mask of LOCKLOST field.                  */
  #define MCPLL_INTENSET_LOCKLOST_Min (0x0UL)        /*!< Min enumerator value of LOCKLOST field.                              */
  #define MCPLL_INTENSET_LOCKLOST_Max (0x1UL)        /*!< Max enumerator value of LOCKLOST field.                              */
  #define MCPLL_INTENSET_LOCKLOST_Set (0x1UL)        /*!< Enable                                                               */
  #define MCPLL_INTENSET_LOCKLOST_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define MCPLL_INTENSET_LOCKLOST_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* MCPLL_INTENCLR: Disable interrupt */
  #define MCPLL_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* STARTED @Bit 0 : Write '1' to disable interrupt for event STARTED */
  #define MCPLL_INTENCLR_STARTED_Pos (0UL)           /*!< Position of STARTED field.                                           */
  #define MCPLL_INTENCLR_STARTED_Msk (0x1UL << MCPLL_INTENCLR_STARTED_Pos) /*!< Bit mask of STARTED field.                     */
  #define MCPLL_INTENCLR_STARTED_Min (0x0UL)         /*!< Min enumerator value of STARTED field.                               */
  #define MCPLL_INTENCLR_STARTED_Max (0x1UL)         /*!< Max enumerator value of STARTED field.                               */
  #define MCPLL_INTENCLR_STARTED_Clear (0x1UL)       /*!< Disable                                                              */
  #define MCPLL_INTENCLR_STARTED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MCPLL_INTENCLR_STARTED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* LOCKTIMEOUT @Bit 1 : Write '1' to disable interrupt for event LOCKTIMEOUT */
  #define MCPLL_INTENCLR_LOCKTIMEOUT_Pos (1UL)       /*!< Position of LOCKTIMEOUT field.                                       */
  #define MCPLL_INTENCLR_LOCKTIMEOUT_Msk (0x1UL << MCPLL_INTENCLR_LOCKTIMEOUT_Pos) /*!< Bit mask of LOCKTIMEOUT field.         */
  #define MCPLL_INTENCLR_LOCKTIMEOUT_Min (0x0UL)     /*!< Min enumerator value of LOCKTIMEOUT field.                           */
  #define MCPLL_INTENCLR_LOCKTIMEOUT_Max (0x1UL)     /*!< Max enumerator value of LOCKTIMEOUT field.                           */
  #define MCPLL_INTENCLR_LOCKTIMEOUT_Clear (0x1UL)   /*!< Disable                                                              */
  #define MCPLL_INTENCLR_LOCKTIMEOUT_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define MCPLL_INTENCLR_LOCKTIMEOUT_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* LOCKLOST @Bit 2 : Write '1' to disable interrupt for event LOCKLOST */
  #define MCPLL_INTENCLR_LOCKLOST_Pos (2UL)          /*!< Position of LOCKLOST field.                                          */
  #define MCPLL_INTENCLR_LOCKLOST_Msk (0x1UL << MCPLL_INTENCLR_LOCKLOST_Pos) /*!< Bit mask of LOCKLOST field.                  */
  #define MCPLL_INTENCLR_LOCKLOST_Min (0x0UL)        /*!< Min enumerator value of LOCKLOST field.                              */
  #define MCPLL_INTENCLR_LOCKLOST_Max (0x1UL)        /*!< Max enumerator value of LOCKLOST field.                              */
  #define MCPLL_INTENCLR_LOCKLOST_Clear (0x1UL)      /*!< Disable                                                              */
  #define MCPLL_INTENCLR_LOCKLOST_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define MCPLL_INTENCLR_LOCKLOST_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* MCPLL_INTPEND: Pending interrupts */
  #define MCPLL_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* STARTED @Bit 0 : Read pending status of interrupt for event STARTED */
  #define MCPLL_INTPEND_STARTED_Pos (0UL)            /*!< Position of STARTED field.                                           */
  #define MCPLL_INTPEND_STARTED_Msk (0x1UL << MCPLL_INTPEND_STARTED_Pos) /*!< Bit mask of STARTED field.                       */
  #define MCPLL_INTPEND_STARTED_Min (0x0UL)          /*!< Min enumerator value of STARTED field.                               */
  #define MCPLL_INTPEND_STARTED_Max (0x1UL)          /*!< Max enumerator value of STARTED field.                               */
  #define MCPLL_INTPEND_STARTED_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define MCPLL_INTPEND_STARTED_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* LOCKTIMEOUT @Bit 1 : Read pending status of interrupt for event LOCKTIMEOUT */
  #define MCPLL_INTPEND_LOCKTIMEOUT_Pos (1UL)        /*!< Position of LOCKTIMEOUT field.                                       */
  #define MCPLL_INTPEND_LOCKTIMEOUT_Msk (0x1UL << MCPLL_INTPEND_LOCKTIMEOUT_Pos) /*!< Bit mask of LOCKTIMEOUT field.           */
  #define MCPLL_INTPEND_LOCKTIMEOUT_Min (0x0UL)      /*!< Min enumerator value of LOCKTIMEOUT field.                           */
  #define MCPLL_INTPEND_LOCKTIMEOUT_Max (0x1UL)      /*!< Max enumerator value of LOCKTIMEOUT field.                           */
  #define MCPLL_INTPEND_LOCKTIMEOUT_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define MCPLL_INTPEND_LOCKTIMEOUT_Pending (0x1UL)  /*!< Read: Pending                                                        */

