adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* MC @Bits 0..2 : Post division ratio for OUTC (RX ADC in CELLRF). Depending on MC_TRIG register a external trigger is
                   required. Changing the division factor between 15 and 16 on the fly is not glitch free. If division factor is
                   switched between 16 and 15 it must be ensured that the receiver of the clock is disabled at that moment. */    
                                                                                                                                  
  #define MCPLL_MC_MC_Pos (0UL)                      /*!< Position of MC field.                                                */
  #define MCPLL_MC_MC_Msk (0x7UL << MCPLL_MC_MC_Pos) /*!< Bit mask of MC field.                                                */
  #define MCPLL_MC_MC_Min (0x0UL)                    /*!< Min enumerator value of MC field.                                    */
  #define MCPLL_MC_MC_Max (0x7UL)                    /*!< Max enumerator value of MC field.                                    */
  #define MCPLL_MC_MC_Nothing (0x0UL)                /*!< Output grounded, constant logic low                                  */
  #define MCPLL_MC_MC_CLK307M2 (0x1UL)               /*!< Division by 16, output frequency is 307.2 MHz                        */
  #define MCPLL_MC_MC_CLK327M68 (0x2UL)              /*!< Division by 15, output frequency is 327.68 MHz                       */
  #define MCPLL_MC_MC_Nothing2 (0x3UL)               /*!< Output grounded, constant logic low                                  */
  #define MCPLL_MC_MC_CLK153M6 (0x4UL)               /*!< Division by 32, output frequency is 153.6 MHz                        */
  #define MCPLL_MC_MC_ExtClk (0x5UL)                 /*!< External clock                                                       */
  #define MCPLL_MC_MC_Nothing3 (0x6UL)               /*!< Output grounded, constant logic low                                  */
  #define MCPLL_MC_MC_Nothing4 (0x7UL)               /*!< Output grounded, constant logic low                                  */


/* MCPLL_MD: Post division ratio for OUTD (Unused) */
  #define MCPLL_MD_ResetValue (0x00000000UL)         /*!< Reset value of MD register.                                          */

/* MD @Bits 0..2 : Post division ratio for OUTD (Unused) */
  #define MCPLL_MD_MD_Pos (0UL)                      /*!< Position of MD field.                                                */
  #define MCPLL_MD_MD_Msk (0x7UL << MCPLL_MD_MD_Pos) /*!< Bit mask of MD field.                                                */
  #define MCPLL_MD_MD_Min (0x0UL)                    /*!< Min enumerator value of MD field.                                    */
  #define MCPLL_MD_MD_Max (0x7UL)                    /*!< Max enumerator value of MD field.                                    */
  #define MCPLL_MD_MD_Nothing (0x0UL)                /*!< Output grounded, constant logic low                                  */
  #define MCPLL_MD_MD_CLK307M2 (0x1UL)               /*!< Division by 16, output frequency is 307.2 MHz                        */
  #define MCPLL_MD_MD_CLK327M68 (0x2UL)              /*!< Division by 15, output frequency is 327.68 MHz                       */
  #define MCPLL_MD_MD_Nothing2 (0x3UL)               /*!< Output grounded, constant logic low                                  */
  #define MCPLL_MD_MD_CLK153M6 (0x4UL)               /*!< Division by 32, output frequency is 153.6 MHz                        */
  #define MCPLL_MD_MD_ExtClk (0x5UL)                 /*!< External clock                                                       */
  #define MCPLL_MD_MD_Nothing3 (0x6UL)               /*!< Output grounded, constant logic low                                  */
  #define MCPLL_MD_MD_Nothing4 (0x7UL)               /*!< Output grounded, constant logic low                                  */


/* MCPLL_MTESTOUT: Post division ratio for Testout */
  #define MCPLL_MTESTOUT_ResetValue (0x00000000UL)   /*!< Reset value of MTESTOUT register.                                    */

/* MTESTOUT @Bits 0..2 : Post division ratio for Testout (Connected to IO) */
  #define MCPLL_MTESTOUT_MTESTOUT_Pos (0UL)          /*!< Position of MTESTOUT field.                                          */
  #define MCPLL_MTESTOUT_MTESTOUT_Msk (0x7UL << MCPLL_MTESTOUT_MTESTOUT_Pos) /*!< Bit mask of MTESTOUT field.                  */
  #define MCPLL_MTESTOUT_MTESTOUT_Min (0x0UL)        /*!< Min enumerator value of MTESTOUT field.                              */
  #define MCPLL_MTESTOUT_MTESTOUT_Max (0x7UL)        /*!< Max enumerator value of MTESTOUT field.                              */
  #define MCPLL_MTESTOUT_MTESTOUT_Nothing (0x0UL)    /*!< Output grounded, constant logic low                                  */
  #define MCPLL_MTESTOUT_MTESTOUT_CLK307M2 (0x1UL)   /*!< Division by 16, output frequency is 307.2 MHz                        */
  #define MCPLL_MTESTOUT_MTESTOUT_CLK327M68 (0x2UL)  /*!< Division by 15, output frequency is 327.68 MHz                       */
  #define MCPLL_MTESTOUT_MTESTOUT_CLK122M88 (0x3UL)  /*!< Division by 40, output frequency is 122.88 MHz                       */
  #define MCPLL_MTESTOUT_MTESTOUT_CLK153M6 (0x4UL)   /*!< Division by 32, output frequency is 153.6 MHz                        */
  #define MCPLL_MTESTOUT_MTESTOUT_ExtClk (0x5UL)     /*!< External clock                                                       */
  #define MCPLL_MTESTOUT_MTESTOUT_Nothing2 (0x6UL)   /*!< Output grounded, constant logic low                                  */
  #define MCPLL_MTESTOUT_MTESTOUT_Nothing3 (0x7UL)   /*!< Output grounded, constant logic low                                  */


/* MCPLL_MCTRIG: MC register triggering setting */
  #define MCPLL_MCTRIG_ResetValue (0x00000000UL)     /*!< Reset value of MCTRIG register.                                      */

/* MCTRIG_ENA @Bit 0 : Enable for MC register triggering */
  #define MCPLL_MCTRIG_MCTRIG_ENA_Pos (0UL)          /*!< Position of MCTRIG_ENA field.                                        */
  #define MCPLL_MCTRIG_MCTRIG_ENA_Msk (0x1UL << MCPLL_MCTRIG_MCTRIG_ENA_Pos) /*!< Bit mask of MCTRIG_ENA field.                */
  #define MCPLL_MCTRIG_MCTRIG_ENA_Min (0x0UL)        /*!< Min enumerator value of MCTRIG_ENA field.                            */
  #define MCPLL_MCTRIG_MCTRIG_ENA_Max (0x1UL)        /*!< Max enumerator value of MCTRIG_ENA field.                            */
  #define MCPLL_MCTRIG_MCTRIG_ENA_NORMAL (0x0UL)     /*!< MC register changes division setting immediately                     */
  #define MCPLL_MCTRIG_MCTRIG_ENA_TRIGGER (0x1UL)    /*!< MC register requires pulse from REQ_MC input before division setting
                                                          is applied*/                                                            


/* MCPLL_REQUPDATE: REQ_UPDATE setting */
  #define MCPLL_REQUPDATE_ResetValue (0x00000000UL)  /*!< Reset value of REQUPDATE register.                                   */

/* REQ_UPDATE_ENA @Bit 0 : Disable for REQ_UPDATE */
  #define MCPLL_REQUPDATE_REQ_UPDATE_ENA_Pos (0UL)   /*!< Position of REQ_UPDATE_ENA field.                                    */
  #define MCPLL_REQUPDATE_REQ_UPDATE_ENA_Msk (0x1UL << MCPLL_REQUPDATE_REQ_UPDATE_ENA_Pos) /*!< Bit mask of REQ_UPDATE_ENA
                                                                            field.*/                                              
  #define MCPLL_REQUPDATE_REQ_UPDATE_ENA_Min (0x0UL) /*!< Min enumerator value of REQ_UPDATE_ENA field.                        */
  #define MCPLL_REQUPDATE_REQ_UPDATE_ENA_Max (0x1UL) /*!< Max enumerator value of REQ_UPDATE_ENA field.                        */
  #define MCPLL_REQUPDATE_REQ_UPDATE_ENA_NORMAL (0x0UL) /*!< REQ_UPDATE from HW updates FCW normally                           */
  #define MCPLL_REQUPDATE_REQ_UPDATE_ENA_BLOCK (0x1UL) /*!< REQ_UPDATE from HW is blocked and doesn`t update FCW               */


/* MCPLL_TRIM: MCPLL trimming */
  #define MCPLL_TRIM_ResetValue (0x00000000UL)       /*!< Reset value of TRIM register.                                        */

/* LDO_RTUNE @Bits 0..3 : LDO reference voltage tuning against process corners. See analog IP specification. */
  #define MCPLL_TRIM_LDO_RTUNE_Pos (0UL)             /*!< Position of LDO_RTUNE field.                                         */
  #define MCPLL_TRIM_LDO_RTUNE_Msk (0xFUL << MCPLL_TRIM_LDO_RTUNE_Pos) /*!< Bit mask of LDO_RTUNE field.                       */


/* MCPLL_OUTA_DRV: Drive strength for OUTA */
  #define MCPLL_OUTA_DRV_ResetValue (0x00000001UL)   /*!< Reset value of OUTA_DRV register.                                    */

