adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* OUTA_DRV @Bits 0..1 : Drive strength for OUTA */
  #define MCPLL_OUTA_DRV_OUTA_DRV_Pos (0UL)          /*!< Position of OUTA_DRV field.                                          */
  #define MCPLL_OUTA_DRV_OUTA_DRV_Msk (0x3UL << MCPLL_OUTA_DRV_OUTA_DRV_Pos) /*!< Bit mask of OUTA_DRV field.                  */


/* MCPLL_OUTB_DRV: Drive strength for OUTB */
  #define MCPLL_OUTB_DRV_ResetValue (0x00000001UL)   /*!< Reset value of OUTB_DRV register.                                    */

/* OUTB_DRV @Bits 0..1 : Drive strength for OUTB */
  #define MCPLL_OUTB_DRV_OUTB_DRV_Pos (0UL)          /*!< Position of OUTB_DRV field.                                          */
  #define MCPLL_OUTB_DRV_OUTB_DRV_Msk (0x3UL << MCPLL_OUTB_DRV_OUTB_DRV_Pos) /*!< Bit mask of OUTB_DRV field.                  */


/* MCPLL_OUTC_DRV: Drive strength for OUTC */
  #define MCPLL_OUTC_DRV_ResetValue (0x00000001UL)   /*!< Reset value of OUTC_DRV register.                                    */

/* OUTC_DRV @Bits 0..1 : Drive strength for OUTC */
  #define MCPLL_OUTC_DRV_OUTC_DRV_Pos (0UL)          /*!< Position of OUTC_DRV field.                                          */
  #define MCPLL_OUTC_DRV_OUTC_DRV_Msk (0x3UL << MCPLL_OUTC_DRV_OUTC_DRV_Pos) /*!< Bit mask of OUTC_DRV field.                  */


/* MCPLL_OUTD_DRV: Drive strength for OUTD */
  #define MCPLL_OUTD_DRV_ResetValue (0x00000001UL)   /*!< Reset value of OUTD_DRV register.                                    */

/* OUTD_DRV @Bits 0..1 : Drive strength for OUTD */
  #define MCPLL_OUTD_DRV_OUTD_DRV_Pos (0UL)          /*!< Position of OUTD_DRV field.                                          */
  #define MCPLL_OUTD_DRV_OUTD_DRV_Msk (0x3UL << MCPLL_OUTD_DRV_OUTD_DRV_Pos) /*!< Bit mask of OUTD_DRV field.                  */


/* MCPLL_OUTTEST_DRV: Drive strength for Testout */
  #define MCPLL_OUTTEST_DRV_ResetValue (0x00000001UL) /*!< Reset value of OUTTEST_DRV register.                                */

/* OUTTEST_DRV @Bits 0..1 : Drive strength for Testout */
  #define MCPLL_OUTTEST_DRV_OUTTEST_DRV_Pos (0UL)    /*!< Position of OUTTEST_DRV field.                                       */
  #define MCPLL_OUTTEST_DRV_OUTTEST_DRV_Msk (0x3UL << MCPLL_OUTTEST_DRV_OUTTEST_DRV_Pos) /*!< Bit mask of OUTTEST_DRV field.   */


/* MCPLL_INTMODE: Integer mode */
  #define MCPLL_INTMODE_ResetValue (0x00000000UL)    /*!< Reset value of INTMODE register.                                     */

/* INTMODE @Bit 0 : Integer mode */
  #define MCPLL_INTMODE_INTMODE_Pos (0UL)            /*!< Position of INTMODE field.                                           */
  #define MCPLL_INTMODE_INTMODE_Msk (0x1UL << MCPLL_INTMODE_INTMODE_Pos) /*!< Bit mask of INTMODE field.                       */
  #define MCPLL_INTMODE_INTMODE_Min (0x0UL)          /*!< Min enumerator value of INTMODE field.                               */
  #define MCPLL_INTMODE_INTMODE_Max (0x1UL)          /*!< Max enumerator value of INTMODE field.                               */
  #define MCPLL_INTMODE_INTMODE_Fractional (0x0UL)   /*!< Fractional mode                                                      */
  #define MCPLL_INTMODE_INTMODE_Integer (0x1UL)      /*!< Integer mode                                                         */


/* MCPLL_LOCKTIMEOUT: Timeout value for locking */
  #define MCPLL_LOCKTIMEOUT_ResetValue (0x00000000UL) /*!< Reset value of LOCKTIMEOUT register.                                */

/* LOCKTIMEOUT @Bits 0..1 : Timeout value for locking */
  #define MCPLL_LOCKTIMEOUT_LOCKTIMEOUT_Pos (0UL)    /*!< Position of LOCKTIMEOUT field.                                       */
  #define MCPLL_LOCKTIMEOUT_LOCKTIMEOUT_Msk (0x3UL << MCPLL_LOCKTIMEOUT_LOCKTIMEOUT_Pos) /*!< Bit mask of LOCKTIMEOUT field.   */
  #define MCPLL_LOCKTIMEOUT_LOCKTIMEOUT_Min (0x0UL)  /*!< Min enumerator value of LOCKTIMEOUT field.                           */
  #define MCPLL_LOCKTIMEOUT_LOCKTIMEOUT_Max (0x3UL)  /*!< Max enumerator value of LOCKTIMEOUT field.                           */
  #define MCPLL_LOCKTIMEOUT_LOCKTIMEOUT_VALUE20US (0x0UL) /*!< If locking takes more than 20us, LOCKTIMEOUT event is generated.*/
  #define MCPLL_LOCKTIMEOUT_LOCKTIMEOUT_VALUE40US (0x1UL) /*!< If locking takes more than 40us, LOCKTIMEOUT event is generated.*/
  #define MCPLL_LOCKTIMEOUT_LOCKTIMEOUT_VALUE60US (0x2UL) /*!< If locking takes more than 60us, LOCKTIMEOUT event is generated.*/
  #define MCPLL_LOCKTIMEOUT_LOCKTIMEOUT_UNLIMITED (0x3UL) /*!< Lock signal is waited forever                                   */


/* MCPLL_EXTCLK: External clock control */
  #define MCPLL_EXTCLK_ResetValue (0x00000000UL)     /*!< Reset value of EXTCLK register.                                      */

/* EXTCLKENABLE @Bit 0 : Enable for external clock is input buffer */
  #define MCPLL_EXTCLK_EXTCLKENABLE_Pos (0UL)        /*!< Position of EXTCLKENABLE field.                                      */
  #define MCPLL_EXTCLK_EXTCLKENABLE_Msk (0x1UL << MCPLL_EXTCLK_EXTCLKENABLE_Pos) /*!< Bit mask of EXTCLKENABLE field.          */
  #define MCPLL_EXTCLK_EXTCLKENABLE_Min (0x0UL)      /*!< Min enumerator value of EXTCLKENABLE field.                          */
  #define MCPLL_EXTCLK_EXTCLKENABLE_Max (0x1UL)      /*!< Max enumerator value of EXTCLKENABLE field.                          */
  #define MCPLL_EXTCLK_EXTCLKENABLE_Disabled (0x0UL) /*!< External clock input buffer disabled                                 */
  #define MCPLL_EXTCLK_EXTCLKENABLE_Enabled (0x1UL)  /*!< External clock input buffer enabled                                  */


/* MCPLL_DBG_DIG: Mmi digital debug control */
  #define MCPLL_DBG_DIG_ResetValue (0x00000000UL)    /*!< Reset value of DBG_DIG register.                                     */

/* RST_CORE @Bit 0 : Release synchronous reset from Core domain */
  #define MCPLL_DBG_DIG_RST_CORE_Pos (0UL)           /*!< Position of RST_CORE field.                                          */
  #define MCPLL_DBG_DIG_RST_CORE_Msk (0x1UL << MCPLL_DBG_DIG_RST_CORE_Pos) /*!< Bit mask of RST_CORE field.                    */
  #define MCPLL_DBG_DIG_RST_CORE_Min (0x0UL)         /*!< Min enumerator value of RST_CORE field.                              */
  #define MCPLL_DBG_DIG_RST_CORE_Max (0x1UL)         /*!< Max enumerator value of RST_CORE field.                              */
  #define MCPLL_DBG_DIG_RST_CORE_Disabled (0x0UL)    /*!< Normal mode, synchronous reset is requested by MMI                   */
  #define MCPLL_DBG_DIG_RST_CORE_Enabled (0x1UL)     /*!< Synchronous reset is released                                        */


/* MCPLL_OUTAEXT_ENA: External clock enable (OUTA) */
  #define MCPLL_OUTAEXT_ENA_ResetValue (0x00000000UL) /*!< Reset value of OUTAEXT_ENA register.                                */

