adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* OUTAEXT_ENA @Bit 0 : External clock enable (OUTA). IMPORTANT: Enable sequence: first OUTAEXT_SEL high, then OUTAEXT_ENA high.
                        Disable sequence: first OUTAEXT_ENA low, then OUTAEXT_SEL low. */                                         
                                                                                                                                  
  #define MCPLL_OUTAEXT_ENA_OUTAEXT_ENA_Pos (0UL)    /*!< Position of OUTAEXT_ENA field.                                       */
  #define MCPLL_OUTAEXT_ENA_OUTAEXT_ENA_Msk (0x1UL << MCPLL_OUTAEXT_ENA_OUTAEXT_ENA_Pos) /*!< Bit mask of OUTAEXT_ENA field.   */
  #define MCPLL_OUTAEXT_ENA_OUTAEXT_ENA_Min (0x0UL)  /*!< Min enumerator value of OUTAEXT_ENA field.                           */
  #define MCPLL_OUTAEXT_ENA_OUTAEXT_ENA_Max (0x1UL)  /*!< Max enumerator value of OUTAEXT_ENA field.                           */
  #define MCPLL_OUTAEXT_ENA_OUTAEXT_ENA_Gated (0x0UL) /*!< External clock (ckCore) gated                                       */
  #define MCPLL_OUTAEXT_ENA_OUTAEXT_ENA_Active (0x1UL) /*!< External clock (ckCore) active                                     */


/* MCPLL_OUTAEXT_SEL: External clock (ckCore) multiplexing to OUTA */
  #define MCPLL_OUTAEXT_SEL_ResetValue (0x00000000UL) /*!< Reset value of OUTAEXT_SEL register.                                */

/* OUTAEXT_SEL @Bit 0 : External clock (ckCore) multiplexing to OUTA. IMPORTANT: Enable sequence: first OUTAEXT_SEL high, then
                        OUTAEXT_ENA high. Disable sequence: first OUTAEXT_ENA low, then OUTAEXT_SEL low. */                       
                                                                                                                                  
  #define MCPLL_OUTAEXT_SEL_OUTAEXT_SEL_Pos (0UL)    /*!< Position of OUTAEXT_SEL field.                                       */
  #define MCPLL_OUTAEXT_SEL_OUTAEXT_SEL_Msk (0x1UL << MCPLL_OUTAEXT_SEL_OUTAEXT_SEL_Pos) /*!< Bit mask of OUTAEXT_SEL field.   */
  #define MCPLL_OUTAEXT_SEL_OUTAEXT_SEL_Min (0x0UL)  /*!< Min enumerator value of OUTAEXT_SEL field.                           */
  #define MCPLL_OUTAEXT_SEL_OUTAEXT_SEL_Max (0x1UL)  /*!< Max enumerator value of OUTAEXT_SEL field.                           */
  #define MCPLL_OUTAEXT_SEL_OUTAEXT_SEL_Normal (0x0UL) /*!< Normal mode, MCPLL provides the clock                              */
  #define MCPLL_OUTAEXT_SEL_OUTAEXT_SEL_External (0x1UL) /*!< External clock (ckCore) selected                                 */


/* MCPLL_PWR_CONTROL: Power supply control */
  #define MCPLL_PWR_CONTROL_ResetValue (0x00000000UL) /*!< Reset value of PWR_CONTROL register.                                */

/* CLEANPWR_REQ @Bit 0 : Clean power is requested when MCPLL start is requested. Ack is waited before analog part is enabled. */
  #define MCPLL_PWR_CONTROL_CLEANPWR_REQ_Pos (0UL)   /*!< Position of CLEANPWR_REQ field.                                      */
  #define MCPLL_PWR_CONTROL_CLEANPWR_REQ_Msk (0x1UL << MCPLL_PWR_CONTROL_CLEANPWR_REQ_Pos) /*!< Bit mask of CLEANPWR_REQ field.*/
  #define MCPLL_PWR_CONTROL_CLEANPWR_REQ_Min (0x0UL) /*!< Min enumerator value of CLEANPWR_REQ field.                          */
  #define MCPLL_PWR_CONTROL_CLEANPWR_REQ_Max (0x1UL) /*!< Max enumerator value of CLEANPWR_REQ field.                          */
  #define MCPLL_PWR_CONTROL_CLEANPWR_REQ_Disabled (0x0UL) /*!< Default supply, clean power is not requested                    */
  #define MCPLL_PWR_CONTROL_CLEANPWR_REQ_Enabled (0x1UL) /*!< Clean power is requested during MCPLL startup cycle              */


/* MCPLL_ATB: ATB test bus control */
  #define MCPLL_ATB_ResetValue (0x00000000UL)        /*!< Reset value of ATB register.                                         */

/* ATE @Bits 0..3 : ATB test bus enable */
  #define MCPLL_ATB_ATE_Pos (0UL)                    /*!< Position of ATE field.                                               */
  #define MCPLL_ATB_ATE_Msk (0xFUL << MCPLL_ATB_ATE_Pos) /*!< Bit mask of ATE field.                                           */


/* MCPLL_SPARE: Spare signals */
  #define MCPLL_SPARE_ResetValue (0x00000000UL)      /*!< Reset value of SPARE register.                                       */

/* SPARE @Bits 0..3 : Spare signals */
  #define MCPLL_SPARE_SPARE_Pos (0UL)                /*!< Position of SPARE field.                                             */
  #define MCPLL_SPARE_SPARE_Msk (0xFUL << MCPLL_SPARE_SPARE_Pos) /*!< Bit mask of SPARE field.                                 */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          MEMCONF                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct MEMCONF_POWER =================================================== */
/**
  * @brief POWER [MEMCONF_POWER] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONTROL;                           /*!< (@ 0x00000000) RAM/ROM[n] power control register.                    */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  RET;                               /*!< (@ 0x00000008) RAM retention for RAM [n].                            */
  __IOM uint32_t  RET2;                              /*!< (@ 0x0000000C) RAM retention for the second bank in the RAM block    */
} NRF_MEMCONF_POWER_Type;                            /*!< Size = 16 (0x010)                                                    */
  #define MEMCONF_POWER_MaxCount (2UL)               /*!< Max size of POWER[2] array.                                          */

/* MEMCONF_POWER_CONTROL: RAM/ROM[n] power control register. */
  #define MEMCONF_POWER_CONTROL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONTROL register.                                */

