adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* MEMCONF_REPAIR_BITLINE: Repair configuration for RAM blocks. */
  #define MEMCONF_REPAIR_BITLINE_ResetValue (0x00000000UL) /*!< Reset value of BITLINE register.                               */

/* ADDR @Bits 0..6 : Repair address of the bitline */
  #define MEMCONF_REPAIR_BITLINE_ADDR_Pos (0UL)      /*!< Position of ADDR field.                                              */
  #define MEMCONF_REPAIR_BITLINE_ADDR_Msk (0x7FUL << MEMCONF_REPAIR_BITLINE_ADDR_Pos) /*!< Bit mask of ADDR field.             */

/* EN @Bit 31 : Enable bitline repair */
  #define MEMCONF_REPAIR_BITLINE_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define MEMCONF_REPAIR_BITLINE_EN_Msk (0x1UL << MEMCONF_REPAIR_BITLINE_EN_Pos) /*!< Bit mask of EN field.                    */
  #define MEMCONF_REPAIR_BITLINE_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define MEMCONF_REPAIR_BITLINE_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define MEMCONF_REPAIR_BITLINE_EN_Disabled (0x0UL) /*!< Repair disabled.                                                     */
  #define MEMCONF_REPAIR_BITLINE_EN_Enabled (0x1UL)  /*!< Repair enabled.                                                      */



/* ================================================ Struct MEMCONF_BLOCKTYPE ================================================= */
/**
  * @brief BLOCKTYPE [MEMCONF_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim configuration for the RAM/ROM block types.       */
} NRF_MEMCONF_BLOCKTYPE_Type;                        /*!< Size = 4 (0x004)                                                     */
  #define MEMCONF_BLOCKTYPE_MaxCount (64UL)          /*!< Max size of BLOCKTYPE[64] array.                                     */

/* MEMCONF_BLOCKTYPE_TRIM: Trim configuration for the RAM/ROM block types. */
  #define MEMCONF_BLOCKTYPE_TRIM_ResetValue (0x00000000UL) /*!< Reset value of TRIM register.                                  */

/* MEMTRIM0 @Bit 0 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM0_Pos (0UL)  /*!< Position of MEMTRIM0 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM0_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM0_Pos) /*!< Bit mask of MEMTRIM0 field.  */

/* MEMTRIM1 @Bit 1 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM1_Pos (1UL)  /*!< Position of MEMTRIM1 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM1_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM1_Pos) /*!< Bit mask of MEMTRIM1 field.  */

/* MEMTRIM2 @Bit 2 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM2_Pos (2UL)  /*!< Position of MEMTRIM2 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM2_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM2_Pos) /*!< Bit mask of MEMTRIM2 field.  */

/* MEMTRIM3 @Bit 3 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM3_Pos (3UL)  /*!< Position of MEMTRIM3 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM3_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM3_Pos) /*!< Bit mask of MEMTRIM3 field.  */

/* MEMTRIM4 @Bit 4 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM4_Pos (4UL)  /*!< Position of MEMTRIM4 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM4_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM4_Pos) /*!< Bit mask of MEMTRIM4 field.  */

/* MEMTRIM5 @Bit 5 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM5_Pos (5UL)  /*!< Position of MEMTRIM5 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM5_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM5_Pos) /*!< Bit mask of MEMTRIM5 field.  */

/* MEMTRIM6 @Bit 6 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM6_Pos (6UL)  /*!< Position of MEMTRIM6 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM6_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM6_Pos) /*!< Bit mask of MEMTRIM6 field.  */

/* MEMTRIM7 @Bit 7 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM7_Pos (7UL)  /*!< Position of MEMTRIM7 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM7_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM7_Pos) /*!< Bit mask of MEMTRIM7 field.  */

/* MEMTRIM8 @Bit 8 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM8_Pos (8UL)  /*!< Position of MEMTRIM8 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM8_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM8_Pos) /*!< Bit mask of MEMTRIM8 field.  */

/* MEMTRIM9 @Bit 9 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM9_Pos (9UL)  /*!< Position of MEMTRIM9 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM9_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM9_Pos) /*!< Bit mask of MEMTRIM9 field.  */

/* MEMTRIM10 @Bit 10 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM10_Pos (10UL) /*!< Position of MEMTRIM10 field.                                        */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM10_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM10_Pos) /*!< Bit mask of MEMTRIM10
                                                                            field.*/                                              

/* MEMTRIM11 @Bit 11 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM11_Pos (11UL) /*!< Position of MEMTRIM11 field.                                        */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM11_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM11_Pos) /*!< Bit mask of MEMTRIM11
                                                                            field.*/                                              

/* MEMTRIM12 @Bit 12 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM12_Pos (12UL) /*!< Position of MEMTRIM12 field.                                        */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM12_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM12_Pos) /*!< Bit mask of MEMTRIM12
                                                                            field.*/                                              

