adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CONNECTION10 @Bit 10 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Pos (10UL) /*!< Position of CONNECTION10 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Pos) /*!< Bit mask of
                                                                            CONNECTION10 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Min (0x0UL) /*!< Min enumerator value of CONNECTION10 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Max (0x1UL) /*!< Max enumerator value of CONNECTION10 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Disabled (0x0UL) /*!< Master port 10 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Enabled (0x1UL) /*!< Master port 10 connection to global slave is enabled    */

/* CONNECTION11 @Bit 11 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Pos (11UL) /*!< Position of CONNECTION11 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Pos) /*!< Bit mask of
                                                                            CONNECTION11 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Min (0x0UL) /*!< Min enumerator value of CONNECTION11 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Max (0x1UL) /*!< Max enumerator value of CONNECTION11 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Disabled (0x0UL) /*!< Master port 11 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Enabled (0x1UL) /*!< Master port 11 connection to global slave is enabled    */

/* CONNECTION12 @Bit 12 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Pos (12UL) /*!< Position of CONNECTION12 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Pos) /*!< Bit mask of
                                                                            CONNECTION12 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Min (0x0UL) /*!< Min enumerator value of CONNECTION12 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Max (0x1UL) /*!< Max enumerator value of CONNECTION12 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Disabled (0x0UL) /*!< Master port 12 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Enabled (0x1UL) /*!< Master port 12 connection to global slave is enabled    */

/* CONNECTION13 @Bit 13 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Pos (13UL) /*!< Position of CONNECTION13 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Pos) /*!< Bit mask of
                                                                            CONNECTION13 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Min (0x0UL) /*!< Min enumerator value of CONNECTION13 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Max (0x1UL) /*!< Max enumerator value of CONNECTION13 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Disabled (0x0UL) /*!< Master port 13 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Enabled (0x1UL) /*!< Master port 13 connection to global slave is enabled    */

/* CONNECTION14 @Bit 14 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Pos (14UL) /*!< Position of CONNECTION14 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Pos) /*!< Bit mask of
                                                                            CONNECTION14 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Min (0x0UL) /*!< Min enumerator value of CONNECTION14 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Max (0x1UL) /*!< Max enumerator value of CONNECTION14 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Disabled (0x0UL) /*!< Master port 14 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Enabled (0x1UL) /*!< Master port 14 connection to global slave is enabled    */

/* CONNECTION15 @Bit 15 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Pos (15UL) /*!< Position of CONNECTION15 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Pos) /*!< Bit mask of
                                                                            CONNECTION15 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Min (0x0UL) /*!< Min enumerator value of CONNECTION15 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Max (0x1UL) /*!< Max enumerator value of CONNECTION15 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Disabled (0x0UL) /*!< Master port 15 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Enabled (0x1UL) /*!< Master port 15 connection to global slave is enabled    */

/* CONNECTION16 @Bit 16 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Pos (16UL) /*!< Position of CONNECTION16 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Pos) /*!< Bit mask of
                                                                            CONNECTION16 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Min (0x0UL) /*!< Min enumerator value of CONNECTION16 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Max (0x1UL) /*!< Max enumerator value of CONNECTION16 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Disabled (0x0UL) /*!< Master port 16 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Enabled (0x1UL) /*!< Master port 16 connection to global slave is enabled    */

