adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CONNECTION17 @Bit 17 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Pos (17UL) /*!< Position of CONNECTION17 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Pos) /*!< Bit mask of
                                                                            CONNECTION17 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Min (0x0UL) /*!< Min enumerator value of CONNECTION17 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Max (0x1UL) /*!< Max enumerator value of CONNECTION17 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Disabled (0x0UL) /*!< Master port 17 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Enabled (0x1UL) /*!< Master port 17 connection to global slave is enabled    */

/* CONNECTION18 @Bit 18 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Pos (18UL) /*!< Position of CONNECTION18 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Pos) /*!< Bit mask of
                                                                            CONNECTION18 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Min (0x0UL) /*!< Min enumerator value of CONNECTION18 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Max (0x1UL) /*!< Max enumerator value of CONNECTION18 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Disabled (0x0UL) /*!< Master port 18 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Enabled (0x1UL) /*!< Master port 18 connection to global slave is enabled    */

/* CONNECTION19 @Bit 19 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION19_Pos (19UL) /*!< Position of CONNECTION19 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION19_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION19_Pos) /*!< Bit mask of
                                                                            CONNECTION19 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION19_Min (0x0UL) /*!< Min enumerator value of CONNECTION19 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION19_Max (0x1UL) /*!< Max enumerator value of CONNECTION19 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION19_Disabled (0x0UL) /*!< Master port 19 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION19_Enabled (0x1UL) /*!< Master port 19 connection to global slave is enabled    */

/* CONNECTION20 @Bit 20 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION20_Pos (20UL) /*!< Position of CONNECTION20 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION20_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION20_Pos) /*!< Bit mask of
                                                                            CONNECTION20 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION20_Min (0x0UL) /*!< Min enumerator value of CONNECTION20 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION20_Max (0x1UL) /*!< Max enumerator value of CONNECTION20 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION20_Disabled (0x0UL) /*!< Master port 20 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION20_Enabled (0x1UL) /*!< Master port 20 connection to global slave is enabled    */

/* CONNECTION21 @Bit 21 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION21_Pos (21UL) /*!< Position of CONNECTION21 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION21_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION21_Pos) /*!< Bit mask of
                                                                            CONNECTION21 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION21_Min (0x0UL) /*!< Min enumerator value of CONNECTION21 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION21_Max (0x1UL) /*!< Max enumerator value of CONNECTION21 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION21_Disabled (0x0UL) /*!< Master port 21 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION21_Enabled (0x1UL) /*!< Master port 21 connection to global slave is enabled    */

/* CONNECTION22 @Bit 22 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION22_Pos (22UL) /*!< Position of CONNECTION22 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION22_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION22_Pos) /*!< Bit mask of
                                                                            CONNECTION22 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION22_Min (0x0UL) /*!< Min enumerator value of CONNECTION22 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION22_Max (0x1UL) /*!< Max enumerator value of CONNECTION22 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION22_Disabled (0x0UL) /*!< Master port 22 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION22_Enabled (0x1UL) /*!< Master port 22 connection to global slave is enabled    */

/* CONNECTION23 @Bit 23 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION23_Pos (23UL) /*!< Position of CONNECTION23 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION23_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION23_Pos) /*!< Bit mask of
                                                                            CONNECTION23 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION23_Min (0x0UL) /*!< Min enumerator value of CONNECTION23 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION23_Max (0x1UL) /*!< Max enumerator value of CONNECTION23 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION23_Disabled (0x0UL) /*!< Master port 23 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION23_Enabled (0x1UL) /*!< Master port 23 connection to global slave is enabled    */

/* CONNECTION24 @Bit 24 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION24_Pos (24UL) /*!< Position of CONNECTION24 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION24_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION24_Pos) /*!< Bit mask of
                                                                            CONNECTION24 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION24_Min (0x0UL) /*!< Min enumerator value of CONNECTION24 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION24_Max (0x1UL) /*!< Max enumerator value of CONNECTION24 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION24_Disabled (0x0UL) /*!< Master port 24 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION24_Enabled (0x1UL) /*!< Master port 24 connection to global slave is enabled    */

/* CONNECTION25 @Bit 25 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION25_Pos (25UL) /*!< Position of CONNECTION25 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION25_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION25_Pos) /*!< Bit mask of
                                                                            CONNECTION25 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION25_Min (0x0UL) /*!< Min enumerator value of CONNECTION25 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION25_Max (0x1UL) /*!< Max enumerator value of CONNECTION25 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION25_Disabled (0x0UL) /*!< Master port 25 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION25_Enabled (0x1UL) /*!< Master port 25 connection to global slave is enabled    */

/* CONNECTION26 @Bit 26 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION26_Pos (26UL) /*!< Position of CONNECTION26 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION26_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION26_Pos) /*!< Bit mask of
                                                                            CONNECTION26 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION26_Min (0x0UL) /*!< Min enumerator value of CONNECTION26 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION26_Max (0x1UL) /*!< Max enumerator value of CONNECTION26 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION26_Disabled (0x0UL) /*!< Master port 26 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION26_Enabled (0x1UL) /*!< Master port 26 connection to global slave is enabled    */

/* CONNECTION27 @Bit 27 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION27_Pos (27UL) /*!< Position of CONNECTION27 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION27_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION27_Pos) /*!< Bit mask of
                                                                            CONNECTION27 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION27_Min (0x0UL) /*!< Min enumerator value of CONNECTION27 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION27_Max (0x1UL) /*!< Max enumerator value of CONNECTION27 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION27_Disabled (0x0UL) /*!< Master port 27 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION27_Enabled (0x1UL) /*!< Master port 27 connection to global slave is enabled    */

/* CONNECTION28 @Bit 28 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION28_Pos (28UL) /*!< Position of CONNECTION28 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION28_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION28_Pos) /*!< Bit mask of
                                                                            CONNECTION28 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION28_Min (0x0UL) /*!< Min enumerator value of CONNECTION28 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION28_Max (0x1UL) /*!< Max enumerator value of CONNECTION28 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION28_Disabled (0x0UL) /*!< Master port 28 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION28_Enabled (0x1UL) /*!< Master port 28 connection to global slave is enabled    */

/* CONNECTION29 @Bit 29 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION29_Pos (29UL) /*!< Position of CONNECTION29 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION29_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION29_Pos) /*!< Bit mask of
                                                                            CONNECTION29 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION29_Min (0x0UL) /*!< Min enumerator value of CONNECTION29 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION29_Max (0x1UL) /*!< Max enumerator value of CONNECTION29 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION29_Disabled (0x0UL) /*!< Master port 29 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION29_Enabled (0x1UL) /*!< Master port 29 connection to global slave is enabled    */

/* CONNECTION30 @Bit 30 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION30_Pos (30UL) /*!< Position of CONNECTION30 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION30_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION30_Pos) /*!< Bit mask of
                                                                            CONNECTION30 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION30_Min (0x0UL) /*!< Min enumerator value of CONNECTION30 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION30_Max (0x1UL) /*!< Max enumerator value of CONNECTION30 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION30_Disabled (0x0UL) /*!< Master port 30 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION30_Enabled (0x1UL) /*!< Master port 30 connection to global slave is enabled    */

/* CONNECTION31 @Bit 31 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION31_Pos (31UL) /*!< Position of CONNECTION31 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION31_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION31_Pos) /*!< Bit mask of
                                                                            CONNECTION31 field.*/                                 
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION31_Min (0x0UL) /*!< Min enumerator value of CONNECTION31 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION31_Max (0x1UL) /*!< Max enumerator value of CONNECTION31 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION31_Disabled (0x0UL) /*!< Master port 31 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION31_Enabled (0x1UL) /*!< Master port 31 connection to global slave is enabled    */


/* MPC_GLOBALSLAVE_LOCK: Lock global slave registers */
  #define MPC_GLOBALSLAVE_LOCK_ResetValue (0x00000000UL) /*!< Reset value of LOCK register.                                    */

/* LOCK @Bit 0 : Enable lock */
  #define MPC_GLOBALSLAVE_LOCK_LOCK_Pos (0UL)        /*!< Position of LOCK field.                                              */
  #define MPC_GLOBALSLAVE_LOCK_LOCK_Msk (0x1UL << MPC_GLOBALSLAVE_LOCK_LOCK_Pos) /*!< Bit mask of LOCK field.                  */
  #define MPC_GLOBALSLAVE_LOCK_LOCK_Min (0x0UL)      /*!< Min enumerator value of LOCK field.                                  */
  #define MPC_GLOBALSLAVE_LOCK_LOCK_Max (0x1UL)      /*!< Max enumerator value of LOCK field.                                  */
  #define MPC_GLOBALSLAVE_LOCK_LOCK_Disabled (0x0UL) /*!< Lock disabled.                                                       */
  #define MPC_GLOBALSLAVE_LOCK_LOCK_Enabled (0x1UL)  /*!< Lock enabled.                                                        */



/* =================================================== Struct MPC_RTCHOKE ==================================================== */
/**
  * @brief RTCHOKE [MPC_RTCHOKE] Real time choke configuration for AXI master port
  */
typedef struct {
  __IOM uint32_t  WRITEACCESS;                       /*!< (@ 0x00000000) Enable AXI Write Address Channel Real Time Choke for
                                                                         master port*/                                            
  __IOM uint32_t  READACCESS;                        /*!< (@ 0x00000004) Enable AXI Read Address Channel Real Time Choke for
                                                                         master port*/                                            
  __IM  uint32_t  RESERVED[22];
  __IOM uint32_t  DELAY[32];                         /*!< (@ 0x00000060) Real Time Choke delay value for slave number n        */
} NRF_MPC_RTCHOKE_Type;                              /*!< Size = 224 (0x0E0)                                                   */

/* MPC_RTCHOKE_WRITEACCESS: Enable AXI Write Address Channel Real Time Choke for master port */
  #define MPC_RTCHOKE_WRITEACCESS_ResetValue (0x00000000UL) /*!< Reset value of WRITEACCESS register.                          */

/* ENABLE0 @Bit 0 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE0_Pos (0UL)  /*!< Position of ENABLE0 field.                                           */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE0_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE0_Pos) /*!< Bit mask of ENABLE0 field.   */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE0_Min (0x0UL) /*!< Min enumerator value of ENABLE0 field.                              */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE0_Max (0x1UL) /*!< Max enumerator value of ENABLE0 field.                              */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE0_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 0 Write Address
                                                               Channel*/                                                          
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE0_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 0 Write Address
                                                              Channel*/                                                           

/* ENABLE1 @Bit 1 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE1_Pos (1UL)  /*!< Position of ENABLE1 field.                                           */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE1_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE1_Pos) /*!< Bit mask of ENABLE1 field.   */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE1_Min (0x0UL) /*!< Min enumerator value of ENABLE1 field.                              */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE1_Max (0x1UL) /*!< Max enumerator value of ENABLE1 field.                              */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE1_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 1 Write Address
                                                               Channel*/                                                          
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE1_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 1 Write Address
                                                              Channel*/                                                           

/* ENABLE2 @Bit 2 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE2_Pos (2UL)  /*!< Position of ENABLE2 field.                                           */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE2_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE2_Pos) /*!< Bit mask of ENABLE2 field.   */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE2_Min (0x0UL) /*!< Min enumerator value of ENABLE2 field.                              */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE2_Max (0x1UL) /*!< Max enumerator value of ENABLE2 field.                              */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE2_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 2 Write Address
                                                               Channel*/                                                          
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE2_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 2 Write Address
                                                              Channel*/                                                           

/* ENABLE3 @Bit 3 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE3_Pos (3UL)  /*!< Position of ENABLE3 field.                                           */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE3_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE3_Pos) /*!< Bit mask of ENABLE3 field.   */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE3_Min (0x0UL) /*!< Min enumerator value of ENABLE3 field.                              */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE3_Max (0x1UL) /*!< Max enumerator value of ENABLE3 field.                              */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE3_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 3 Write Address
                                                               Channel*/                                                          
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE3_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 3 Write Address
                                                              Channel*/                                                           

