adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ENABLE23 @Bit 23 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE23_Pos (23UL) /*!< Position of ENABLE23 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE23_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE23_Pos) /*!< Bit mask of ENABLE23 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE23_Min (0x0UL) /*!< Min enumerator value of ENABLE23 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE23_Max (0x1UL) /*!< Max enumerator value of ENABLE23 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE23_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 23 Read Address
                                                               Channel*/                                                          
  #define MPC_RTCHOKE_READACCESS_ENABLE23_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 23 Read Address
                                                              Channel*/                                                           

/* ENABLE24 @Bit 24 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE24_Pos (24UL) /*!< Position of ENABLE24 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE24_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE24_Pos) /*!< Bit mask of ENABLE24 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE24_Min (0x0UL) /*!< Min enumerator value of ENABLE24 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE24_Max (0x1UL) /*!< Max enumerator value of ENABLE24 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE24_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 24 Read Address
                                                               Channel*/                                                          
  #define MPC_RTCHOKE_READACCESS_ENABLE24_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 24 Read Address
                                                              Channel*/                                                           

/* ENABLE25 @Bit 25 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE25_Pos (25UL) /*!< Position of ENABLE25 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE25_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE25_Pos) /*!< Bit mask of ENABLE25 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE25_Min (0x0UL) /*!< Min enumerator value of ENABLE25 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE25_Max (0x1UL) /*!< Max enumerator value of ENABLE25 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE25_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 25 Read Address
                                                               Channel*/                                                          
  #define MPC_RTCHOKE_READACCESS_ENABLE25_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 25 Read Address
                                                              Channel*/                                                           

/* ENABLE26 @Bit 26 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE26_Pos (26UL) /*!< Position of ENABLE26 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE26_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE26_Pos) /*!< Bit mask of ENABLE26 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE26_Min (0x0UL) /*!< Min enumerator value of ENABLE26 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE26_Max (0x1UL) /*!< Max enumerator value of ENABLE26 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE26_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 26 Read Address
                                                               Channel*/                                                          
  #define MPC_RTCHOKE_READACCESS_ENABLE26_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 26 Read Address
                                                              Channel*/                                                           

/* ENABLE27 @Bit 27 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE27_Pos (27UL) /*!< Position of ENABLE27 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE27_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE27_Pos) /*!< Bit mask of ENABLE27 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE27_Min (0x0UL) /*!< Min enumerator value of ENABLE27 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE27_Max (0x1UL) /*!< Max enumerator value of ENABLE27 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE27_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 27 Read Address
                                                               Channel*/                                                          
  #define MPC_RTCHOKE_READACCESS_ENABLE27_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 27 Read Address
                                                              Channel*/                                                           

/* ENABLE28 @Bit 28 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE28_Pos (28UL) /*!< Position of ENABLE28 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE28_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE28_Pos) /*!< Bit mask of ENABLE28 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE28_Min (0x0UL) /*!< Min enumerator value of ENABLE28 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE28_Max (0x1UL) /*!< Max enumerator value of ENABLE28 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE28_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 28 Read Address
                                                               Channel*/                                                          
  #define MPC_RTCHOKE_READACCESS_ENABLE28_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 28 Read Address
                                                              Channel*/                                                           

/* ENABLE29 @Bit 29 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE29_Pos (29UL) /*!< Position of ENABLE29 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE29_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE29_Pos) /*!< Bit mask of ENABLE29 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE29_Min (0x0UL) /*!< Min enumerator value of ENABLE29 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE29_Max (0x1UL) /*!< Max enumerator value of ENABLE29 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE29_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 29 Read Address
                                                               Channel*/                                                          
  #define MPC_RTCHOKE_READACCESS_ENABLE29_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 29 Read Address
                                                              Channel*/                                                           

/* ENABLE30 @Bit 30 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE30_Pos (30UL) /*!< Position of ENABLE30 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE30_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE30_Pos) /*!< Bit mask of ENABLE30 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE30_Min (0x0UL) /*!< Min enumerator value of ENABLE30 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE30_Max (0x1UL) /*!< Max enumerator value of ENABLE30 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE30_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 30 Read Address
                                                               Channel*/                                                          
  #define MPC_RTCHOKE_READACCESS_ENABLE30_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 30 Read Address
                                                              Channel*/                                                           

/* ENABLE31 @Bit 31 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE31_Pos (31UL) /*!< Position of ENABLE31 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE31_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE31_Pos) /*!< Bit mask of ENABLE31 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE31_Min (0x0UL) /*!< Min enumerator value of ENABLE31 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE31_Max (0x1UL) /*!< Max enumerator value of ENABLE31 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE31_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 31 Read Address
                                                               Channel*/                                                          
  #define MPC_RTCHOKE_READACCESS_ENABLE31_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 31 Read Address
                                                              Channel*/                                                           


/* MPC_RTCHOKE_DELAY: Real Time Choke delay value for slave number n */
  #define MPC_RTCHOKE_DELAY_MaxCount (32UL)          /*!< Max size of DELAY[32] array.                                         */
  #define MPC_RTCHOKE_DELAY_ResetValue (0x00000000UL) /*!< Reset value of DELAY[32] register.                                  */

/* DELAY @Bits 0..7 : Real Time Choke delay in bus clock cycles. */
  #define MPC_RTCHOKE_DELAY_DELAY_Pos (0UL)          /*!< Position of DELAY field.                                             */
  #define MPC_RTCHOKE_DELAY_DELAY_Msk (0xFFUL << MPC_RTCHOKE_DELAY_DELAY_Pos) /*!< Bit mask of DELAY field.                    */
  #define MPC_RTCHOKE_DELAY_DELAY_Min (0x0UL)        /*!< Min value of DELAY field.                                            */
  #define MPC_RTCHOKE_DELAY_DELAY_Max (0xFFUL)       /*!< Max size of DELAY field.                                             */



/* ==================================================== Struct MPC_REGION ==================================================== */
/**
  * @brief REGION [MPC_REGION] Memory region to slave decoding table
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) Slave region n Configuration register                 */
  __IOM uint32_t  STARTADDR;                         /*!< (@ 0x00000004) Region n start address                                */
  __IOM uint32_t  ADDRMASK;                          /*!< (@ 0x00000008) Select which bits of the incoming address are compared
                                                                         against the STARTADDR*/                                  
  __IOM uint32_t  MASTERPORT;                        /*!< (@ 0x0000000C) Region n local master enable                          */
} NRF_MPC_REGION_Type;                               /*!< Size = 16 (0x010)                                                    */
  #define MPC_REGION_MaxCount (32UL)                 /*!< Max size of REGION[32] array.                                        */

/* MPC_REGION_CONFIG: Slave region n Configuration register */
  #define MPC_REGION_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                                     */

/* SLAVENUMBER @Bits 0..4 : Target slave number for region n accesses. Slave number 0 is reserved for default slave */
  #define MPC_REGION_CONFIG_SLAVENUMBER_Pos (0UL)    /*!< Position of SLAVENUMBER field.                                       */
  #define MPC_REGION_CONFIG_SLAVENUMBER_Msk (0x1FUL << MPC_REGION_CONFIG_SLAVENUMBER_Pos) /*!< Bit mask of SLAVENUMBER field.  */
  #define MPC_REGION_CONFIG_SLAVENUMBER_Min (0x0UL)  /*!< Min value of SLAVENUMBER field.                                      */
  #define MPC_REGION_CONFIG_SLAVENUMBER_Max (0x1FUL) /*!< Max size of SLAVENUMBER field.                                       */

