adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ENABLE3 @Bit 3 : Enable region n for master port 3 */
  #define MPC_REGION_MASTERPORT_ENABLE3_Pos (3UL)    /*!< Position of ENABLE3 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE3_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE3_Pos) /*!< Bit mask of ENABLE3 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE3_Min (0x0UL)  /*!< Min enumerator value of ENABLE3 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE3_Max (0x1UL)  /*!< Max enumerator value of ENABLE3 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE3_Disable (0x0UL) /*!< Region n is disabled for master port 3                            */
  #define MPC_REGION_MASTERPORT_ENABLE3_Enable (0x1UL) /*!< Region n is enabled for master port 3                              */

/* ENABLE4 @Bit 4 : Enable region n for master port 4 */
  #define MPC_REGION_MASTERPORT_ENABLE4_Pos (4UL)    /*!< Position of ENABLE4 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE4_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE4_Pos) /*!< Bit mask of ENABLE4 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE4_Min (0x0UL)  /*!< Min enumerator value of ENABLE4 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE4_Max (0x1UL)  /*!< Max enumerator value of ENABLE4 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE4_Disable (0x0UL) /*!< Region n is disabled for master port 4                            */
  #define MPC_REGION_MASTERPORT_ENABLE4_Enable (0x1UL) /*!< Region n is enabled for master port 4                              */

/* ENABLE5 @Bit 5 : Enable region n for master port 5 */
  #define MPC_REGION_MASTERPORT_ENABLE5_Pos (5UL)    /*!< Position of ENABLE5 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE5_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE5_Pos) /*!< Bit mask of ENABLE5 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE5_Min (0x0UL)  /*!< Min enumerator value of ENABLE5 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE5_Max (0x1UL)  /*!< Max enumerator value of ENABLE5 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE5_Disable (0x0UL) /*!< Region n is disabled for master port 5                            */
  #define MPC_REGION_MASTERPORT_ENABLE5_Enable (0x1UL) /*!< Region n is enabled for master port 5                              */

/* ENABLE6 @Bit 6 : Enable region n for master port 6 */
  #define MPC_REGION_MASTERPORT_ENABLE6_Pos (6UL)    /*!< Position of ENABLE6 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE6_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE6_Pos) /*!< Bit mask of ENABLE6 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE6_Min (0x0UL)  /*!< Min enumerator value of ENABLE6 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE6_Max (0x1UL)  /*!< Max enumerator value of ENABLE6 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE6_Disable (0x0UL) /*!< Region n is disabled for master port 6                            */
  #define MPC_REGION_MASTERPORT_ENABLE6_Enable (0x1UL) /*!< Region n is enabled for master port 6                              */

/* ENABLE7 @Bit 7 : Enable region n for master port 7 */
  #define MPC_REGION_MASTERPORT_ENABLE7_Pos (7UL)    /*!< Position of ENABLE7 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE7_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE7_Pos) /*!< Bit mask of ENABLE7 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE7_Min (0x0UL)  /*!< Min enumerator value of ENABLE7 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE7_Max (0x1UL)  /*!< Max enumerator value of ENABLE7 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE7_Disable (0x0UL) /*!< Region n is disabled for master port 7                            */
  #define MPC_REGION_MASTERPORT_ENABLE7_Enable (0x1UL) /*!< Region n is enabled for master port 7                              */

/* ENABLE8 @Bit 8 : Enable region n for master port 8 */
  #define MPC_REGION_MASTERPORT_ENABLE8_Pos (8UL)    /*!< Position of ENABLE8 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE8_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE8_Pos) /*!< Bit mask of ENABLE8 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE8_Min (0x0UL)  /*!< Min enumerator value of ENABLE8 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE8_Max (0x1UL)  /*!< Max enumerator value of ENABLE8 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE8_Disable (0x0UL) /*!< Region n is disabled for master port 8                            */
  #define MPC_REGION_MASTERPORT_ENABLE8_Enable (0x1UL) /*!< Region n is enabled for master port 8                              */

/* ENABLE9 @Bit 9 : Enable region n for master port 9 */
  #define MPC_REGION_MASTERPORT_ENABLE9_Pos (9UL)    /*!< Position of ENABLE9 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE9_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE9_Pos) /*!< Bit mask of ENABLE9 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE9_Min (0x0UL)  /*!< Min enumerator value of ENABLE9 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE9_Max (0x1UL)  /*!< Max enumerator value of ENABLE9 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE9_Disable (0x0UL) /*!< Region n is disabled for master port 9                            */
  #define MPC_REGION_MASTERPORT_ENABLE9_Enable (0x1UL) /*!< Region n is enabled for master port 9                              */

/* ENABLE10 @Bit 10 : Enable region n for master port 10 */
  #define MPC_REGION_MASTERPORT_ENABLE10_Pos (10UL)  /*!< Position of ENABLE10 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE10_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE10_Pos) /*!< Bit mask of ENABLE10 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE10_Min (0x0UL) /*!< Min enumerator value of ENABLE10 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE10_Max (0x1UL) /*!< Max enumerator value of ENABLE10 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE10_Disable (0x0UL) /*!< Region n is disabled for master port 10                          */
  #define MPC_REGION_MASTERPORT_ENABLE10_Enable (0x1UL) /*!< Region n is enabled for master port 10                            */

