adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* MRAMC_LOWAVGCURR_WRITE: Preload timeout value for low average current in case of write */
  #define MRAMC_LOWAVGCURR_WRITE_ResetValue (0x00000000UL) /*!< Reset value of WRITE register.                                 */

/* VALUE @Bits 0..11 : Preload value */
  #define MRAMC_LOWAVGCURR_WRITE_VALUE_Pos (0UL)     /*!< Position of VALUE field.                                             */
  #define MRAMC_LOWAVGCURR_WRITE_VALUE_Msk (0xFFFUL << MRAMC_LOWAVGCURR_WRITE_VALUE_Pos) /*!< Bit mask of VALUE field.         */
  #define MRAMC_LOWAVGCURR_WRITE_VALUE_Min (0x0UL)   /*!< Min value of VALUE field.                                            */
  #define MRAMC_LOWAVGCURR_WRITE_VALUE_Max (0xFFFUL) /*!< Max size of VALUE field.                                             */


/* MRAMC_LOWAVGCURR_ERASE: Preload timeout value for low average current in case of erase */
  #define MRAMC_LOWAVGCURR_ERASE_ResetValue (0x00000000UL) /*!< Reset value of ERASE register.                                 */

/* VALUE @Bits 0..11 : Preload value */
  #define MRAMC_LOWAVGCURR_ERASE_VALUE_Pos (0UL)     /*!< Position of VALUE field.                                             */
  #define MRAMC_LOWAVGCURR_ERASE_VALUE_Msk (0xFFFUL << MRAMC_LOWAVGCURR_ERASE_VALUE_Pos) /*!< Bit mask of VALUE field.         */
  #define MRAMC_LOWAVGCURR_ERASE_VALUE_Min (0x0UL)   /*!< Min value of VALUE field.                                            */
  #define MRAMC_LOWAVGCURR_ERASE_VALUE_Max (0xFFFUL) /*!< Max size of VALUE field.                                             */



/* =================================================== Struct MRAMC_POWER ==================================================== */
/**
  * @brief POWER [MRAMC_POWER] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INIT;                              /*!< (@ 0x00000000) Initiates power up or down sequence.                  */
  __IOM uint32_t  AUTOPOWERDOWN;                     /*!< (@ 0x00000004) Configures the automatic power down feature using the
                                                                         inactive time period of MRAM.*/                          
  __IOM uint32_t  MASK;                              /*!< (@ 0x00000008) Mask for the various voltages supplies when initiating
                                                                         power up/down.*/                                         
  __IM  uint32_t  STATUS;                            /*!< (@ 0x0000000C) Status of the power up/down sequence.                 */
  __IM  uint32_t  POWERUPACK;                        /*!< (@ 0x00000010) Status of the power control signals acknowledgement
                                                                         during power up sequence.*/                              
  __IM  uint32_t  POWERDOWNACK;                      /*!< (@ 0x00000014) Status of the power control signals acknowledgement
                                                                         during power down sequence.*/                            
  __IOM uint32_t  FORCEON;                           /*!< (@ 0x00000018) Force ON the power supply.                            */
  __IOM uint32_t  FORCEOFF;                          /*!< (@ 0x0000001C) Force OFF the power supply.                           */
} NRF_MRAMC_POWER_Type;                              /*!< Size = 32 (0x020)                                                    */

/* MRAMC_POWER_INIT: Initiates power up or down sequence. */
  #define MRAMC_POWER_INIT_ResetValue (0x00000000UL) /*!< Reset value of INIT register.                                        */

/* MODE @Bits 0..1 : Power mode. */
  #define MRAMC_POWER_INIT_MODE_Pos (0UL)            /*!< Position of MODE field.                                              */
  #define MRAMC_POWER_INIT_MODE_Msk (0x3UL << MRAMC_POWER_INIT_MODE_Pos) /*!< Bit mask of MODE field.                          */
  #define MRAMC_POWER_INIT_MODE_Min (0x0UL)          /*!< Min enumerator value of MODE field.                                  */
  #define MRAMC_POWER_INIT_MODE_Max (0x3UL)          /*!< Max enumerator value of MODE field.                                  */
  #define MRAMC_POWER_INIT_MODE_NoOperation (0x0UL)  /*!< No change in power mode                                              */
  #define MRAMC_POWER_INIT_MODE_PowerUp (0x1UL)      /*!< Triggers power up sequence. Ignored if MRAM is already in Active mode
                                                          or Standby mode.*/                                                      
  #define MRAMC_POWER_INIT_MODE_PowerDown (0x2UL)    /*!< Initiates power down sequence. Ignored if MRAM is already in MRAM_OFF
                                                          mode.*/                                                                 
  #define MRAMC_POWER_INIT_MODE_PowerDownTrimRet (0x3UL) /*!< Initiates power down sequence with trim retained. Ignored if MRAM
                                                              is already in MRAM_OFF_TRIM_RETAIN mode.*/                          

/* KEY @Bits 16..31 : Key to enable the writing to this register. */
  #define MRAMC_POWER_INIT_KEY_Pos (16UL)            /*!< Position of KEY field.                                               */
  #define MRAMC_POWER_INIT_KEY_Msk (0xFFFFUL << MRAMC_POWER_INIT_KEY_Pos) /*!< Bit mask of KEY field.                          */
  #define MRAMC_POWER_INIT_KEY_Min (0x0UL)           /*!< Min enumerator value of KEY field.                                   */
  #define MRAMC_POWER_INIT_KEY_Max (0xA66DUL)        /*!< Max enumerator value of KEY field.                                   */
  #define MRAMC_POWER_INIT_KEY_Disable (0x0000UL)    /*!< Disable the writing to this register                                 */
  #define MRAMC_POWER_INIT_KEY_Enable (0xA66DUL)     /*!< Enable the writing to this register                                  */


/* MRAMC_POWER_AUTOPOWERDOWN: Configures the automatic power down feature using the inactive time period of MRAM. */
  #define MRAMC_POWER_AUTOPOWERDOWN_ResetValue (0x00000000UL) /*!< Reset value of AUTOPOWERDOWN register.                      */

/* TIMEOUTVALUE @Bits 0..15 : Tiemout value for the power down. */
  #define MRAMC_POWER_AUTOPOWERDOWN_TIMEOUTVALUE_Pos (0UL) /*!< Position of TIMEOUTVALUE field.                                */
  #define MRAMC_POWER_AUTOPOWERDOWN_TIMEOUTVALUE_Msk (0xFFFFUL << MRAMC_POWER_AUTOPOWERDOWN_TIMEOUTVALUE_Pos) /*!< Bit mask of
                                                                            TIMEOUTVALUE field.*/                                 
  #define MRAMC_POWER_AUTOPOWERDOWN_TIMEOUTVALUE_Min (0x0UL) /*!< Min value of TIMEOUTVALUE field.                             */
  #define MRAMC_POWER_AUTOPOWERDOWN_TIMEOUTVALUE_Max (0xFFFFUL) /*!< Max size of TIMEOUTVALUE field.                           */

