adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* POWERDOWNCFG @Bit 30 : Power down mode when the timeout happens. */
  #define MRAMC_POWER_AUTOPOWERDOWN_POWERDOWNCFG_Pos (30UL) /*!< Position of POWERDOWNCFG field.                               */
  #define MRAMC_POWER_AUTOPOWERDOWN_POWERDOWNCFG_Msk (0x1UL << MRAMC_POWER_AUTOPOWERDOWN_POWERDOWNCFG_Pos) /*!< Bit mask of
                                                                            POWERDOWNCFG field.*/                                 
  #define MRAMC_POWER_AUTOPOWERDOWN_POWERDOWNCFG_Min (0x0UL) /*!< Min enumerator value of POWERDOWNCFG field.                  */
  #define MRAMC_POWER_AUTOPOWERDOWN_POWERDOWNCFG_Max (0x1UL) /*!< Max enumerator value of POWERDOWNCFG field.                  */
  #define MRAMC_POWER_AUTOPOWERDOWN_POWERDOWNCFG_MramOffTrimRetain (0x0UL) /*!< Power mode is MRAM_OFF_TRIM_RETAIN             */
  #define MRAMC_POWER_AUTOPOWERDOWN_POWERDOWNCFG_MramOff (0x1UL) /*!< Power mode is MRAM_OFF                                   */

/* ENABLE @Bit 31 : Enable the automatic power down feature. */
  #define MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Pos (31UL) /*!< Position of ENABLE field.                                           */
  #define MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Msk (0x1UL << MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Pos) /*!< Bit mask of ENABLE field.  */
  #define MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                              */
  #define MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                              */
  #define MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Disable (0x0UL) /*!< Disable the automatic power down feature                       */
  #define MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Enable (0x1UL) /*!< Enable the automatic power down feature                         */


/* MRAMC_POWER_MASK: Mask for the various voltages supplies when initiating power up/down. */
  #define MRAMC_POWER_MASK_ResetValue (0x00000000UL) /*!< Reset value of MASK register.                                        */

/* VDD @Bit 0 : Mask VDD */
  #define MRAMC_POWER_MASK_VDD_Pos (0UL)             /*!< Position of VDD field.                                               */
  #define MRAMC_POWER_MASK_VDD_Msk (0x1UL << MRAMC_POWER_MASK_VDD_Pos) /*!< Bit mask of VDD field.                             */
  #define MRAMC_POWER_MASK_VDD_Min (0x0UL)           /*!< Min enumerator value of VDD field.                                   */
  #define MRAMC_POWER_MASK_VDD_Max (0x1UL)           /*!< Max enumerator value of VDD field.                                   */
  #define MRAMC_POWER_MASK_VDD_NoOperation (0x0UL)   /*!< No operation                                                         */
  #define MRAMC_POWER_MASK_VDD_Mask (0x1UL)          /*!< Mask VDD                                                             */

/* VDDA @Bit 1 : Mask VDDA */
  #define MRAMC_POWER_MASK_VDDA_Pos (1UL)            /*!< Position of VDDA field.                                              */
  #define MRAMC_POWER_MASK_VDDA_Msk (0x1UL << MRAMC_POWER_MASK_VDDA_Pos) /*!< Bit mask of VDDA field.                          */
  #define MRAMC_POWER_MASK_VDDA_Min (0x0UL)          /*!< Min enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_MASK_VDDA_Max (0x1UL)          /*!< Max enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_MASK_VDDA_NoOperation (0x0UL)  /*!< No operation                                                         */
  #define MRAMC_POWER_MASK_VDDA_Mask (0x1UL)         /*!< Mask VDDA                                                            */

/* VDDCFG @Bit 2 : Mask VDD_CFG */
  #define MRAMC_POWER_MASK_VDDCFG_Pos (2UL)          /*!< Position of VDDCFG field.                                            */
  #define MRAMC_POWER_MASK_VDDCFG_Msk (0x1UL << MRAMC_POWER_MASK_VDDCFG_Pos) /*!< Bit mask of VDDCFG field.                    */
  #define MRAMC_POWER_MASK_VDDCFG_Min (0x0UL)        /*!< Min enumerator value of VDDCFG field.                                */
  #define MRAMC_POWER_MASK_VDDCFG_Max (0x1UL)        /*!< Max enumerator value of VDDCFG field.                                */
  #define MRAMC_POWER_MASK_VDDCFG_NoOperation (0x0UL) /*!< No operation                                                        */
  #define MRAMC_POWER_MASK_VDDCFG_Mask (0x1UL)       /*!< Mask VDD_CFG                                                         */

/* VDDACFG @Bit 3 : Mask VDDA_CFG */
  #define MRAMC_POWER_MASK_VDDACFG_Pos (3UL)         /*!< Position of VDDACFG field.                                           */
  #define MRAMC_POWER_MASK_VDDACFG_Msk (0x1UL << MRAMC_POWER_MASK_VDDACFG_Pos) /*!< Bit mask of VDDACFG field.                 */
  #define MRAMC_POWER_MASK_VDDACFG_Min (0x0UL)       /*!< Min enumerator value of VDDACFG field.                               */
  #define MRAMC_POWER_MASK_VDDACFG_Max (0x1UL)       /*!< Max enumerator value of VDDACFG field.                               */
  #define MRAMC_POWER_MASK_VDDACFG_NoOperation (0x0UL) /*!< No operation                                                       */
  #define MRAMC_POWER_MASK_VDDACFG_Mask (0x1UL)      /*!< Mask VDDA_CFG                                                        */

/* VREF @Bit 4 : Mask VREF */
  #define MRAMC_POWER_MASK_VREF_Pos (4UL)            /*!< Position of VREF field.                                              */
  #define MRAMC_POWER_MASK_VREF_Msk (0x1UL << MRAMC_POWER_MASK_VREF_Pos) /*!< Bit mask of VREF field.                          */
  #define MRAMC_POWER_MASK_VREF_Min (0x0UL)          /*!< Min enumerator value of VREF field.                                  */
  #define MRAMC_POWER_MASK_VREF_Max (0x1UL)          /*!< Max enumerator value of VREF field.                                  */
  #define MRAMC_POWER_MASK_VREF_NoOperation (0x0UL)  /*!< No operation                                                         */
  #define MRAMC_POWER_MASK_VREF_Mask (0x1UL)         /*!< Mask VREF                                                            */

/* VPR @Bit 5 : Mask VPR */
  #define MRAMC_POWER_MASK_VPR_Pos (5UL)             /*!< Position of VPR field.                                               */
  #define MRAMC_POWER_MASK_VPR_Msk (0x1UL << MRAMC_POWER_MASK_VPR_Pos) /*!< Bit mask of VPR field.                             */
  #define MRAMC_POWER_MASK_VPR_Min (0x0UL)           /*!< Min enumerator value of VPR field.                                   */
  #define MRAMC_POWER_MASK_VPR_Max (0x1UL)           /*!< Max enumerator value of VPR field.                                   */
  #define MRAMC_POWER_MASK_VPR_NoOperation (0x0UL)   /*!< No operation                                                         */
  #define MRAMC_POWER_MASK_VPR_Mask (0x1UL)          /*!< Mask VPR                                                             */

