adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* KEY @Bits 16..31 : Key to enable the writing to this register. */
  #define MRAMC_POWER_MASK_KEY_Pos (16UL)            /*!< Position of KEY field.                                               */
  #define MRAMC_POWER_MASK_KEY_Msk (0xFFFFUL << MRAMC_POWER_MASK_KEY_Pos) /*!< Bit mask of KEY field.                          */
  #define MRAMC_POWER_MASK_KEY_Min (0x0UL)           /*!< Min enumerator value of KEY field.                                   */
  #define MRAMC_POWER_MASK_KEY_Max (0xA66DUL)        /*!< Max enumerator value of KEY field.                                   */
  #define MRAMC_POWER_MASK_KEY_Disable (0x0000UL)    /*!< Disable the writing to this register                                 */
  #define MRAMC_POWER_MASK_KEY_Enable (0xA66DUL)     /*!< Enable the writing to this register                                  */


/* MRAMC_POWER_STATUS: Status of the power up/down sequence. */
  #define MRAMC_POWER_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                                    */

/* STATE @Bits 0..3 : The current power up/down state. */
  #define MRAMC_POWER_STATUS_STATE_Pos (0UL)         /*!< Position of STATE field.                                             */
  #define MRAMC_POWER_STATUS_STATE_Msk (0xFUL << MRAMC_POWER_STATUS_STATE_Pos) /*!< Bit mask of STATE field.                   */
  #define MRAMC_POWER_STATUS_STATE_Min (0x0UL)       /*!< Min enumerator value of STATE field.                                 */
  #define MRAMC_POWER_STATUS_STATE_Max (0x8UL)       /*!< Max enumerator value of STATE field.                                 */
  #define MRAMC_POWER_STATUS_STATE_Off (0x0UL)       /*!< MRAM is OFF                                                          */
  #define MRAMC_POWER_STATUS_STATE_PowerUpSeq (0x1UL) /*!< MRAM power up sequence is active                                    */
  #define MRAMC_POWER_STATUS_STATE_TrimConfigSeq (0x2UL) /*!< Request for the MRAM trim configuration.                         */
  #define MRAMC_POWER_STATUS_STATE_TrimConfigWait (0x3UL) /*!< Waiting for the MRAM trim configuration to complete.            */
  #define MRAMC_POWER_STATUS_STATE_TrimConfigDone (0x4UL) /*!< The MRAM trim configuration to completed (This is momentary
                                                               state).*/                                                          
  #define MRAMC_POWER_STATUS_STATE_Standby (0x5UL)   /*!< MRAM is in standby mode.                                             */
  #define MRAMC_POWER_STATUS_STATE_Active (0x6UL)    /*!< MRAM is in active mode (or in standby mode)                          */
  #define MRAMC_POWER_STATUS_STATE_PowerDownSeq (0x7UL) /*!< MRAM power down sequence is active                                */
  #define MRAMC_POWER_STATUS_STATE_OffTrimRetain (0x8UL) /*!< MRAM is OFF with trim configuration in retain                    */


/* MRAMC_POWER_POWERUPACK: Status of the power control signals acknowledgement during power up sequence. */
  #define MRAMC_POWER_POWERUPACK_ResetValue (0x00000000UL) /*!< Reset value of POWERUPACK register.                            */

/* VREF @Bit 0 : Waiting for VREF up ACK or not */
  #define MRAMC_POWER_POWERUPACK_VREF_Pos (0UL)      /*!< Position of VREF field.                                              */
  #define MRAMC_POWER_POWERUPACK_VREF_Msk (0x1UL << MRAMC_POWER_POWERUPACK_VREF_Pos) /*!< Bit mask of VREF field.              */
  #define MRAMC_POWER_POWERUPACK_VREF_Min (0x0UL)    /*!< Min enumerator value of VREF field.                                  */
  #define MRAMC_POWER_POWERUPACK_VREF_Max (0x1UL)    /*!< Max enumerator value of VREF field.                                  */
  #define MRAMC_POWER_POWERUPACK_VREF_Busy (0x0UL)   /*!< Busy                                                                 */
  #define MRAMC_POWER_POWERUPACK_VREF_Ready (0x1UL)  /*!< Ready                                                                */

/* VPR @Bit 1 : Waiting for VPR up ACK or not */
  #define MRAMC_POWER_POWERUPACK_VPR_Pos (1UL)       /*!< Position of VPR field.                                               */
  #define MRAMC_POWER_POWERUPACK_VPR_Msk (0x1UL << MRAMC_POWER_POWERUPACK_VPR_Pos) /*!< Bit mask of VPR field.                 */
  #define MRAMC_POWER_POWERUPACK_VPR_Min (0x0UL)     /*!< Min enumerator value of VPR field.                                   */
  #define MRAMC_POWER_POWERUPACK_VPR_Max (0x1UL)     /*!< Max enumerator value of VPR field.                                   */
  #define MRAMC_POWER_POWERUPACK_VPR_Busy (0x0UL)    /*!< Busy                                                                 */
  #define MRAMC_POWER_POWERUPACK_VPR_Ready (0x1UL)   /*!< Ready                                                                */

/* VDD @Bit 2 : Waiting for VDD up ACK or not */
  #define MRAMC_POWER_POWERUPACK_VDD_Pos (2UL)       /*!< Position of VDD field.                                               */
  #define MRAMC_POWER_POWERUPACK_VDD_Msk (0x1UL << MRAMC_POWER_POWERUPACK_VDD_Pos) /*!< Bit mask of VDD field.                 */
  #define MRAMC_POWER_POWERUPACK_VDD_Min (0x0UL)     /*!< Min enumerator value of VDD field.                                   */
  #define MRAMC_POWER_POWERUPACK_VDD_Max (0x1UL)     /*!< Max enumerator value of VDD field.                                   */
  #define MRAMC_POWER_POWERUPACK_VDD_Busy (0x0UL)    /*!< Busy                                                                 */
  #define MRAMC_POWER_POWERUPACK_VDD_Ready (0x1UL)   /*!< Ready                                                                */

/* VDDCFG @Bit 3 : Waiting for VDD_CFG up ACK or not */
  #define MRAMC_POWER_POWERUPACK_VDDCFG_Pos (3UL)    /*!< Position of VDDCFG field.                                            */
  #define MRAMC_POWER_POWERUPACK_VDDCFG_Msk (0x1UL << MRAMC_POWER_POWERUPACK_VDDCFG_Pos) /*!< Bit mask of VDDCFG field.        */
  #define MRAMC_POWER_POWERUPACK_VDDCFG_Min (0x0UL)  /*!< Min enumerator value of VDDCFG field.                                */
  #define MRAMC_POWER_POWERUPACK_VDDCFG_Max (0x1UL)  /*!< Max enumerator value of VDDCFG field.                                */
  #define MRAMC_POWER_POWERUPACK_VDDCFG_Busy (0x0UL) /*!< Busy                                                                 */
  #define MRAMC_POWER_POWERUPACK_VDDCFG_Ready (0x1UL) /*!< Ready                                                               */

