adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VDDA @Bit 4 : Waiting for VDDA up ACK or not */
  #define MRAMC_POWER_POWERUPACK_VDDA_Pos (4UL)      /*!< Position of VDDA field.                                              */
  #define MRAMC_POWER_POWERUPACK_VDDA_Msk (0x1UL << MRAMC_POWER_POWERUPACK_VDDA_Pos) /*!< Bit mask of VDDA field.              */
  #define MRAMC_POWER_POWERUPACK_VDDA_Min (0x0UL)    /*!< Min enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_POWERUPACK_VDDA_Max (0x1UL)    /*!< Max enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_POWERUPACK_VDDA_Busy (0x0UL)   /*!< Busy                                                                 */
  #define MRAMC_POWER_POWERUPACK_VDDA_Ready (0x1UL)  /*!< Ready                                                                */

/* VDDACFG @Bit 5 : Waiting for VDDA_CFG up ACK or not */
  #define MRAMC_POWER_POWERUPACK_VDDACFG_Pos (5UL)   /*!< Position of VDDACFG field.                                           */
  #define MRAMC_POWER_POWERUPACK_VDDACFG_Msk (0x1UL << MRAMC_POWER_POWERUPACK_VDDACFG_Pos) /*!< Bit mask of VDDACFG field.     */
  #define MRAMC_POWER_POWERUPACK_VDDACFG_Min (0x0UL) /*!< Min enumerator value of VDDACFG field.                               */
  #define MRAMC_POWER_POWERUPACK_VDDACFG_Max (0x1UL) /*!< Max enumerator value of VDDACFG field.                               */
  #define MRAMC_POWER_POWERUPACK_VDDACFG_Busy (0x0UL) /*!< Busy                                                                */
  #define MRAMC_POWER_POWERUPACK_VDDACFG_Ready (0x1UL) /*!< Ready                                                              */


/* MRAMC_POWER_POWERDOWNACK: Status of the power control signals acknowledgement during power down sequence. */
  #define MRAMC_POWER_POWERDOWNACK_ResetValue (0x00000000UL) /*!< Reset value of POWERDOWNACK register.                        */

/* VREF @Bit 0 : Waiting for VREF down ACK or not */
  #define MRAMC_POWER_POWERDOWNACK_VREF_Pos (0UL)    /*!< Position of VREF field.                                              */
  #define MRAMC_POWER_POWERDOWNACK_VREF_Msk (0x1UL << MRAMC_POWER_POWERDOWNACK_VREF_Pos) /*!< Bit mask of VREF field.          */
  #define MRAMC_POWER_POWERDOWNACK_VREF_Min (0x0UL)  /*!< Min enumerator value of VREF field.                                  */
  #define MRAMC_POWER_POWERDOWNACK_VREF_Max (0x1UL)  /*!< Max enumerator value of VREF field.                                  */
  #define MRAMC_POWER_POWERDOWNACK_VREF_Busy (0x0UL) /*!< Busy                                                                 */
  #define MRAMC_POWER_POWERDOWNACK_VREF_Ready (0x1UL) /*!< Ready                                                               */

/* VPR @Bit 1 : Waiting for VPR down ACK or not */
  #define MRAMC_POWER_POWERDOWNACK_VPR_Pos (1UL)     /*!< Position of VPR field.                                               */
  #define MRAMC_POWER_POWERDOWNACK_VPR_Msk (0x1UL << MRAMC_POWER_POWERDOWNACK_VPR_Pos) /*!< Bit mask of VPR field.             */
  #define MRAMC_POWER_POWERDOWNACK_VPR_Min (0x0UL)   /*!< Min enumerator value of VPR field.                                   */
  #define MRAMC_POWER_POWERDOWNACK_VPR_Max (0x1UL)   /*!< Max enumerator value of VPR field.                                   */
  #define MRAMC_POWER_POWERDOWNACK_VPR_Busy (0x0UL)  /*!< Busy                                                                 */
  #define MRAMC_POWER_POWERDOWNACK_VPR_Ready (0x1UL) /*!< Ready                                                                */

/* VDD @Bit 2 : Waiting for VDD down ACK or not */
  #define MRAMC_POWER_POWERDOWNACK_VDD_Pos (2UL)     /*!< Position of VDD field.                                               */
  #define MRAMC_POWER_POWERDOWNACK_VDD_Msk (0x1UL << MRAMC_POWER_POWERDOWNACK_VDD_Pos) /*!< Bit mask of VDD field.             */
  #define MRAMC_POWER_POWERDOWNACK_VDD_Min (0x0UL)   /*!< Min enumerator value of VDD field.                                   */
  #define MRAMC_POWER_POWERDOWNACK_VDD_Max (0x1UL)   /*!< Max enumerator value of VDD field.                                   */
  #define MRAMC_POWER_POWERDOWNACK_VDD_Busy (0x0UL)  /*!< Busy                                                                 */
  #define MRAMC_POWER_POWERDOWNACK_VDD_Ready (0x1UL) /*!< Ready                                                                */

/* VDDCFG @Bit 3 : Waiting for VDD_CFG down ACK or not */
  #define MRAMC_POWER_POWERDOWNACK_VDDCFG_Pos (3UL)  /*!< Position of VDDCFG field.                                            */
  #define MRAMC_POWER_POWERDOWNACK_VDDCFG_Msk (0x1UL << MRAMC_POWER_POWERDOWNACK_VDDCFG_Pos) /*!< Bit mask of VDDCFG field.    */
  #define MRAMC_POWER_POWERDOWNACK_VDDCFG_Min (0x0UL) /*!< Min enumerator value of VDDCFG field.                               */
  #define MRAMC_POWER_POWERDOWNACK_VDDCFG_Max (0x1UL) /*!< Max enumerator value of VDDCFG field.                               */
  #define MRAMC_POWER_POWERDOWNACK_VDDCFG_Busy (0x0UL) /*!< Busy                                                               */
  #define MRAMC_POWER_POWERDOWNACK_VDDCFG_Ready (0x1UL) /*!< Ready                                                             */

/* VDDA @Bit 4 : Waiting for VDDA down ACK or not */
  #define MRAMC_POWER_POWERDOWNACK_VDDA_Pos (4UL)    /*!< Position of VDDA field.                                              */
  #define MRAMC_POWER_POWERDOWNACK_VDDA_Msk (0x1UL << MRAMC_POWER_POWERDOWNACK_VDDA_Pos) /*!< Bit mask of VDDA field.          */
  #define MRAMC_POWER_POWERDOWNACK_VDDA_Min (0x0UL)  /*!< Min enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_POWERDOWNACK_VDDA_Max (0x1UL)  /*!< Max enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_POWERDOWNACK_VDDA_Busy (0x0UL) /*!< Busy                                                                 */
  #define MRAMC_POWER_POWERDOWNACK_VDDA_Ready (0x1UL) /*!< Ready                                                               */

