adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VDDACFG @Bit 5 : Waiting for VDDA_CFG down ACK or not */
  #define MRAMC_POWER_POWERDOWNACK_VDDACFG_Pos (5UL) /*!< Position of VDDACFG field.                                           */
  #define MRAMC_POWER_POWERDOWNACK_VDDACFG_Msk (0x1UL << MRAMC_POWER_POWERDOWNACK_VDDACFG_Pos) /*!< Bit mask of VDDACFG field. */
  #define MRAMC_POWER_POWERDOWNACK_VDDACFG_Min (0x0UL) /*!< Min enumerator value of VDDACFG field.                             */
  #define MRAMC_POWER_POWERDOWNACK_VDDACFG_Max (0x1UL) /*!< Max enumerator value of VDDACFG field.                             */
  #define MRAMC_POWER_POWERDOWNACK_VDDACFG_Busy (0x0UL) /*!< Busy                                                              */
  #define MRAMC_POWER_POWERDOWNACK_VDDACFG_Ready (0x1UL) /*!< Ready                                                            */


/* MRAMC_POWER_FORCEON: Force ON the power supply. */
  #define MRAMC_POWER_FORCEON_ResetValue (0x00000000UL) /*!< Reset value of FORCEON register.                                  */

/* VREF @Bit 0 : Force ON the VREF supply */
  #define MRAMC_POWER_FORCEON_VREF_Pos (0UL)         /*!< Position of VREF field.                                              */
  #define MRAMC_POWER_FORCEON_VREF_Msk (0x1UL << MRAMC_POWER_FORCEON_VREF_Pos) /*!< Bit mask of VREF field.                    */
  #define MRAMC_POWER_FORCEON_VREF_Min (0x0UL)       /*!< Min enumerator value of VREF field.                                  */
  #define MRAMC_POWER_FORCEON_VREF_Max (0x1UL)       /*!< Max enumerator value of VREF field.                                  */
  #define MRAMC_POWER_FORCEON_VREF_NoOperation (0x0UL) /*!< No Force ON.                                                       */
  #define MRAMC_POWER_FORCEON_VREF_ForceOn (0x1UL)   /*!< Force ON.                                                            */

/* VPR @Bit 1 : Force ON the VPR supply */
  #define MRAMC_POWER_FORCEON_VPR_Pos (1UL)          /*!< Position of VPR field.                                               */
  #define MRAMC_POWER_FORCEON_VPR_Msk (0x1UL << MRAMC_POWER_FORCEON_VPR_Pos) /*!< Bit mask of VPR field.                       */
  #define MRAMC_POWER_FORCEON_VPR_Min (0x0UL)        /*!< Min enumerator value of VPR field.                                   */
  #define MRAMC_POWER_FORCEON_VPR_Max (0x1UL)        /*!< Max enumerator value of VPR field.                                   */
  #define MRAMC_POWER_FORCEON_VPR_NoOperation (0x0UL) /*!< No Force ON.                                                        */
  #define MRAMC_POWER_FORCEON_VPR_ForceOn (0x1UL)    /*!< Force ON.                                                            */

/* VDD @Bit 2 : Force ON the VDD supply */
  #define MRAMC_POWER_FORCEON_VDD_Pos (2UL)          /*!< Position of VDD field.                                               */
  #define MRAMC_POWER_FORCEON_VDD_Msk (0x1UL << MRAMC_POWER_FORCEON_VDD_Pos) /*!< Bit mask of VDD field.                       */
  #define MRAMC_POWER_FORCEON_VDD_Min (0x0UL)        /*!< Min enumerator value of VDD field.                                   */
  #define MRAMC_POWER_FORCEON_VDD_Max (0x1UL)        /*!< Max enumerator value of VDD field.                                   */
  #define MRAMC_POWER_FORCEON_VDD_NoOperation (0x0UL) /*!< No Force ON.                                                        */
  #define MRAMC_POWER_FORCEON_VDD_ForceOn (0x1UL)    /*!< Force ON.                                                            */

/* VDDCFG @Bit 3 : Force ON the VDD_CFG supply */
  #define MRAMC_POWER_FORCEON_VDDCFG_Pos (3UL)       /*!< Position of VDDCFG field.                                            */
  #define MRAMC_POWER_FORCEON_VDDCFG_Msk (0x1UL << MRAMC_POWER_FORCEON_VDDCFG_Pos) /*!< Bit mask of VDDCFG field.              */
  #define MRAMC_POWER_FORCEON_VDDCFG_Min (0x0UL)     /*!< Min enumerator value of VDDCFG field.                                */
  #define MRAMC_POWER_FORCEON_VDDCFG_Max (0x1UL)     /*!< Max enumerator value of VDDCFG field.                                */
  #define MRAMC_POWER_FORCEON_VDDCFG_NoOperation (0x0UL) /*!< No Force ON.                                                     */
  #define MRAMC_POWER_FORCEON_VDDCFG_ForceOn (0x1UL) /*!< Force ON.                                                            */

/* VDDA @Bit 4 : Force ON the VDDA supply */
  #define MRAMC_POWER_FORCEON_VDDA_Pos (4UL)         /*!< Position of VDDA field.                                              */
  #define MRAMC_POWER_FORCEON_VDDA_Msk (0x1UL << MRAMC_POWER_FORCEON_VDDA_Pos) /*!< Bit mask of VDDA field.                    */
  #define MRAMC_POWER_FORCEON_VDDA_Min (0x0UL)       /*!< Min enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_FORCEON_VDDA_Max (0x1UL)       /*!< Max enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_FORCEON_VDDA_NoOperation (0x0UL) /*!< No Force ON.                                                       */
  #define MRAMC_POWER_FORCEON_VDDA_ForceOn (0x1UL)   /*!< Force ON.                                                            */

/* VDDACFG @Bit 5 : Force ON the VDDA_CFG supply */
  #define MRAMC_POWER_FORCEON_VDDACFG_Pos (5UL)      /*!< Position of VDDACFG field.                                           */
  #define MRAMC_POWER_FORCEON_VDDACFG_Msk (0x1UL << MRAMC_POWER_FORCEON_VDDACFG_Pos) /*!< Bit mask of VDDACFG field.           */
  #define MRAMC_POWER_FORCEON_VDDACFG_Min (0x0UL)    /*!< Min enumerator value of VDDACFG field.                               */
  #define MRAMC_POWER_FORCEON_VDDACFG_Max (0x1UL)    /*!< Max enumerator value of VDDACFG field.                               */
  #define MRAMC_POWER_FORCEON_VDDACFG_NoOperation (0x0UL) /*!< No Force ON.                                                    */
  #define MRAMC_POWER_FORCEON_VDDACFG_ForceOn (0x1UL) /*!< Force ON.                                                           */

/* KEY @Bits 16..31 : Key to enable the writing to this register. */
  #define MRAMC_POWER_FORCEON_KEY_Pos (16UL)         /*!< Position of KEY field.                                               */
  #define MRAMC_POWER_FORCEON_KEY_Msk (0xFFFFUL << MRAMC_POWER_FORCEON_KEY_Pos) /*!< Bit mask of KEY field.                    */
  #define MRAMC_POWER_FORCEON_KEY_Min (0x0UL)        /*!< Min enumerator value of KEY field.                                   */
  #define MRAMC_POWER_FORCEON_KEY_Max (0xA66DUL)     /*!< Max enumerator value of KEY field.                                   */
  #define MRAMC_POWER_FORCEON_KEY_Disable (0x0000UL) /*!< Disable the writing to this register                                 */
  #define MRAMC_POWER_FORCEON_KEY_Enable (0xA66DUL)  /*!< Enable the writing to this register                                  */


/* MRAMC_POWER_FORCEOFF: Force OFF the power supply. */
  #define MRAMC_POWER_FORCEOFF_ResetValue (0x00000000UL) /*!< Reset value of FORCEOFF register.                                */

/* VREF @Bit 0 : Force OFF the VREF supply */
  #define MRAMC_POWER_FORCEOFF_VREF_Pos (0UL)        /*!< Position of VREF field.                                              */
  #define MRAMC_POWER_FORCEOFF_VREF_Msk (0x1UL << MRAMC_POWER_FORCEOFF_VREF_Pos) /*!< Bit mask of VREF field.                  */
  #define MRAMC_POWER_FORCEOFF_VREF_Min (0x0UL)      /*!< Min enumerator value of VREF field.                                  */
  #define MRAMC_POWER_FORCEOFF_VREF_Max (0x1UL)      /*!< Max enumerator value of VREF field.                                  */
  #define MRAMC_POWER_FORCEOFF_VREF_NoOperation (0x0UL) /*!< No Force OFF.                                                     */
  #define MRAMC_POWER_FORCEOFF_VREF_ForceOff (0x1UL) /*!< Force OFF.                                                           */

/* VPR @Bit 1 : Force OFF the VPR supply */
  #define MRAMC_POWER_FORCEOFF_VPR_Pos (1UL)         /*!< Position of VPR field.                                               */
  #define MRAMC_POWER_FORCEOFF_VPR_Msk (0x1UL << MRAMC_POWER_FORCEOFF_VPR_Pos) /*!< Bit mask of VPR field.                     */
  #define MRAMC_POWER_FORCEOFF_VPR_Min (0x0UL)       /*!< Min enumerator value of VPR field.                                   */
  #define MRAMC_POWER_FORCEOFF_VPR_Max (0x1UL)       /*!< Max enumerator value of VPR field.                                   */
  #define MRAMC_POWER_FORCEOFF_VPR_NoOperation (0x0UL) /*!< No Force OFF.                                                      */
  #define MRAMC_POWER_FORCEOFF_VPR_ForceOff (0x1UL)  /*!< Force OFF.                                                           */

/* VDD @Bit 2 : Force OFF the VDD supply */
  #define MRAMC_POWER_FORCEOFF_VDD_Pos (2UL)         /*!< Position of VDD field.                                               */
  #define MRAMC_POWER_FORCEOFF_VDD_Msk (0x1UL << MRAMC_POWER_FORCEOFF_VDD_Pos) /*!< Bit mask of VDD field.                     */
  #define MRAMC_POWER_FORCEOFF_VDD_Min (0x0UL)       /*!< Min enumerator value of VDD field.                                   */
  #define MRAMC_POWER_FORCEOFF_VDD_Max (0x1UL)       /*!< Max enumerator value of VDD field.                                   */
  #define MRAMC_POWER_FORCEOFF_VDD_NoOperation (0x0UL) /*!< No Force OFF.                                                      */
  #define MRAMC_POWER_FORCEOFF_VDD_ForceOff (0x1UL)  /*!< Force OFF.                                                           */

/* VDDCFG @Bit 3 : Force OFF the VDD_CFG supply */
  #define MRAMC_POWER_FORCEOFF_VDDCFG_Pos (3UL)      /*!< Position of VDDCFG field.                                            */
  #define MRAMC_POWER_FORCEOFF_VDDCFG_Msk (0x1UL << MRAMC_POWER_FORCEOFF_VDDCFG_Pos) /*!< Bit mask of VDDCFG field.            */
  #define MRAMC_POWER_FORCEOFF_VDDCFG_Min (0x0UL)    /*!< Min enumerator value of VDDCFG field.                                */
  #define MRAMC_POWER_FORCEOFF_VDDCFG_Max (0x1UL)    /*!< Max enumerator value of VDDCFG field.                                */
  #define MRAMC_POWER_FORCEOFF_VDDCFG_NoOperation (0x0UL) /*!< No Force OFF.                                                   */
  #define MRAMC_POWER_FORCEOFF_VDDCFG_ForceOff (0x1UL) /*!< Force OFF.                                                         */

