adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VDDA @Bit 4 : Force OFF the VDDA supply */
  #define MRAMC_POWER_FORCEOFF_VDDA_Pos (4UL)        /*!< Position of VDDA field.                                              */
  #define MRAMC_POWER_FORCEOFF_VDDA_Msk (0x1UL << MRAMC_POWER_FORCEOFF_VDDA_Pos) /*!< Bit mask of VDDA field.                  */
  #define MRAMC_POWER_FORCEOFF_VDDA_Min (0x0UL)      /*!< Min enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_FORCEOFF_VDDA_Max (0x1UL)      /*!< Max enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_FORCEOFF_VDDA_NoOperation (0x0UL) /*!< No Force OFF.                                                     */
  #define MRAMC_POWER_FORCEOFF_VDDA_ForceOff (0x1UL) /*!< Force OFF.                                                           */

/* VDDACFG @Bit 5 : Force OFF the VDDA_CFG supply */
  #define MRAMC_POWER_FORCEOFF_VDDACFG_Pos (5UL)     /*!< Position of VDDACFG field.                                           */
  #define MRAMC_POWER_FORCEOFF_VDDACFG_Msk (0x1UL << MRAMC_POWER_FORCEOFF_VDDACFG_Pos) /*!< Bit mask of VDDACFG field.         */
  #define MRAMC_POWER_FORCEOFF_VDDACFG_Min (0x0UL)   /*!< Min enumerator value of VDDACFG field.                               */
  #define MRAMC_POWER_FORCEOFF_VDDACFG_Max (0x1UL)   /*!< Max enumerator value of VDDACFG field.                               */
  #define MRAMC_POWER_FORCEOFF_VDDACFG_NoOperation (0x0UL) /*!< No Force OFF.                                                  */
  #define MRAMC_POWER_FORCEOFF_VDDACFG_ForceOff (0x1UL) /*!< Force OFF.                                                        */

/* KEY @Bits 16..31 : Key to enable the writing to this register. */
  #define MRAMC_POWER_FORCEOFF_KEY_Pos (16UL)        /*!< Position of KEY field.                                               */
  #define MRAMC_POWER_FORCEOFF_KEY_Msk (0xFFFFUL << MRAMC_POWER_FORCEOFF_KEY_Pos) /*!< Bit mask of KEY field.                  */
  #define MRAMC_POWER_FORCEOFF_KEY_Min (0x0UL)       /*!< Min enumerator value of KEY field.                                   */
  #define MRAMC_POWER_FORCEOFF_KEY_Max (0xA66DUL)    /*!< Max enumerator value of KEY field.                                   */
  #define MRAMC_POWER_FORCEOFF_KEY_Disable (0x0000UL) /*!< Disable the writing to this register                                */
  #define MRAMC_POWER_FORCEOFF_KEY_Enable (0xA66DUL) /*!< Enable the writing to this register                                  */



/* ==================================================== Struct MRAMC_TRIM ==================================================== */
/**
  * @brief TRIM [MRAMC_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DATAIN;                            /*!< (@ 0x00000000) Data to be written to the MRAM trim configuration.    */
  __IM  uint32_t  DATAOUT;                           /*!< (@ 0x00000004) Data read from the MRAM trim configuration.           */
  __IOM uint32_t  COUNT;                             /*!< (@ 0x00000008) Number of bits in the current data to be written to and
                                                                         read from the trim configuration.*/                      
  __IOM uint32_t  START;                             /*!< (@ 0x0000000C) Start shifting data for trim configuration.           */
  __IM  uint32_t  READY;                             /*!< (@ 0x00000010) Status of shifting the MRAM trim configuration data.  */
  __IOM uint32_t  DONE;                              /*!< (@ 0x00000014) This register is used to indicate to the MRAMC that the
                                                                         whole MRAM trim configuration data write is completed.*/ 
} NRF_MRAMC_TRIM_Type;                               /*!< Size = 24 (0x018)                                                    */

/* MRAMC_TRIM_DATAIN: Data to be written to the MRAM trim configuration. */
  #define MRAMC_TRIM_DATAIN_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DATAIN register.                                     */

/* DATAIN @Bits 0..31 : Data */
  #define MRAMC_TRIM_DATAIN_DATAIN_Pos (0UL)         /*!< Position of DATAIN field.                                            */
  #define MRAMC_TRIM_DATAIN_DATAIN_Msk (0xFFFFFFFFUL << MRAMC_TRIM_DATAIN_DATAIN_Pos) /*!< Bit mask of DATAIN field.           */


/* MRAMC_TRIM_DATAOUT: Data read from the MRAM trim configuration. */
  #define MRAMC_TRIM_DATAOUT_ResetValue (0x00000000UL) /*!< Reset value of DATAOUT register.                                   */

/* DATAOUT @Bits 0..31 : Data */
  #define MRAMC_TRIM_DATAOUT_DATAOUT_Pos (0UL)       /*!< Position of DATAOUT field.                                           */
  #define MRAMC_TRIM_DATAOUT_DATAOUT_Msk (0xFFFFFFFFUL << MRAMC_TRIM_DATAOUT_DATAOUT_Pos) /*!< Bit mask of DATAOUT field.      */


/* MRAMC_TRIM_COUNT: Number of bits in the current data to be written to and read from the trim configuration. */
  #define MRAMC_TRIM_COUNT_ResetValue (0x00000020UL) /*!< Reset value of COUNT register.                                       */

/* COUNT @Bits 0..5 : Number of bits to be written. */
  #define MRAMC_TRIM_COUNT_COUNT_Pos (0UL)           /*!< Position of COUNT field.                                             */
  #define MRAMC_TRIM_COUNT_COUNT_Msk (0x3FUL << MRAMC_TRIM_COUNT_COUNT_Pos) /*!< Bit mask of COUNT field.                      */
  #define MRAMC_TRIM_COUNT_COUNT_Min (0x0UL)         /*!< Min value of COUNT field.                                            */
  #define MRAMC_TRIM_COUNT_COUNT_Max (0x20UL)        /*!< Max size of COUNT field.                                             */


/* MRAMC_TRIM_START: Start shifting data for trim configuration. */
  #define MRAMC_TRIM_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                                       */

/* START @Bit 0 : Start trim configuration */
  #define MRAMC_TRIM_START_START_Pos (0UL)           /*!< Position of START field.                                             */
  #define MRAMC_TRIM_START_START_Msk (0x1UL << MRAMC_TRIM_START_START_Pos) /*!< Bit mask of START field.                       */
  #define MRAMC_TRIM_START_START_Min (0x0UL)         /*!< Min enumerator value of START field.                                 */
  #define MRAMC_TRIM_START_START_Max (0x1UL)         /*!< Max enumerator value of START field.                                 */
  #define MRAMC_TRIM_START_START_NoOperation (0x0UL) /*!< No operation                                                         */
  #define MRAMC_TRIM_START_START_Start (0x1UL)       /*!< Start trim config                                                    */

