adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* MRAMC_ERASE_LOCK: Locking the erase registers. */
  #define MRAMC_ERASE_LOCK_ResetValue (0x00000000UL) /*!< Reset value of LOCK register.                                        */

/* ERASEWORD @Bit 0 : Lock for ERASE.ERASEWORD. */
  #define MRAMC_ERASE_LOCK_ERASEWORD_Pos (0UL)       /*!< Position of ERASEWORD field.                                         */
  #define MRAMC_ERASE_LOCK_ERASEWORD_Msk (0x1UL << MRAMC_ERASE_LOCK_ERASEWORD_Pos) /*!< Bit mask of ERASEWORD field.           */
  #define MRAMC_ERASE_LOCK_ERASEWORD_Min (0x0UL)     /*!< Min enumerator value of ERASEWORD field.                             */
  #define MRAMC_ERASE_LOCK_ERASEWORD_Max (0x1UL)     /*!< Max enumerator value of ERASEWORD field.                             */
  #define MRAMC_ERASE_LOCK_ERASEWORD_Disabled (0x0UL) /*!< Lock disabled.                                                      */
  #define MRAMC_ERASE_LOCK_ERASEWORD_Enabled (0x1UL) /*!< Lock enabled.                                                        */

/* ERASEAREA @Bit 1 : Lock for ERASE.ERASEAREA. */
  #define MRAMC_ERASE_LOCK_ERASEAREA_Pos (1UL)       /*!< Position of ERASEAREA field.                                         */
  #define MRAMC_ERASE_LOCK_ERASEAREA_Msk (0x1UL << MRAMC_ERASE_LOCK_ERASEAREA_Pos) /*!< Bit mask of ERASEAREA field.           */
  #define MRAMC_ERASE_LOCK_ERASEAREA_Min (0x0UL)     /*!< Min enumerator value of ERASEAREA field.                             */
  #define MRAMC_ERASE_LOCK_ERASEAREA_Max (0x1UL)     /*!< Max enumerator value of ERASEAREA field.                             */
  #define MRAMC_ERASE_LOCK_ERASEAREA_Disabled (0x0UL) /*!< Lock disabled.                                                      */
  #define MRAMC_ERASE_LOCK_ERASEAREA_Enabled (0x1UL) /*!< Lock enabled.                                                        */

/* ERASEALL @Bit 2 : Lock for ERASE.ERASEALL. */
  #define MRAMC_ERASE_LOCK_ERASEALL_Pos (2UL)        /*!< Position of ERASEALL field.                                          */
  #define MRAMC_ERASE_LOCK_ERASEALL_Msk (0x1UL << MRAMC_ERASE_LOCK_ERASEALL_Pos) /*!< Bit mask of ERASEALL field.              */
  #define MRAMC_ERASE_LOCK_ERASEALL_Min (0x0UL)      /*!< Min enumerator value of ERASEALL field.                              */
  #define MRAMC_ERASE_LOCK_ERASEALL_Max (0x1UL)      /*!< Max enumerator value of ERASEALL field.                              */
  #define MRAMC_ERASE_LOCK_ERASEALL_Disabled (0x0UL) /*!< Lock disabled.                                                       */
  #define MRAMC_ERASE_LOCK_ERASEALL_Enabled (0x1UL)  /*!< Lock enabled.                                                        */



/* ================================================= Struct MRAMC_CONFIGNVR ================================================== */
/**
  * @brief CONFIGNVR [MRAMC_CONFIGNVR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PAGE[4];                           /*!< (@ 0x00000000) Configuration register for NVR page n                 */
} NRF_MRAMC_CONFIGNVR_Type;                          /*!< Size = 16 (0x010)                                                    */

/* MRAMC_CONFIGNVR_PAGE: Configuration register for NVR page n */
  #define MRAMC_CONFIGNVR_PAGE_MaxCount (4UL)        /*!< Max size of PAGE[4] array.                                           */
  #define MRAMC_CONFIGNVR_PAGE_ResetValue (0xFFF00000UL) /*!< Reset value of PAGE[4] register.                                 */

/* WEN @Bits 0..1 : Write enable. */
  #define MRAMC_CONFIGNVR_PAGE_WEN_Pos (0UL)         /*!< Position of WEN field.                                               */
  #define MRAMC_CONFIGNVR_PAGE_WEN_Msk (0x3UL << MRAMC_CONFIGNVR_PAGE_WEN_Pos) /*!< Bit mask of WEN field.                     */
  #define MRAMC_CONFIGNVR_PAGE_WEN_Min (0x0UL)       /*!< Min enumerator value of WEN field.                                   */
  #define MRAMC_CONFIGNVR_PAGE_WEN_Max (0x2UL)       /*!< Max enumerator value of WEN field.                                   */
  #define MRAMC_CONFIGNVR_PAGE_WEN_DisableWrite (0x0UL) /*!< Write is disabled                                                 */
  #define MRAMC_CONFIGNVR_PAGE_WEN_EnableNormalWrite (0x1UL) /*!< Normal write is enabled                                      */
  #define MRAMC_CONFIGNVR_PAGE_WEN_EnableDirectWrite (0x2UL) /*!< Direct write is enabled                                      */

/* EEN @Bits 4..5 : Erase enable. */
  #define MRAMC_CONFIGNVR_PAGE_EEN_Pos (4UL)         /*!< Position of EEN field.                                               */
  #define MRAMC_CONFIGNVR_PAGE_EEN_Msk (0x3UL << MRAMC_CONFIGNVR_PAGE_EEN_Pos) /*!< Bit mask of EEN field.                     */
  #define MRAMC_CONFIGNVR_PAGE_EEN_Min (0x0UL)       /*!< Min enumerator value of EEN field.                                   */
  #define MRAMC_CONFIGNVR_PAGE_EEN_Max (0x2UL)       /*!< Max enumerator value of EEN field.                                   */
  #define MRAMC_CONFIGNVR_PAGE_EEN_DisableErase (0x0UL) /*!< Erase is disabled but read is allowed                             */
  #define MRAMC_CONFIGNVR_PAGE_EEN_EnablePageErase (0x1UL) /*!< Erase page and read are allowed                                */
  #define MRAMC_CONFIGNVR_PAGE_EEN_EnableWordErase (0x2UL) /*!< Erase word and read are allowed                                */

/* Lock @Bit 16 : Enables the lock for this register. */
  #define MRAMC_CONFIGNVR_PAGE_Lock_Pos (16UL)       /*!< Position of Lock field.                                              */
  #define MRAMC_CONFIGNVR_PAGE_Lock_Msk (0x1UL << MRAMC_CONFIGNVR_PAGE_Lock_Pos) /*!< Bit mask of Lock field.                  */
  #define MRAMC_CONFIGNVR_PAGE_Lock_Min (0x0UL)      /*!< Min enumerator value of Lock field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_Lock_Max (0x1UL)      /*!< Max enumerator value of Lock field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_Lock_LockDisabled (0x0UL) /*!< Read: Lock is disabled                                           */
  #define MRAMC_CONFIGNVR_PAGE_Lock_LockEnabled (0x1UL) /*!< Read: Lock is enabled                                             */
  #define MRAMC_CONFIGNVR_PAGE_Lock_EnableLock (0x1UL) /*!< Write: Enables the lock (Ignores any other value written)          */

/* UREN @Bit 20 : Enable read access to the upper part of NVR page, where the upper part size is NVR page size - 2KB */
  #define MRAMC_CONFIGNVR_PAGE_UREN_Pos (20UL)       /*!< Position of UREN field.                                              */
  #define MRAMC_CONFIGNVR_PAGE_UREN_Msk (0x1UL << MRAMC_CONFIGNVR_PAGE_UREN_Pos) /*!< Bit mask of UREN field.                  */
  #define MRAMC_CONFIGNVR_PAGE_UREN_Min (0x0UL)      /*!< Min enumerator value of UREN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_UREN_Max (0x1UL)      /*!< Max enumerator value of UREN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_UREN_Disabled (0x0UL) /*!< Read is disabled. Ignores any other value written.                   */
  #define MRAMC_CONFIGNVR_PAGE_UREN_Enabled (0x1UL)  /*!< Read is enabled                                                      */

/* UWEN @Bit 21 : Enable write access to the upper part of NVR page, where the upper part size is NVR page size - 2KB */
  #define MRAMC_CONFIGNVR_PAGE_UWEN_Pos (21UL)       /*!< Position of UWEN field.                                              */
  #define MRAMC_CONFIGNVR_PAGE_UWEN_Msk (0x1UL << MRAMC_CONFIGNVR_PAGE_UWEN_Pos) /*!< Bit mask of UWEN field.                  */
  #define MRAMC_CONFIGNVR_PAGE_UWEN_Min (0x0UL)      /*!< Min enumerator value of UWEN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_UWEN_Max (0x1UL)      /*!< Max enumerator value of UWEN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_UWEN_Disabled (0x0UL) /*!< Write is disabled. Ignores any other value written.                  */
  #define MRAMC_CONFIGNVR_PAGE_UWEN_Enabled (0x1UL)  /*!< Write is enabled                                                     */

/* LREN @Bit 22 : Enable read access to the lower range of the NVR page, as defined by LRSIZE */
  #define MRAMC_CONFIGNVR_PAGE_LREN_Pos (22UL)       /*!< Position of LREN field.                                              */
  #define MRAMC_CONFIGNVR_PAGE_LREN_Msk (0x1UL << MRAMC_CONFIGNVR_PAGE_LREN_Pos) /*!< Bit mask of LREN field.                  */
  #define MRAMC_CONFIGNVR_PAGE_LREN_Min (0x0UL)      /*!< Min enumerator value of LREN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_LREN_Max (0x1UL)      /*!< Max enumerator value of LREN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_LREN_Disabled (0x0UL) /*!< Read is disabled. Ignores any other value written.                   */
  #define MRAMC_CONFIGNVR_PAGE_LREN_Enabled (0x1UL)  /*!< Read is enabled                                                      */

/* LWEN @Bit 23 : Enable write access to the lower range of the NVR page, as defined by LWSIZE */
  #define MRAMC_CONFIGNVR_PAGE_LWEN_Pos (23UL)       /*!< Position of LWEN field.                                              */
  #define MRAMC_CONFIGNVR_PAGE_LWEN_Msk (0x1UL << MRAMC_CONFIGNVR_PAGE_LWEN_Pos) /*!< Bit mask of LWEN field.                  */
  #define MRAMC_CONFIGNVR_PAGE_LWEN_Min (0x0UL)      /*!< Min enumerator value of LWEN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_LWEN_Max (0x1UL)      /*!< Max enumerator value of LWEN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_LWEN_Disabled (0x0UL) /*!< Write is disabled. Ignores any other value written.                  */
  #define MRAMC_CONFIGNVR_PAGE_LWEN_Enabled (0x1UL)  /*!< Write is enabled                                                     */

/* LRSIZE @Bits 24..27 : Size of part of the lower 2KB memory in the NVR page to disable read access */
  #define MRAMC_CONFIGNVR_PAGE_LRSIZE_Pos (24UL)     /*!< Position of LRSIZE field.                                            */
  #define MRAMC_CONFIGNVR_PAGE_LRSIZE_Msk (0xFUL << MRAMC_CONFIGNVR_PAGE_LRSIZE_Pos) /*!< Bit mask of LRSIZE field.            */
  #define MRAMC_CONFIGNVR_PAGE_LRSIZE_Min (0x0UL)    /*!< Min value of LRSIZE field.                                           */
  #define MRAMC_CONFIGNVR_PAGE_LRSIZE_Max (0xFUL)    /*!< Max size of LRSIZE field.                                            */

/* LWSIZE @Bits 28..31 : Size of part of the lower 2KB memory in the NVR page to disable write access */
  #define MRAMC_CONFIGNVR_PAGE_LWSIZE_Pos (28UL)     /*!< Position of LWSIZE field.                                            */
  #define MRAMC_CONFIGNVR_PAGE_LWSIZE_Msk (0xFUL << MRAMC_CONFIGNVR_PAGE_LWSIZE_Pos) /*!< Bit mask of LWSIZE field.            */
  #define MRAMC_CONFIGNVR_PAGE_LWSIZE_Min (0x0UL)    /*!< Min value of LWSIZE field.                                           */
  #define MRAMC_CONFIGNVR_PAGE_LWSIZE_Max (0xFUL)    /*!< Max size of LWSIZE field.                                            */



/* ==================================================== Struct MRAMC_TEST ==================================================== */
/**
  * @brief TEST [MRAMC_TEST] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TESTMODE;                          /*!< (@ 0x00000000) Register for entering test mode. Refer to the MRAM test
                                                                         flow documentation for more details.*/                   
  __IOM uint32_t  LOCKTESTMODE;                      /*!< (@ 0x00000004) Enables the lock for the TESTMODE                     */
} NRF_MRAMC_TEST_Type;                               /*!< Size = 8 (0x008)                                                     */

/* MRAMC_TEST_TESTMODE: Register for entering test mode. Refer to the MRAM test flow documentation for more details. */
  #define MRAMC_TEST_TESTMODE_ResetValue (0x00000000UL) /*!< Reset value of TESTMODE register.                                 */

/* TESTMODE @Bits 0..15 : Register for entering test mode. This register does not return the same value as written. */
  #define MRAMC_TEST_TESTMODE_TESTMODE_Pos (0UL)     /*!< Position of TESTMODE field.                                          */
  #define MRAMC_TEST_TESTMODE_TESTMODE_Msk (0xFFFFUL << MRAMC_TEST_TESTMODE_TESTMODE_Pos) /*!< Bit mask of TESTMODE field.     */
  #define MRAMC_TEST_TESTMODE_TESTMODE_Min (0x0UL)   /*!< Min enumerator value of TESTMODE field.                              */
  #define MRAMC_TEST_TESTMODE_TESTMODE_Max (0xBCDEUL) /*!< Max enumerator value of TESTMODE field.                             */
  #define MRAMC_TEST_TESTMODE_TESTMODE_NORMAL (0x0000UL) /*!< Read: Not in test-mode.                                          */
  #define MRAMC_TEST_TESTMODE_TESTMODE_TESTMODE1 (0x0001UL) /*!< Read: In TESTMODE1.                                           */
  #define MRAMC_TEST_TESTMODE_TESTMODE_TESTMODE2 (0x0002UL) /*!< Read: In TESTMODE2.                                           */
  #define MRAMC_TEST_TESTMODE_TESTMODE_SetNORMAL (0x0000UL) /*!< Write: Sets NORMAL mode.                                      */
  #define MRAMC_TEST_TESTMODE_TESTMODE_SetTESTMODE1 (0xBCDEUL) /*!< Write: Sets TESTMODE1. Enables the mass erase.             */
  #define MRAMC_TEST_TESTMODE_TESTMODE_SetTESTMODE2 (0xABCDUL) /*!< Write: Sets TESTMODE2. Used for production tests.          */


/* MRAMC_TEST_LOCKTESTMODE: Enables the lock for the TESTMODE */
  #define MRAMC_TEST_LOCKTESTMODE_ResetValue (0x00000000UL) /*!< Reset value of LOCKTESTMODE register.                         */

/* EnableLock @Bits 0..31 : Enables the lock for TESTMODE. */
  #define MRAMC_TEST_LOCKTESTMODE_EnableLock_Pos (0UL) /*!< Position of EnableLock field.                                      */
  #define MRAMC_TEST_LOCKTESTMODE_EnableLock_Msk (0xFFFFFFFFUL << MRAMC_TEST_LOCKTESTMODE_EnableLock_Pos) /*!< Bit mask of
                                                                            EnableLock field.*/                                   
  #define MRAMC_TEST_LOCKTESTMODE_EnableLock_Min (0x0UL) /*!< Min enumerator value of EnableLock field.                        */
  #define MRAMC_TEST_LOCKTESTMODE_EnableLock_Max (0x10CC10CCUL) /*!< Max enumerator value of EnableLock field.                 */
  #define MRAMC_TEST_LOCKTESTMODE_EnableLock_LockDisabled (0x00000000UL) /*!< Read: TESTMODE is not locked                     */
  #define MRAMC_TEST_LOCKTESTMODE_EnableLock_LockEnabled (0x00000001UL) /*!< Read: TESTMODE is locked                          */
  #define MRAMC_TEST_LOCKTESTMODE_EnableLock_EnableLock (0x10CC10CCUL) /*!< Write: Enables the lock (Ignores any other value
                                                                            written)*/                                            



