adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* MRAMC_TESTMODE2_DATA: Data word n to/from MRAM data in/out bus. */
  #define MRAMC_TESTMODE2_DATA_MaxCount (4UL)        /*!< Max size of DATA[4] array.                                           */
  #define MRAMC_TESTMODE2_DATA_ResetValue (0x00000000UL) /*!< Reset value of DATA[4] register.                                 */

/* TESTDATA @Bits 0..31 : Returns data from the MRAM data out bus on reading. Sets the data to the MRAM data in bus on writing.
                          */                                                                                                      
                                                                                                                                  
  #define MRAMC_TESTMODE2_DATA_TESTDATA_Pos (0UL)    /*!< Position of TESTDATA field.                                          */
  #define MRAMC_TESTMODE2_DATA_TESTDATA_Msk (0xFFFFFFFFUL << MRAMC_TESTMODE2_DATA_TESTDATA_Pos) /*!< Bit mask of TESTDATA
                                                                            field.*/                                              


/* MRAMC_TESTMODE2_DATAECC: ECC bits to/from MRAM data in/out bus. */
  #define MRAMC_TESTMODE2_DATAECC_ResetValue (0x00000000UL) /*!< Reset value of DATAECC register.                              */

/* ECC @Bits 0..13 : Returns ECC bits from the MRAM data out bus on reading. Sets the ECC bits to the MRAM data in bus on
                     writing. */                                                                                                  
                                                                                                                                  
  #define MRAMC_TESTMODE2_DATAECC_ECC_Pos (0UL)      /*!< Position of ECC field.                                               */
  #define MRAMC_TESTMODE2_DATAECC_ECC_Msk (0x3FFFUL << MRAMC_TESTMODE2_DATAECC_ECC_Pos) /*!< Bit mask of ECC field.            */


/* MRAMC_TESTMODE2_ADDR: Address bits of the MRAM address bus. The register is updated when the auto-increment is done. */
  #define MRAMC_TESTMODE2_ADDR_ResetValue (0x00000000UL) /*!< Reset value of ADDR register.                                    */

/* YADDR @Bits 0..6 : Control the YADDR lines. The YADDR is incremented on auto-increment and the XADDR is incrmented by one
                      when the YADDR overflow during increment. */                                                                
                                                                                                                                  
  #define MRAMC_TESTMODE2_ADDR_YADDR_Pos (0UL)       /*!< Position of YADDR field.                                             */
  #define MRAMC_TESTMODE2_ADDR_YADDR_Msk (0x7FUL << MRAMC_TESTMODE2_ADDR_YADDR_Pos) /*!< Bit mask of YADDR field.              */

/* XADDR @Bits 7..18 : Control the XADDR lines */
  #define MRAMC_TESTMODE2_ADDR_XADDR_Pos (7UL)       /*!< Position of XADDR field.                                             */
  #define MRAMC_TESTMODE2_ADDR_XADDR_Msk (0xFFFUL << MRAMC_TESTMODE2_ADDR_XADDR_Pos) /*!< Bit mask of XADDR field.             */


/* MRAMC_TESTMODE2_DATAINC: Same as DATA but post-increments address after the read from the bus. */
  #define MRAMC_TESTMODE2_DATAINC_MaxCount (4UL)     /*!< Max size of DATAINC[4] array.                                        */
  #define MRAMC_TESTMODE2_DATAINC_ResetValue (0x00000000UL) /*!< Reset value of DATAINC[4] register.                           */

/* DATA @Bits 0..31 : Read or write data. */
  #define MRAMC_TESTMODE2_DATAINC_DATA_Pos (0UL)     /*!< Position of DATA field.                                              */
  #define MRAMC_TESTMODE2_DATAINC_DATA_Msk (0xFFFFFFFFUL << MRAMC_TESTMODE2_DATAINC_DATA_Pos) /*!< Bit mask of DATA field.     */


/* MRAMC_TESTMODE2_DATAECCINC: Same as DATAECC but post-increments ADDR after the read from the bus. */
  #define MRAMC_TESTMODE2_DATAECCINC_ResetValue (0x00000000UL) /*!< Reset value of DATAECCINC register.                        */

/* ECC @Bits 0..13 : ECC bits. */
  #define MRAMC_TESTMODE2_DATAECCINC_ECC_Pos (0UL)   /*!< Position of ECC field.                                               */
  #define MRAMC_TESTMODE2_DATAECCINC_ECC_Msk (0x3FFFUL << MRAMC_TESTMODE2_DATAECCINC_ECC_Pos) /*!< Bit mask of ECC field.      */


/* MRAMC_TESTMODE2_TESTCMP: Compares the MRAM data with DATA and DATAECC register content. Post-increments the address after the
                             read based on TESTMODE2.CONFIG.AUTOINC. */                                                           
                                                                                                                                  
  #define MRAMC_TESTMODE2_TESTCMP_ResetValue (0x00000000UL) /*!< Reset value of TESTCMP register.                              */

/* DIRECT @Bit 0 : Reads and compares with MRAM data lines directly to DATA and DATAECC register content. If the CLK is high,
                   then the CLK is set low, the address is incremented based on TESTMODE2.CONFIG.AUTOINC register and then the
                   CLK is set high. During this, the tCKL and tAS timing are taken care by the MRAMC. */                          
                                                                                                                                  
  #define MRAMC_TESTMODE2_TESTCMP_DIRECT_Pos (0UL)   /*!< Position of DIRECT field.                                            */
  #define MRAMC_TESTMODE2_TESTCMP_DIRECT_Msk (0x1UL << MRAMC_TESTMODE2_TESTCMP_DIRECT_Pos) /*!< Bit mask of DIRECT field.      */
  #define MRAMC_TESTMODE2_TESTCMP_DIRECT_Min (0x0UL) /*!< Min enumerator value of DIRECT field.                                */
  #define MRAMC_TESTMODE2_TESTCMP_DIRECT_Max (0x1UL) /*!< Max enumerator value of DIRECT field.                                */
  #define MRAMC_TESTMODE2_TESTCMP_DIRECT_Equal (0x0UL) /*!< Data read directly from MRAM bus and the DATA and DATAECC register
                                                            content are equal*/                                                   
  #define MRAMC_TESTMODE2_TESTCMP_DIRECT_NotEqual (0x1UL) /*!< Data read directly from MRAM bus and the DATA and DATAECC
                                                               register content are different*/                                   

/* LATCHED @Bit 1 : Compares with the last latched data. */
  #define MRAMC_TESTMODE2_TESTCMP_LATCHED_Pos (1UL)  /*!< Position of LATCHED field.                                           */
  #define MRAMC_TESTMODE2_TESTCMP_LATCHED_Msk (0x1UL << MRAMC_TESTMODE2_TESTCMP_LATCHED_Pos) /*!< Bit mask of LATCHED field.   */
  #define MRAMC_TESTMODE2_TESTCMP_LATCHED_Min (0x0UL) /*!< Min enumerator value of LATCHED field.                              */
  #define MRAMC_TESTMODE2_TESTCMP_LATCHED_Max (0x1UL) /*!< Max enumerator value of LATCHED field.                              */
  #define MRAMC_TESTMODE2_TESTCMP_LATCHED_Equal (0x0UL) /*!< The last latched data from MRAM bus and DATA and DATAECC register
                                                             content are equal*/                                                  
  #define MRAMC_TESTMODE2_TESTCMP_LATCHED_NotEqual (0x1UL) /*!< The last latched data from MRAM bus and DATA and DATAECC
                                                                register content are different*/                                  

/* FAILBITSDIRECT @Bits 8..15 : Number of bits that does not match while comparing the direct data. */
  #define MRAMC_TESTMODE2_TESTCMP_FAILBITSDIRECT_Pos (8UL) /*!< Position of FAILBITSDIRECT field.                              */
  #define MRAMC_TESTMODE2_TESTCMP_FAILBITSDIRECT_Msk (0xFFUL << MRAMC_TESTMODE2_TESTCMP_FAILBITSDIRECT_Pos) /*!< Bit mask of
                                                                            FAILBITSDIRECT field.*/                               

/* FAILBITSLATCHED @Bits 16..23 : Number of bits that does not match while comparing the latched data. */
  #define MRAMC_TESTMODE2_TESTCMP_FAILBITSLATCHED_Pos (16UL) /*!< Position of FAILBITSLATCHED field.                           */
  #define MRAMC_TESTMODE2_TESTCMP_FAILBITSLATCHED_Msk (0xFFUL << MRAMC_TESTMODE2_TESTCMP_FAILBITSLATCHED_Pos) /*!< Bit mask of
                                                                            FAILBITSLATCHED field.*/                              


