adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* MRAMC_TESTMODE2_COUNTERRELOAD: Configures the counter reload value. The counter is reloaded and starts counting from the
                                   CLK/PROGEN rising edge. */                                                                     
                                                                                                                                  
  #define MRAMC_TESTMODE2_COUNTERRELOAD_ResetValue (0x00000000UL) /*!< Reset value of COUNTERRELOAD register.                  */

/* VALUE @Bits 0..13 : Counter reload value. */
  #define MRAMC_TESTMODE2_COUNTERRELOAD_VALUE_Pos (0UL) /*!< Position of VALUE field.                                          */
  #define MRAMC_TESTMODE2_COUNTERRELOAD_VALUE_Msk (0x3FFFUL << MRAMC_TESTMODE2_COUNTERRELOAD_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/                                              


/* MRAMC_TESTMODE2_COUNTERRUN: Returns the state (counting or not) of the counter */
  #define MRAMC_TESTMODE2_COUNTERRUN_ResetValue (0x00000000UL) /*!< Reset value of COUNTERRUN register.                        */

/* RUNNING @Bit 0 : Returns the state of the counter */
  #define MRAMC_TESTMODE2_COUNTERRUN_RUNNING_Pos (0UL) /*!< Position of RUNNING field.                                         */
  #define MRAMC_TESTMODE2_COUNTERRUN_RUNNING_Msk (0x1UL << MRAMC_TESTMODE2_COUNTERRUN_RUNNING_Pos) /*!< Bit mask of RUNNING
                                                                            field.*/                                              
  #define MRAMC_TESTMODE2_COUNTERRUN_RUNNING_Min (0x0UL) /*!< Min enumerator value of RUNNING field.                           */
  #define MRAMC_TESTMODE2_COUNTERRUN_RUNNING_Max (0x1UL) /*!< Max enumerator value of RUNNING field.                           */
  #define MRAMC_TESTMODE2_COUNTERRUN_RUNNING_NotRunning (0x0UL) /*!< Counter is not running                                    */
  #define MRAMC_TESTMODE2_COUNTERRUN_RUNNING_Running (0x1UL) /*!< Counter is running                                           */


/* MRAMC_TESTMODE2_CONFIG: TESTMODE2 Configuration */
  #define MRAMC_TESTMODE2_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                                */

/* ENABLECOUNTER @Bit 0 : Enable counter */
  #define MRAMC_TESTMODE2_CONFIG_ENABLECOUNTER_Pos (0UL) /*!< Position of ENABLECOUNTER field.                                 */
  #define MRAMC_TESTMODE2_CONFIG_ENABLECOUNTER_Msk (0x1UL << MRAMC_TESTMODE2_CONFIG_ENABLECOUNTER_Pos) /*!< Bit mask of
                                                                            ENABLECOUNTER field.*/                                
  #define MRAMC_TESTMODE2_CONFIG_ENABLECOUNTER_Min (0x0UL) /*!< Min enumerator value of ENABLECOUNTER field.                   */
  #define MRAMC_TESTMODE2_CONFIG_ENABLECOUNTER_Max (0x1UL) /*!< Max enumerator value of ENABLECOUNTER field.                   */
  #define MRAMC_TESTMODE2_CONFIG_ENABLECOUNTER_Disabled (0x0UL) /*!< Counter is disabled                                       */
  #define MRAMC_TESTMODE2_CONFIG_ENABLECOUNTER_Enabled (0x1UL) /*!< Counter is enabled                                         */

/* COUNTERSTART @Bits 1..2 : Counter start configuration */
  #define MRAMC_TESTMODE2_CONFIG_COUNTERSTART_Pos (1UL) /*!< Position of COUNTERSTART field.                                   */
  #define MRAMC_TESTMODE2_CONFIG_COUNTERSTART_Msk (0x3UL << MRAMC_TESTMODE2_CONFIG_COUNTERSTART_Pos) /*!< Bit mask of
                                                                            COUNTERSTART field.*/                                 
  #define MRAMC_TESTMODE2_CONFIG_COUNTERSTART_Min (0x0UL) /*!< Min enumerator value of COUNTERSTART field.                     */
  #define MRAMC_TESTMODE2_CONFIG_COUNTERSTART_Max (0x2UL) /*!< Max enumerator value of COUNTERSTART field.                     */
  #define MRAMC_TESTMODE2_CONFIG_COUNTERSTART_NoOperation (0x0UL) /*!< The counter is not active                               */
  #define MRAMC_TESTMODE2_CONFIG_COUNTERSTART_CLK (0x1UL) /*!< The counter start on rising edge of CLK                         */
  #define MRAMC_TESTMODE2_CONFIG_COUNTERSTART_PROGEN (0x2UL) /*!< The counter start on rising edge of PROGEN                   */

/* READLATCH @Bit 3 : Configuration for latching the read/compare data */
  #define MRAMC_TESTMODE2_CONFIG_READLATCH_Pos (3UL) /*!< Position of READLATCH field.                                         */
  #define MRAMC_TESTMODE2_CONFIG_READLATCH_Msk (0x1UL << MRAMC_TESTMODE2_CONFIG_READLATCH_Pos) /*!< Bit mask of READLATCH
                                                                            field.*/                                              
  #define MRAMC_TESTMODE2_CONFIG_READLATCH_Min (0x0UL) /*!< Min enumerator value of READLATCH field.                           */
  #define MRAMC_TESTMODE2_CONFIG_READLATCH_Max (0x1UL) /*!< Max enumerator value of READLATCH field.                           */
  #define MRAMC_TESTMODE2_CONFIG_READLATCH_RDY (0x0UL) /*!< Latch the read data on the next rising edge on RDY after CLK going
                                                            high*/                                                                
  #define MRAMC_TESTMODE2_CONFIG_READLATCH_CounterTimeout (0x1UL) /*!< Latch the read data when the counter expires after CLK
                                                                       going high*/                                               

/* READDATA @Bit 4 : Configuration for the read to DATA, DATAINC, DATAECC and DATAECCINC, and TESTCMP */
  #define MRAMC_TESTMODE2_CONFIG_READDATA_Pos (4UL)  /*!< Position of READDATA field.                                          */
  #define MRAMC_TESTMODE2_CONFIG_READDATA_Msk (0x1UL << MRAMC_TESTMODE2_CONFIG_READDATA_Pos) /*!< Bit mask of READDATA field.  */
  #define MRAMC_TESTMODE2_CONFIG_READDATA_Min (0x0UL) /*!< Min enumerator value of READDATA field.                             */
  #define MRAMC_TESTMODE2_CONFIG_READDATA_Max (0x1UL) /*!< Max enumerator value of READDATA field.                             */
  #define MRAMC_TESTMODE2_CONFIG_READDATA_Direct (0x0UL) /*!< Read the data directly from the MRAM data bus                    */
  #define MRAMC_TESTMODE2_CONFIG_READDATA_Latched (0x1UL) /*!< Read the last latched data from the MRAM data bus               */

/* TESTCMPECC @Bit 5 : Configuration for TESTCMP to exclude ECC or not while comparison */
  #define MRAMC_TESTMODE2_CONFIG_TESTCMPECC_Pos (5UL) /*!< Position of TESTCMPECC field.                                       */
  #define MRAMC_TESTMODE2_CONFIG_TESTCMPECC_Msk (0x1UL << MRAMC_TESTMODE2_CONFIG_TESTCMPECC_Pos) /*!< Bit mask of TESTCMPECC
                                                                            field.*/                                              
  #define MRAMC_TESTMODE2_CONFIG_TESTCMPECC_Min (0x0UL) /*!< Min enumerator value of TESTCMPECC field.                         */
  #define MRAMC_TESTMODE2_CONFIG_TESTCMPECC_Max (0x1UL) /*!< Max enumerator value of TESTCMPECC field.                         */
  #define MRAMC_TESTMODE2_CONFIG_TESTCMPECC_Include (0x0UL) /*!< Compare both corresponding DATA and DATAECC with the
                                                                 direct/latched MRAM data*/                                       
  #define MRAMC_TESTMODE2_CONFIG_TESTCMPECC_Exclude (0x1UL) /*!< Compare only corresponding DATA with the direct/latched MRAM
                                                                 data*/                                                           

