adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* AUTOINC @Bits 6..7 : Controls the address auto-increment feature */
  #define MRAMC_TESTMODE2_CONFIG_AUTOINC_Pos (6UL)   /*!< Position of AUTOINC field.                                           */
  #define MRAMC_TESTMODE2_CONFIG_AUTOINC_Msk (0x3UL << MRAMC_TESTMODE2_CONFIG_AUTOINC_Pos) /*!< Bit mask of AUTOINC field.     */
  #define MRAMC_TESTMODE2_CONFIG_AUTOINC_Min (0x0UL) /*!< Min enumerator value of AUTOINC field.                               */
  #define MRAMC_TESTMODE2_CONFIG_AUTOINC_Max (0x2UL) /*!< Max enumerator value of AUTOINC field.                               */
  #define MRAMC_TESTMODE2_CONFIG_AUTOINC_NoIncrement (0x0UL) /*!< Address auto-incrementing is disabled                        */
  #define MRAMC_TESTMODE2_CONFIG_AUTOINC_Increment1 (0x1UL) /*!< Address auto-increment by one MRAM word                       */
  #define MRAMC_TESTMODE2_CONFIG_AUTOINC_Increment2 (0x2UL) /*!< Address auto-increment by two MRAM words                      */

/* WRITETRIGGER @Bits 8..10 : Configuration for write trigger */
  #define MRAMC_TESTMODE2_CONFIG_WRITETRIGGER_Pos (8UL) /*!< Position of WRITETRIGGER field.                                   */
  #define MRAMC_TESTMODE2_CONFIG_WRITETRIGGER_Msk (0x7UL << MRAMC_TESTMODE2_CONFIG_WRITETRIGGER_Pos) /*!< Bit mask of
                                                                            WRITETRIGGER field.*/                                 
  #define MRAMC_TESTMODE2_CONFIG_WRITETRIGGER_Min (0x0UL) /*!< Min enumerator value of WRITETRIGGER field.                     */
  #define MRAMC_TESTMODE2_CONFIG_WRITETRIGGER_Max (0x5UL) /*!< Max enumerator value of WRITETRIGGER field.                     */
  #define MRAMC_TESTMODE2_CONFIG_WRITETRIGGER_NoOperation (0x0UL) /*!< Write pulse handled manually.                           */
  #define MRAMC_TESTMODE2_CONFIG_WRITETRIGGER_DATAWORD0 (0x1UL) /*!< Writing to DATA[0] or DATAINC[0] triggers write pulse     */
  #define MRAMC_TESTMODE2_CONFIG_WRITETRIGGER_DATAWORD1 (0x2UL) /*!< Writing to DATA[1] or DATAINC[1] triggers write pulse     */
  #define MRAMC_TESTMODE2_CONFIG_WRITETRIGGER_DATAWORD2 (0x3UL) /*!< Writing to DATA[2] or DATAINC[2] triggers write pulse     */
  #define MRAMC_TESTMODE2_CONFIG_WRITETRIGGER_DATAWORD3 (0x4UL) /*!< Writing to DATA[3] or DATAINC[3] triggers write pulse     */
  #define MRAMC_TESTMODE2_CONFIG_WRITETRIGGER_DATAECC (0x5UL) /*!< Writing to DATAECC or DATAECCINC triggers write to pulse    */


/* MRAMC_TESTMODE2_TMOEN: Enable the pin multiplexing for TMO[2:0] pins of the MRAM macro */
  #define MRAMC_TESTMODE2_TMOEN_ResetValue (0x00000000UL) /*!< Reset value of TMOEN register.                                  */

/* ENABLE @Bit 0 : Enable or disable the TMO[2:0] pin multiplexing with analog IO pads. */
  #define MRAMC_TESTMODE2_TMOEN_ENABLE_Pos (0UL)     /*!< Position of ENABLE field.                                            */
  #define MRAMC_TESTMODE2_TMOEN_ENABLE_Msk (0x1UL << MRAMC_TESTMODE2_TMOEN_ENABLE_Pos) /*!< Bit mask of ENABLE field.          */
  #define MRAMC_TESTMODE2_TMOEN_ENABLE_Min (0x0UL)   /*!< Min enumerator value of ENABLE field.                                */
  #define MRAMC_TESTMODE2_TMOEN_ENABLE_Max (0x1UL)   /*!< Max enumerator value of ENABLE field.                                */
  #define MRAMC_TESTMODE2_TMOEN_ENABLE_Disable (0x0UL) /*!< Disable multiplexing                                               */
  #define MRAMC_TESTMODE2_TMOEN_ENABLE_Enable (0x1UL) /*!< Enable multiplexing                                                 */


/* MRAMC_TESTMODE2_BURSTWORDSNUM: Number of words for burst read or write */
  #define MRAMC_TESTMODE2_BURSTWORDSNUM_ResetValue (0x00000000UL) /*!< Reset value of BURSTWORDSNUM register.                  */

/* WORDS @Bits 0..18 : Number of words for burst read or write. */
  #define MRAMC_TESTMODE2_BURSTWORDSNUM_WORDS_Pos (0UL) /*!< Position of WORDS field.                                          */
  #define MRAMC_TESTMODE2_BURSTWORDSNUM_WORDS_Msk (0x7FFFFUL << MRAMC_TESTMODE2_BURSTWORDSNUM_WORDS_Pos) /*!< Bit mask of WORDS
                                                                            field.*/                                              


/* MRAMC_TESTMODE2_BURSTMODESTAT: The burst mode operation status. */
  #define MRAMC_TESTMODE2_BURSTMODESTAT_ResetValue (0x00000000UL) /*!< Reset value of BURSTMODESTAT register.                  */

/* DONE @Bits 0..1 : The burst mode operation is completed. */
  #define MRAMC_TESTMODE2_BURSTMODESTAT_DONE_Pos (0UL) /*!< Position of DONE field.                                            */
  #define MRAMC_TESTMODE2_BURSTMODESTAT_DONE_Msk (0x3UL << MRAMC_TESTMODE2_BURSTMODESTAT_DONE_Pos) /*!< Bit mask of DONE field.*/
  #define MRAMC_TESTMODE2_BURSTMODESTAT_DONE_Min (0x0UL) /*!< Min enumerator value of DONE field.                              */
  #define MRAMC_TESTMODE2_BURSTMODESTAT_DONE_Max (0x3UL) /*!< Max enumerator value of DONE field.                              */
  #define MRAMC_TESTMODE2_BURSTMODESTAT_DONE_NotActive (0x0UL) /*!< Burst mode operation not active                            */
  #define MRAMC_TESTMODE2_BURSTMODESTAT_DONE_Running (0x1UL) /*!< Burst mode is running                                        */
  #define MRAMC_TESTMODE2_BURSTMODESTAT_DONE_Done (0x2UL) /*!< The last burst mode operation is completed                      */
  #define MRAMC_TESTMODE2_BURSTMODESTAT_DONE_Error (0x3UL) /*!< The last burst mode operation is completed with errors for read
                                                                operation*/                                                       


/* MRAMC_TESTMODE2_ONEBITERR: Number of one bit error words detected while compare in the last burst mode read operation. */
  #define MRAMC_TESTMODE2_ONEBITERR_ResetValue (0x00000000UL) /*!< Reset value of ONEBITERR register.                          */

/* COUNT @Bits 0..18 : Number of words with one bit errors. */
  #define MRAMC_TESTMODE2_ONEBITERR_COUNT_Pos (0UL)  /*!< Position of COUNT field.                                             */
  #define MRAMC_TESTMODE2_ONEBITERR_COUNT_Msk (0x7FFFFUL << MRAMC_TESTMODE2_ONEBITERR_COUNT_Pos) /*!< Bit mask of COUNT field. */


/* MRAMC_TESTMODE2_TWOBITSERR: Number of two bit errors words detected while compare in the last burst mode read operation. */
  #define MRAMC_TESTMODE2_TWOBITSERR_ResetValue (0x00000000UL) /*!< Reset value of TWOBITSERR register.                        */

/* COUNT @Bits 0..18 : Number of words with one bit errors. */
  #define MRAMC_TESTMODE2_TWOBITSERR_COUNT_Pos (0UL) /*!< Position of COUNT field.                                             */
  #define MRAMC_TESTMODE2_TWOBITSERR_COUNT_Msk (0x7FFFFUL << MRAMC_TESTMODE2_TWOBITSERR_COUNT_Pos) /*!< Bit mask of COUNT
                                                                            field.*/                                              


