adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* MRAMC_TESTMODE2_MANYBITSERR: Number of more than two bit errors words detected while compare in the last burst mode read
                                 operation. */                                                                                    
                                                                                                                                  
  #define MRAMC_TESTMODE2_MANYBITSERR_ResetValue (0x00000000UL) /*!< Reset value of MANYBITSERR register.                      */

/* COUNT @Bits 0..18 : Number of words with more than two bit errors. */
  #define MRAMC_TESTMODE2_MANYBITSERR_COUNT_Pos (0UL) /*!< Position of COUNT field.                                            */
  #define MRAMC_TESTMODE2_MANYBITSERR_COUNT_Msk (0x7FFFFUL << MRAMC_TESTMODE2_MANYBITSERR_COUNT_Pos) /*!< Bit mask of COUNT
                                                                            field.*/                                              


/* MRAMC_TESTMODE2_ONEBITERRTHR: Threshold in terms of number of one bit error words to end the burst mode read operation with
                                  error. */                                                                                       
                                                                                                                                  
  #define MRAMC_TESTMODE2_ONEBITERRTHR_ResetValue (0x00000000UL) /*!< Reset value of ONEBITERRTHR register.                    */

/* COUNT @Bits 0..10 : Number of words with one bit errors. */
  #define MRAMC_TESTMODE2_ONEBITERRTHR_COUNT_Pos (0UL) /*!< Position of COUNT field.                                           */
  #define MRAMC_TESTMODE2_ONEBITERRTHR_COUNT_Msk (0x7FFUL << MRAMC_TESTMODE2_ONEBITERRTHR_COUNT_Pos) /*!< Bit mask of COUNT
                                                                            field.*/                                              


/* MRAMC_TESTMODE2_TWOBITSERRTHR: Threshold in terms of number of two bits error words to end the burst mode read operation with
                                   error. */                                                                                      
                                                                                                                                  
  #define MRAMC_TESTMODE2_TWOBITSERRTHR_ResetValue (0x00000000UL) /*!< Reset value of TWOBITSERRTHR register.                  */

/* COUNT @Bits 0..10 : Number of words with two bits errors. */
  #define MRAMC_TESTMODE2_TWOBITSERRTHR_COUNT_Pos (0UL) /*!< Position of COUNT field.                                          */
  #define MRAMC_TESTMODE2_TWOBITSERRTHR_COUNT_Msk (0x7FFUL << MRAMC_TESTMODE2_TWOBITSERRTHR_COUNT_Pos) /*!< Bit mask of COUNT
                                                                            field.*/                                              


/* MRAMC_TESTMODE2_MANYBITSERRTHR: Threshold in terms of number of more than two bits error words to end the burst mode read
                                    operation with error. */                                                                      
                                                                                                                                  
  #define MRAMC_TESTMODE2_MANYBITSERRTHR_ResetValue (0x00000000UL) /*!< Reset value of MANYBITSERRTHR register.                */

/* COUNT @Bits 0..10 : Number of words with more than two bits errors. */
  #define MRAMC_TESTMODE2_MANYBITSERRTHR_COUNT_Pos (0UL) /*!< Position of COUNT field.                                         */
  #define MRAMC_TESTMODE2_MANYBITSERRTHR_COUNT_Msk (0x7FFUL << MRAMC_TESTMODE2_MANYBITSERRTHR_COUNT_Pos) /*!< Bit mask of COUNT
                                                                            field.*/                                              


/* ====================================================== Struct MRAMC ======================================================= */
/**
  * @brief MRAM controller
  */
  typedef struct {                                   /*!< MRAMC Structure                                                      */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) Current operation is completed                        */
    __IOM uint32_t EVENTS_READYNEXT;                 /*!< (@ 0x00000104) Ready to accept a new write operation                 */
    __IOM uint32_t EVENTS_ECCERROR;                  /*!< (@ 0x00000108) ECC error detected but not corrected.                 */
    __IOM uint32_t EVENTS_ECCERRORCORR;              /*!< (@ 0x0000010C) ECC error detected and corrected.                     */
    __IOM uint32_t EVENTS_TRIMCONFIGREQ;             /*!< (@ 0x00000110) MRAM trim configuration request. The MRAMC is ready for
                                                                         the MRAM trim configuration.*/                           
    __IOM uint32_t EVENTS_ACCESSERR;                 /*!< (@ 0x00000114) MRAM access error.                                    */
    __IM uint32_t RESERVED1[122];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t READY;                             /*!< (@ 0x00000400) MRAMC current operation status.                       */
    __IM uint32_t READYNEXT;                         /*!< (@ 0x00000404) Ready next flag.                                      */
    __IM uint32_t RESERVED3[2];
    __IOM NRF_MRAMC_ECC_Type ECC;                    /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[56];
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000500) Configuration register                                */
    __IOM uint32_t AUTOREADMODE;                     /*!< (@ 0x00000504) Automatically disables the write and erases on timeout
                                                                         and enters into read mode.*/                             
    __IOM uint32_t WAITSTATES;                       /*!< (@ 0x00000508) Waitstates for MRAM read access                       */
    __IOM uint32_t READYNEXTTIMEOUT;                 /*!< (@ 0x0000050C) Preload timeout value for waiting for a next write    */
    __IOM NRF_MRAMC_LOWAVGCURR_Type LOWAVGCURR;      /*!< (@ 0x00000510) (unspecified)                                         */
    __IM uint32_t RESERVED5;
    __IOM NRF_MRAMC_POWER_Type POWER;                /*!< (@ 0x00000520) (unspecified)                                         */
    __IOM NRF_MRAMC_TRIM_Type TRIM;                  /*!< (@ 0x00000540) (unspecified)                                         */
    __IM uint32_t RESERVED6[2];
    __IOM NRF_MRAMC_ERASE_Type ERASE;                /*!< (@ 0x00000560) (unspecified)                                         */
    __IM uint32_t RESERVED7[3];
    __IOM NRF_MRAMC_CONFIGNVR_Type CONFIGNVR;        /*!< (@ 0x00000580) (unspecified)                                         */
    __IM uint32_t RESERVED8[28];
    __IOM NRF_MRAMC_TEST_Type TEST;                  /*!< (@ 0x00000600) (unspecified)                                         */
    __IOM NRF_MRAMC_TESTMODE1_Type TESTMODE1;        /*!< (@ 0x00000608) (unspecified)                                         */
    __IM uint32_t RESERVED9;
    __IOM NRF_MRAMC_TESTMODE2_Type TESTMODE2;        /*!< (@ 0x00000610) (unspecified)                                         */
  } NRF_MRAMC_Type;                                  /*!< Size = 1664 (0x680)                                                  */

/* MRAMC_EVENTS_READY: Current operation is completed */
  #define MRAMC_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                              */

