adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* READYNEXT @Bit 1 : Read pending status of interrupt for event READYNEXT */
  #define MRAMC_INTPEND_READYNEXT_Pos (1UL)          /*!< Position of READYNEXT field.                                         */
  #define MRAMC_INTPEND_READYNEXT_Msk (0x1UL << MRAMC_INTPEND_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.                 */
  #define MRAMC_INTPEND_READYNEXT_Min (0x0UL)        /*!< Min enumerator value of READYNEXT field.                             */
  #define MRAMC_INTPEND_READYNEXT_Max (0x1UL)        /*!< Max enumerator value of READYNEXT field.                             */
  #define MRAMC_INTPEND_READYNEXT_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define MRAMC_INTPEND_READYNEXT_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* ECCERROR @Bit 2 : Read pending status of interrupt for event ECCERROR */
  #define MRAMC_INTPEND_ECCERROR_Pos (2UL)           /*!< Position of ECCERROR field.                                          */
  #define MRAMC_INTPEND_ECCERROR_Msk (0x1UL << MRAMC_INTPEND_ECCERROR_Pos) /*!< Bit mask of ECCERROR field.                    */
  #define MRAMC_INTPEND_ECCERROR_Min (0x0UL)         /*!< Min enumerator value of ECCERROR field.                              */
  #define MRAMC_INTPEND_ECCERROR_Max (0x1UL)         /*!< Max enumerator value of ECCERROR field.                              */
  #define MRAMC_INTPEND_ECCERROR_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define MRAMC_INTPEND_ECCERROR_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* ECCERRORCORR @Bit 3 : Read pending status of interrupt for event ECCERRORCORR */
  #define MRAMC_INTPEND_ECCERRORCORR_Pos (3UL)       /*!< Position of ECCERRORCORR field.                                      */
  #define MRAMC_INTPEND_ECCERRORCORR_Msk (0x1UL << MRAMC_INTPEND_ECCERRORCORR_Pos) /*!< Bit mask of ECCERRORCORR field.        */
  #define MRAMC_INTPEND_ECCERRORCORR_Min (0x0UL)     /*!< Min enumerator value of ECCERRORCORR field.                          */
  #define MRAMC_INTPEND_ECCERRORCORR_Max (0x1UL)     /*!< Max enumerator value of ECCERRORCORR field.                          */
  #define MRAMC_INTPEND_ECCERRORCORR_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define MRAMC_INTPEND_ECCERRORCORR_Pending (0x1UL) /*!< Read: Pending                                                        */

/* TRIMCONFIGREQ @Bit 4 : Read pending status of interrupt for event TRIMCONFIGREQ */
  #define MRAMC_INTPEND_TRIMCONFIGREQ_Pos (4UL)      /*!< Position of TRIMCONFIGREQ field.                                     */
  #define MRAMC_INTPEND_TRIMCONFIGREQ_Msk (0x1UL << MRAMC_INTPEND_TRIMCONFIGREQ_Pos) /*!< Bit mask of TRIMCONFIGREQ field.     */
  #define MRAMC_INTPEND_TRIMCONFIGREQ_Min (0x0UL)    /*!< Min enumerator value of TRIMCONFIGREQ field.                         */
  #define MRAMC_INTPEND_TRIMCONFIGREQ_Max (0x1UL)    /*!< Max enumerator value of TRIMCONFIGREQ field.                         */
  #define MRAMC_INTPEND_TRIMCONFIGREQ_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define MRAMC_INTPEND_TRIMCONFIGREQ_Pending (0x1UL) /*!< Read: Pending                                                       */

/* ACCESSERR @Bit 5 : Read pending status of interrupt for event ACCESSERR */
  #define MRAMC_INTPEND_ACCESSERR_Pos (5UL)          /*!< Position of ACCESSERR field.                                         */
  #define MRAMC_INTPEND_ACCESSERR_Msk (0x1UL << MRAMC_INTPEND_ACCESSERR_Pos) /*!< Bit mask of ACCESSERR field.                 */
  #define MRAMC_INTPEND_ACCESSERR_Min (0x0UL)        /*!< Min enumerator value of ACCESSERR field.                             */
  #define MRAMC_INTPEND_ACCESSERR_Max (0x1UL)        /*!< Max enumerator value of ACCESSERR field.                             */
  #define MRAMC_INTPEND_ACCESSERR_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define MRAMC_INTPEND_ACCESSERR_Pending (0x1UL)    /*!< Read: Pending                                                        */


/* MRAMC_READY: MRAMC current operation status. */
  #define MRAMC_READY_ResetValue (0x00000000UL)      /*!< Reset value of READY register.                                       */

/* READY @Bit 0 : MRAMC is ready or busy */
  #define MRAMC_READY_READY_Pos (0UL)                /*!< Position of READY field.                                             */
  #define MRAMC_READY_READY_Msk (0x1UL << MRAMC_READY_READY_Pos) /*!< Bit mask of READY field.                                 */
  #define MRAMC_READY_READY_Min (0x0UL)              /*!< Min enumerator value of READY field.                                 */
  #define MRAMC_READY_READY_Max (0x1UL)              /*!< Max enumerator value of READY field.                                 */
  #define MRAMC_READY_READY_Busy (0x0UL)             /*!< MRAMC is busy                                                        */
  #define MRAMC_READY_READY_Ready (0x1UL)            /*!< Current operation is completed and MRAMC is ready                    */


/* MRAMC_READYNEXT: Ready next flag. */
  #define MRAMC_READYNEXT_ResetValue (0x00000000UL)  /*!< Reset value of READYNEXT register.                                   */

/* READYNEXT @Bit 0 : MRAMC can accept a new write operation */
  #define MRAMC_READYNEXT_READYNEXT_Pos (0UL)        /*!< Position of READYNEXT field.                                         */
  #define MRAMC_READYNEXT_READYNEXT_Msk (0x1UL << MRAMC_READYNEXT_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.             */
  #define MRAMC_READYNEXT_READYNEXT_Min (0x0UL)      /*!< Min enumerator value of READYNEXT field.                             */
  #define MRAMC_READYNEXT_READYNEXT_Max (0x1UL)      /*!< Max enumerator value of READYNEXT field.                             */
  #define MRAMC_READYNEXT_READYNEXT_Busy (0x0UL)     /*!< MRAMC cannot accept any write operation now                          */
  #define MRAMC_READYNEXT_READYNEXT_Ready (0x1UL)    /*!< MRAMC is ready to accept a new write operation                       */


/* MRAMC_CONFIG: Configuration register */
  #define MRAMC_CONFIG_ResetValue (0x00000000UL)     /*!< Reset value of CONFIG register.                                      */

