adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* COMPLETED1 @Bit 9 : Enable or disable interrupt for event COMPLETED[1] */
  #define MVDMA_INTEN_COMPLETED1_Pos (9UL)           /*!< Position of COMPLETED1 field.                                        */
  #define MVDMA_INTEN_COMPLETED1_Msk (0x1UL << MVDMA_INTEN_COMPLETED1_Pos) /*!< Bit mask of COMPLETED1 field.                  */
  #define MVDMA_INTEN_COMPLETED1_Min (0x0UL)         /*!< Min enumerator value of COMPLETED1 field.                            */
  #define MVDMA_INTEN_COMPLETED1_Max (0x1UL)         /*!< Max enumerator value of COMPLETED1 field.                            */
  #define MVDMA_INTEN_COMPLETED1_Disabled (0x0UL)    /*!< Disable                                                              */
  #define MVDMA_INTEN_COMPLETED1_Enabled (0x1UL)     /*!< Enable                                                               */

/* COMPLETED2 @Bit 10 : Enable or disable interrupt for event COMPLETED[2] */
  #define MVDMA_INTEN_COMPLETED2_Pos (10UL)          /*!< Position of COMPLETED2 field.                                        */
  #define MVDMA_INTEN_COMPLETED2_Msk (0x1UL << MVDMA_INTEN_COMPLETED2_Pos) /*!< Bit mask of COMPLETED2 field.                  */
  #define MVDMA_INTEN_COMPLETED2_Min (0x0UL)         /*!< Min enumerator value of COMPLETED2 field.                            */
  #define MVDMA_INTEN_COMPLETED2_Max (0x1UL)         /*!< Max enumerator value of COMPLETED2 field.                            */
  #define MVDMA_INTEN_COMPLETED2_Disabled (0x0UL)    /*!< Disable                                                              */
  #define MVDMA_INTEN_COMPLETED2_Enabled (0x1UL)     /*!< Enable                                                               */

/* COMPLETED3 @Bit 11 : Enable or disable interrupt for event COMPLETED[3] */
  #define MVDMA_INTEN_COMPLETED3_Pos (11UL)          /*!< Position of COMPLETED3 field.                                        */
  #define MVDMA_INTEN_COMPLETED3_Msk (0x1UL << MVDMA_INTEN_COMPLETED3_Pos) /*!< Bit mask of COMPLETED3 field.                  */
  #define MVDMA_INTEN_COMPLETED3_Min (0x0UL)         /*!< Min enumerator value of COMPLETED3 field.                            */
  #define MVDMA_INTEN_COMPLETED3_Max (0x1UL)         /*!< Max enumerator value of COMPLETED3 field.                            */
  #define MVDMA_INTEN_COMPLETED3_Disabled (0x0UL)    /*!< Disable                                                              */
  #define MVDMA_INTEN_COMPLETED3_Enabled (0x1UL)     /*!< Enable                                                               */

/* COMPLETED4 @Bit 12 : Enable or disable interrupt for event COMPLETED[4] */
  #define MVDMA_INTEN_COMPLETED4_Pos (12UL)          /*!< Position of COMPLETED4 field.                                        */
  #define MVDMA_INTEN_COMPLETED4_Msk (0x1UL << MVDMA_INTEN_COMPLETED4_Pos) /*!< Bit mask of COMPLETED4 field.                  */
  #define MVDMA_INTEN_COMPLETED4_Min (0x0UL)         /*!< Min enumerator value of COMPLETED4 field.                            */
  #define MVDMA_INTEN_COMPLETED4_Max (0x1UL)         /*!< Max enumerator value of COMPLETED4 field.                            */
  #define MVDMA_INTEN_COMPLETED4_Disabled (0x0UL)    /*!< Disable                                                              */
  #define MVDMA_INTEN_COMPLETED4_Enabled (0x1UL)     /*!< Enable                                                               */

/* COMPLETED5 @Bit 13 : Enable or disable interrupt for event COMPLETED[5] */
  #define MVDMA_INTEN_COMPLETED5_Pos (13UL)          /*!< Position of COMPLETED5 field.                                        */
  #define MVDMA_INTEN_COMPLETED5_Msk (0x1UL << MVDMA_INTEN_COMPLETED5_Pos) /*!< Bit mask of COMPLETED5 field.                  */
  #define MVDMA_INTEN_COMPLETED5_Min (0x0UL)         /*!< Min enumerator value of COMPLETED5 field.                            */
  #define MVDMA_INTEN_COMPLETED5_Max (0x1UL)         /*!< Max enumerator value of COMPLETED5 field.                            */
  #define MVDMA_INTEN_COMPLETED5_Disabled (0x0UL)    /*!< Disable                                                              */
  #define MVDMA_INTEN_COMPLETED5_Enabled (0x1UL)     /*!< Enable                                                               */

/* COMPLETED6 @Bit 14 : Enable or disable interrupt for event COMPLETED[6] */
  #define MVDMA_INTEN_COMPLETED6_Pos (14UL)          /*!< Position of COMPLETED6 field.                                        */
  #define MVDMA_INTEN_COMPLETED6_Msk (0x1UL << MVDMA_INTEN_COMPLETED6_Pos) /*!< Bit mask of COMPLETED6 field.                  */
  #define MVDMA_INTEN_COMPLETED6_Min (0x0UL)         /*!< Min enumerator value of COMPLETED6 field.                            */
  #define MVDMA_INTEN_COMPLETED6_Max (0x1UL)         /*!< Max enumerator value of COMPLETED6 field.                            */
  #define MVDMA_INTEN_COMPLETED6_Disabled (0x0UL)    /*!< Disable                                                              */
  #define MVDMA_INTEN_COMPLETED6_Enabled (0x1UL)     /*!< Enable                                                               */

/* COMPLETED7 @Bit 15 : Enable or disable interrupt for event COMPLETED[7] */
  #define MVDMA_INTEN_COMPLETED7_Pos (15UL)          /*!< Position of COMPLETED7 field.                                        */
  #define MVDMA_INTEN_COMPLETED7_Msk (0x1UL << MVDMA_INTEN_COMPLETED7_Pos) /*!< Bit mask of COMPLETED7 field.                  */
  #define MVDMA_INTEN_COMPLETED7_Min (0x0UL)         /*!< Min enumerator value of COMPLETED7 field.                            */
  #define MVDMA_INTEN_COMPLETED7_Max (0x1UL)         /*!< Max enumerator value of COMPLETED7 field.                            */
  #define MVDMA_INTEN_COMPLETED7_Disabled (0x0UL)    /*!< Disable                                                              */
  #define MVDMA_INTEN_COMPLETED7_Enabled (0x1UL)     /*!< Enable                                                               */


/* MVDMA_INTENSET: Enable interrupt */
  #define MVDMA_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* END @Bit 0 : Write '1' to enable interrupt for event END */
  #define MVDMA_INTENSET_END_Pos (0UL)               /*!< Position of END field.                                               */
  #define MVDMA_INTENSET_END_Msk (0x1UL << MVDMA_INTENSET_END_Pos) /*!< Bit mask of END field.                                 */
  #define MVDMA_INTENSET_END_Min (0x0UL)             /*!< Min enumerator value of END field.                                   */
  #define MVDMA_INTENSET_END_Max (0x1UL)             /*!< Max enumerator value of END field.                                   */
  #define MVDMA_INTENSET_END_Set (0x1UL)             /*!< Enable                                                               */
  #define MVDMA_INTENSET_END_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define MVDMA_INTENSET_END_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

