adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* STARTED @Bit 1 : Read pending status of interrupt for event STARTED */
  #define MVDMA_INTPEND_STARTED_Pos (1UL)            /*!< Position of STARTED field.                                           */
  #define MVDMA_INTPEND_STARTED_Msk (0x1UL << MVDMA_INTPEND_STARTED_Pos) /*!< Bit mask of STARTED field.                       */
  #define MVDMA_INTPEND_STARTED_Min (0x0UL)          /*!< Min enumerator value of STARTED field.                               */
  #define MVDMA_INTPEND_STARTED_Max (0x1UL)          /*!< Max enumerator value of STARTED field.                               */
  #define MVDMA_INTPEND_STARTED_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define MVDMA_INTPEND_STARTED_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* PAUSED @Bit 2 : Read pending status of interrupt for event PAUSED */
  #define MVDMA_INTPEND_PAUSED_Pos (2UL)             /*!< Position of PAUSED field.                                            */
  #define MVDMA_INTPEND_PAUSED_Msk (0x1UL << MVDMA_INTPEND_PAUSED_Pos) /*!< Bit mask of PAUSED field.                          */
  #define MVDMA_INTPEND_PAUSED_Min (0x0UL)           /*!< Min enumerator value of PAUSED field.                                */
  #define MVDMA_INTPEND_PAUSED_Max (0x1UL)           /*!< Max enumerator value of PAUSED field.                                */
  #define MVDMA_INTPEND_PAUSED_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define MVDMA_INTPEND_PAUSED_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* RESET @Bit 3 : Read pending status of interrupt for event RESET */
  #define MVDMA_INTPEND_RESET_Pos (3UL)              /*!< Position of RESET field.                                             */
  #define MVDMA_INTPEND_RESET_Msk (0x1UL << MVDMA_INTPEND_RESET_Pos) /*!< Bit mask of RESET field.                             */
  #define MVDMA_INTPEND_RESET_Min (0x0UL)            /*!< Min enumerator value of RESET field.                                 */
  #define MVDMA_INTPEND_RESET_Max (0x1UL)            /*!< Max enumerator value of RESET field.                                 */
  #define MVDMA_INTPEND_RESET_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define MVDMA_INTPEND_RESET_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* SOURCEBUSERROR @Bit 4 : Read pending status of interrupt for event SOURCEBUSERROR */
  #define MVDMA_INTPEND_SOURCEBUSERROR_Pos (4UL)     /*!< Position of SOURCEBUSERROR field.                                    */
  #define MVDMA_INTPEND_SOURCEBUSERROR_Msk (0x1UL << MVDMA_INTPEND_SOURCEBUSERROR_Pos) /*!< Bit mask of SOURCEBUSERROR field.  */
  #define MVDMA_INTPEND_SOURCEBUSERROR_Min (0x0UL)   /*!< Min enumerator value of SOURCEBUSERROR field.                        */
  #define MVDMA_INTPEND_SOURCEBUSERROR_Max (0x1UL)   /*!< Max enumerator value of SOURCEBUSERROR field.                        */
  #define MVDMA_INTPEND_SOURCEBUSERROR_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define MVDMA_INTPEND_SOURCEBUSERROR_Pending (0x1UL) /*!< Read: Pending                                                      */

/* SOURCESELECTJOBDONE @Bit 5 : Read pending status of interrupt for event SOURCESELECTJOBDONE */
  #define MVDMA_INTPEND_SOURCESELECTJOBDONE_Pos (5UL) /*!< Position of SOURCESELECTJOBDONE field.                              */
  #define MVDMA_INTPEND_SOURCESELECTJOBDONE_Msk (0x1UL << MVDMA_INTPEND_SOURCESELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            SOURCESELECTJOBDONE field.*/                          
  #define MVDMA_INTPEND_SOURCESELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SOURCESELECTJOBDONE field.                */
  #define MVDMA_INTPEND_SOURCESELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SOURCESELECTJOBDONE field.                */
  #define MVDMA_INTPEND_SOURCESELECTJOBDONE_NotPending (0x0UL) /*!< Read: Not pending                                          */
  #define MVDMA_INTPEND_SOURCESELECTJOBDONE_Pending (0x1UL) /*!< Read: Pending                                                 */

/* SINKBUSERROR @Bit 6 : Read pending status of interrupt for event SINKBUSERROR */
  #define MVDMA_INTPEND_SINKBUSERROR_Pos (6UL)       /*!< Position of SINKBUSERROR field.                                      */
  #define MVDMA_INTPEND_SINKBUSERROR_Msk (0x1UL << MVDMA_INTPEND_SINKBUSERROR_Pos) /*!< Bit mask of SINKBUSERROR field.        */
  #define MVDMA_INTPEND_SINKBUSERROR_Min (0x0UL)     /*!< Min enumerator value of SINKBUSERROR field.                          */
  #define MVDMA_INTPEND_SINKBUSERROR_Max (0x1UL)     /*!< Max enumerator value of SINKBUSERROR field.                          */
  #define MVDMA_INTPEND_SINKBUSERROR_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define MVDMA_INTPEND_SINKBUSERROR_Pending (0x1UL) /*!< Read: Pending                                                        */

/* SINKSELECTJOBDONE @Bit 7 : Read pending status of interrupt for event SINKSELECTJOBDONE */
  #define MVDMA_INTPEND_SINKSELECTJOBDONE_Pos (7UL)  /*!< Position of SINKSELECTJOBDONE field.                                 */
  #define MVDMA_INTPEND_SINKSELECTJOBDONE_Msk (0x1UL << MVDMA_INTPEND_SINKSELECTJOBDONE_Pos) /*!< Bit mask of SINKSELECTJOBDONE
                                                                            field.*/                                              
  #define MVDMA_INTPEND_SINKSELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SINKSELECTJOBDONE field.                    */
  #define MVDMA_INTPEND_SINKSELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SINKSELECTJOBDONE field.                    */
  #define MVDMA_INTPEND_SINKSELECTJOBDONE_NotPending (0x0UL) /*!< Read: Not pending                                            */
  #define MVDMA_INTPEND_SINKSELECTJOBDONE_Pending (0x1UL) /*!< Read: Pending                                                   */

