adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EN @Bit 31 : Enable the digital test bus */
  #define NFCT_DFT_DTB0CONFIG_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define NFCT_DFT_DTB0CONFIG_EN_Msk (0x1UL << NFCT_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                          */
  #define NFCT_DFT_DTB0CONFIG_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define NFCT_DFT_DTB0CONFIG_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define NFCT_DFT_DTB0CONFIG_EN_Disabled (0x0UL)    /*!< Digital test bus is disabled (Clamped to VSS)                        */
  #define NFCT_DFT_DTB0CONFIG_EN_Enabled (0x1UL)     /*!< Digital test bus is enabled                                          */


/* NFCT_DFT_TCFG: Test mode configuration */
  #define NFCT_DFT_TCFG_ResetValue (0x00000000UL)    /*!< Reset value of TCFG register.                                        */

/* VCOVOLTAGE @Bit 0 : Tuning voltage of VCO inside NFCT_CLOCKREC_GF22N set to constant Hi-Z voltage so it can be overridden by
                       ATB */                                                                                                     
                                                                                                                                  
  #define NFCT_DFT_TCFG_VCOVOLTAGE_Pos (0UL)         /*!< Position of VCOVOLTAGE field.                                        */
  #define NFCT_DFT_TCFG_VCOVOLTAGE_Msk (0x1UL << NFCT_DFT_TCFG_VCOVOLTAGE_Pos) /*!< Bit mask of VCOVOLTAGE field.              */
  #define NFCT_DFT_TCFG_VCOVOLTAGE_Min (0x0UL)       /*!< Min enumerator value of VCOVOLTAGE field.                            */
  #define NFCT_DFT_TCFG_VCOVOLTAGE_Max (0x1UL)       /*!< Max enumerator value of VCOVOLTAGE field.                            */
  #define NFCT_DFT_TCFG_VCOVOLTAGE_Disabled (0x0UL)  /*!< (unspecified)                                                        */
  #define NFCT_DFT_TCFG_VCOVOLTAGE_Enabled (0x1UL)   /*!< (unspecified)                                                        */

/* OSCIN @Bit 1 : Sets the oscillator input of the phase detector inside PLL of NFCT_CLOCKREC_GF22N to 0 */
  #define NFCT_DFT_TCFG_OSCIN_Pos (1UL)              /*!< Position of OSCIN field.                                             */
  #define NFCT_DFT_TCFG_OSCIN_Msk (0x1UL << NFCT_DFT_TCFG_OSCIN_Pos) /*!< Bit mask of OSCIN field.                             */
  #define NFCT_DFT_TCFG_OSCIN_Min (0x0UL)            /*!< Min enumerator value of OSCIN field.                                 */
  #define NFCT_DFT_TCFG_OSCIN_Max (0x1UL)            /*!< Max enumerator value of OSCIN field.                                 */
  #define NFCT_DFT_TCFG_OSCIN_Disabled (0x0UL)       /*!< (unspecified)                                                        */
  #define NFCT_DFT_TCFG_OSCIN_Enabled (0x1UL)        /*!< (unspecified)                                                        */

/* PHASEDETOUT @Bit 2 : Overrides the output of the XOR phase detector inside PLL of NFCT_CLOCKREC_GF22N to 1 */
  #define NFCT_DFT_TCFG_PHASEDETOUT_Pos (2UL)        /*!< Position of PHASEDETOUT field.                                       */
  #define NFCT_DFT_TCFG_PHASEDETOUT_Msk (0x1UL << NFCT_DFT_TCFG_PHASEDETOUT_Pos) /*!< Bit mask of PHASEDETOUT field.           */
  #define NFCT_DFT_TCFG_PHASEDETOUT_Min (0x0UL)      /*!< Min enumerator value of PHASEDETOUT field.                           */
  #define NFCT_DFT_TCFG_PHASEDETOUT_Max (0x1UL)      /*!< Max enumerator value of PHASEDETOUT field.                           */
  #define NFCT_DFT_TCFG_PHASEDETOUT_Disabled (0x0UL) /*!< (unspecified)                                                        */
  #define NFCT_DFT_TCFG_PHASEDETOUT_Enabled (0x1UL)  /*!< (unspecified)                                                        */

/* BIT3 @Bit 3 : Spare (Clock recovery) */
  #define NFCT_DFT_TCFG_BIT3_Pos (3UL)               /*!< Position of BIT3 field.                                              */
  #define NFCT_DFT_TCFG_BIT3_Msk (0x1UL << NFCT_DFT_TCFG_BIT3_Pos) /*!< Bit mask of BIT3 field.                                */

/* BIT4 @Bit 4 : Spare (Clock recovery) */
  #define NFCT_DFT_TCFG_BIT4_Pos (4UL)               /*!< Position of BIT4 field.                                              */
  #define NFCT_DFT_TCFG_BIT4_Msk (0x1UL << NFCT_DFT_TCFG_BIT4_Pos) /*!< Bit mask of BIT4 field.                                */
  #define NFCT_DFT_TCFG_BIT4_Min (0x0UL)             /*!< Min enumerator value of BIT4 field.                                  */
  #define NFCT_DFT_TCFG_BIT4_Max (0x1UL)             /*!< Max enumerator value of BIT4 field.                                  */
  #define NFCT_DFT_TCFG_BIT4_Disabled (0x0UL)        /*!< (unspecified)                                                        */
  #define NFCT_DFT_TCFG_BIT4_Enabled (0x1UL)         /*!< (unspecified)                                                        */

/* BIT5 @Bit 5 : Spare */
  #define NFCT_DFT_TCFG_BIT5_Pos (5UL)               /*!< Position of BIT5 field.                                              */
  #define NFCT_DFT_TCFG_BIT5_Msk (0x1UL << NFCT_DFT_TCFG_BIT5_Pos) /*!< Bit mask of BIT5 field.                                */
  #define NFCT_DFT_TCFG_BIT5_Min (0x0UL)             /*!< Min enumerator value of BIT5 field.                                  */
  #define NFCT_DFT_TCFG_BIT5_Max (0x1UL)             /*!< Max enumerator value of BIT5 field.                                  */
  #define NFCT_DFT_TCFG_BIT5_Disabled (0x0UL)        /*!< (unspecified)                                                        */
  #define NFCT_DFT_TCFG_BIT5_Enabled (0x1UL)         /*!< (unspecified)                                                        */

/* BIT6 @Bit 6 : Spare (Local bias) */
  #define NFCT_DFT_TCFG_BIT6_Pos (6UL)               /*!< Position of BIT6 field.                                              */
  #define NFCT_DFT_TCFG_BIT6_Msk (0x1UL << NFCT_DFT_TCFG_BIT6_Pos) /*!< Bit mask of BIT6 field.                                */
  #define NFCT_DFT_TCFG_BIT6_Min (0x0UL)             /*!< Min enumerator value of BIT6 field.                                  */
  #define NFCT_DFT_TCFG_BIT6_Max (0x1UL)             /*!< Max enumerator value of BIT6 field.                                  */
  #define NFCT_DFT_TCFG_BIT6_Disabled (0x0UL)        /*!< (unspecified)                                                        */
  #define NFCT_DFT_TCFG_BIT6_Enabled (0x1UL)         /*!< (unspecified)                                                        */

/* BIT7 @Bit 7 : Bypass LDO */
  #define NFCT_DFT_TCFG_BIT7_Pos (7UL)               /*!< Position of BIT7 field.                                              */
  #define NFCT_DFT_TCFG_BIT7_Msk (0x1UL << NFCT_DFT_TCFG_BIT7_Pos) /*!< Bit mask of BIT7 field.                                */
  #define NFCT_DFT_TCFG_BIT7_Min (0x0UL)             /*!< Min enumerator value of BIT7 field.                                  */
  #define NFCT_DFT_TCFG_BIT7_Max (0x1UL)             /*!< Max enumerator value of BIT7 field.                                  */
  #define NFCT_DFT_TCFG_BIT7_Disabled (0x0UL)        /*!< (unspecified)                                                        */
  #define NFCT_DFT_TCFG_BIT7_Enabled (0x1UL)         /*!< (unspecified)                                                        */

/* BIT8 @Bit 8 : Spare (LDO) */
  #define NFCT_DFT_TCFG_BIT8_Pos (8UL)               /*!< Position of BIT8 field.                                              */
  #define NFCT_DFT_TCFG_BIT8_Msk (0x1UL << NFCT_DFT_TCFG_BIT8_Pos) /*!< Bit mask of BIT8 field.                                */
  #define NFCT_DFT_TCFG_BIT8_Min (0x0UL)             /*!< Min enumerator value of BIT8 field.                                  */
  #define NFCT_DFT_TCFG_BIT8_Max (0x1UL)             /*!< Max enumerator value of BIT8 field.                                  */
  #define NFCT_DFT_TCFG_BIT8_Disabled (0x0UL)        /*!< (unspecified)                                                        */
  #define NFCT_DFT_TCFG_BIT8_Enabled (0x1UL)         /*!< (unspecified)                                                        */

