adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* NFCT_TASKS_GOIDLE: Force state machine to IDLE state */
  #define NFCT_TASKS_GOIDLE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_GOIDLE register.                               */

/* TASKS_GOIDLE @Bit 0 : Force state machine to IDLE state */
  #define NFCT_TASKS_GOIDLE_TASKS_GOIDLE_Pos (0UL)   /*!< Position of TASKS_GOIDLE field.                                      */
  #define NFCT_TASKS_GOIDLE_TASKS_GOIDLE_Msk (0x1UL << NFCT_TASKS_GOIDLE_TASKS_GOIDLE_Pos) /*!< Bit mask of TASKS_GOIDLE field.*/
  #define NFCT_TASKS_GOIDLE_TASKS_GOIDLE_Min (0x1UL) /*!< Min enumerator value of TASKS_GOIDLE field.                          */
  #define NFCT_TASKS_GOIDLE_TASKS_GOIDLE_Max (0x1UL) /*!< Max enumerator value of TASKS_GOIDLE field.                          */
  #define NFCT_TASKS_GOIDLE_TASKS_GOIDLE_Trigger (0x1UL) /*!< Trigger task                                                     */


/* NFCT_TASKS_GOSLEEP: Force state machine to SLEEP_A state */
  #define NFCT_TASKS_GOSLEEP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_GOSLEEP register.                             */

/* TASKS_GOSLEEP @Bit 0 : Force state machine to SLEEP_A state */
  #define NFCT_TASKS_GOSLEEP_TASKS_GOSLEEP_Pos (0UL) /*!< Position of TASKS_GOSLEEP field.                                     */
  #define NFCT_TASKS_GOSLEEP_TASKS_GOSLEEP_Msk (0x1UL << NFCT_TASKS_GOSLEEP_TASKS_GOSLEEP_Pos) /*!< Bit mask of TASKS_GOSLEEP
                                                                            field.*/                                              
  #define NFCT_TASKS_GOSLEEP_TASKS_GOSLEEP_Min (0x1UL) /*!< Min enumerator value of TASKS_GOSLEEP field.                       */
  #define NFCT_TASKS_GOSLEEP_TASKS_GOSLEEP_Max (0x1UL) /*!< Max enumerator value of TASKS_GOSLEEP field.                       */
  #define NFCT_TASKS_GOSLEEP_TASKS_GOSLEEP_Trigger (0x1UL) /*!< Trigger task                                                   */


/* NFCT_SUBSCRIBE_ACTIVATE: Subscribe configuration for task ACTIVATE */
  #define NFCT_SUBSCRIBE_ACTIVATE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_ACTIVATE register.                   */

/* CHIDX @Bits 0..7 : DPPI channel that task ACTIVATE will subscribe to */
  #define NFCT_SUBSCRIBE_ACTIVATE_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define NFCT_SUBSCRIBE_ACTIVATE_CHIDX_Msk (0xFFUL << NFCT_SUBSCRIBE_ACTIVATE_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define NFCT_SUBSCRIBE_ACTIVATE_CHIDX_Min (0x0UL)  /*!< Min value of CHIDX field.                                            */
  #define NFCT_SUBSCRIBE_ACTIVATE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_SUBSCRIBE_ACTIVATE_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define NFCT_SUBSCRIBE_ACTIVATE_EN_Msk (0x1UL << NFCT_SUBSCRIBE_ACTIVATE_EN_Pos) /*!< Bit mask of EN field.                  */
  #define NFCT_SUBSCRIBE_ACTIVATE_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_ACTIVATE_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_ACTIVATE_EN_Disabled (0x0UL) /*!< Disable subscription                                                */
  #define NFCT_SUBSCRIBE_ACTIVATE_EN_Enabled (0x1UL) /*!< Enable subscription                                                  */


/* NFCT_SUBSCRIBE_DISABLE: Subscribe configuration for task DISABLE */
  #define NFCT_SUBSCRIBE_DISABLE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DISABLE register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that task DISABLE will subscribe to */
  #define NFCT_SUBSCRIBE_DISABLE_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define NFCT_SUBSCRIBE_DISABLE_CHIDX_Msk (0xFFUL << NFCT_SUBSCRIBE_DISABLE_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define NFCT_SUBSCRIBE_DISABLE_CHIDX_Min (0x0UL)   /*!< Min value of CHIDX field.                                            */
  #define NFCT_SUBSCRIBE_DISABLE_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_SUBSCRIBE_DISABLE_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define NFCT_SUBSCRIBE_DISABLE_EN_Msk (0x1UL << NFCT_SUBSCRIBE_DISABLE_EN_Pos) /*!< Bit mask of EN field.                    */
  #define NFCT_SUBSCRIBE_DISABLE_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_DISABLE_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_DISABLE_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define NFCT_SUBSCRIBE_DISABLE_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* NFCT_SUBSCRIBE_SENSE: Subscribe configuration for task SENSE */
  #define NFCT_SUBSCRIBE_SENSE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_SENSE register.                         */

/* CHIDX @Bits 0..7 : DPPI channel that task SENSE will subscribe to */
  #define NFCT_SUBSCRIBE_SENSE_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define NFCT_SUBSCRIBE_SENSE_CHIDX_Msk (0xFFUL << NFCT_SUBSCRIBE_SENSE_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define NFCT_SUBSCRIBE_SENSE_CHIDX_Min (0x0UL)     /*!< Min value of CHIDX field.                                            */
  #define NFCT_SUBSCRIBE_SENSE_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_SUBSCRIBE_SENSE_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define NFCT_SUBSCRIBE_SENSE_EN_Msk (0x1UL << NFCT_SUBSCRIBE_SENSE_EN_Pos) /*!< Bit mask of EN field.                        */
  #define NFCT_SUBSCRIBE_SENSE_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_SENSE_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_SENSE_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define NFCT_SUBSCRIBE_SENSE_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* NFCT_SUBSCRIBE_STARTTX: Subscribe configuration for task STARTTX */
  #define NFCT_SUBSCRIBE_STARTTX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STARTTX register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that task STARTTX will subscribe to */
  #define NFCT_SUBSCRIBE_STARTTX_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define NFCT_SUBSCRIBE_STARTTX_CHIDX_Msk (0xFFUL << NFCT_SUBSCRIBE_STARTTX_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define NFCT_SUBSCRIBE_STARTTX_CHIDX_Min (0x0UL)   /*!< Min value of CHIDX field.                                            */
  #define NFCT_SUBSCRIBE_STARTTX_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_SUBSCRIBE_STARTTX_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define NFCT_SUBSCRIBE_STARTTX_EN_Msk (0x1UL << NFCT_SUBSCRIBE_STARTTX_EN_Pos) /*!< Bit mask of EN field.                    */
  #define NFCT_SUBSCRIBE_STARTTX_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_STARTTX_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_STARTTX_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define NFCT_SUBSCRIBE_STARTTX_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* NFCT_SUBSCRIBE_STOPTX: Subscribe configuration for task STOPTX */
  #define NFCT_SUBSCRIBE_STOPTX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOPTX register.                       */

/* CHIDX @Bits 0..7 : DPPI channel that task STOPTX will subscribe to */
  #define NFCT_SUBSCRIBE_STOPTX_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define NFCT_SUBSCRIBE_STOPTX_CHIDX_Msk (0xFFUL << NFCT_SUBSCRIBE_STOPTX_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define NFCT_SUBSCRIBE_STOPTX_CHIDX_Min (0x0UL)    /*!< Min value of CHIDX field.                                            */
  #define NFCT_SUBSCRIBE_STOPTX_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_SUBSCRIBE_STOPTX_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define NFCT_SUBSCRIBE_STOPTX_EN_Msk (0x1UL << NFCT_SUBSCRIBE_STOPTX_EN_Pos) /*!< Bit mask of EN field.                      */
  #define NFCT_SUBSCRIBE_STOPTX_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_STOPTX_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_STOPTX_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define NFCT_SUBSCRIBE_STOPTX_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* NFCT_SUBSCRIBE_START_ROSCCAL: Subscribe configuration for task START_ROSCCAL */
  #define NFCT_SUBSCRIBE_START_ROSCCAL_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_START_ROSCCAL register.         */

/* CHIDX @Bits 0..7 : DPPI channel that task START_ROSCCAL will subscribe to */
  #define NFCT_SUBSCRIBE_START_ROSCCAL_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                           */
  #define NFCT_SUBSCRIBE_START_ROSCCAL_CHIDX_Msk (0xFFUL << NFCT_SUBSCRIBE_START_ROSCCAL_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define NFCT_SUBSCRIBE_START_ROSCCAL_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                        */
  #define NFCT_SUBSCRIBE_START_ROSCCAL_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                        */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_SUBSCRIBE_START_ROSCCAL_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define NFCT_SUBSCRIBE_START_ROSCCAL_EN_Msk (0x1UL << NFCT_SUBSCRIBE_START_ROSCCAL_EN_Pos) /*!< Bit mask of EN field.        */
  #define NFCT_SUBSCRIBE_START_ROSCCAL_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define NFCT_SUBSCRIBE_START_ROSCCAL_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define NFCT_SUBSCRIBE_START_ROSCCAL_EN_Disabled (0x0UL) /*!< Disable subscription                                           */
  #define NFCT_SUBSCRIBE_START_ROSCCAL_EN_Enabled (0x1UL) /*!< Enable subscription                                             */


/* NFCT_SUBSCRIBE_FREQMEASURE: Subscribe configuration for task FREQMEASURE */
  #define NFCT_SUBSCRIBE_FREQMEASURE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_FREQMEASURE register.             */

/* CHIDX @Bits 0..7 : DPPI channel that task FREQMEASURE will subscribe to */
  #define NFCT_SUBSCRIBE_FREQMEASURE_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define NFCT_SUBSCRIBE_FREQMEASURE_CHIDX_Msk (0xFFUL << NFCT_SUBSCRIBE_FREQMEASURE_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define NFCT_SUBSCRIBE_FREQMEASURE_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                          */
  #define NFCT_SUBSCRIBE_FREQMEASURE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_SUBSCRIBE_FREQMEASURE_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define NFCT_SUBSCRIBE_FREQMEASURE_EN_Msk (0x1UL << NFCT_SUBSCRIBE_FREQMEASURE_EN_Pos) /*!< Bit mask of EN field.            */
  #define NFCT_SUBSCRIBE_FREQMEASURE_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_FREQMEASURE_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_FREQMEASURE_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define NFCT_SUBSCRIBE_FREQMEASURE_EN_Enabled (0x1UL) /*!< Enable subscription                                               */


