adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EVENTS_FREQMEASUREDONE @Bit 0 : Done with one frequency measurement, result available in the MEASUREDFREQ register. This
                                   event will fire several times during calibration. */                                           
                                                                                                                                  
  #define NFCT_EVENTS_FREQMEASUREDONE_EVENTS_FREQMEASUREDONE_Pos (0UL) /*!< Position of EVENTS_FREQMEASUREDONE field.          */
  #define NFCT_EVENTS_FREQMEASUREDONE_EVENTS_FREQMEASUREDONE_Msk (0x1UL << NFCT_EVENTS_FREQMEASUREDONE_EVENTS_FREQMEASUREDONE_Pos)
                                                                            /*!< Bit mask of EVENTS_FREQMEASUREDONE field.*/      
  #define NFCT_EVENTS_FREQMEASUREDONE_EVENTS_FREQMEASUREDONE_Min (0x0UL) /*!< Min enumerator value of EVENTS_FREQMEASUREDONE
                                                                            field.*/                                              
  #define NFCT_EVENTS_FREQMEASUREDONE_EVENTS_FREQMEASUREDONE_Max (0x1UL) /*!< Max enumerator value of EVENTS_FREQMEASUREDONE
                                                                            field.*/                                              
  #define NFCT_EVENTS_FREQMEASUREDONE_EVENTS_FREQMEASUREDONE_NotGenerated (0x0UL) /*!< Event not generated                     */
  #define NFCT_EVENTS_FREQMEASUREDONE_EVENTS_FREQMEASUREDONE_Generated (0x1UL) /*!< Event generated                            */


/* NFCT_EVENTS_CALCOMPLETE: NFC ring oscillator calibration complete. */
  #define NFCT_EVENTS_CALCOMPLETE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CALCOMPLETE register.                   */

/* EVENTS_CALCOMPLETE @Bit 0 : NFC ring oscillator calibration complete. */
  #define NFCT_EVENTS_CALCOMPLETE_EVENTS_CALCOMPLETE_Pos (0UL) /*!< Position of EVENTS_CALCOMPLETE field.                      */
  #define NFCT_EVENTS_CALCOMPLETE_EVENTS_CALCOMPLETE_Msk (0x1UL << NFCT_EVENTS_CALCOMPLETE_EVENTS_CALCOMPLETE_Pos) /*!< Bit mask
                                                                            of EVENTS_CALCOMPLETE field.*/                        
  #define NFCT_EVENTS_CALCOMPLETE_EVENTS_CALCOMPLETE_Min (0x0UL) /*!< Min enumerator value of EVENTS_CALCOMPLETE field.        */
  #define NFCT_EVENTS_CALCOMPLETE_EVENTS_CALCOMPLETE_Max (0x1UL) /*!< Max enumerator value of EVENTS_CALCOMPLETE field.        */
  #define NFCT_EVENTS_CALCOMPLETE_EVENTS_CALCOMPLETE_NotGenerated (0x0UL) /*!< Event not generated                             */
  #define NFCT_EVENTS_CALCOMPLETE_EVENTS_CALCOMPLETE_Generated (0x1UL) /*!< Event generated                                    */


/* NFCT_EVENTS_RXERROR: NFC RX frame error reported. The FRAMESTATUS.RX register contains details on the source of the error. */
  #define NFCT_EVENTS_RXERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXERROR register.                           */

/* EVENTS_RXERROR @Bit 0 : NFC RX frame error reported. The FRAMESTATUS.RX register contains details on the source of the error.
                           */                                                                                                     
                                                                                                                                  
  #define NFCT_EVENTS_RXERROR_EVENTS_RXERROR_Pos (0UL) /*!< Position of EVENTS_RXERROR field.                                  */
  #define NFCT_EVENTS_RXERROR_EVENTS_RXERROR_Msk (0x1UL << NFCT_EVENTS_RXERROR_EVENTS_RXERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_RXERROR field.*/                               
  #define NFCT_EVENTS_RXERROR_EVENTS_RXERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXERROR field.                    */
  #define NFCT_EVENTS_RXERROR_EVENTS_RXERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXERROR field.                    */
  #define NFCT_EVENTS_RXERROR_EVENTS_RXERROR_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define NFCT_EVENTS_RXERROR_EVENTS_RXERROR_Generated (0x1UL) /*!< Event generated                                            */


/* NFCT_EVENTS_ENDRX: RX buffer (as defined by PACKETPTR and MAXLEN) in Data RAM full. */
  #define NFCT_EVENTS_ENDRX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ENDRX register.                               */

/* EVENTS_ENDRX @Bit 0 : RX buffer (as defined by PACKETPTR and MAXLEN) in Data RAM full. */
  #define NFCT_EVENTS_ENDRX_EVENTS_ENDRX_Pos (0UL)   /*!< Position of EVENTS_ENDRX field.                                      */
  #define NFCT_EVENTS_ENDRX_EVENTS_ENDRX_Msk (0x1UL << NFCT_EVENTS_ENDRX_EVENTS_ENDRX_Pos) /*!< Bit mask of EVENTS_ENDRX field.*/
  #define NFCT_EVENTS_ENDRX_EVENTS_ENDRX_Min (0x0UL) /*!< Min enumerator value of EVENTS_ENDRX field.                          */
  #define NFCT_EVENTS_ENDRX_EVENTS_ENDRX_Max (0x1UL) /*!< Max enumerator value of EVENTS_ENDRX field.                          */
  #define NFCT_EVENTS_ENDRX_EVENTS_ENDRX_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define NFCT_EVENTS_ENDRX_EVENTS_ENDRX_Generated (0x1UL) /*!< Event generated                                                */


/* NFCT_EVENTS_ENDTX: Transmission of data in RAM has ended, and EasyDMA has ended accessing the TX buffer */
  #define NFCT_EVENTS_ENDTX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ENDTX register.                               */

/* EVENTS_ENDTX @Bit 0 : Transmission of data in RAM has ended, and EasyDMA has ended accessing the TX buffer */
  #define NFCT_EVENTS_ENDTX_EVENTS_ENDTX_Pos (0UL)   /*!< Position of EVENTS_ENDTX field.                                      */
  #define NFCT_EVENTS_ENDTX_EVENTS_ENDTX_Msk (0x1UL << NFCT_EVENTS_ENDTX_EVENTS_ENDTX_Pos) /*!< Bit mask of EVENTS_ENDTX field.*/
  #define NFCT_EVENTS_ENDTX_EVENTS_ENDTX_Min (0x0UL) /*!< Min enumerator value of EVENTS_ENDTX field.                          */
  #define NFCT_EVENTS_ENDTX_EVENTS_ENDTX_Max (0x1UL) /*!< Max enumerator value of EVENTS_ENDTX field.                          */
  #define NFCT_EVENTS_ENDTX_EVENTS_ENDTX_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define NFCT_EVENTS_ENDTX_EVENTS_ENDTX_Generated (0x1UL) /*!< Event generated                                                */


