adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* NFCT_EVENTS_AUTOCOLRESSTARTED: Auto collision resolution process has started Event generated when ALL_REQ or SENS_REQ has
                                   been received while in IDLE state */                                                           
                                                                                                                                  
  #define NFCT_EVENTS_AUTOCOLRESSTARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_AUTOCOLRESSTARTED register.       */

/* EVENTS_AUTOCOLRESSTARTED @Bit 0 : Auto collision resolution process has started Event generated when ALL_REQ or SENS_REQ has
                                     been received while in IDLE state */                                                         
                                                                                                                                  
  #define NFCT_EVENTS_AUTOCOLRESSTARTED_EVENTS_AUTOCOLRESSTARTED_Pos (0UL) /*!< Position of EVENTS_AUTOCOLRESSTARTED field.    */
  #define NFCT_EVENTS_AUTOCOLRESSTARTED_EVENTS_AUTOCOLRESSTARTED_Msk (0x1UL << NFCT_EVENTS_AUTOCOLRESSTARTED_EVENTS_AUTOCOLRESSTARTED_Pos)
                                                                            /*!< Bit mask of EVENTS_AUTOCOLRESSTARTED field.*/    
  #define NFCT_EVENTS_AUTOCOLRESSTARTED_EVENTS_AUTOCOLRESSTARTED_Min (0x0UL) /*!< Min enumerator value of
                                                                            EVENTS_AUTOCOLRESSTARTED field.*/                     
  #define NFCT_EVENTS_AUTOCOLRESSTARTED_EVENTS_AUTOCOLRESSTARTED_Max (0x1UL) /*!< Max enumerator value of
                                                                            EVENTS_AUTOCOLRESSTARTED field.*/                     
  #define NFCT_EVENTS_AUTOCOLRESSTARTED_EVENTS_AUTOCOLRESSTARTED_NotGenerated (0x0UL) /*!< Event not generated                 */
  #define NFCT_EVENTS_AUTOCOLRESSTARTED_EVENTS_AUTOCOLRESSTARTED_Generated (0x1UL) /*!< Event generated                        */


/* NFCT_EVENTS_AUTOCOLRES1: Auto collision resolution cascade level 1 succeeded */
  #define NFCT_EVENTS_AUTOCOLRES1_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_AUTOCOLRES1 register.                   */

/* EVENTS_AUTOCOLRES1 @Bit 0 : Auto collision resolution cascade level 1 succeeded */
  #define NFCT_EVENTS_AUTOCOLRES1_EVENTS_AUTOCOLRES1_Pos (0UL) /*!< Position of EVENTS_AUTOCOLRES1 field.                      */
  #define NFCT_EVENTS_AUTOCOLRES1_EVENTS_AUTOCOLRES1_Msk (0x1UL << NFCT_EVENTS_AUTOCOLRES1_EVENTS_AUTOCOLRES1_Pos) /*!< Bit mask
                                                                            of EVENTS_AUTOCOLRES1 field.*/                        
  #define NFCT_EVENTS_AUTOCOLRES1_EVENTS_AUTOCOLRES1_Min (0x0UL) /*!< Min enumerator value of EVENTS_AUTOCOLRES1 field.        */
  #define NFCT_EVENTS_AUTOCOLRES1_EVENTS_AUTOCOLRES1_Max (0x1UL) /*!< Max enumerator value of EVENTS_AUTOCOLRES1 field.        */
  #define NFCT_EVENTS_AUTOCOLRES1_EVENTS_AUTOCOLRES1_NotGenerated (0x0UL) /*!< Event not generated                             */
  #define NFCT_EVENTS_AUTOCOLRES1_EVENTS_AUTOCOLRES1_Generated (0x1UL) /*!< Event generated                                    */


/* NFCT_EVENTS_AUTOCOLRES2: Auto collision resolution cascade level 2 succeeded */
  #define NFCT_EVENTS_AUTOCOLRES2_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_AUTOCOLRES2 register.                   */

/* EVENTS_AUTOCOLRES2 @Bit 0 : Auto collision resolution cascade level 2 succeeded */
  #define NFCT_EVENTS_AUTOCOLRES2_EVENTS_AUTOCOLRES2_Pos (0UL) /*!< Position of EVENTS_AUTOCOLRES2 field.                      */
  #define NFCT_EVENTS_AUTOCOLRES2_EVENTS_AUTOCOLRES2_Msk (0x1UL << NFCT_EVENTS_AUTOCOLRES2_EVENTS_AUTOCOLRES2_Pos) /*!< Bit mask
                                                                            of EVENTS_AUTOCOLRES2 field.*/                        
  #define NFCT_EVENTS_AUTOCOLRES2_EVENTS_AUTOCOLRES2_Min (0x0UL) /*!< Min enumerator value of EVENTS_AUTOCOLRES2 field.        */
  #define NFCT_EVENTS_AUTOCOLRES2_EVENTS_AUTOCOLRES2_Max (0x1UL) /*!< Max enumerator value of EVENTS_AUTOCOLRES2 field.        */
  #define NFCT_EVENTS_AUTOCOLRES2_EVENTS_AUTOCOLRES2_NotGenerated (0x0UL) /*!< Event not generated                             */
  #define NFCT_EVENTS_AUTOCOLRES2_EVENTS_AUTOCOLRES2_Generated (0x1UL) /*!< Event generated                                    */


/* NFCT_EVENTS_AUTOCOLRES3: Auto collision resolution cascade level 3 succeeded */
  #define NFCT_EVENTS_AUTOCOLRES3_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_AUTOCOLRES3 register.                   */

/* EVENTS_AUTOCOLRES3 @Bit 0 : Auto collision resolution cascade level 3 succeeded */
  #define NFCT_EVENTS_AUTOCOLRES3_EVENTS_AUTOCOLRES3_Pos (0UL) /*!< Position of EVENTS_AUTOCOLRES3 field.                      */
  #define NFCT_EVENTS_AUTOCOLRES3_EVENTS_AUTOCOLRES3_Msk (0x1UL << NFCT_EVENTS_AUTOCOLRES3_EVENTS_AUTOCOLRES3_Pos) /*!< Bit mask
                                                                            of EVENTS_AUTOCOLRES3 field.*/                        
  #define NFCT_EVENTS_AUTOCOLRES3_EVENTS_AUTOCOLRES3_Min (0x0UL) /*!< Min enumerator value of EVENTS_AUTOCOLRES3 field.        */
  #define NFCT_EVENTS_AUTOCOLRES3_EVENTS_AUTOCOLRES3_Max (0x1UL) /*!< Max enumerator value of EVENTS_AUTOCOLRES3 field.        */
  #define NFCT_EVENTS_AUTOCOLRES3_EVENTS_AUTOCOLRES3_NotGenerated (0x0UL) /*!< Event not generated                             */
  #define NFCT_EVENTS_AUTOCOLRES3_EVENTS_AUTOCOLRES3_Generated (0x1UL) /*!< Event generated                                    */


/* NFCT_EVENTS_COLLISION: NFC auto collision resolution error reported. The AUTOCOLRESSTATUS register contains details on the
                           source of the error. */                                                                                
                                                                                                                                  
  #define NFCT_EVENTS_COLLISION_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_COLLISION register.                       */

