adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event FIELDLOST will publish to */
  #define NFCT_PUBLISH_FIELDLOST_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_FIELDLOST_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_FIELDLOST_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define NFCT_PUBLISH_FIELDLOST_CHIDX_Min (0x0UL)   /*!< Min value of CHIDX field.                                            */
  #define NFCT_PUBLISH_FIELDLOST_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_FIELDLOST_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_FIELDLOST_EN_Msk (0x1UL << NFCT_PUBLISH_FIELDLOST_EN_Pos) /*!< Bit mask of EN field.                    */
  #define NFCT_PUBLISH_FIELDLOST_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_FIELDLOST_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_FIELDLOST_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define NFCT_PUBLISH_FIELDLOST_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* NFCT_PUBLISH_TXFRAMESTART: Publish configuration for event TXFRAMESTART */
  #define NFCT_PUBLISH_TXFRAMESTART_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXFRAMESTART register.               */

/* CHIDX @Bits 0..7 : DPPI channel that event TXFRAMESTART will publish to */
  #define NFCT_PUBLISH_TXFRAMESTART_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_TXFRAMESTART_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_TXFRAMESTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define NFCT_PUBLISH_TXFRAMESTART_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                           */
  #define NFCT_PUBLISH_TXFRAMESTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_TXFRAMESTART_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_TXFRAMESTART_EN_Msk (0x1UL << NFCT_PUBLISH_TXFRAMESTART_EN_Pos) /*!< Bit mask of EN field.              */
  #define NFCT_PUBLISH_TXFRAMESTART_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_TXFRAMESTART_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_TXFRAMESTART_EN_Disabled (0x0UL) /*!< Disable publishing                                                */
  #define NFCT_PUBLISH_TXFRAMESTART_EN_Enabled (0x1UL) /*!< Enable publishing                                                  */


/* NFCT_PUBLISH_TXFRAMEEND: Publish configuration for event TXFRAMEEND */
  #define NFCT_PUBLISH_TXFRAMEEND_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXFRAMEEND register.                   */

/* CHIDX @Bits 0..7 : DPPI channel that event TXFRAMEEND will publish to */
  #define NFCT_PUBLISH_TXFRAMEEND_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_TXFRAMEEND_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_TXFRAMEEND_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define NFCT_PUBLISH_TXFRAMEEND_CHIDX_Min (0x0UL)  /*!< Min value of CHIDX field.                                            */
  #define NFCT_PUBLISH_TXFRAMEEND_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_TXFRAMEEND_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_TXFRAMEEND_EN_Msk (0x1UL << NFCT_PUBLISH_TXFRAMEEND_EN_Pos) /*!< Bit mask of EN field.                  */
  #define NFCT_PUBLISH_TXFRAMEEND_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_TXFRAMEEND_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_TXFRAMEEND_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define NFCT_PUBLISH_TXFRAMEEND_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* NFCT_PUBLISH_RXFRAMESTART: Publish configuration for event RXFRAMESTART */
  #define NFCT_PUBLISH_RXFRAMESTART_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXFRAMESTART register.               */

/* CHIDX @Bits 0..7 : DPPI channel that event RXFRAMESTART will publish to */
  #define NFCT_PUBLISH_RXFRAMESTART_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_RXFRAMESTART_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_RXFRAMESTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define NFCT_PUBLISH_RXFRAMESTART_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                           */
  #define NFCT_PUBLISH_RXFRAMESTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_RXFRAMESTART_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_RXFRAMESTART_EN_Msk (0x1UL << NFCT_PUBLISH_RXFRAMESTART_EN_Pos) /*!< Bit mask of EN field.              */
  #define NFCT_PUBLISH_RXFRAMESTART_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_RXFRAMESTART_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_RXFRAMESTART_EN_Disabled (0x0UL) /*!< Disable publishing                                                */
  #define NFCT_PUBLISH_RXFRAMESTART_EN_Enabled (0x1UL) /*!< Enable publishing                                                  */


/* NFCT_PUBLISH_RXFRAMEEND: Publish configuration for event RXFRAMEEND */
  #define NFCT_PUBLISH_RXFRAMEEND_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXFRAMEEND register.                   */

/* CHIDX @Bits 0..7 : DPPI channel that event RXFRAMEEND will publish to */
  #define NFCT_PUBLISH_RXFRAMEEND_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_RXFRAMEEND_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_RXFRAMEEND_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define NFCT_PUBLISH_RXFRAMEEND_CHIDX_Min (0x0UL)  /*!< Min value of CHIDX field.                                            */
  #define NFCT_PUBLISH_RXFRAMEEND_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_RXFRAMEEND_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_RXFRAMEEND_EN_Msk (0x1UL << NFCT_PUBLISH_RXFRAMEEND_EN_Pos) /*!< Bit mask of EN field.                  */
  #define NFCT_PUBLISH_RXFRAMEEND_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_RXFRAMEEND_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_RXFRAMEEND_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define NFCT_PUBLISH_RXFRAMEEND_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* NFCT_PUBLISH_ERROR: Publish configuration for event ERROR */
  #define NFCT_PUBLISH_ERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ERROR register.                             */

/* CHIDX @Bits 0..7 : DPPI channel that event ERROR will publish to */
  #define NFCT_PUBLISH_ERROR_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_ERROR_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_ERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define NFCT_PUBLISH_ERROR_CHIDX_Min (0x0UL)       /*!< Min value of CHIDX field.                                            */
  #define NFCT_PUBLISH_ERROR_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_ERROR_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_ERROR_EN_Msk (0x1UL << NFCT_PUBLISH_ERROR_EN_Pos) /*!< Bit mask of EN field.                            */
  #define NFCT_PUBLISH_ERROR_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_ERROR_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_ERROR_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define NFCT_PUBLISH_ERROR_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* NFCT_PUBLISH_FREQMEASUREDONE: Publish configuration for event FREQMEASUREDONE */
  #define NFCT_PUBLISH_FREQMEASUREDONE_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_FREQMEASUREDONE register.         */

