adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* NFCT_PUBLISH_ENDTX: Publish configuration for event ENDTX */
  #define NFCT_PUBLISH_ENDTX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ENDTX register.                             */

/* CHIDX @Bits 0..7 : DPPI channel that event ENDTX will publish to */
  #define NFCT_PUBLISH_ENDTX_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_ENDTX_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_ENDTX_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define NFCT_PUBLISH_ENDTX_CHIDX_Min (0x0UL)       /*!< Min value of CHIDX field.                                            */
  #define NFCT_PUBLISH_ENDTX_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_ENDTX_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_ENDTX_EN_Msk (0x1UL << NFCT_PUBLISH_ENDTX_EN_Pos) /*!< Bit mask of EN field.                            */
  #define NFCT_PUBLISH_ENDTX_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_ENDTX_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_ENDTX_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define NFCT_PUBLISH_ENDTX_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* NFCT_PUBLISH_AUTOCOLRESSTARTED: Publish configuration for event AUTOCOLRESSTARTED */
  #define NFCT_PUBLISH_AUTOCOLRESSTARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_AUTOCOLRESSTARTED register.     */

/* CHIDX @Bits 0..7 : DPPI channel that event AUTOCOLRESSTARTED will publish to */
  #define NFCT_PUBLISH_AUTOCOLRESSTARTED_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                         */
  #define NFCT_PUBLISH_AUTOCOLRESSTARTED_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_AUTOCOLRESSTARTED_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define NFCT_PUBLISH_AUTOCOLRESSTARTED_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                      */
  #define NFCT_PUBLISH_AUTOCOLRESSTARTED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                      */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_AUTOCOLRESSTARTED_EN_Pos (31UL) /*!< Position of EN field.                                              */
  #define NFCT_PUBLISH_AUTOCOLRESSTARTED_EN_Msk (0x1UL << NFCT_PUBLISH_AUTOCOLRESSTARTED_EN_Pos) /*!< Bit mask of EN field.    */
  #define NFCT_PUBLISH_AUTOCOLRESSTARTED_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                 */
  #define NFCT_PUBLISH_AUTOCOLRESSTARTED_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                 */
  #define NFCT_PUBLISH_AUTOCOLRESSTARTED_EN_Disabled (0x0UL) /*!< Disable publishing                                           */
  #define NFCT_PUBLISH_AUTOCOLRESSTARTED_EN_Enabled (0x1UL) /*!< Enable publishing                                             */


/* NFCT_PUBLISH_AUTOCOLRES1: Publish configuration for event AUTOCOLRES1 */
  #define NFCT_PUBLISH_AUTOCOLRES1_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_AUTOCOLRES1 register.                 */

/* CHIDX @Bits 0..7 : DPPI channel that event AUTOCOLRES1 will publish to */
  #define NFCT_PUBLISH_AUTOCOLRES1_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_AUTOCOLRES1_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_AUTOCOLRES1_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define NFCT_PUBLISH_AUTOCOLRES1_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                            */
  #define NFCT_PUBLISH_AUTOCOLRES1_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_AUTOCOLRES1_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_AUTOCOLRES1_EN_Msk (0x1UL << NFCT_PUBLISH_AUTOCOLRES1_EN_Pos) /*!< Bit mask of EN field.                */
  #define NFCT_PUBLISH_AUTOCOLRES1_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_AUTOCOLRES1_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_AUTOCOLRES1_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define NFCT_PUBLISH_AUTOCOLRES1_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* NFCT_PUBLISH_AUTOCOLRES2: Publish configuration for event AUTOCOLRES2 */
  #define NFCT_PUBLISH_AUTOCOLRES2_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_AUTOCOLRES2 register.                 */

/* CHIDX @Bits 0..7 : DPPI channel that event AUTOCOLRES2 will publish to */
  #define NFCT_PUBLISH_AUTOCOLRES2_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_AUTOCOLRES2_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_AUTOCOLRES2_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define NFCT_PUBLISH_AUTOCOLRES2_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                            */
  #define NFCT_PUBLISH_AUTOCOLRES2_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_AUTOCOLRES2_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_AUTOCOLRES2_EN_Msk (0x1UL << NFCT_PUBLISH_AUTOCOLRES2_EN_Pos) /*!< Bit mask of EN field.                */
  #define NFCT_PUBLISH_AUTOCOLRES2_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_AUTOCOLRES2_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_AUTOCOLRES2_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define NFCT_PUBLISH_AUTOCOLRES2_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* NFCT_PUBLISH_AUTOCOLRES3: Publish configuration for event AUTOCOLRES3 */
  #define NFCT_PUBLISH_AUTOCOLRES3_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_AUTOCOLRES3 register.                 */

/* CHIDX @Bits 0..7 : DPPI channel that event AUTOCOLRES3 will publish to */
  #define NFCT_PUBLISH_AUTOCOLRES3_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_AUTOCOLRES3_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_AUTOCOLRES3_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define NFCT_PUBLISH_AUTOCOLRES3_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                            */
  #define NFCT_PUBLISH_AUTOCOLRES3_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_AUTOCOLRES3_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_AUTOCOLRES3_EN_Msk (0x1UL << NFCT_PUBLISH_AUTOCOLRES3_EN_Pos) /*!< Bit mask of EN field.                */
  #define NFCT_PUBLISH_AUTOCOLRES3_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_AUTOCOLRES3_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_AUTOCOLRES3_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define NFCT_PUBLISH_AUTOCOLRES3_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* NFCT_PUBLISH_COLLISION: Publish configuration for event COLLISION */
  #define NFCT_PUBLISH_COLLISION_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_COLLISION register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that event COLLISION will publish to */
  #define NFCT_PUBLISH_COLLISION_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_COLLISION_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_COLLISION_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define NFCT_PUBLISH_COLLISION_CHIDX_Min (0x0UL)   /*!< Min value of CHIDX field.                                            */
  #define NFCT_PUBLISH_COLLISION_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_COLLISION_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_COLLISION_EN_Msk (0x1UL << NFCT_PUBLISH_COLLISION_EN_Pos) /*!< Bit mask of EN field.                    */
  #define NFCT_PUBLISH_COLLISION_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_COLLISION_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_COLLISION_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define NFCT_PUBLISH_COLLISION_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* NFCT_PUBLISH_SELECTED: Publish configuration for event SELECTED */
  #define NFCT_PUBLISH_SELECTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_SELECTED register.                       */

/* CHIDX @Bits 0..7 : DPPI channel that event SELECTED will publish to */
  #define NFCT_PUBLISH_SELECTED_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define NFCT_PUBLISH_SELECTED_CHIDX_Msk (0xFFUL << NFCT_PUBLISH_SELECTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define NFCT_PUBLISH_SELECTED_CHIDX_Min (0x0UL)    /*!< Min value of CHIDX field.                                            */
  #define NFCT_PUBLISH_SELECTED_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_PUBLISH_SELECTED_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define NFCT_PUBLISH_SELECTED_EN_Msk (0x1UL << NFCT_PUBLISH_SELECTED_EN_Pos) /*!< Bit mask of EN field.                      */
  #define NFCT_PUBLISH_SELECTED_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_SELECTED_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define NFCT_PUBLISH_SELECTED_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define NFCT_PUBLISH_SELECTED_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* NFCT_PUBLISH_STARTED: Publish configuration for event STARTED */
  #define NFCT_PUBLISH_STARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STARTED register.                         */

