adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* NFCT_INTENSET: Enable interrupt */
  #define NFCT_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define NFCT_INTENSET_READY_Pos (0UL)              /*!< Position of READY field.                                             */
  #define NFCT_INTENSET_READY_Msk (0x1UL << NFCT_INTENSET_READY_Pos) /*!< Bit mask of READY field.                             */
  #define NFCT_INTENSET_READY_Min (0x0UL)            /*!< Min enumerator value of READY field.                                 */
  #define NFCT_INTENSET_READY_Max (0x1UL)            /*!< Max enumerator value of READY field.                                 */
  #define NFCT_INTENSET_READY_Set (0x1UL)            /*!< Enable                                                               */
  #define NFCT_INTENSET_READY_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_READY_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* FIELDDETECTED @Bit 1 : Write '1' to enable interrupt for event FIELDDETECTED */
  #define NFCT_INTENSET_FIELDDETECTED_Pos (1UL)      /*!< Position of FIELDDETECTED field.                                     */
  #define NFCT_INTENSET_FIELDDETECTED_Msk (0x1UL << NFCT_INTENSET_FIELDDETECTED_Pos) /*!< Bit mask of FIELDDETECTED field.     */
  #define NFCT_INTENSET_FIELDDETECTED_Min (0x0UL)    /*!< Min enumerator value of FIELDDETECTED field.                         */
  #define NFCT_INTENSET_FIELDDETECTED_Max (0x1UL)    /*!< Max enumerator value of FIELDDETECTED field.                         */
  #define NFCT_INTENSET_FIELDDETECTED_Set (0x1UL)    /*!< Enable                                                               */
  #define NFCT_INTENSET_FIELDDETECTED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define NFCT_INTENSET_FIELDDETECTED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* FIELDLOST @Bit 2 : Write '1' to enable interrupt for event FIELDLOST */
  #define NFCT_INTENSET_FIELDLOST_Pos (2UL)          /*!< Position of FIELDLOST field.                                         */
  #define NFCT_INTENSET_FIELDLOST_Msk (0x1UL << NFCT_INTENSET_FIELDLOST_Pos) /*!< Bit mask of FIELDLOST field.                 */
  #define NFCT_INTENSET_FIELDLOST_Min (0x0UL)        /*!< Min enumerator value of FIELDLOST field.                             */
  #define NFCT_INTENSET_FIELDLOST_Max (0x1UL)        /*!< Max enumerator value of FIELDLOST field.                             */
  #define NFCT_INTENSET_FIELDLOST_Set (0x1UL)        /*!< Enable                                                               */
  #define NFCT_INTENSET_FIELDLOST_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_FIELDLOST_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* TXFRAMESTART @Bit 3 : Write '1' to enable interrupt for event TXFRAMESTART */
  #define NFCT_INTENSET_TXFRAMESTART_Pos (3UL)       /*!< Position of TXFRAMESTART field.                                      */
  #define NFCT_INTENSET_TXFRAMESTART_Msk (0x1UL << NFCT_INTENSET_TXFRAMESTART_Pos) /*!< Bit mask of TXFRAMESTART field.        */
  #define NFCT_INTENSET_TXFRAMESTART_Min (0x0UL)     /*!< Min enumerator value of TXFRAMESTART field.                          */
  #define NFCT_INTENSET_TXFRAMESTART_Max (0x1UL)     /*!< Max enumerator value of TXFRAMESTART field.                          */
  #define NFCT_INTENSET_TXFRAMESTART_Set (0x1UL)     /*!< Enable                                                               */
  #define NFCT_INTENSET_TXFRAMESTART_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define NFCT_INTENSET_TXFRAMESTART_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* TXFRAMEEND @Bit 4 : Write '1' to enable interrupt for event TXFRAMEEND */
  #define NFCT_INTENSET_TXFRAMEEND_Pos (4UL)         /*!< Position of TXFRAMEEND field.                                        */
  #define NFCT_INTENSET_TXFRAMEEND_Msk (0x1UL << NFCT_INTENSET_TXFRAMEEND_Pos) /*!< Bit mask of TXFRAMEEND field.              */
  #define NFCT_INTENSET_TXFRAMEEND_Min (0x0UL)       /*!< Min enumerator value of TXFRAMEEND field.                            */
  #define NFCT_INTENSET_TXFRAMEEND_Max (0x1UL)       /*!< Max enumerator value of TXFRAMEEND field.                            */
  #define NFCT_INTENSET_TXFRAMEEND_Set (0x1UL)       /*!< Enable                                                               */
  #define NFCT_INTENSET_TXFRAMEEND_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_TXFRAMEEND_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RXFRAMESTART @Bit 5 : Write '1' to enable interrupt for event RXFRAMESTART */
  #define NFCT_INTENSET_RXFRAMESTART_Pos (5UL)       /*!< Position of RXFRAMESTART field.                                      */
  #define NFCT_INTENSET_RXFRAMESTART_Msk (0x1UL << NFCT_INTENSET_RXFRAMESTART_Pos) /*!< Bit mask of RXFRAMESTART field.        */
  #define NFCT_INTENSET_RXFRAMESTART_Min (0x0UL)     /*!< Min enumerator value of RXFRAMESTART field.                          */
  #define NFCT_INTENSET_RXFRAMESTART_Max (0x1UL)     /*!< Max enumerator value of RXFRAMESTART field.                          */
  #define NFCT_INTENSET_RXFRAMESTART_Set (0x1UL)     /*!< Enable                                                               */
  #define NFCT_INTENSET_RXFRAMESTART_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define NFCT_INTENSET_RXFRAMESTART_Enabled (0x1UL) /*!< Read: Enabled                                                        */

