adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RXFRAMEEND @Bit 6 : Write '1' to enable interrupt for event RXFRAMEEND */
  #define NFCT_INTENSET_RXFRAMEEND_Pos (6UL)         /*!< Position of RXFRAMEEND field.                                        */
  #define NFCT_INTENSET_RXFRAMEEND_Msk (0x1UL << NFCT_INTENSET_RXFRAMEEND_Pos) /*!< Bit mask of RXFRAMEEND field.              */
  #define NFCT_INTENSET_RXFRAMEEND_Min (0x0UL)       /*!< Min enumerator value of RXFRAMEEND field.                            */
  #define NFCT_INTENSET_RXFRAMEEND_Max (0x1UL)       /*!< Max enumerator value of RXFRAMEEND field.                            */
  #define NFCT_INTENSET_RXFRAMEEND_Set (0x1UL)       /*!< Enable                                                               */
  #define NFCT_INTENSET_RXFRAMEEND_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_RXFRAMEEND_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* ERROR @Bit 7 : Write '1' to enable interrupt for event ERROR */
  #define NFCT_INTENSET_ERROR_Pos (7UL)              /*!< Position of ERROR field.                                             */
  #define NFCT_INTENSET_ERROR_Msk (0x1UL << NFCT_INTENSET_ERROR_Pos) /*!< Bit mask of ERROR field.                             */
  #define NFCT_INTENSET_ERROR_Min (0x0UL)            /*!< Min enumerator value of ERROR field.                                 */
  #define NFCT_INTENSET_ERROR_Max (0x1UL)            /*!< Max enumerator value of ERROR field.                                 */
  #define NFCT_INTENSET_ERROR_Set (0x1UL)            /*!< Enable                                                               */
  #define NFCT_INTENSET_ERROR_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_ERROR_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* FREQMEASUREDONE @Bit 8 : Write '1' to enable interrupt for event FREQMEASUREDONE */
  #define NFCT_INTENSET_FREQMEASUREDONE_Pos (8UL)    /*!< Position of FREQMEASUREDONE field.                                   */
  #define NFCT_INTENSET_FREQMEASUREDONE_Msk (0x1UL << NFCT_INTENSET_FREQMEASUREDONE_Pos) /*!< Bit mask of FREQMEASUREDONE
                                                                            field.*/                                              
  #define NFCT_INTENSET_FREQMEASUREDONE_Min (0x0UL)  /*!< Min enumerator value of FREQMEASUREDONE field.                       */
  #define NFCT_INTENSET_FREQMEASUREDONE_Max (0x1UL)  /*!< Max enumerator value of FREQMEASUREDONE field.                       */
  #define NFCT_INTENSET_FREQMEASUREDONE_Set (0x1UL)  /*!< Enable                                                               */
  #define NFCT_INTENSET_FREQMEASUREDONE_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define NFCT_INTENSET_FREQMEASUREDONE_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* CALCOMPLETE @Bit 9 : Write '1' to enable interrupt for event CALCOMPLETE */
  #define NFCT_INTENSET_CALCOMPLETE_Pos (9UL)        /*!< Position of CALCOMPLETE field.                                       */
  #define NFCT_INTENSET_CALCOMPLETE_Msk (0x1UL << NFCT_INTENSET_CALCOMPLETE_Pos) /*!< Bit mask of CALCOMPLETE field.           */
  #define NFCT_INTENSET_CALCOMPLETE_Min (0x0UL)      /*!< Min enumerator value of CALCOMPLETE field.                           */
  #define NFCT_INTENSET_CALCOMPLETE_Max (0x1UL)      /*!< Max enumerator value of CALCOMPLETE field.                           */
  #define NFCT_INTENSET_CALCOMPLETE_Set (0x1UL)      /*!< Enable                                                               */
  #define NFCT_INTENSET_CALCOMPLETE_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_CALCOMPLETE_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* RXERROR @Bit 10 : Write '1' to enable interrupt for event RXERROR */
  #define NFCT_INTENSET_RXERROR_Pos (10UL)           /*!< Position of RXERROR field.                                           */
  #define NFCT_INTENSET_RXERROR_Msk (0x1UL << NFCT_INTENSET_RXERROR_Pos) /*!< Bit mask of RXERROR field.                       */
  #define NFCT_INTENSET_RXERROR_Min (0x0UL)          /*!< Min enumerator value of RXERROR field.                               */
  #define NFCT_INTENSET_RXERROR_Max (0x1UL)          /*!< Max enumerator value of RXERROR field.                               */
  #define NFCT_INTENSET_RXERROR_Set (0x1UL)          /*!< Enable                                                               */
  #define NFCT_INTENSET_RXERROR_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_RXERROR_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ENDRX @Bit 11 : Write '1' to enable interrupt for event ENDRX */
  #define NFCT_INTENSET_ENDRX_Pos (11UL)             /*!< Position of ENDRX field.                                             */
  #define NFCT_INTENSET_ENDRX_Msk (0x1UL << NFCT_INTENSET_ENDRX_Pos) /*!< Bit mask of ENDRX field.                             */
  #define NFCT_INTENSET_ENDRX_Min (0x0UL)            /*!< Min enumerator value of ENDRX field.                                 */
  #define NFCT_INTENSET_ENDRX_Max (0x1UL)            /*!< Max enumerator value of ENDRX field.                                 */
  #define NFCT_INTENSET_ENDRX_Set (0x1UL)            /*!< Enable                                                               */
  #define NFCT_INTENSET_ENDRX_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_ENDRX_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

