adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ENDTX @Bit 12 : Write '1' to enable interrupt for event ENDTX */
  #define NFCT_INTENSET_ENDTX_Pos (12UL)             /*!< Position of ENDTX field.                                             */
  #define NFCT_INTENSET_ENDTX_Msk (0x1UL << NFCT_INTENSET_ENDTX_Pos) /*!< Bit mask of ENDTX field.                             */
  #define NFCT_INTENSET_ENDTX_Min (0x0UL)            /*!< Min enumerator value of ENDTX field.                                 */
  #define NFCT_INTENSET_ENDTX_Max (0x1UL)            /*!< Max enumerator value of ENDTX field.                                 */
  #define NFCT_INTENSET_ENDTX_Set (0x1UL)            /*!< Enable                                                               */
  #define NFCT_INTENSET_ENDTX_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_ENDTX_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* AUTOCOLRESSTARTED @Bit 14 : Write '1' to enable interrupt for event AUTOCOLRESSTARTED */
  #define NFCT_INTENSET_AUTOCOLRESSTARTED_Pos (14UL) /*!< Position of AUTOCOLRESSTARTED field.                                 */
  #define NFCT_INTENSET_AUTOCOLRESSTARTED_Msk (0x1UL << NFCT_INTENSET_AUTOCOLRESSTARTED_Pos) /*!< Bit mask of AUTOCOLRESSTARTED
                                                                            field.*/                                              
  #define NFCT_INTENSET_AUTOCOLRESSTARTED_Min (0x0UL) /*!< Min enumerator value of AUTOCOLRESSTARTED field.                    */
  #define NFCT_INTENSET_AUTOCOLRESSTARTED_Max (0x1UL) /*!< Max enumerator value of AUTOCOLRESSTARTED field.                    */
  #define NFCT_INTENSET_AUTOCOLRESSTARTED_Set (0x1UL) /*!< Enable                                                              */
  #define NFCT_INTENSET_AUTOCOLRESSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define NFCT_INTENSET_AUTOCOLRESSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* AUTOCOLRES1 @Bit 15 : Write '1' to enable interrupt for event AUTOCOLRES1 */
  #define NFCT_INTENSET_AUTOCOLRES1_Pos (15UL)       /*!< Position of AUTOCOLRES1 field.                                       */
  #define NFCT_INTENSET_AUTOCOLRES1_Msk (0x1UL << NFCT_INTENSET_AUTOCOLRES1_Pos) /*!< Bit mask of AUTOCOLRES1 field.           */
  #define NFCT_INTENSET_AUTOCOLRES1_Min (0x0UL)      /*!< Min enumerator value of AUTOCOLRES1 field.                           */
  #define NFCT_INTENSET_AUTOCOLRES1_Max (0x1UL)      /*!< Max enumerator value of AUTOCOLRES1 field.                           */
  #define NFCT_INTENSET_AUTOCOLRES1_Set (0x1UL)      /*!< Enable                                                               */
  #define NFCT_INTENSET_AUTOCOLRES1_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_AUTOCOLRES1_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* AUTOCOLRES2 @Bit 16 : Write '1' to enable interrupt for event AUTOCOLRES2 */
  #define NFCT_INTENSET_AUTOCOLRES2_Pos (16UL)       /*!< Position of AUTOCOLRES2 field.                                       */
  #define NFCT_INTENSET_AUTOCOLRES2_Msk (0x1UL << NFCT_INTENSET_AUTOCOLRES2_Pos) /*!< Bit mask of AUTOCOLRES2 field.           */
  #define NFCT_INTENSET_AUTOCOLRES2_Min (0x0UL)      /*!< Min enumerator value of AUTOCOLRES2 field.                           */
  #define NFCT_INTENSET_AUTOCOLRES2_Max (0x1UL)      /*!< Max enumerator value of AUTOCOLRES2 field.                           */
  #define NFCT_INTENSET_AUTOCOLRES2_Set (0x1UL)      /*!< Enable                                                               */
  #define NFCT_INTENSET_AUTOCOLRES2_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_AUTOCOLRES2_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* AUTOCOLRES3 @Bit 17 : Write '1' to enable interrupt for event AUTOCOLRES3 */
  #define NFCT_INTENSET_AUTOCOLRES3_Pos (17UL)       /*!< Position of AUTOCOLRES3 field.                                       */
  #define NFCT_INTENSET_AUTOCOLRES3_Msk (0x1UL << NFCT_INTENSET_AUTOCOLRES3_Pos) /*!< Bit mask of AUTOCOLRES3 field.           */
  #define NFCT_INTENSET_AUTOCOLRES3_Min (0x0UL)      /*!< Min enumerator value of AUTOCOLRES3 field.                           */
  #define NFCT_INTENSET_AUTOCOLRES3_Max (0x1UL)      /*!< Max enumerator value of AUTOCOLRES3 field.                           */
  #define NFCT_INTENSET_AUTOCOLRES3_Set (0x1UL)      /*!< Enable                                                               */
  #define NFCT_INTENSET_AUTOCOLRES3_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_AUTOCOLRES3_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* COLLISION @Bit 18 : Write '1' to enable interrupt for event COLLISION */
  #define NFCT_INTENSET_COLLISION_Pos (18UL)         /*!< Position of COLLISION field.                                         */
  #define NFCT_INTENSET_COLLISION_Msk (0x1UL << NFCT_INTENSET_COLLISION_Pos) /*!< Bit mask of COLLISION field.                 */
  #define NFCT_INTENSET_COLLISION_Min (0x0UL)        /*!< Min enumerator value of COLLISION field.                             */
  #define NFCT_INTENSET_COLLISION_Max (0x1UL)        /*!< Max enumerator value of COLLISION field.                             */
  #define NFCT_INTENSET_COLLISION_Set (0x1UL)        /*!< Enable                                                               */
  #define NFCT_INTENSET_COLLISION_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_COLLISION_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* SELECTED @Bit 19 : Write '1' to enable interrupt for event SELECTED */
  #define NFCT_INTENSET_SELECTED_Pos (19UL)          /*!< Position of SELECTED field.                                          */
  #define NFCT_INTENSET_SELECTED_Msk (0x1UL << NFCT_INTENSET_SELECTED_Pos) /*!< Bit mask of SELECTED field.                    */
  #define NFCT_INTENSET_SELECTED_Min (0x0UL)         /*!< Min enumerator value of SELECTED field.                              */
  #define NFCT_INTENSET_SELECTED_Max (0x1UL)         /*!< Max enumerator value of SELECTED field.                              */
  #define NFCT_INTENSET_SELECTED_Set (0x1UL)         /*!< Enable                                                               */
  #define NFCT_INTENSET_SELECTED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_SELECTED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

