adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* NFCT_PWRUPSENSE: Tells if the NFCT peripheral is in SENSE mode */
  #define NFCT_PWRUPSENSE_ResetValue (0x00000000UL)  /*!< Reset value of PWRUPSENSE register.                                  */

/* SENSE @Bit 0 : Tells if the NFCT peripheral is in SENSE mode */
  #define NFCT_PWRUPSENSE_SENSE_Pos (0UL)            /*!< Position of SENSE field.                                             */
  #define NFCT_PWRUPSENSE_SENSE_Msk (0x1UL << NFCT_PWRUPSENSE_SENSE_Pos) /*!< Bit mask of SENSE field.                         */
  #define NFCT_PWRUPSENSE_SENSE_Min (0x0UL)          /*!< Min enumerator value of SENSE field.                                 */
  #define NFCT_PWRUPSENSE_SENSE_Max (0x1UL)          /*!< Max enumerator value of SENSE field.                                 */
  #define NFCT_PWRUPSENSE_SENSE_Disabled (0x0UL)     /*!< NFCT is not in SENSE mode                                            */
  #define NFCT_PWRUPSENSE_SENSE_Sense (0x1UL)        /*!< NFCT is in SENSE mode                                                */


/* NFCT_ERRORSTATUS: NFC Error Status register */
  #define NFCT_ERRORSTATUS_ResetValue (0x00000000UL) /*!< Reset value of ERRORSTATUS register.                                 */

/* FRAMEDELAYTIMEOUT @Bit 0 : No STARTTX task triggered before expiration of the time set in FRAMEDELAYMAX */
  #define NFCT_ERRORSTATUS_FRAMEDELAYTIMEOUT_Pos (0UL) /*!< Position of FRAMEDELAYTIMEOUT field.                               */
  #define NFCT_ERRORSTATUS_FRAMEDELAYTIMEOUT_Msk (0x1UL << NFCT_ERRORSTATUS_FRAMEDELAYTIMEOUT_Pos) /*!< Bit mask of
                                                                            FRAMEDELAYTIMEOUT field.*/                            

/* INVALIDNFCSYMBOL @Bit 1 : Detects any transition on demodulated carrier between 100 RF carrier periods before EoF and 255 RF
                             carrier periods after EoF. This status is cleared on SoF. */                                         
                                                                                                                                  
  #define NFCT_ERRORSTATUS_INVALIDNFCSYMBOL_Pos (1UL) /*!< Position of INVALIDNFCSYMBOL field.                                 */
  #define NFCT_ERRORSTATUS_INVALIDNFCSYMBOL_Msk (0x1UL << NFCT_ERRORSTATUS_INVALIDNFCSYMBOL_Pos) /*!< Bit mask of
                                                                            INVALIDNFCSYMBOL field.*/                             

/* CMREGOUTOFRANGE @Bit 7 : Common mode regulation out of range */
  #define NFCT_ERRORSTATUS_CMREGOUTOFRANGE_Pos (7UL) /*!< Position of CMREGOUTOFRANGE field.                                   */
  #define NFCT_ERRORSTATUS_CMREGOUTOFRANGE_Msk (0x1UL << NFCT_ERRORSTATUS_CMREGOUTOFRANGE_Pos) /*!< Bit mask of CMREGOUTOFRANGE
                                                                            field.*/                                              


/* NFCT_AUTOCOLRESSTATUS: NFC Auto collision resolution Error Status register */
  #define NFCT_AUTOCOLRESSTATUS_ResetValue (0x00000000UL) /*!< Reset value of AUTOCOLRESSTATUS register.                       */

/* ERROR @Bits 0..1 : Auto collision resolution status */
  #define NFCT_AUTOCOLRESSTATUS_ERROR_Pos (0UL)      /*!< Position of ERROR field.                                             */
  #define NFCT_AUTOCOLRESSTATUS_ERROR_Msk (0x3UL << NFCT_AUTOCOLRESSTATUS_ERROR_Pos) /*!< Bit mask of ERROR field.             */
  #define NFCT_AUTOCOLRESSTATUS_ERROR_Min (0x0UL)    /*!< Min enumerator value of ERROR field.                                 */
  #define NFCT_AUTOCOLRESSTATUS_ERROR_Max (0x3UL)    /*!< Max enumerator value of ERROR field.                                 */
  #define NFCT_AUTOCOLRESSTATUS_ERROR_NoCollision (0x0UL) /*!< Auto collision resolution resolved, no error                    */
  #define NFCT_AUTOCOLRESSTATUS_ERROR_Cascade1Fail (0x1UL) /*!< Auto collision resolution failed at Cascade level 1            */
  #define NFCT_AUTOCOLRESSTATUS_ERROR_Cascade2Fail (0x2UL) /*!< Auto collision resolution failed at Cascade level 2            */
  #define NFCT_AUTOCOLRESSTATUS_ERROR_Cascade3Fail (0x3UL) /*!< Auto collision resolution failed at Cascade level 3            */


/* NFCT_NFCTAGSTATE: Current operating state of NFC tag */
  #define NFCT_NFCTAGSTATE_ResetValue (0x00000000UL) /*!< Reset value of NFCTAGSTATE register.                                 */

/* NFCTAGSTATE @Bits 0..2 : NfcTag state */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_Pos (0UL)     /*!< Position of NFCTAGSTATE field.                                       */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_Msk (0x7UL << NFCT_NFCTAGSTATE_NFCTAGSTATE_Pos) /*!< Bit mask of NFCTAGSTATE field.     */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_Min (0x0UL)   /*!< Min enumerator value of NFCTAGSTATE field.                           */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_Max (0x6UL)   /*!< Max enumerator value of NFCTAGSTATE field.                           */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_Disabled (0x0UL) /*!< Disabled or sense                                                 */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_RampUp (0x2UL) /*!< RampUp                                                              */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_Idle (0x3UL)  /*!< Idle                                                                 */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_Receive (0x4UL) /*!< Receive                                                            */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_FrameDelay (0x5UL) /*!< FrameDelay                                                      */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_Transmit (0x6UL) /*!< Transmit                                                          */


/* NFCT_SLEEPSTATE: Sleep state during automatic collision resolution */
  #define NFCT_SLEEPSTATE_ResetValue (0x00000000UL)  /*!< Reset value of SLEEPSTATE register.                                  */

/* SLEEPSTATE @Bit 0 : Reflects the sleep state during automatic collision resolution. Set to IDLE by a GOIDLE task. Set to
                       SLEEP_A when a valid SLEEP_REQ frame is received or by a GOSLEEP task. */                                  
                                                                                                                                  
  #define NFCT_SLEEPSTATE_SLEEPSTATE_Pos (0UL)       /*!< Position of SLEEPSTATE field.                                        */
  #define NFCT_SLEEPSTATE_SLEEPSTATE_Msk (0x1UL << NFCT_SLEEPSTATE_SLEEPSTATE_Pos) /*!< Bit mask of SLEEPSTATE field.          */
  #define NFCT_SLEEPSTATE_SLEEPSTATE_Min (0x0UL)     /*!< Min enumerator value of SLEEPSTATE field.                            */
  #define NFCT_SLEEPSTATE_SLEEPSTATE_Max (0x1UL)     /*!< Max enumerator value of SLEEPSTATE field.                            */
  #define NFCT_SLEEPSTATE_SLEEPSTATE_Idle (0x0UL)    /*!< State is IDLE.                                                       */
  #define NFCT_SLEEPSTATE_SLEEPSTATE_SleepA (0x1UL)  /*!< State is SLEEP_A.                                                    */


