adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* NFCT_BYTESWRITTENTORAM: Number of bytes written to RAM */
  #define NFCT_BYTESWRITTENTORAM_ResetValue (0x00000000UL) /*!< Reset value of BYTESWRITTENTORAM register.                     */

/* BYTESWRITTENTORAM @Bits 0..8 : Number of bytes written to RAM. */
  #define NFCT_BYTESWRITTENTORAM_BYTESWRITTENTORAM_Pos (0UL) /*!< Position of BYTESWRITTENTORAM field.                         */
  #define NFCT_BYTESWRITTENTORAM_BYTESWRITTENTORAM_Msk (0x1FFUL << NFCT_BYTESWRITTENTORAM_BYTESWRITTENTORAM_Pos) /*!< Bit mask
                                                                            of BYTESWRITTENTORAM field.*/                         


/* NFCT_NFCFRAMINGCORESTATE: NFC Framing Core State */
  #define NFCT_NFCFRAMINGCORESTATE_ResetValue (0x00000000UL) /*!< Reset value of NFCFRAMINGCORESTATE register.                 */

/* NFCFRAMINGCORESTATE @Bits 0..2 : Current NFC Framing Core State */
  #define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_Pos (0UL) /*!< Position of NFCFRAMINGCORESTATE field.                   */
  #define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_Msk (0x7UL << NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_Pos) /*!< Bit
                                                                            mask of NFCFRAMINGCORESTATE field.*/                  
  #define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_Min (0x0UL) /*!< Min enumerator value of NFCFRAMINGCORESTATE field.     */
  #define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_Max (0x7UL) /*!< Max enumerator value of NFCFRAMINGCORESTATE field.     */
  #define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_PadNotConnected (0x0UL) /*!< NFC pads not connected                     */
  #define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_Disabled (0x1UL) /*!< NFCT peripheral disabled                          */
  #define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_Sense (0x2UL) /*!< In sense state. But it is transitive state, so visible
                                                                          for one peripheral clock cycle only.*/                  
  #define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_RampUp (0x3UL) /*!< NFCT peripheral ramping up                          */
  #define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_CollisionResolution (0x4UL) /*!< Automatic collision resolution in
                                                                            progress*/                                            
  #define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_Selected (0x5UL) /*!< In selected state                                 */
  #define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_Transmitting (0x6UL) /*!< Transmit in progress                          */
  #define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_TransmitFinishing (0x7UL) /*!< Transmit finishing, reading from the RAM
                                                                            buffer completed*/                                    


/* NFCT_NFCANTICOLRESSTATE: Automatic collision resolution (anti-collision) state */
  #define NFCT_NFCANTICOLRESSTATE_ResetValue (0x00000000UL) /*!< Reset value of NFCANTICOLRESSTATE register.                   */

/* NFCANTICOLRESSTATE @Bits 0..3 : Current Automatic collision resolution (anti-collision) state */
  #define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_Pos (0UL) /*!< Position of NFCANTICOLRESSTATE field.                      */
  #define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_Msk (0xFUL << NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_Pos) /*!< Bit mask
                                                                            of NFCANTICOLRESSTATE field.*/                        
  #define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_Min (0x0UL) /*!< Min enumerator value of NFCANTICOLRESSTATE field.        */
  #define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_Max (0xDUL) /*!< Max enumerator value of NFCANTICOLRESSTATE field.        */
  #define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_IDLE (0x0UL) /*!< State IDLE                                              */
  #define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_IDLE_SENS_RES (0x1UL) /*!< State IDLE_SENS_RES                            */
  #define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_READY_A0 (0x2UL) /*!< State READY_A0                                      */
  #define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_READY_A0_SEL_RES (0x3UL) /*!< State READY_A0_SEL_RES                      */
  #define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_READY_A0_SDD_RES (0x4UL) /*!< State READY_A0_SDD_RES                      */
  #define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_READY_A1 (0x5UL) /*!< State READY_A1                                      */
  #define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_READY_A1_SEL_RES (0x6UL) /*!< State READY_A1_SEL_RES                      */
  #define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_READY_A1_SDD_RES (0x7UL) /*!< State READY_A1_SDD_RES                      */
  #define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_READY_A2 (0x8UL) /*!< State READY_A2                                      */
  #define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_READY_A2_SEL_RES (0x9UL) /*!< State READY_A2_SEL_RES                      */
  #define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_READY_A2_SDD_RES (0xAUL) /*!< State READY_A2_SDD_RES                      */
  #define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_ACTIVE_A (0xBUL) /*!< State ACTIVE_A                                      */
  #define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_SLEEP_A (0xCUL) /*!< State SLEEP_A                                        */
  #define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_SLEEP_A_SENS_RES (0xDUL) /*!< State SLEEP_A_SENS_RES                      */


/* NFCT_MEASUREDFREQ: The frequency measured on the 13.56 MHz NFC carrier signal */
  #define NFCT_MEASUREDFREQ_ResetValue (0x00000000UL) /*!< Reset value of MEASUREDFREQ register.                               */

/* MEASUREDFREQ @Bits 0..10 : The frequency measured on the 13.56 MHz NFC carrier signal. This result is produced in response to
                              triggering FREQMEASURE. Frequency = 16 MHz * MEASUREDFREQ / 1000 */                                 
                                                                                                                                  
  #define NFCT_MEASUREDFREQ_MEASUREDFREQ_Pos (0UL)   /*!< Position of MEASUREDFREQ field.                                      */
  #define NFCT_MEASUREDFREQ_MEASUREDFREQ_Msk (0x7FFUL << NFCT_MEASUREDFREQ_MEASUREDFREQ_Pos) /*!< Bit mask of MEASUREDFREQ
                                                                            field.*/                                              


/* NFCT_ROSCCALVALUE: The current value used by the ring oscillator */
  #define NFCT_ROSCCALVALUE_ResetValue (0x0000000FUL) /*!< Reset value of ROSCCALVALUE register.                               */

/* ROSCCALVALUE @Bits 0..4 : The current value used by the ring oscillator. Either given by the calibration engine, or by the
                             override value. */                                                                                   
                                                                                                                                  
  #define NFCT_ROSCCALVALUE_ROSCCALVALUE_Pos (0UL)   /*!< Position of ROSCCALVALUE field.                                      */
  #define NFCT_ROSCCALVALUE_ROSCCALVALUE_Msk (0x1FUL << NFCT_ROSCCALVALUE_ROSCCALVALUE_Pos) /*!< Bit mask of ROSCCALVALUE
                                                                            field.*/                                              
  #define NFCT_ROSCCALVALUE_ROSCCALVALUE_Min (0x0UL) /*!< Min enumerator value of ROSCCALVALUE field.                          */
  #define NFCT_ROSCCALVALUE_ROSCCALVALUE_Max (0x1FUL) /*!< Max enumerator value of ROSCCALVALUE field.                         */
  #define NFCT_ROSCCALVALUE_ROSCCALVALUE_Minimum (0x00UL) /*!< Minimum frequency                                               */
  #define NFCT_ROSCCALVALUE_ROSCCALVALUE_Nominal (0x0FUL) /*!< Nominal frequency                                               */
  #define NFCT_ROSCCALVALUE_ROSCCALVALUE_Maximum (0x1FUL) /*!< Maximum frequency                                               */


/* NFCT_FIELDPRESENT: Indicates the presence or not of a valid field */
  #define NFCT_FIELDPRESENT_ResetValue (0x00000000UL) /*!< Reset value of FIELDPRESENT register.                               */

/* FIELDPRESENT @Bit 0 : Indicates if a valid field is present. Available only in the activated state. */
  #define NFCT_FIELDPRESENT_FIELDPRESENT_Pos (0UL)   /*!< Position of FIELDPRESENT field.                                      */
  #define NFCT_FIELDPRESENT_FIELDPRESENT_Msk (0x1UL << NFCT_FIELDPRESENT_FIELDPRESENT_Pos) /*!< Bit mask of FIELDPRESENT field.*/
  #define NFCT_FIELDPRESENT_FIELDPRESENT_Min (0x0UL) /*!< Min enumerator value of FIELDPRESENT field.                          */
  #define NFCT_FIELDPRESENT_FIELDPRESENT_Max (0x1UL) /*!< Max enumerator value of FIELDPRESENT field.                          */
  #define NFCT_FIELDPRESENT_FIELDPRESENT_NoField (0x0UL) /*!< No valid field detected                                          */
  #define NFCT_FIELDPRESENT_FIELDPRESENT_FieldPresent (0x1UL) /*!< Valid field detected                                        */

