adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LOCKDETECT @Bit 1 : Indicates if the low level has locked to the field */
  #define NFCT_FIELDPRESENT_LOCKDETECT_Pos (1UL)     /*!< Position of LOCKDETECT field.                                        */
  #define NFCT_FIELDPRESENT_LOCKDETECT_Msk (0x1UL << NFCT_FIELDPRESENT_LOCKDETECT_Pos) /*!< Bit mask of LOCKDETECT field.      */
  #define NFCT_FIELDPRESENT_LOCKDETECT_Min (0x0UL)   /*!< Min enumerator value of LOCKDETECT field.                            */
  #define NFCT_FIELDPRESENT_LOCKDETECT_Max (0x1UL)   /*!< Max enumerator value of LOCKDETECT field.                            */
  #define NFCT_FIELDPRESENT_LOCKDETECT_NotLocked (0x0UL) /*!< Not locked to field                                              */
  #define NFCT_FIELDPRESENT_LOCKDETECT_Locked (0x1UL) /*!< Locked to field                                                     */


/* NFCT_CMFBPDREF: Current value of common-mode voltage level at pad */
  #define NFCT_CMFBPDREF_ResetValue (0x00000000UL)   /*!< Reset value of CMFBPDREF register.                                   */

/* CMFBPDREF @Bits 0..2 : Current value of common-mode voltage level at pad. */
  #define NFCT_CMFBPDREF_CMFBPDREF_Pos (0UL)         /*!< Position of CMFBPDREF field.                                         */
  #define NFCT_CMFBPDREF_CMFBPDREF_Msk (0x7UL << NFCT_CMFBPDREF_CMFBPDREF_Pos) /*!< Bit mask of CMFBPDREF field.               */
  #define NFCT_CMFBPDREF_CMFBPDREF_Min (0x0UL)       /*!< Min enumerator value of CMFBPDREF field.                             */
  #define NFCT_CMFBPDREF_CMFBPDREF_Max (0x4UL)       /*!< Max enumerator value of CMFBPDREF field.                             */
  #define NFCT_CMFBPDREF_CMFBPDREF_CMFBPDREF0 (0x0UL) /*!< 800 mV                                                              */
  #define NFCT_CMFBPDREF_CMFBPDREF_CMFBPDREF1 (0x1UL) /*!< 900 mV                                                              */
  #define NFCT_CMFBPDREF_CMFBPDREF_CMFBPDREF2 (0x2UL) /*!< 1 V                                                                 */
  #define NFCT_CMFBPDREF_CMFBPDREF_CMFBPDREF3 (0x3UL) /*!< 1.1 V                                                               */
  #define NFCT_CMFBPDREF_CMFBPDREF_CMFBPDREF4 (0x4UL) /*!< Spare                                                               */


/* NFCT_ENABLE: Register to enable NFC functionality */
  #define NFCT_ENABLE_ResetValue (0x00000000UL)      /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : Register to enable NFC functionality */
  #define NFCT_ENABLE_ENABLE_Pos (0UL)               /*!< Position of ENABLE field.                                            */
  #define NFCT_ENABLE_ENABLE_Msk (0x1UL << NFCT_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                              */
  #define NFCT_ENABLE_ENABLE_Min (0x0UL)             /*!< Min enumerator value of ENABLE field.                                */
  #define NFCT_ENABLE_ENABLE_Max (0x1UL)             /*!< Max enumerator value of ENABLE field.                                */
  #define NFCT_ENABLE_ENABLE_Disabled (0x0UL)        /*!< Disable NFC                                                          */
  #define NFCT_ENABLE_ENABLE_Enabled (0x1UL)         /*!< Enable NFC                                                           */


/* NFCT_FRAMEDELAYMIN: Minimum frame delay */
  #define NFCT_FRAMEDELAYMIN_ResetValue (0x00000480UL) /*!< Reset value of FRAMEDELAYMIN register.                             */

/* FRAMEDELAYMIN @Bits 0..15 : Minimum frame delay in number of 13.56 MHz clock cycles */
  #define NFCT_FRAMEDELAYMIN_FRAMEDELAYMIN_Pos (0UL) /*!< Position of FRAMEDELAYMIN field.                                     */
  #define NFCT_FRAMEDELAYMIN_FRAMEDELAYMIN_Msk (0xFFFFUL << NFCT_FRAMEDELAYMIN_FRAMEDELAYMIN_Pos) /*!< Bit mask of FRAMEDELAYMIN
                                                                            field.*/                                              


/* NFCT_FRAMEDELAYMAX: Maximum frame delay */
  #define NFCT_FRAMEDELAYMAX_ResetValue (0x00001000UL) /*!< Reset value of FRAMEDELAYMAX register.                             */

/* FRAMEDELAYMAX @Bits 0..19 : Maximum frame delay in number of 13.56 MHz clock cycles */
  #define NFCT_FRAMEDELAYMAX_FRAMEDELAYMAX_Pos (0UL) /*!< Position of FRAMEDELAYMAX field.                                     */
  #define NFCT_FRAMEDELAYMAX_FRAMEDELAYMAX_Msk (0xFFFFFUL << NFCT_FRAMEDELAYMAX_FRAMEDELAYMAX_Pos) /*!< Bit mask of
                                                                            FRAMEDELAYMAX field.*/                                


/* NFCT_FRAMEDELAYMODE: Configuration register for the Frame Delay Timer */
  #define NFCT_FRAMEDELAYMODE_ResetValue (0x00000001UL) /*!< Reset value of FRAMEDELAYMODE register.                           */

/* FRAMEDELAYMODE @Bits 0..1 : Configuration register for the Frame Delay Timer */
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Pos (0UL) /*!< Position of FRAMEDELAYMODE field.                                  */
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Msk (0x3UL << NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Pos) /*!< Bit mask of
                                                                            FRAMEDELAYMODE field.*/                               
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Min (0x0UL) /*!< Min enumerator value of FRAMEDELAYMODE field.                    */
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Max (0x3UL) /*!< Max enumerator value of FRAMEDELAYMODE field.                    */
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_FreeRun (0x0UL) /*!< Transmission is independent of frame timer and will start when
                                                                  the STARTTX task is triggered. No timeout.*/                    
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Window (0x1UL) /*!< Frame is transmitted between FRAMEDELAYMIN and FRAMEDELAYMAX  */
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_ExactVal (0x2UL) /*!< Frame is transmitted exactly at FRAMEDELAYMAX               */
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_WindowGrid (0x3UL) /*!< Frame is transmitted on a bit grid between FRAMEDELAYMIN
                                                                     and FRAMEDELAYMAX*/                                          


/* NFCT_FRAMEDELAYSHIFT: Correction for the frame delay reference */
  #define NFCT_FRAMEDELAYSHIFT_ResetValue (0x0000000CUL) /*!< Reset value of FRAMEDELAYSHIFT register.                         */

/* FRAMEDELAYSHIFT @Bits 0..3 : Fine offset for the reference time for frame timing controller counter, measured in carrier
                                frequency periods. Value 8 is no offset. Values greater than 8 means the frame timing controller
                                counter reaches FRAMEDELAYMIN early and values less than 8 means the counter reaches
                                FRAMEDELAYMIN late. */                                                                            
                                                                                                                                  
  #define NFCT_FRAMEDELAYSHIFT_FRAMEDELAYSHIFT_Pos (0UL) /*!< Position of FRAMEDELAYSHIFT field.                               */
  #define NFCT_FRAMEDELAYSHIFT_FRAMEDELAYSHIFT_Msk (0xFUL << NFCT_FRAMEDELAYSHIFT_FRAMEDELAYSHIFT_Pos) /*!< Bit mask of
                                                                            FRAMEDELAYSHIFT field.*/                              


/* NFCT_MODULATIONCTRL: Enables the modulation output to a GPIO pin which can be connected to a second external antenna. */
  #define NFCT_MODULATIONCTRL_ResetValue (0x00000001UL) /*!< Reset value of MODULATIONCTRL register.                           */

/* MODULATIONCTRL @Bits 0..1 : Configuration of modulation control. */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_Pos (0UL) /*!< Position of MODULATIONCTRL field.                                  */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_Msk (0x3UL << NFCT_MODULATIONCTRL_MODULATIONCTRL_Pos) /*!< Bit mask of
                                                                            MODULATIONCTRL field.*/                               
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_Min (0x0UL) /*!< Min enumerator value of MODULATIONCTRL field.                    */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_Max (0x3UL) /*!< Max enumerator value of MODULATIONCTRL field.                    */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_Invalid (0x0UL) /*!< Invalid, defaults to same behaviour as for Internal          */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_Internal (0x1UL) /*!< Use internal modulator only                                 */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_ModToGpio (0x2UL) /*!< Output digital modulation signal to a GPIO pin.            */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_InternalAndModToGpio (0x3UL) /*!< Use internal modulator and output digital
                                                                            modulation signal to a GPIO pin.*/                    


/* NFCT_CRCPOLY: CRC polynomial */
  #define NFCT_CRCPOLY_ResetValue (0x00001021UL)     /*!< Reset value of CRCPOLY register.                                     */

/* CRCPOLY @Bits 0..15 : CRC polynomial. Each term in the CRC polynomial is mapped to a bit in this register which index
                         corresponds to the term's exponent. The most significant term (bit 16) is hardwired to 1, and not
                         reflected in the register. The following example is for a 16-bit CRC polynomial: (x16 +) x12 + x5 + 1 =
                         (1) 0001 0000 0010 0001 = 0x1021 (x16 is implicitly 1 and does not need to be written to the register)
                         */                                                                                                       
                                                                                                                                  
  #define NFCT_CRCPOLY_CRCPOLY_Pos (0UL)             /*!< Position of CRCPOLY field.                                           */
  #define NFCT_CRCPOLY_CRCPOLY_Msk (0xFFFFUL << NFCT_CRCPOLY_CRCPOLY_Pos) /*!< Bit mask of CRCPOLY field.                      */


/* NFCT_CRCINIT: CRC initial value */
  #define NFCT_CRCINIT_ResetValue (0x00006363UL)     /*!< Reset value of CRCINIT register.                                     */

/* CRCINIT @Bits 0..15 : Initial value for CRC calculation */
  #define NFCT_CRCINIT_CRCINIT_Pos (0UL)             /*!< Position of CRCINIT field.                                           */
  #define NFCT_CRCINIT_CRCINIT_Msk (0xFFFFUL << NFCT_CRCINIT_CRCINIT_Pos) /*!< Bit mask of CRCINIT field.                      */
  #define NFCT_CRCINIT_CRCINIT_Min (0x6363UL)        /*!< Min enumerator value of CRCINIT field.                               */
  #define NFCT_CRCINIT_CRCINIT_Max (0xFFFFUL)        /*!< Max enumerator value of CRCINIT field.                               */
  #define NFCT_CRCINIT_CRCINIT_NFCA (0x6363UL)       /*!< Initial value for NFC-A                                              */
  #define NFCT_CRCINIT_CRCINIT_NFCBF (0xFFFFUL)      /*!< Initial value for NFC-B and NFC-F                                    */


