adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DEMODEDGEDETECT @Bit 12 : Selects if an edge detector is enabled to detect the rising edge of an NFC pulse */
  #define NFCT_DEMODCONFIG_DEMODEDGEDETECT_Pos (12UL) /*!< Position of DEMODEDGEDETECT field.                                  */
  #define NFCT_DEMODCONFIG_DEMODEDGEDETECT_Msk (0x1UL << NFCT_DEMODCONFIG_DEMODEDGEDETECT_Pos) /*!< Bit mask of DEMODEDGEDETECT
                                                                            field.*/                                              
  #define NFCT_DEMODCONFIG_DEMODEDGEDETECT_Min (0x0UL) /*!< Min enumerator value of DEMODEDGEDETECT field.                     */
  #define NFCT_DEMODCONFIG_DEMODEDGEDETECT_Max (0x1UL) /*!< Max enumerator value of DEMODEDGEDETECT field.                     */
  #define NFCT_DEMODCONFIG_DEMODEDGEDETECT_Disabled (0x0UL) /*!< No edge detector - the rising edge of LOCKDETECT or DEMODLEV is
                                                                 used directly*/                                                  
  #define NFCT_DEMODCONFIG_DEMODEDGEDETECT_Enabled (0x1UL) /*!< Edge detector enabled on the rising edge of the NFC pulse      */


/* NFCT_SYMBOLTOLLOWER: Configuration register for the tolerance of the received NFC pulse width */
  #define NFCT_SYMBOLTOLLOWER_ResetValue (0x00000002UL) /*!< Reset value of SYMBOLTOLLOWER register.                           */

/* SYMBOLTOLLOWER @Bits 0..5 : Minimum allowable received NFC pulse width, given in pulses of 13.56 MHz clock */
  #define NFCT_SYMBOLTOLLOWER_SYMBOLTOLLOWER_Pos (0UL) /*!< Position of SYMBOLTOLLOWER field.                                  */
  #define NFCT_SYMBOLTOLLOWER_SYMBOLTOLLOWER_Msk (0x3FUL << NFCT_SYMBOLTOLLOWER_SYMBOLTOLLOWER_Pos) /*!< Bit mask of
                                                                            SYMBOLTOLLOWER field.*/                               


/* NFCT_SYMBOLTOLUPPER: Configuration register for the tolerance of the received NFC pulse width */
  #define NFCT_SYMBOLTOLUPPER_ResetValue (0x0000003FUL) /*!< Reset value of SYMBOLTOLUPPER register.                           */

/* SYMBOLTOLUPPER @Bits 0..5 : Maximum allowable received NFC pulse width, given in pulses of 13.56 MHz clock */
  #define NFCT_SYMBOLTOLUPPER_SYMBOLTOLUPPER_Pos (0UL) /*!< Position of SYMBOLTOLUPPER field.                                  */
  #define NFCT_SYMBOLTOLUPPER_SYMBOLTOLUPPER_Msk (0x3FUL << NFCT_SYMBOLTOLUPPER_SYMBOLTOLUPPER_Pos) /*!< Bit mask of
                                                                            SYMBOLTOLUPPER field.*/                               


/* NFCT_CONTINUOUSSUBCARRIER: Selects continuous sub-carrier transmission */
  #define NFCT_CONTINUOUSSUBCARRIER_ResetValue (0x00000000UL) /*!< Reset value of CONTINUOUSSUBCARRIER register.               */

/* CONTINUOUSSUBCARRIER @Bit 0 : Selects continuous sub-carrier transmission */
  #define NFCT_CONTINUOUSSUBCARRIER_CONTINUOUSSUBCARRIER_Pos (0UL) /*!< Position of CONTINUOUSSUBCARRIER field.                */
  #define NFCT_CONTINUOUSSUBCARRIER_CONTINUOUSSUBCARRIER_Msk (0x1UL << NFCT_CONTINUOUSSUBCARRIER_CONTINUOUSSUBCARRIER_Pos) /*!<
                                                                            Bit mask of CONTINUOUSSUBCARRIER field.*/             
  #define NFCT_CONTINUOUSSUBCARRIER_CONTINUOUSSUBCARRIER_Min (0x0UL) /*!< Min enumerator value of CONTINUOUSSUBCARRIER field.  */
  #define NFCT_CONTINUOUSSUBCARRIER_CONTINUOUSSUBCARRIER_Max (0x1UL) /*!< Max enumerator value of CONTINUOUSSUBCARRIER field.  */
  #define NFCT_CONTINUOUSSUBCARRIER_CONTINUOUSSUBCARRIER_Normal (0x0UL) /*!< Normal modulation                                 */
  #define NFCT_CONTINUOUSSUBCARRIER_CONTINUOUSSUBCARRIER_Carrier (0x1UL) /*!< Continuous sub-carrier transmission              */


/* NFCT_CLOCKRECCONFIG: Configuration bits for NFCT_CLOCKREC_GF22N */
  #define NFCT_CLOCKRECCONFIG_ResetValue (0x00000121UL) /*!< Reset value of CLOCKRECCONFIG register.                           */

/* ENABLERXTHRESHOLD @Bit 0 : Enables RX threshold of the sine-to-square converter. 1b_0 enables TX threshold. */
  #define NFCT_CLOCKRECCONFIG_ENABLERXTHRESHOLD_Pos (0UL) /*!< Position of ENABLERXTHRESHOLD field.                            */
  #define NFCT_CLOCKRECCONFIG_ENABLERXTHRESHOLD_Msk (0x1UL << NFCT_CLOCKRECCONFIG_ENABLERXTHRESHOLD_Pos) /*!< Bit mask of
                                                                            ENABLERXTHRESHOLD field.*/                            

/* RXTHRESHOLD @Bits 4..5 : Select RX threshold voltage */
  #define NFCT_CLOCKRECCONFIG_RXTHRESHOLD_Pos (4UL)  /*!< Position of RXTHRESHOLD field.                                       */
  #define NFCT_CLOCKRECCONFIG_RXTHRESHOLD_Msk (0x3UL << NFCT_CLOCKRECCONFIG_RXTHRESHOLD_Pos) /*!< Bit mask of RXTHRESHOLD
                                                                            field.*/                                              

/* ENABLEOUTPUT @Bit 8 : Enables the NFCT_REF_13M56_AO_0V8 output */
  #define NFCT_CLOCKRECCONFIG_ENABLEOUTPUT_Pos (8UL) /*!< Position of ENABLEOUTPUT field.                                      */
  #define NFCT_CLOCKRECCONFIG_ENABLEOUTPUT_Msk (0x1UL << NFCT_CLOCKRECCONFIG_ENABLEOUTPUT_Pos) /*!< Bit mask of ENABLEOUTPUT
                                                                            field.*/                                              

/* SPARE @Bit 9 : Spare */
  #define NFCT_CLOCKRECCONFIG_SPARE_Pos (9UL)        /*!< Position of SPARE field.                                             */
  #define NFCT_CLOCKRECCONFIG_SPARE_Msk (0x1UL << NFCT_CLOCKRECCONFIG_SPARE_Pos) /*!< Bit mask of SPARE field.                 */


/* NFCT_OVERRIDEENABLE: Enables override functionality. */
  #define NFCT_OVERRIDEENABLE_ResetValue (0x00000000UL) /*!< Reset value of OVERRIDEENABLE register.                           */

/* OVRENPWRUP @Bit 0 : Override enable for OVERRIDE_PWRUP */
  #define NFCT_OVERRIDEENABLE_OVRENPWRUP_Pos (0UL)   /*!< Position of OVRENPWRUP field.                                        */
  #define NFCT_OVERRIDEENABLE_OVRENPWRUP_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENPWRUP_Pos) /*!< Bit mask of OVRENPWRUP field.  */

/* OVRENMODULATION @Bit 1 : Override enable for modulation on/off */
  #define NFCT_OVERRIDEENABLE_OVRENMODULATION_Pos (1UL) /*!< Position of OVRENMODULATION field.                                */
  #define NFCT_OVERRIDEENABLE_OVRENMODULATION_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENMODULATION_Pos) /*!< Bit mask of
                                                                            OVRENMODULATION field.*/                              

/* OVRENCMFBPDREF @Bit 2 : Spare */
  #define NFCT_OVERRIDEENABLE_OVRENCMFBPDREF_Pos (2UL) /*!< Position of OVRENCMFBPDREF field.                                  */
  #define NFCT_OVERRIDEENABLE_OVRENCMFBPDREF_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENCMFBPDREF_Pos) /*!< Bit mask of
                                                                            OVRENCMFBPDREF field.*/                               

/* OVRENROSCCALCODE @Bit 3 : Override enable for ROSCCALCODE */
  #define NFCT_OVERRIDEENABLE_OVRENROSCCALCODE_Pos (3UL) /*!< Position of OVRENROSCCALCODE field.                              */
  #define NFCT_OVERRIDEENABLE_OVRENROSCCALCODE_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENROSCCALCODE_Pos) /*!< Bit mask of
                                                                            OVRENROSCCALCODE field.*/                             

/* OVRENROSCCALEN @Bit 4 : Override enable for ROSCCALEN */
  #define NFCT_OVERRIDEENABLE_OVRENROSCCALEN_Pos (4UL) /*!< Position of OVRENROSCCALEN field.                                  */
  #define NFCT_OVERRIDEENABLE_OVRENROSCCALEN_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENROSCCALEN_Pos) /*!< Bit mask of
                                                                            OVRENROSCCALEN field.*/                               

