adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* OVRENCLAMPEN1V6 @Bit 5 : Override enable for the 1V6 clamp */
  #define NFCT_OVERRIDEENABLE_OVRENCLAMPEN1V6_Pos (5UL) /*!< Position of OVRENCLAMPEN1V6 field.                                */
  #define NFCT_OVERRIDEENABLE_OVRENCLAMPEN1V6_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENCLAMPEN1V6_Pos) /*!< Bit mask of
                                                                            OVRENCLAMPEN1V6 field.*/                              

/* OVRENCLAMPEN2V6 @Bit 6 : Override enable for the 2V6 clamp */
  #define NFCT_OVERRIDEENABLE_OVRENCLAMPEN2V6_Pos (6UL) /*!< Position of OVRENCLAMPEN2V6 field.                                */
  #define NFCT_OVERRIDEENABLE_OVRENCLAMPEN2V6_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENCLAMPEN2V6_Pos) /*!< Bit mask of
                                                                            OVRENCLAMPEN2V6 field.*/                              

/* OVRENPWRUPRES @Bit 7 : Override enable for pwrUpRes */
  #define NFCT_OVERRIDEENABLE_OVRENPWRUPRES_Pos (7UL) /*!< Position of OVRENPWRUPRES field.                                    */
  #define NFCT_OVERRIDEENABLE_OVRENPWRUPRES_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENPWRUPRES_Pos) /*!< Bit mask of OVRENPWRUPRES
                                                                            field.*/                                              

/* OVRENRSTPEAKLEV @Bit 8 : Override enable for nfcRstPeakLev */
  #define NFCT_OVERRIDEENABLE_OVRENRSTPEAKLEV_Pos (8UL) /*!< Position of OVRENRSTPEAKLEV field.                                */
  #define NFCT_OVERRIDEENABLE_OVRENRSTPEAKLEV_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENRSTPEAKLEV_Pos) /*!< Bit mask of
                                                                            OVRENRSTPEAKLEV field.*/                              

/* OVRENRSTEDCLOCK @Bit 9 : Override enable for nfcRstEdgeDetectClockRec */
  #define NFCT_OVERRIDEENABLE_OVRENRSTEDCLOCK_Pos (9UL) /*!< Position of OVRENRSTEDCLOCK field.                                */
  #define NFCT_OVERRIDEENABLE_OVRENRSTEDCLOCK_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENRSTEDCLOCK_Pos) /*!< Bit mask of
                                                                            OVRENRSTEDCLOCK field.*/                              

/* OVRENFIELDDET @Bit 10 : Override enable for pwrupNfcFieldDetect */
  #define NFCT_OVERRIDEENABLE_OVRENFIELDDET_Pos (10UL) /*!< Position of OVRENFIELDDET field.                                   */
  #define NFCT_OVERRIDEENABLE_OVRENFIELDDET_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENFIELDDET_Pos) /*!< Bit mask of OVRENFIELDDET
                                                                            field.*/                                              

/* SPARE @Bit 11 : Spare */
  #define NFCT_OVERRIDEENABLE_SPARE_Pos (11UL)       /*!< Position of SPARE field.                                             */
  #define NFCT_OVERRIDEENABLE_SPARE_Msk (0x1UL << NFCT_OVERRIDEENABLE_SPARE_Pos) /*!< Bit mask of SPARE field.                 */

/* OVRENPWRUPNFCLDO @Bit 12 : Override enable for pwrupNfcLdo */
  #define NFCT_OVERRIDEENABLE_OVRENPWRUPNFCLDO_Pos (12UL) /*!< Position of OVRENPWRUPNFCLDO field.                             */
  #define NFCT_OVERRIDEENABLE_OVRENPWRUPNFCLDO_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENPWRUPNFCLDO_Pos) /*!< Bit mask of
                                                                            OVRENPWRUPNFCLDO field.*/                             

/* OVRENRETAIN @Bit 13 : Override enable for retainAna */
  #define NFCT_OVERRIDEENABLE_OVRENRETAIN_Pos (13UL) /*!< Position of OVRENRETAIN field.                                       */
  #define NFCT_OVERRIDEENABLE_OVRENRETAIN_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENRETAIN_Pos) /*!< Bit mask of OVRENRETAIN
                                                                            field.*/                                              

/* OVRENPADNFCCFG @Bit 14 : Override enable for padNfcCfg */
  #define NFCT_OVERRIDEENABLE_OVRENPADNFCCFG_Pos (14UL) /*!< Position of OVRENPADNFCCFG field.                                 */
  #define NFCT_OVERRIDEENABLE_OVRENPADNFCCFG_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENPADNFCCFG_Pos) /*!< Bit mask of
                                                                            OVRENPADNFCCFG field.*/                               


/* NFCT_OVRVALPWRUPNFC: Override value for pwrupNfc */
  #define NFCT_OVRVALPWRUPNFC_ResetValue (0x00000000UL) /*!< Reset value of OVRVALPWRUPNFC register.                           */

/* OVRVALPWRUPNFC @Bit 0 : Override value for pwrupNfc */
  #define NFCT_OVRVALPWRUPNFC_OVRVALPWRUPNFC_Pos (0UL) /*!< Position of OVRVALPWRUPNFC field.                                  */
  #define NFCT_OVRVALPWRUPNFC_OVRVALPWRUPNFC_Msk (0x1UL << NFCT_OVRVALPWRUPNFC_OVRVALPWRUPNFC_Pos) /*!< Bit mask of
                                                                            OVRVALPWRUPNFC field.*/                               


/* NFCT_OVRVALMODULATION: Override value for modulation on/off */
  #define NFCT_OVRVALMODULATION_ResetValue (0x00000000UL) /*!< Reset value of OVRVALMODULATION register.                       */

/* OVRVALMODULATION @Bit 0 : Override value for modulation on/off */
  #define NFCT_OVRVALMODULATION_OVRVALMODULATION_Pos (0UL) /*!< Position of OVRVALMODULATION field.                            */
  #define NFCT_OVRVALMODULATION_OVRVALMODULATION_Msk (0x1UL << NFCT_OVRVALMODULATION_OVRVALMODULATION_Pos) /*!< Bit mask of
                                                                            OVRVALMODULATION field.*/                             


/* NFCT_OVRVALROSCCALCODE: Override value for the calibration word for the oscillator */
  #define NFCT_OVRVALROSCCALCODE_ResetValue (0x00000000UL) /*!< Reset value of OVRVALROSCCALCODE register.                     */

/* OVRVALROSCCALCODE @Bits 0..5 : Override value for the calibration word for the oscillator */
  #define NFCT_OVRVALROSCCALCODE_OVRVALROSCCALCODE_Pos (0UL) /*!< Position of OVRVALROSCCALCODE field.                         */
  #define NFCT_OVRVALROSCCALCODE_OVRVALROSCCALCODE_Msk (0x3FUL << NFCT_OVRVALROSCCALCODE_OVRVALROSCCALCODE_Pos) /*!< Bit mask of
                                                                            OVRVALROSCCALCODE field.*/                            


/* NFCT_OVRVALCLAMPEN1V6: Override value for the 1V6 clamp */
  #define NFCT_OVRVALCLAMPEN1V6_ResetValue (0x00000000UL) /*!< Reset value of OVRVALCLAMPEN1V6 register.                       */

/* OVRVALCLAMPEN1V6 @Bit 0 : Override value for the 1V6 clamp */
  #define NFCT_OVRVALCLAMPEN1V6_OVRVALCLAMPEN1V6_Pos (0UL) /*!< Position of OVRVALCLAMPEN1V6 field.                            */
  #define NFCT_OVRVALCLAMPEN1V6_OVRVALCLAMPEN1V6_Msk (0x1UL << NFCT_OVRVALCLAMPEN1V6_OVRVALCLAMPEN1V6_Pos) /*!< Bit mask of
                                                                            OVRVALCLAMPEN1V6 field.*/                             


/* NFCT_OVRVALCLAMPEN2V6: Override value for the 2V6 clamp */
  #define NFCT_OVRVALCLAMPEN2V6_ResetValue (0x00000000UL) /*!< Reset value of OVRVALCLAMPEN2V6 register.                       */

/* OVRVALCLAMPEN2V6 @Bit 0 : Override value for the 2V6 clamp */
  #define NFCT_OVRVALCLAMPEN2V6_OVRVALCLAMPEN2V6_Pos (0UL) /*!< Position of OVRVALCLAMPEN2V6 field.                            */
  #define NFCT_OVRVALCLAMPEN2V6_OVRVALCLAMPEN2V6_Msk (0x1UL << NFCT_OVRVALCLAMPEN2V6_OVRVALCLAMPEN2V6_Pos) /*!< Bit mask of
                                                                            OVRVALCLAMPEN2V6 field.*/                             


/* NFCT_CALENNFC: Value for the signal CALEN going to the oscillator */
  #define NFCT_CALENNFC_ResetValue (0x00000000UL)    /*!< Reset value of CALENNFC register.                                    */

/* CALENNFC @Bit 0 : Value for the calibration word for the oscillator */
  #define NFCT_CALENNFC_CALENNFC_Pos (0UL)           /*!< Position of CALENNFC field.                                          */
  #define NFCT_CALENNFC_CALENNFC_Msk (0x1UL << NFCT_CALENNFC_CALENNFC_Pos) /*!< Bit mask of CALENNFC field.                    */


