adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* INTVALCOMMON @Bits 0..1 : Initial value of common-mode voltage level at pad */
  #define NFCT_PNFCCFGRET_INTVALCOMMON_Pos (0UL)     /*!< Position of INTVALCOMMON field.                                      */
  #define NFCT_PNFCCFGRET_INTVALCOMMON_Msk (0x3UL << NFCT_PNFCCFGRET_INTVALCOMMON_Pos) /*!< Bit mask of INTVALCOMMON field.    */

/* ENABLECOMMONREGULATION @Bit 4 : Enable/disable common-regulation at pad */
  #define NFCT_PNFCCFGRET_ENABLECOMMONREGULATION_Pos (4UL) /*!< Position of ENABLECOMMONREGULATION field.                      */
  #define NFCT_PNFCCFGRET_ENABLECOMMONREGULATION_Msk (0x1UL << NFCT_PNFCCFGRET_ENABLECOMMONREGULATION_Pos) /*!< Bit mask of
                                                                            ENABLECOMMONREGULATION field.*/                       

/* ENABLEBULKBIASSHUNT @Bit 5 : Enable/disable bulk bias of shunt transistors (flipped-well devices) during load modulation */
  #define NFCT_PNFCCFGRET_ENABLEBULKBIASSHUNT_Pos (5UL) /*!< Position of ENABLEBULKBIASSHUNT field.                            */
  #define NFCT_PNFCCFGRET_ENABLEBULKBIASSHUNT_Msk (0x1UL << NFCT_PNFCCFGRET_ENABLEBULKBIASSHUNT_Pos) /*!< Bit mask of
                                                                            ENABLEBULKBIASSHUNT field.*/                          


/* NFCT_SHUNTALGCONFIG: Configuration settings for Shunt regulator algorithm */
  #define NFCT_SHUNTALGCONFIG_ResetValue (0x00004482UL) /*!< Reset value of SHUNTALGCONFIG register.                           */

/* RSTPULSEWIDTH @Bits 0..3 : Pulse width of peak reset signal */
  #define NFCT_SHUNTALGCONFIG_RSTPULSEWIDTH_Pos (0UL) /*!< Position of RSTPULSEWIDTH field.                                    */
  #define NFCT_SHUNTALGCONFIG_RSTPULSEWIDTH_Msk (0xFUL << NFCT_SHUNTALGCONFIG_RSTPULSEWIDTH_Pos) /*!< Bit mask of RSTPULSEWIDTH
                                                                            field.*/                                              

/* RSTPPEAKPERIOD @Bits 4..7 : Period of peak reset signal */
  #define NFCT_SHUNTALGCONFIG_RSTPPEAKPERIOD_Pos (4UL) /*!< Position of RSTPPEAKPERIOD field.                                  */
  #define NFCT_SHUNTALGCONFIG_RSTPPEAKPERIOD_Msk (0xFUL << NFCT_SHUNTALGCONFIG_RSTPPEAKPERIOD_Pos) /*!< Bit mask of
                                                                            RSTPPEAKPERIOD field.*/                               

/* MULTTRIMSTARTVALUE @Bits 8..11 : Start value for MULT_TRIM */
  #define NFCT_SHUNTALGCONFIG_MULTTRIMSTARTVALUE_Pos (8UL) /*!< Position of MULTTRIMSTARTVALUE field.                          */
  #define NFCT_SHUNTALGCONFIG_MULTTRIMSTARTVALUE_Msk (0xFUL << NFCT_SHUNTALGCONFIG_MULTTRIMSTARTVALUE_Pos) /*!< Bit mask of
                                                                            MULTTRIMSTARTVALUE field.*/                           

/* MULTTRIMLOVWERBOUND @Bits 12..15 : Lower bound on MULT_TRIM */
  #define NFCT_SHUNTALGCONFIG_MULTTRIMLOVWERBOUND_Pos (12UL) /*!< Position of MULTTRIMLOVWERBOUND field.                       */
  #define NFCT_SHUNTALGCONFIG_MULTTRIMLOVWERBOUND_Msk (0xFUL << NFCT_SHUNTALGCONFIG_MULTTRIMLOVWERBOUND_Pos) /*!< Bit mask of
                                                                            MULTTRIMLOVWERBOUND field.*/                          

/* DISABLESHUNT @Bit 16 : Control shunt regulation during load modulation */
  #define NFCT_SHUNTALGCONFIG_DISABLESHUNT_Pos (16UL) /*!< Position of DISABLESHUNT field.                                     */
  #define NFCT_SHUNTALGCONFIG_DISABLESHUNT_Msk (0x1UL << NFCT_SHUNTALGCONFIG_DISABLESHUNT_Pos) /*!< Bit mask of DISABLESHUNT
                                                                            field.*/                                              
  #define NFCT_SHUNTALGCONFIG_DISABLESHUNT_Min (0x0UL) /*!< Min enumerator value of DISABLESHUNT field.                        */
  #define NFCT_SHUNTALGCONFIG_DISABLESHUNT_Max (0x1UL) /*!< Max enumerator value of DISABLESHUNT field.                        */
  #define NFCT_SHUNTALGCONFIG_DISABLESHUNT_Disabled (0x0UL) /*!< Shunt regulation is disabled during load modulation           */
  #define NFCT_SHUNTALGCONFIG_DISABLESHUNT_Enabled (0x1UL) /*!< Shunt regulation is enabled during load modulation             */


/* NFCT_OVRVALPWRUPNFCTFIELDDET: Power up field detect part of circuit and 5 nA IBPP current reference */
  #define NFCT_OVRVALPWRUPNFCTFIELDDET_ResetValue (0x00000000UL) /*!< Reset value of OVRVALPWRUPNFCTFIELDDET register.         */

/* OVRVALPWRUPNFCTFIELDDET @Bit 0 : Power up field detect part of circuit and 5 nA IBPP current reference */
  #define NFCT_OVRVALPWRUPNFCTFIELDDET_OVRVALPWRUPNFCTFIELDDET_Pos (0UL) /*!< Position of OVRVALPWRUPNFCTFIELDDET field.       */
  #define NFCT_OVRVALPWRUPNFCTFIELDDET_OVRVALPWRUPNFCTFIELDDET_Msk (0x1UL << NFCT_OVRVALPWRUPNFCTFIELDDET_OVRVALPWRUPNFCTFIELDDET_Pos)
                                                                            /*!< Bit mask of OVRVALPWRUPNFCTFIELDDET field.*/     


/* NFCT_OVRVALNFCTRSTEDCLK: Resets edge detect signal in NFCT_CLOCKREC_GF22N */
  #define NFCT_OVRVALNFCTRSTEDCLK_ResetValue (0x00000000UL) /*!< Reset value of OVRVALNFCTRSTEDCLK register.                   */

/* OVRVALNFCTRSTEDCLK @Bit 0 : Resets edge detect signal in NFCT_CLOCKREC_GF22N */
  #define NFCT_OVRVALNFCTRSTEDCLK_OVRVALNFCTRSTEDCLK_Pos (0UL) /*!< Position of OVRVALNFCTRSTEDCLK field.                      */
  #define NFCT_OVRVALNFCTRSTEDCLK_OVRVALNFCTRSTEDCLK_Msk (0x1UL << NFCT_OVRVALNFCTRSTEDCLK_OVRVALNFCTRSTEDCLK_Pos) /*!< Bit mask
                                                                            of OVRVALNFCTRSTEDCLK field.*/                        


/* NFCT_OVRVALNFCTRSTPEAKLEV: Resets peak detectors in NFCT_SHUNTREG_GF22N */
  #define NFCT_OVRVALNFCTRSTPEAKLEV_ResetValue (0x00000000UL) /*!< Reset value of OVRVALNFCTRSTPEAKLEV register.               */

/* OVRVALNFCTRSTPEAKLEV @Bit 0 : Resets peak detectors in NFCT_SHUNTREG_GF22N */
  #define NFCT_OVRVALNFCTRSTPEAKLEV_OVRVALNFCTRSTPEAKLEV_Pos (0UL) /*!< Position of OVRVALNFCTRSTPEAKLEV field.                */
  #define NFCT_OVRVALNFCTRSTPEAKLEV_OVRVALNFCTRSTPEAKLEV_Msk (0x1UL << NFCT_OVRVALNFCTRSTPEAKLEV_OVRVALNFCTRSTPEAKLEV_Pos) /*!<
                                                                            Bit mask of OVRVALNFCTRSTPEAKLEV field.*/             


/* NFCT_OVRVALNFCTCALEN: Enable calibration of ring oscillator in NFCT_CLOCKREC_GF22N */
  #define NFCT_OVRVALNFCTCALEN_ResetValue (0x00000000UL) /*!< Reset value of OVRVALNFCTCALEN register.                         */

/* OVRVALNFCTCALEN @Bit 0 : Enable calibration of ring oscillator in NFCT_CLOCKREC_GF22N */
  #define NFCT_OVRVALNFCTCALEN_OVRVALNFCTCALEN_Pos (0UL) /*!< Position of OVRVALNFCTCALEN field.                               */
  #define NFCT_OVRVALNFCTCALEN_OVRVALNFCTCALEN_Msk (0x1UL << NFCT_OVRVALNFCTCALEN_OVRVALNFCTCALEN_Pos) /*!< Bit mask of
                                                                            OVRVALNFCTCALEN field.*/                              


/* NFCT_NFCTFIELDDETCFG: NFCT_FIELDDET_GF22N configuration bits */
  #define NFCT_NFCTFIELDDETCFG_ResetValue (0x00000002UL) /*!< Reset value of NFCTFIELDDETCFG register.                         */

