adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* THRESHOLDVOLTAGE @Bits 0..1 : Trimming of field detector threshold voltage */
  #define NFCT_NFCTFIELDDETCFG_THRESHOLDVOLTAGE_Pos (0UL) /*!< Position of THRESHOLDVOLTAGE field.                             */
  #define NFCT_NFCTFIELDDETCFG_THRESHOLDVOLTAGE_Msk (0x3UL << NFCT_NFCTFIELDDETCFG_THRESHOLDVOLTAGE_Pos) /*!< Bit mask of
                                                                            THRESHOLDVOLTAGE field.*/                             

/* HYSTERESISLEVEL @Bit 4 : Change hysteresis level of internal comparator */
  #define NFCT_NFCTFIELDDETCFG_HYSTERESISLEVEL_Pos (4UL) /*!< Position of HYSTERESISLEVEL field.                               */
  #define NFCT_NFCTFIELDDETCFG_HYSTERESISLEVEL_Msk (0x1UL << NFCT_NFCTFIELDDETCFG_HYSTERESISLEVEL_Pos) /*!< Bit mask of
                                                                            HYSTERESISLEVEL field.*/                              

/* TRIMIBPP @Bits 8..9 : Trim 5 nA IBPP current (from NFCT_BIAS_GF22N) */
  #define NFCT_NFCTFIELDDETCFG_TRIMIBPP_Pos (8UL)    /*!< Position of TRIMIBPP field.                                          */
  #define NFCT_NFCTFIELDDETCFG_TRIMIBPP_Msk (0x3UL << NFCT_NFCTFIELDDETCFG_TRIMIBPP_Pos) /*!< Bit mask of TRIMIBPP field.      */


/* NFCT_NFCTCTRL: Spare digital control signals */
  #define NFCT_NFCTCTRL_ResetValue (0x00000000UL)    /*!< Reset value of NFCTCTRL register.                                    */

/* DIGITALCONTROL @Bits 0..1 : Spare digital control signals */
  #define NFCT_NFCTCTRL_DIGITALCONTROL_Pos (0UL)     /*!< Position of DIGITALCONTROL field.                                    */
  #define NFCT_NFCTCTRL_DIGITALCONTROL_Msk (0x3UL << NFCT_NFCTCTRL_DIGITALCONTROL_Pos) /*!< Bit mask of DIGITALCONTROL field.  */


/* NFCT_PWRUPNFCTLDO: Power-up for LDO */
  #define NFCT_PWRUPNFCTLDO_ResetValue (0x00000000UL) /*!< Reset value of PWRUPNFCTLDO register.                               */

/* POWERBLEEDCURRENT @Bit 0 : Power-up with bleed current */
  #define NFCT_PWRUPNFCTLDO_POWERBLEEDCURRENT_Pos (0UL) /*!< Position of POWERBLEEDCURRENT field.                              */
  #define NFCT_PWRUPNFCTLDO_POWERBLEEDCURRENT_Msk (0x1UL << NFCT_PWRUPNFCTLDO_POWERBLEEDCURRENT_Pos) /*!< Bit mask of
                                                                            POWERBLEEDCURRENT field.*/                            

/* POWERNOBLEEDCURRENT @Bit 1 : Power-up without bleed current */
  #define NFCT_PWRUPNFCTLDO_POWERNOBLEEDCURRENT_Pos (1UL) /*!< Position of POWERNOBLEEDCURRENT field.                          */
  #define NFCT_PWRUPNFCTLDO_POWERNOBLEEDCURRENT_Msk (0x1UL << NFCT_PWRUPNFCTLDO_POWERNOBLEEDCURRENT_Pos) /*!< Bit mask of
                                                                            POWERNOBLEEDCURRENT field.*/                          


/* NFCT_PADCONFIG: NFC pad configuration */
  #define NFCT_PADCONFIG_ResetValue (0x00000001UL)   /*!< Reset value of PADCONFIG register.                                   */

/* ENABLE @Bit 0 : Enable NFC pads */
  #define NFCT_PADCONFIG_ENABLE_Pos (0UL)            /*!< Position of ENABLE field.                                            */
  #define NFCT_PADCONFIG_ENABLE_Msk (0x1UL << NFCT_PADCONFIG_ENABLE_Pos) /*!< Bit mask of ENABLE field.                        */
  #define NFCT_PADCONFIG_ENABLE_Min (0x0UL)          /*!< Min enumerator value of ENABLE field.                                */
  #define NFCT_PADCONFIG_ENABLE_Max (0x1UL)          /*!< Max enumerator value of ENABLE field.                                */
  #define NFCT_PADCONFIG_ENABLE_Disabled (0x0UL)     /*!< NFC pads are used as GPIO pins                                       */
  #define NFCT_PADCONFIG_ENABLE_Enabled (0x1UL)      /*!< The NFC pads are configured as NFC antenna pins                      */


/* NFCT_NFCTCALCMP: Output from the calibration comparator */
  #define NFCT_NFCTCALCMP_ResetValue (0x00000000UL)  /*!< Reset value of NFCTCALCMP register.                                  */

/* NFCTCALCMP @Bit 0 : (unspecified) */
  #define NFCT_NFCTCALCMP_NFCTCALCMP_Pos (0UL)       /*!< Position of NFCTCALCMP field.                                        */
  #define NFCT_NFCTCALCMP_NFCTCALCMP_Msk (0x1UL << NFCT_NFCTCALCMP_NFCTCALCMP_Pos) /*!< Bit mask of NFCTCALCMP field.          */
  #define NFCT_NFCTCALCMP_NFCTCALCMP_Min (0x0UL)     /*!< Min enumerator value of NFCTCALCMP field.                            */
  #define NFCT_NFCTCALCMP_NFCTCALCMP_Max (0x1UL)     /*!< Max enumerator value of NFCTCALCMP field.                            */
  #define NFCT_NFCTCALCMP_NFCTCALCMP_NFCCaLCmpLow (0x0UL) /*!< Trim code low                                                   */
  #define NFCT_NFCTCALCMP_NFCTCALCMP_NFCCaLCmpHigh (0x1UL) /*!< Trim code high                                                 */


/* NFCT_BIASCFG: Configuration of NFCT_BIAS_GF22N */
  #define NFCT_BIASCFG_ResetValue (0x00007000UL)     /*!< Reset value of BIASCFG register.                                     */

/* TRIMIBPSR @Bits 0..4 : Fine trim IBPSR 4 uA bias current This will also trim VREF_SWAT_0V8 in steps of 10 mV */
  #define NFCT_BIASCFG_TRIMIBPSR_Pos (0UL)           /*!< Position of TRIMIBPSR field.                                         */
  #define NFCT_BIASCFG_TRIMIBPSR_Msk (0x1FUL << NFCT_BIASCFG_TRIMIBPSR_Pos) /*!< Bit mask of TRIMIBPSR field.                  */

/* COARSEIBPSR @Bits 8..9 : Coarse IBPSR 4 uA. Might be needed to cover trimming range if modelling is an issue */
  #define NFCT_BIASCFG_COARSEIBPSR_Pos (8UL)         /*!< Position of COARSEIBPSR field.                                       */
  #define NFCT_BIASCFG_COARSEIBPSR_Msk (0x3UL << NFCT_BIASCFG_COARSEIBPSR_Pos) /*!< Bit mask of COARSEIBPSR field.             */

/* REFERENCEVOLTAGE @Bits 12..14 : Reference voltage level */
  #define NFCT_BIASCFG_REFERENCEVOLTAGE_Pos (12UL)   /*!< Position of REFERENCEVOLTAGE field.                                  */
  #define NFCT_BIASCFG_REFERENCEVOLTAGE_Msk (0x7UL << NFCT_BIASCFG_REFERENCEVOLTAGE_Pos) /*!< Bit mask of REFERENCEVOLTAGE
                                                                            field.*/                                              

/* SPARE @Bits 16..19 : Spare */
  #define NFCT_BIASCFG_SPARE_Pos (16UL)              /*!< Position of SPARE field.                                             */
  #define NFCT_BIASCFG_SPARE_Msk (0xFUL << NFCT_BIASCFG_SPARE_Pos) /*!< Bit mask of SPARE field.                               */


/* NFCT_RINGOSCCONFIG: Configuration settings for ring oscillator algorithm */
  #define NFCT_RINGOSCCONFIG_ResetValue (0x00000000UL) /*!< Reset value of RINGOSCCONFIG register.                             */

/* CALIBRATIONSOURCE @Bit 0 : Calibration source */
  #define NFCT_RINGOSCCONFIG_CALIBRATIONSOURCE_Pos (0UL) /*!< Position of CALIBRATIONSOURCE field.                             */
  #define NFCT_RINGOSCCONFIG_CALIBRATIONSOURCE_Msk (0x1UL << NFCT_RINGOSCCONFIG_CALIBRATIONSOURCE_Pos) /*!< Bit mask of
                                                                            CALIBRATIONSOURCE field.*/                            
  #define NFCT_RINGOSCCONFIG_CALIBRATIONSOURCE_Min (0x0UL) /*!< Min enumerator value of CALIBRATIONSOURCE field.               */
  #define NFCT_RINGOSCCONFIG_CALIBRATIONSOURCE_Max (0x1UL) /*!< Max enumerator value of CALIBRATIONSOURCE field.               */
  #define NFCT_RINGOSCCONFIG_CALIBRATIONSOURCE_Disabled (0x0UL) /*!< NFC carrier signal used as calibration source             */
  #define NFCT_RINGOSCCONFIG_CALIBRATIONSOURCE_Enabled (0x1UL) /*!< 16 MHz crystal oscillator used as calibration source       */


