adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* NFCT_OVRVALRETAIN: Retain - Latch and isolate all RET_0V8 inputs to NFCT_ANA_GF22N and P_NFC_GF22N */
  #define NFCT_OVRVALRETAIN_ResetValue (0x00000000UL) /*!< Reset value of OVRVALRETAIN register.                               */

/* OVRVALRETAIN @Bit 0 : Retain - Latch and isolate all RET_0V8 inputs to NFCT_ANA_GF22N and P_NFC_GF22N */
  #define NFCT_OVRVALRETAIN_OVRVALRETAIN_Pos (0UL)   /*!< Position of OVRVALRETAIN field.                                      */
  #define NFCT_OVRVALRETAIN_OVRVALRETAIN_Msk (0x1UL << NFCT_OVRVALRETAIN_OVRVALRETAIN_Pos) /*!< Bit mask of OVRVALRETAIN field.*/


/* NFCT_CMFBENABLE: Enable calibration of cmfbPdRef */
  #define NFCT_CMFBENABLE_ResetValue (0x00000000UL)  /*!< Reset value of CMFBENABLE register.                                  */

/* CMFBENABLE @Bit 0 : Enable calibration of cmfbPdRef */
  #define NFCT_CMFBENABLE_CMFBENABLE_Pos (0UL)       /*!< Position of CMFBENABLE field.                                        */
  #define NFCT_CMFBENABLE_CMFBENABLE_Msk (0x1UL << NFCT_CMFBENABLE_CMFBENABLE_Pos) /*!< Bit mask of CMFBENABLE field.          */


/* NFCT_OVRVALPADNFCCFG: Override of P_NFCCFG_RET_0V8 to P_NFC_GF22N */
  #define NFCT_OVRVALPADNFCCFG_ResetValue (0x00000000UL) /*!< Reset value of OVRVALPADNFCCFG register.                         */

/* COMMONREGEN @Bit 0 : Enable/disable common-regulation at pad */
  #define NFCT_OVRVALPADNFCCFG_COMMONREGEN_Pos (0UL) /*!< Position of COMMONREGEN field.                                       */
  #define NFCT_OVRVALPADNFCCFG_COMMONREGEN_Msk (0x1UL << NFCT_OVRVALPADNFCCFG_COMMONREGEN_Pos) /*!< Bit mask of COMMONREGEN
                                                                            field.*/                                              

/* COMMONMODEVOLT @Bits 1..3 : Set common-mode voltage level at pad */
  #define NFCT_OVRVALPADNFCCFG_COMMONMODEVOLT_Pos (1UL) /*!< Position of COMMONMODEVOLT field.                                 */
  #define NFCT_OVRVALPADNFCCFG_COMMONMODEVOLT_Msk (0x7UL << NFCT_OVRVALPADNFCCFG_COMMONMODEVOLT_Pos) /*!< Bit mask of
                                                                            COMMONMODEVOLT field.*/                               

/* SHUNTREGSHUNT @Bits 4..10 : Multiplier of shunt transistor between NFC1 and NFC2 during shunt regulation */
  #define NFCT_OVRVALPADNFCCFG_SHUNTREGSHUNT_Pos (4UL) /*!< Position of SHUNTREGSHUNT field.                                   */
  #define NFCT_OVRVALPADNFCCFG_SHUNTREGSHUNT_Msk (0x7FUL << NFCT_OVRVALPADNFCCFG_SHUNTREGSHUNT_Pos) /*!< Bit mask of
                                                                            SHUNTREGSHUNT field.*/                                

/* SHUNTTRANSISTORS @Bits 11..15 : Gate voltage of shunt transistors */
  #define NFCT_OVRVALPADNFCCFG_SHUNTTRANSISTORS_Pos (11UL) /*!< Position of SHUNTTRANSISTORS field.                            */
  #define NFCT_OVRVALPADNFCCFG_SHUNTTRANSISTORS_Msk (0x1FUL << NFCT_OVRVALPADNFCCFG_SHUNTTRANSISTORS_Pos) /*!< Bit mask of
                                                                            SHUNTTRANSISTORS field.*/                             

/* SHUNTREGLOAD @Bits 16..22 : Multiplier of shunt transistor between NFC1 and NFC2 during load modulation */
  #define NFCT_OVRVALPADNFCCFG_SHUNTREGLOAD_Pos (16UL) /*!< Position of SHUNTREGLOAD field.                                    */
  #define NFCT_OVRVALPADNFCCFG_SHUNTREGLOAD_Msk (0x7FUL << NFCT_OVRVALPADNFCCFG_SHUNTREGLOAD_Pos) /*!< Bit mask of SHUNTREGLOAD
                                                                            field.*/                                              

/* BULKBIAS @Bit 23 : Enable/disable bulk bias of shunt transistors (flipped-well devices) during load modulation */
  #define NFCT_OVRVALPADNFCCFG_BULKBIAS_Pos (23UL)   /*!< Position of BULKBIAS field.                                          */
  #define NFCT_OVRVALPADNFCCFG_BULKBIAS_Msk (0x1UL << NFCT_OVRVALPADNFCCFG_BULKBIAS_Pos) /*!< Bit mask of BULKBIAS field.      */

/* GATEVOLTAGECLAMP @Bits 24..27 : Back gate voltage of clamp during 2.6 V clamping mode */
  #define NFCT_OVRVALPADNFCCFG_GATEVOLTAGECLAMP_Pos (24UL) /*!< Position of GATEVOLTAGECLAMP field.                            */
  #define NFCT_OVRVALPADNFCCFG_GATEVOLTAGECLAMP_Msk (0xFUL << NFCT_OVRVALPADNFCCFG_GATEVOLTAGECLAMP_Pos) /*!< Bit mask of
                                                                            GATEVOLTAGECLAMP field.*/                             


/* NFCT_PACKETPTR: Packet pointer for TXD and RXD data storage in Data RAM */
  #define NFCT_PACKETPTR_ResetValue (0x00000000UL)   /*!< Reset value of PACKETPTR register.                                   */

/* PTR @Bits 0..31 : Packet pointer for TXD and RXD data storage in Data RAM. This address is a byte-aligned RAM address. */
  #define NFCT_PACKETPTR_PTR_Pos (0UL)               /*!< Position of PTR field.                                               */
  #define NFCT_PACKETPTR_PTR_Msk (0xFFFFFFFFUL << NFCT_PACKETPTR_PTR_Pos) /*!< Bit mask of PTR field.                          */


/* NFCT_MAXLEN: Size of the RAM buffer allocated to TXD and RXD data storage each */
  #define NFCT_MAXLEN_ResetValue (0x00000000UL)      /*!< Reset value of MAXLEN register.                                      */

/* MAXLEN @Bits 0..8 : Size of the RAM buffer allocated to TXD and RXD data storage each */
  #define NFCT_MAXLEN_MAXLEN_Pos (0UL)               /*!< Position of MAXLEN field.                                            */
  #define NFCT_MAXLEN_MAXLEN_Msk (0x1FFUL << NFCT_MAXLEN_MAXLEN_Pos) /*!< Bit mask of MAXLEN field.                            */
  #define NFCT_MAXLEN_MAXLEN_Min (0x0UL)             /*!< Min value of MAXLEN field.                                           */
  #define NFCT_MAXLEN_MAXLEN_Max (0x101UL)           /*!< Max size of MAXLEN field.                                            */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           OICR                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct OICR_DEVICE ==================================================== */
/**
  * @brief DEVICE [OICR_DEVICE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  UUID[4];                           /*!< (@ 0x00000000) 128-bit Universally Unique IDentifier (UUID).         */
  __IOM uint32_t  TYPE;                              /*!< (@ 0x00000010) Device type.                                          */
  __IOM uint32_t  TESTIMPRINT[8];                    /*!< (@ 0x00000014) Production test imprint.                              */
  __IM  uint32_t  PARTNO;                            /*!< (@ 0x00000034) Part number.                                          */
  __IM  uint32_t  HWREVISION;                        /*!< (@ 0x00000038) Hardware revision.                                    */
  __IM  uint32_t  PRODUCTIONREVISION;                /*!< (@ 0x0000003C) Production reversion.                                 */
} NRF_OICR_DEVICE_Type;                              /*!< Size = 64 (0x040)                                                    */

/* OICR_DEVICE_UUID: 128-bit Universally Unique IDentifier (UUID). */
  #define OICR_DEVICE_UUID_MaxCount (4UL)            /*!< Max size of UUID[4] array.                                           */
  #define OICR_DEVICE_UUID_ResetValue (0xFFFFFFFFUL) /*!< Reset value of UUID[4] register.                                     */

/* UUID @Bits 0..31 : Device UUID [n]. */
  #define OICR_DEVICE_UUID_UUID_Pos (0UL)            /*!< Position of UUID field.                                              */
  #define OICR_DEVICE_UUID_UUID_Msk (0xFFFFFFFFUL << OICR_DEVICE_UUID_UUID_Pos) /*!< Bit mask of UUID field.                   */


/* OICR_DEVICE_TYPE: Device type. */
  #define OICR_DEVICE_TYPE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TYPE register.                                        */

/* TYPE @Bits 0..31 : Device type. */
  #define OICR_DEVICE_TYPE_TYPE_Pos (0UL)            /*!< Position of TYPE field.                                              */
  #define OICR_DEVICE_TYPE_TYPE_Msk (0xFFFFFFFFUL << OICR_DEVICE_TYPE_TYPE_Pos) /*!< Bit mask of TYPE field.                   */
  #define OICR_DEVICE_TYPE_TYPE_Min (0x0UL)          /*!< Min enumerator value of TYPE field.                                  */
  #define OICR_DEVICE_TYPE_TYPE_Max (0xFFFFFFFFUL)   /*!< Max enumerator value of TYPE field.                                  */
  #define OICR_DEVICE_TYPE_TYPE_Die (0x00000000UL)   /*!< Device is a physical DIE.                                            */
  #define OICR_DEVICE_TYPE_TYPE_FPGA (0xFFFFFFFFUL)  /*!< Device is a FPGA.                                                    */


/* OICR_DEVICE_TESTIMPRINT: Production test imprint. */
  #define OICR_DEVICE_TESTIMPRINT_MaxCount (8UL)     /*!< Max size of TESTIMPRINT[8] array.                                    */
  #define OICR_DEVICE_TESTIMPRINT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TESTIMPRINT[8] register.                       */

/* TESTIMPRINT @Bits 0..31 : Production test imprint. */
  #define OICR_DEVICE_TESTIMPRINT_TESTIMPRINT_Pos (0UL) /*!< Position of TESTIMPRINT field.                                    */
  #define OICR_DEVICE_TESTIMPRINT_TESTIMPRINT_Msk (0xFFFFFFFFUL << OICR_DEVICE_TESTIMPRINT_TESTIMPRINT_Pos) /*!< Bit mask of
                                                                            TESTIMPRINT field.*/                                  


