adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* OICR_MRAM_LOWAVGCURR_READ: Timeout value for low average current in case of read. */
  #define OICR_MRAM_LOWAVGCURR_READ_ResetValue (0xFFFFFFFFUL) /*!< Reset value of READ register.                               */

/* VALUE @Bits 0..31 : Value */
  #define OICR_MRAM_LOWAVGCURR_READ_VALUE_Pos (0UL)  /*!< Position of VALUE field.                                             */
  #define OICR_MRAM_LOWAVGCURR_READ_VALUE_Msk (0xFFFFFFFFUL << OICR_MRAM_LOWAVGCURR_READ_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/                                              


/* OICR_MRAM_LOWAVGCURR_WRITE: Timeout value for low average current in case of write. */
  #define OICR_MRAM_LOWAVGCURR_WRITE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of WRITE register.                             */

/* VALUE @Bits 0..31 : Value */
  #define OICR_MRAM_LOWAVGCURR_WRITE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                             */
  #define OICR_MRAM_LOWAVGCURR_WRITE_VALUE_Msk (0xFFFFFFFFUL << OICR_MRAM_LOWAVGCURR_WRITE_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/                                              


/* OICR_MRAM_LOWAVGCURR_ERASE: Timeout value for low average current in case of erase. */
  #define OICR_MRAM_LOWAVGCURR_ERASE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ERASE register.                             */

/* VALUE @Bits 0..31 : Value */
  #define OICR_MRAM_LOWAVGCURR_ERASE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                             */
  #define OICR_MRAM_LOWAVGCURR_ERASE_VALUE_Msk (0xFFFFFFFFUL << OICR_MRAM_LOWAVGCURR_ERASE_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/                                              



/* ==================================================== Struct OICR_MRAM ===================================================== */
/**
  * @brief MRAM [OICR_MRAM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TRIMRDY;                           /*!< (@ 0x00000000) MRAM TRIM information is populated and ready.         */
  __IOM NRF_OICR_MRAM_LOWAVGCURR_Type LOWAVGCURR;    /*!< (@ 0x00000004) (unspecified)                                         */
  __IOM uint32_t  WAITSTATES;                        /*!< (@ 0x00000010) Default MRAM[n] waitstates.                           */
  __IOM uint32_t  READYNEXTTIMEOUT;                  /*!< (@ 0x00000014) Default MRAM[n] READYNEXTTIMEOUT.                     */
  __IOM uint32_t  NCONFIG;                           /*!< (@ 0x00000018) Number of bits to load from trim configuration for
                                                                         MRAM[n].*/                                               
  __IOM uint32_t  CONFIG[12];                        /*!< (@ 0x0000001C) MRAM[n] trim configuration.                           */
} NRF_OICR_MRAM_Type;                                /*!< Size = 76 (0x04C)                                                    */
  #define OICR_MRAM_MaxCount (2UL)                   /*!< Max size of MRAM[2] array.                                           */

/* OICR_MRAM_TRIMRDY: MRAM TRIM information is populated and ready. */
  #define OICR_MRAM_TRIMRDY_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIMRDY register.                                    */

/* TRIMRDY @Bit 0 : MRAM TRIM information is populated and ready. */
  #define OICR_MRAM_TRIMRDY_TRIMRDY_Pos (0UL)        /*!< Position of TRIMRDY field.                                           */
  #define OICR_MRAM_TRIMRDY_TRIMRDY_Msk (0x1UL << OICR_MRAM_TRIMRDY_TRIMRDY_Pos) /*!< Bit mask of TRIMRDY field.               */
  #define OICR_MRAM_TRIMRDY_TRIMRDY_Min (0x0UL)      /*!< Min enumerator value of TRIMRDY field.                               */
  #define OICR_MRAM_TRIMRDY_TRIMRDY_Max (0x1UL)      /*!< Max enumerator value of TRIMRDY field.                               */
  #define OICR_MRAM_TRIMRDY_TRIMRDY_Ready (0x0UL)    /*!< Trim information is populated and ready.                             */
  #define OICR_MRAM_TRIMRDY_TRIMRDY_NotReady (0x1UL) /*!< Trim information is not populated or ready.                          */


/* OICR_MRAM_WAITSTATES: Default MRAM[n] waitstates. */
  #define OICR_MRAM_WAITSTATES_ResetValue (0xFFFFFFFFUL) /*!< Reset value of WAITSTATES register.                              */

/* VALUE @Bits 0..31 : Value */
  #define OICR_MRAM_WAITSTATES_VALUE_Pos (0UL)       /*!< Position of VALUE field.                                             */
  #define OICR_MRAM_WAITSTATES_VALUE_Msk (0xFFFFFFFFUL << OICR_MRAM_WAITSTATES_VALUE_Pos) /*!< Bit mask of VALUE field.        */


/* OICR_MRAM_READYNEXTTIMEOUT: Default MRAM[n] READYNEXTTIMEOUT. */
  #define OICR_MRAM_READYNEXTTIMEOUT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of READYNEXTTIMEOUT register.                  */

/* VALUE @Bits 0..31 : Value */
  #define OICR_MRAM_READYNEXTTIMEOUT_VALUE_Pos (0UL) /*!< Position of VALUE field.                                             */
  #define OICR_MRAM_READYNEXTTIMEOUT_VALUE_Msk (0xFFFFFFFFUL << OICR_MRAM_READYNEXTTIMEOUT_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/                                              


/* OICR_MRAM_NCONFIG: Number of bits to load from trim configuration for MRAM[n]. */
  #define OICR_MRAM_NCONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of NCONFIG register.                                    */

/* VALUE @Bits 0..31 : Value */
  #define OICR_MRAM_NCONFIG_VALUE_Pos (0UL)          /*!< Position of VALUE field.                                             */
  #define OICR_MRAM_NCONFIG_VALUE_Msk (0xFFFFFFFFUL << OICR_MRAM_NCONFIG_VALUE_Pos) /*!< Bit mask of VALUE field.              */


/* OICR_MRAM_CONFIG: MRAM[n] trim configuration. */
  #define OICR_MRAM_CONFIG_MaxCount (12UL)           /*!< Max size of CONFIG[12] array.                                        */
  #define OICR_MRAM_CONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONFIG[12] register.                                  */

