adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CONFIG @Bits 0..31 : Trim Configuration [o]. */
  #define OICR_MRAM_CONFIG_CONFIG_Pos (0UL)          /*!< Position of CONFIG field.                                            */
  #define OICR_MRAM_CONFIG_CONFIG_Msk (0xFFFFFFFFUL << OICR_MRAM_CONFIG_CONFIG_Pos) /*!< Bit mask of CONFIG field.             */



/* ==================================================== Struct OICR_UROT ===================================================== */
/**
  * @brief UROT [OICR_UROT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DATA[64];                          /*!< (@ 0x00000000) Reserved for updatable RoT data.                      */
} NRF_OICR_UROT_Type;                                /*!< Size = 256 (0x100)                                                   */

/* OICR_UROT_DATA: Reserved for updatable RoT data. */
  #define OICR_UROT_DATA_MaxCount (64UL)             /*!< Max size of DATA[64] array.                                          */
  #define OICR_UROT_DATA_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of DATA[64] register.                                    */

/* DATA @Bits 0..31 : Data */
  #define OICR_UROT_DATA_DATA_Pos (0UL)              /*!< Position of DATA field.                                              */
  #define OICR_UROT_DATA_DATA_Msk (0xFFFFFFFFUL << OICR_UROT_DATA_DATA_Pos) /*!< Bit mask of DATA field.                       */



/* =============================================== Struct OICR_USER_ROT_PUBKEY =============================================== */
/**
  * @brief PUBKEY [OICR_USER_ROT_PUBKEY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DIGEST[8];                         /*!< (@ 0x00000000) First 256 bits of SHA2-512 digest over RoT public key
                                                                         generation [n].*/                                        
  __IOM uint32_t  REVOKE[3];                         /*!< (@ 0x00000020) Revocation status for RoT public key generation [n].  */
} NRF_OICR_USER_ROT_PUBKEY_Type;                     /*!< Size = 44 (0x02C)                                                    */
  #define OICR_USER_ROT_PUBKEY_MaxCount (4UL)        /*!< Max size of PUBKEY[4] array.                                         */

/* OICR_USER_ROT_PUBKEY_DIGEST: First 256 bits of SHA2-512 digest over RoT public key generation [n]. */
  #define OICR_USER_ROT_PUBKEY_DIGEST_MaxCount (8UL) /*!< Max size of DIGEST[8] array.                                         */
  #define OICR_USER_ROT_PUBKEY_DIGEST_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DIGEST[8] register.                        */

/* VALUE @Bits 0..31 : Value for word [o] in the key digest [n]. */
  #define OICR_USER_ROT_PUBKEY_DIGEST_VALUE_Pos (0UL) /*!< Position of VALUE field.                                            */
  #define OICR_USER_ROT_PUBKEY_DIGEST_VALUE_Msk (0xFFFFFFFFUL << OICR_USER_ROT_PUBKEY_DIGEST_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/                                              


/* OICR_USER_ROT_PUBKEY_REVOKE: Revocation status for RoT public key generation [n]. */
  #define OICR_USER_ROT_PUBKEY_REVOKE_MaxCount (3UL) /*!< Max size of REVOKE[3] array.                                         */
  #define OICR_USER_ROT_PUBKEY_REVOKE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of REVOKE[3] register.                        */

/* STATUS @Bits 0..31 : Revocation status. */
  #define OICR_USER_ROT_PUBKEY_REVOKE_STATUS_Pos (0UL) /*!< Position of STATUS field.                                          */
  #define OICR_USER_ROT_PUBKEY_REVOKE_STATUS_Msk (0xFFFFFFFFUL << OICR_USER_ROT_PUBKEY_REVOKE_STATUS_Pos) /*!< Bit mask of
                                                                            STATUS field.*/                                       
  #define OICR_USER_ROT_PUBKEY_REVOKE_STATUS_Min (0xFFFFFFFFUL) /*!< Min enumerator value of STATUS field.                     */
  #define OICR_USER_ROT_PUBKEY_REVOKE_STATUS_Max (0xFFFFFFFFUL) /*!< Max enumerator value of STATUS field.                     */
  #define OICR_USER_ROT_PUBKEY_REVOKE_STATUS_NotRevoked (0xFFFFFFFFUL) /*!< Key not revoked.                                   */



/* ============================================= Struct OICR_USER_ROT_AUTHOPKEY ============================================== */
/**
  * @brief AUTHOPKEY [OICR_USER_ROT_AUTHOPKEY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DIGEST[8];                         /*!< (@ 0x00000000) First 256 bits of SHA2-512 digest over RoT
                                                                         authenticated operation public key generation [n].*/     
  __IOM uint32_t  REVOKE[3];                         /*!< (@ 0x00000020) Revocation status for RoT authenticated operation
                                                                         public key generation [n].*/                             
} NRF_OICR_USER_ROT_AUTHOPKEY_Type;                  /*!< Size = 44 (0x02C)                                                    */
  #define OICR_USER_ROT_AUTHOPKEY_MaxCount (4UL)     /*!< Max size of AUTHOPKEY[4] array.                                      */

/* OICR_USER_ROT_AUTHOPKEY_DIGEST: First 256 bits of SHA2-512 digest over RoT authenticated operation public key generation [n].
                                    */                                                                                            
                                                                                                                                  
  #define OICR_USER_ROT_AUTHOPKEY_DIGEST_MaxCount (8UL) /*!< Max size of DIGEST[8] array.                                      */
  #define OICR_USER_ROT_AUTHOPKEY_DIGEST_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DIGEST[8] register.                     */

/* VALUE @Bits 0..31 : Value for word [o] in the key digest [n]. */
  #define OICR_USER_ROT_AUTHOPKEY_DIGEST_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define OICR_USER_ROT_AUTHOPKEY_DIGEST_VALUE_Msk (0xFFFFFFFFUL << OICR_USER_ROT_AUTHOPKEY_DIGEST_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/                                        


/* OICR_USER_ROT_AUTHOPKEY_REVOKE: Revocation status for RoT authenticated operation public key generation [n]. */
  #define OICR_USER_ROT_AUTHOPKEY_REVOKE_MaxCount (3UL) /*!< Max size of REVOKE[3] array.                                      */
  #define OICR_USER_ROT_AUTHOPKEY_REVOKE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of REVOKE[3] register.                     */

