adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* OICR_NORDIC_ROT_PUBKEY_REVOKE: Revocation status for RoT public key generation [n]. */
  #define OICR_NORDIC_ROT_PUBKEY_REVOKE_MaxCount (3UL) /*!< Max size of REVOKE[3] array.                                       */
  #define OICR_NORDIC_ROT_PUBKEY_REVOKE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of REVOKE[3] register.                      */

/* STATUS @Bits 0..31 : Revocation status. */
  #define OICR_NORDIC_ROT_PUBKEY_REVOKE_STATUS_Pos (0UL) /*!< Position of STATUS field.                                        */
  #define OICR_NORDIC_ROT_PUBKEY_REVOKE_STATUS_Msk (0xFFFFFFFFUL << OICR_NORDIC_ROT_PUBKEY_REVOKE_STATUS_Pos) /*!< Bit mask of
                                                                            STATUS field.*/                                       
  #define OICR_NORDIC_ROT_PUBKEY_REVOKE_STATUS_Min (0xFFFFFFFFUL) /*!< Min enumerator value of STATUS field.                   */
  #define OICR_NORDIC_ROT_PUBKEY_REVOKE_STATUS_Max (0xFFFFFFFFUL) /*!< Max enumerator value of STATUS field.                   */
  #define OICR_NORDIC_ROT_PUBKEY_REVOKE_STATUS_NotRevoked (0xFFFFFFFFUL) /*!< Key not revoked.                                 */



/* ============================================ Struct OICR_NORDIC_ROT_AUTHOPKEY ============================================= */
/**
  * @brief AUTHOPKEY [OICR_NORDIC_ROT_AUTHOPKEY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DIGEST[8];                         /*!< (@ 0x00000000) First 256 bits of SHA2-512 digest over RoT
                                                                         authenticated operation public key generation [n].*/     
  __IOM uint32_t  REVOKE[3];                         /*!< (@ 0x00000020) Revocation status for RoT authenticated operation
                                                                         public key generation [n].*/                             
} NRF_OICR_NORDIC_ROT_AUTHOPKEY_Type;                /*!< Size = 44 (0x02C)                                                    */
  #define OICR_NORDIC_ROT_AUTHOPKEY_MaxCount (4UL)   /*!< Max size of AUTHOPKEY[4] array.                                      */

/* OICR_NORDIC_ROT_AUTHOPKEY_DIGEST: First 256 bits of SHA2-512 digest over RoT authenticated operation public key generation
                                      [n]. */                                                                                     
                                                                                                                                  
  #define OICR_NORDIC_ROT_AUTHOPKEY_DIGEST_MaxCount (8UL) /*!< Max size of DIGEST[8] array.                                    */
  #define OICR_NORDIC_ROT_AUTHOPKEY_DIGEST_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DIGEST[8] register.                   */

/* VALUE @Bits 0..31 : Value for word [o] in the key digest [n]. */
  #define OICR_NORDIC_ROT_AUTHOPKEY_DIGEST_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define OICR_NORDIC_ROT_AUTHOPKEY_DIGEST_VALUE_Msk (0xFFFFFFFFUL << OICR_NORDIC_ROT_AUTHOPKEY_DIGEST_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/                                     


/* OICR_NORDIC_ROT_AUTHOPKEY_REVOKE: Revocation status for RoT authenticated operation public key generation [n]. */
  #define OICR_NORDIC_ROT_AUTHOPKEY_REVOKE_MaxCount (3UL) /*!< Max size of REVOKE[3] array.                                    */
  #define OICR_NORDIC_ROT_AUTHOPKEY_REVOKE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of REVOKE[3] register.                   */

/* STATUS @Bits 0..31 : Revocation status. */
  #define OICR_NORDIC_ROT_AUTHOPKEY_REVOKE_STATUS_Pos (0UL) /*!< Position of STATUS field.                                     */
  #define OICR_NORDIC_ROT_AUTHOPKEY_REVOKE_STATUS_Msk (0xFFFFFFFFUL << OICR_NORDIC_ROT_AUTHOPKEY_REVOKE_STATUS_Pos) /*!< Bit
                                                                            mask of STATUS field.*/                               
  #define OICR_NORDIC_ROT_AUTHOPKEY_REVOKE_STATUS_Min (0xFFFFFFFFUL) /*!< Min enumerator value of STATUS field.                */
  #define OICR_NORDIC_ROT_AUTHOPKEY_REVOKE_STATUS_Max (0xFFFFFFFFUL) /*!< Max enumerator value of STATUS field.                */
  #define OICR_NORDIC_ROT_AUTHOPKEY_REVOKE_STATUS_NotRevoked (0xFFFFFFFFUL) /*!< Key not revoked.                              */



/* ============================================== Struct OICR_NORDIC_ROT_AES256 ============================================== */
/**
  * @brief AES256 [OICR_NORDIC_ROT_AES256] (unspecified)
  */
typedef struct {
  __IOM uint32_t  VALUE[8];                          /*!< (@ 0x00000000) RoT AES256 encryption key generation [n].             */
} NRF_OICR_NORDIC_ROT_AES256_Type;                   /*!< Size = 32 (0x020)                                                    */
  #define OICR_NORDIC_ROT_AES256_MaxCount (2UL)      /*!< Max size of AES256[2] array.                                         */

/* OICR_NORDIC_ROT_AES256_VALUE: RoT AES256 encryption key generation [n]. */
  #define OICR_NORDIC_ROT_AES256_VALUE_MaxCount (8UL) /*!< Max size of VALUE[8] array.                                         */
  #define OICR_NORDIC_ROT_AES256_VALUE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VALUE[8] register.                        */

/* VALUE @Bits 0..31 : Value for word [o] in the key value [n]. */
  #define OICR_NORDIC_ROT_AES256_VALUE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                           */
  #define OICR_NORDIC_ROT_AES256_VALUE_VALUE_Msk (0xFFFFFFFFUL << OICR_NORDIC_ROT_AES256_VALUE_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/                                              



/* =============================================== Struct OICR_NORDIC_ROT_SM4 ================================================ */
/**
  * @brief SM4 [OICR_NORDIC_ROT_SM4] (unspecified)
  */
typedef struct {
  __IOM uint32_t  VALUE[4];                          /*!< (@ 0x00000000) RoT SM4 encryption key generation [n].                */
} NRF_OICR_NORDIC_ROT_SM4_Type;                      /*!< Size = 16 (0x010)                                                    */
  #define OICR_NORDIC_ROT_SM4_MaxCount (4UL)         /*!< Max size of SM4[4] array.                                            */

/* OICR_NORDIC_ROT_SM4_VALUE: RoT SM4 encryption key generation [n]. */
  #define OICR_NORDIC_ROT_SM4_VALUE_MaxCount (4UL)   /*!< Max size of VALUE[4] array.                                          */
  #define OICR_NORDIC_ROT_SM4_VALUE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VALUE[4] register.                           */

/* VALUE @Bits 0..31 : Value for word [o] in the key value [n]. */
  #define OICR_NORDIC_ROT_SM4_VALUE_VALUE_Pos (0UL)  /*!< Position of VALUE field.                                             */
  #define OICR_NORDIC_ROT_SM4_VALUE_VALUE_Msk (0xFFFFFFFFUL << OICR_NORDIC_ROT_SM4_VALUE_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/                                              



/* ================================================= Struct OICR_NORDIC_ROT ================================================== */
/**
  * @brief ROT [OICR_NORDIC_ROT] Assets installed to establish initial Root of Trust in the device.
  */
typedef struct {
  __IOM NRF_OICR_NORDIC_ROT_PUBKEY_Type PUBKEY[4];   /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_OICR_NORDIC_ROT_AUTHOPKEY_Type AUTHOPKEY[4]; /*!< (@ 0x000000B0) (unspecified)                                     */
  __IOM NRF_OICR_NORDIC_ROT_AES256_Type AES256[2];   /*!< (@ 0x00000160) (unspecified)                                         */
  __IOM NRF_OICR_NORDIC_ROT_SM4_Type SM4[4];         /*!< (@ 0x000001A0) (unspecified)                                         */
} NRF_OICR_NORDIC_ROT_Type;                          /*!< Size = 480 (0x1E0)                                                   */


