adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ================================================= Struct OICR_NORDIC_LCS ================================================== */
/**
  * @brief LCS [OICR_NORDIC_LCS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  FFF[3];                            /*!< (@ 0x00000000) Life cycle state FFF encoding.                        */
  __IOM uint32_t  DISCARDED[3];                      /*!< (@ 0x0000000C) Life cycle state DISCARDED encoding.                  */
  __IOM uint32_t  ANALYSIS[3];                       /*!< (@ 0x00000018) Life cycle state ANALYSIS encoding.                   */
} NRF_OICR_NORDIC_LCS_Type;                          /*!< Size = 36 (0x024)                                                    */


/* =================================================== Struct OICR_NORDIC ==================================================== */
/**
  * @brief NORDIC [OICR_NORDIC] (unspecified)
  */
typedef struct {
  __IOM NRF_OICR_NORDIC_ROT_Type ROT;                /*!< (@ 0x00000000) Assets installed to establish initial Root of Trust in
                                                                         the device.*/                                            
  __IOM NRF_OICR_NORDIC_LCS_Type LCS;                /*!< (@ 0x000001E0) (unspecified)                                         */
  __IOM uint32_t  POLICY[8];                         /*!< (@ 0x00000204) ROM enforced device policy                            */
} NRF_OICR_NORDIC_Type;                              /*!< Size = 548 (0x224)                                                   */

/* OICR_NORDIC_POLICY: ROM enforced device policy */
  #define OICR_NORDIC_POLICY_MaxCount (8UL)          /*!< Max size of POLICY[8] array.                                         */
  #define OICR_NORDIC_POLICY_ResetValue (0xFFFFFFFFUL) /*!< Reset value of POLICY[8] register.                                 */

/* TBD @Bits 0..31 : ROM policy description. */
  #define OICR_NORDIC_POLICY_TBD_Pos (0UL)           /*!< Position of TBD field.                                               */
  #define OICR_NORDIC_POLICY_TBD_Msk (0xFFFFFFFFUL << OICR_NORDIC_POLICY_TBD_Pos) /*!< Bit mask of TBD field.                  */



/* ================================================== Struct OICR_PICR_MEM =================================================== */
/**
  * @brief MEM [OICR_PICR_MEM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ADDR;                              /*!< (@ 0x00000000) Start address of the memory to be blocked             */
  __IOM uint32_t  SIZE;                              /*!< (@ 0x00000004) Size of the memory to be blocked                      */
} NRF_OICR_PICR_MEM_Type;                            /*!< Size = 8 (0x008)                                                     */
  #define OICR_PICR_MEM_MaxCount (8UL)               /*!< Max size of MEM[8] array.                                            */

/* OICR_PICR_MEM_ADDR: Start address of the memory to be blocked */
  #define OICR_PICR_MEM_ADDR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ADDR register.                                      */

/* ADDR @Bits 0..31 : Memory start address */
  #define OICR_PICR_MEM_ADDR_ADDR_Pos (0UL)          /*!< Position of ADDR field.                                              */
  #define OICR_PICR_MEM_ADDR_ADDR_Msk (0xFFFFFFFFUL << OICR_PICR_MEM_ADDR_ADDR_Pos) /*!< Bit mask of ADDR field.               */
  #define OICR_PICR_MEM_ADDR_ADDR_Min (0xFFFFFFFFUL) /*!< Min enumerator value of ADDR field.                                  */
  #define OICR_PICR_MEM_ADDR_ADDR_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ADDR field.                                  */
  #define OICR_PICR_MEM_ADDR_ADDR_NotBlocked (0xFFFFFFFFUL) /*!< Memory not blocked                                            */


/* OICR_PICR_MEM_SIZE: Size of the memory to be blocked */
  #define OICR_PICR_MEM_SIZE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of SIZE register.                                      */

/* SIZE @Bits 0..31 : Memory size in bytes */
  #define OICR_PICR_MEM_SIZE_SIZE_Pos (0UL)          /*!< Position of SIZE field.                                              */
  #define OICR_PICR_MEM_SIZE_SIZE_Msk (0xFFFFFFFFUL << OICR_PICR_MEM_SIZE_SIZE_Pos) /*!< Bit mask of SIZE field.               */



/* ================================================= Struct OICR_PICR_PERIPH ================================================= */
/**
  * @brief PERIPH [OICR_PICR_PERIPH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ADDR;                              /*!< (@ 0x00000000) Start address of the peripheral to be blocked         */
  __IOM uint32_t  SIZE;                              /*!< (@ 0x00000004) Number of peripherals to be blocked                   */
} NRF_OICR_PICR_PERIPH_Type;                         /*!< Size = 8 (0x008)                                                     */
  #define OICR_PICR_PERIPH_MaxCount (8UL)            /*!< Max size of PERIPH[8] array.                                         */

/* OICR_PICR_PERIPH_ADDR: Start address of the peripheral to be blocked */
  #define OICR_PICR_PERIPH_ADDR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ADDR register.                                   */

/* ADDR @Bits 0..31 : Peripheral start address */
  #define OICR_PICR_PERIPH_ADDR_ADDR_Pos (0UL)       /*!< Position of ADDR field.                                              */
  #define OICR_PICR_PERIPH_ADDR_ADDR_Msk (0xFFFFFFFFUL << OICR_PICR_PERIPH_ADDR_ADDR_Pos) /*!< Bit mask of ADDR field.         */
  #define OICR_PICR_PERIPH_ADDR_ADDR_Min (0xFFFFFFFFUL) /*!< Min enumerator value of ADDR field.                               */
  #define OICR_PICR_PERIPH_ADDR_ADDR_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ADDR field.                               */
  #define OICR_PICR_PERIPH_ADDR_ADDR_NotBlocked (0xFFFFFFFFUL) /*!< Peripheral not blocked                                     */


/* OICR_PICR_PERIPH_SIZE: Number of peripherals to be blocked */
  #define OICR_PICR_PERIPH_SIZE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of SIZE register.                                   */

/* SIZE @Bits 0..31 : Peripheral size in 4Kbytes. */
  #define OICR_PICR_PERIPH_SIZE_SIZE_Pos (0UL)       /*!< Position of SIZE field.                                              */
  #define OICR_PICR_PERIPH_SIZE_SIZE_Msk (0xFFFFFFFFUL << OICR_PICR_PERIPH_SIZE_SIZE_Pos) /*!< Bit mask of SIZE field.         */



/* ==================================================== Struct OICR_PICR ===================================================== */
/**
  * @brief PICR [OICR_PICR] Product (paper-spin) Information Configuration Registers
  */
typedef struct {
  __IOM uint32_t  DOMAIN;                            /*!< (@ 0x00000000) Block use of a domain                                 */
  __IM  uint32_t  RESERVED[3];
  __IOM NRF_OICR_PICR_MEM_Type MEM[8];               /*!< (@ 0x00000010) (unspecified)                                         */
  __IOM NRF_OICR_PICR_PERIPH_Type PERIPH[8];         /*!< (@ 0x00000050) (unspecified)                                         */
  __IOM uint32_t  GPIO[32];                          /*!< (@ 0x00000090) GPIO configuration to block a pin or port             */
} NRF_OICR_PICR_Type;                                /*!< Size = 272 (0x110)                                                   */

/* OICR_PICR_DOMAIN: Block use of a domain */
  #define OICR_PICR_DOMAIN_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DOMAIN register.                                      */

