adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ID0 @Bits 0..3 : Domain identifier of the domain to be blocked */
  #define OICR_PICR_DOMAIN_ID0_Pos (0UL)             /*!< Position of ID0 field.                                               */
  #define OICR_PICR_DOMAIN_ID0_Msk (0xFUL << OICR_PICR_DOMAIN_ID0_Pos) /*!< Bit mask of ID0 field.                             */
  #define OICR_PICR_DOMAIN_ID0_Min (0xFUL)           /*!< Min enumerator value of ID0 field.                                   */
  #define OICR_PICR_DOMAIN_ID0_Max (0xFUL)           /*!< Max enumerator value of ID0 field.                                   */
  #define OICR_PICR_DOMAIN_ID0_NotBlocked (0xFUL)    /*!< Domain not blocked                                                   */

/* ID1 @Bits 4..7 : Domain identifier of the domain to be blocked */
  #define OICR_PICR_DOMAIN_ID1_Pos (4UL)             /*!< Position of ID1 field.                                               */
  #define OICR_PICR_DOMAIN_ID1_Msk (0xFUL << OICR_PICR_DOMAIN_ID1_Pos) /*!< Bit mask of ID1 field.                             */
  #define OICR_PICR_DOMAIN_ID1_Min (0xFUL)           /*!< Min enumerator value of ID1 field.                                   */
  #define OICR_PICR_DOMAIN_ID1_Max (0xFUL)           /*!< Max enumerator value of ID1 field.                                   */
  #define OICR_PICR_DOMAIN_ID1_NotBlocked (0xFUL)    /*!< Domain not blocked                                                   */

/* ID2 @Bits 8..11 : Domain identifier of the domain to be blocked */
  #define OICR_PICR_DOMAIN_ID2_Pos (8UL)             /*!< Position of ID2 field.                                               */
  #define OICR_PICR_DOMAIN_ID2_Msk (0xFUL << OICR_PICR_DOMAIN_ID2_Pos) /*!< Bit mask of ID2 field.                             */
  #define OICR_PICR_DOMAIN_ID2_Min (0xFUL)           /*!< Min enumerator value of ID2 field.                                   */
  #define OICR_PICR_DOMAIN_ID2_Max (0xFUL)           /*!< Max enumerator value of ID2 field.                                   */
  #define OICR_PICR_DOMAIN_ID2_NotBlocked (0xFUL)    /*!< Domain not blocked                                                   */

/* ID3 @Bits 12..15 : Domain identifier of the domain to be blocked */
  #define OICR_PICR_DOMAIN_ID3_Pos (12UL)            /*!< Position of ID3 field.                                               */
  #define OICR_PICR_DOMAIN_ID3_Msk (0xFUL << OICR_PICR_DOMAIN_ID3_Pos) /*!< Bit mask of ID3 field.                             */
  #define OICR_PICR_DOMAIN_ID3_Min (0xFUL)           /*!< Min enumerator value of ID3 field.                                   */
  #define OICR_PICR_DOMAIN_ID3_Max (0xFUL)           /*!< Max enumerator value of ID3 field.                                   */
  #define OICR_PICR_DOMAIN_ID3_NotBlocked (0xFUL)    /*!< Domain not blocked                                                   */

/* ID4 @Bits 16..19 : Domain identifier of the domain to be blocked */
  #define OICR_PICR_DOMAIN_ID4_Pos (16UL)            /*!< Position of ID4 field.                                               */
  #define OICR_PICR_DOMAIN_ID4_Msk (0xFUL << OICR_PICR_DOMAIN_ID4_Pos) /*!< Bit mask of ID4 field.                             */
  #define OICR_PICR_DOMAIN_ID4_Min (0xFUL)           /*!< Min enumerator value of ID4 field.                                   */
  #define OICR_PICR_DOMAIN_ID4_Max (0xFUL)           /*!< Max enumerator value of ID4 field.                                   */
  #define OICR_PICR_DOMAIN_ID4_NotBlocked (0xFUL)    /*!< Domain not blocked                                                   */

/* ID5 @Bits 20..23 : Domain identifier of the domain to be blocked */
  #define OICR_PICR_DOMAIN_ID5_Pos (20UL)            /*!< Position of ID5 field.                                               */
  #define OICR_PICR_DOMAIN_ID5_Msk (0xFUL << OICR_PICR_DOMAIN_ID5_Pos) /*!< Bit mask of ID5 field.                             */
  #define OICR_PICR_DOMAIN_ID5_Min (0xFUL)           /*!< Min enumerator value of ID5 field.                                   */
  #define OICR_PICR_DOMAIN_ID5_Max (0xFUL)           /*!< Max enumerator value of ID5 field.                                   */
  #define OICR_PICR_DOMAIN_ID5_NotBlocked (0xFUL)    /*!< Domain not blocked                                                   */

/* ID6 @Bits 24..27 : Domain identifier of the domain to be blocked */
  #define OICR_PICR_DOMAIN_ID6_Pos (24UL)            /*!< Position of ID6 field.                                               */
  #define OICR_PICR_DOMAIN_ID6_Msk (0xFUL << OICR_PICR_DOMAIN_ID6_Pos) /*!< Bit mask of ID6 field.                             */
  #define OICR_PICR_DOMAIN_ID6_Min (0xFUL)           /*!< Min enumerator value of ID6 field.                                   */
  #define OICR_PICR_DOMAIN_ID6_Max (0xFUL)           /*!< Max enumerator value of ID6 field.                                   */
  #define OICR_PICR_DOMAIN_ID6_NotBlocked (0xFUL)    /*!< Domain not blocked                                                   */

/* ID7 @Bits 28..31 : Domain identifier of the domain to be blocked */
  #define OICR_PICR_DOMAIN_ID7_Pos (28UL)            /*!< Position of ID7 field.                                               */
  #define OICR_PICR_DOMAIN_ID7_Msk (0xFUL << OICR_PICR_DOMAIN_ID7_Pos) /*!< Bit mask of ID7 field.                             */
  #define OICR_PICR_DOMAIN_ID7_Min (0xFUL)           /*!< Min enumerator value of ID7 field.                                   */
  #define OICR_PICR_DOMAIN_ID7_Max (0xFUL)           /*!< Max enumerator value of ID7 field.                                   */
  #define OICR_PICR_DOMAIN_ID7_NotBlocked (0xFUL)    /*!< Domain not blocked                                                   */


/* OICR_PICR_GPIO: GPIO configuration to block a pin or port */
  #define OICR_PICR_GPIO_MaxCount (32UL)             /*!< Max size of GPIO[32] array.                                          */
  #define OICR_PICR_GPIO_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of GPIO[32] register.                                    */

/* PIN @Bits 0..4 : Pin number */
  #define OICR_PICR_GPIO_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define OICR_PICR_GPIO_PIN_Msk (0x1FUL << OICR_PICR_GPIO_PIN_Pos) /*!< Bit mask of PIN field.                                */

/* PORT @Bits 8..11 : Port number */
  #define OICR_PICR_GPIO_PORT_Pos (8UL)              /*!< Position of PORT field.                                              */
  #define OICR_PICR_GPIO_PORT_Msk (0xFUL << OICR_PICR_GPIO_PORT_Pos) /*!< Bit mask of PORT field.                              */

