adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ENABLE @Bits 12..13 : Enable blocking */
  #define OICR_PICR_GPIO_ENABLE_Pos (12UL)           /*!< Position of ENABLE field.                                            */
  #define OICR_PICR_GPIO_ENABLE_Msk (0x3UL << OICR_PICR_GPIO_ENABLE_Pos) /*!< Bit mask of ENABLE field.                        */
  #define OICR_PICR_GPIO_ENABLE_Min (0x0UL)          /*!< Min enumerator value of ENABLE field.                                */
  #define OICR_PICR_GPIO_ENABLE_Max (0x3UL)          /*!< Max enumerator value of ENABLE field.                                */
  #define OICR_PICR_GPIO_ENABLE_PinBlock (0x0UL)     /*!< GPIO pin block is enabled                                            */
  #define OICR_PICR_GPIO_ENABLE_PortBlock (0x2UL)    /*!< Enable blocking a whole port                                         */
  #define OICR_PICR_GPIO_ENABLE_Disabled (0x3UL)     /*!< GPIO pin block is disabled                                           */



/* =================================================== Struct OICR_FWPATCH =================================================== */
/**
  * @brief FWPATCH [OICR_FWPATCH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PATCHADDR[256];                    /*!< (@ 0x00000000) Patch address for patch entry point n.                */
  __IOM uint32_t  TRAPADDR[8];                       /*!< (@ 0x00000400) Addresses in the ROM code which will be trapped to the
                                                                         PATCHADDR target.*/                                      
  __IOM uint32_t  PATCHCODE[2808];                   /*!< (@ 0x00000420) Patch code area.                                      */
} NRF_OICR_FWPATCH_Type;                             /*!< Size = 12288 (0x3000)                                                */

/* OICR_FWPATCH_PATCHADDR: Patch address for patch entry point n. */
  #define OICR_FWPATCH_PATCHADDR_MaxCount (256UL)    /*!< Max size of PATCHADDR[256] array.                                    */
  #define OICR_FWPATCH_PATCHADDR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PATCHADDR[256] register.                        */

/* ADDR @Bits 0..31 : Address */
  #define OICR_FWPATCH_PATCHADDR_ADDR_Pos (0UL)      /*!< Position of ADDR field.                                              */
  #define OICR_FWPATCH_PATCHADDR_ADDR_Msk (0xFFFFFFFFUL << OICR_FWPATCH_PATCHADDR_ADDR_Pos) /*!< Bit mask of ADDR field.       */


/* OICR_FWPATCH_TRAPADDR: Addresses in the ROM code which will be trapped to the PATCHADDR target. */
  #define OICR_FWPATCH_TRAPADDR_MaxCount (8UL)       /*!< Max size of TRAPADDR[8] array.                                       */
  #define OICR_FWPATCH_TRAPADDR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRAPADDR[8] register.                            */

/* VALUE @Bits 0..31 : Value */
  #define OICR_FWPATCH_TRAPADDR_VALUE_Pos (0UL)      /*!< Position of VALUE field.                                             */
  #define OICR_FWPATCH_TRAPADDR_VALUE_Msk (0xFFFFFFFFUL << OICR_FWPATCH_TRAPADDR_VALUE_Pos) /*!< Bit mask of VALUE field.      */


/* OICR_FWPATCH_PATCHCODE: Patch code area. */
  #define OICR_FWPATCH_PATCHCODE_MaxCount (2808UL)   /*!< Max size of PATCHCODE[2808] array.                                   */
  #define OICR_FWPATCH_PATCHCODE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PATCHCODE[2808] register.                       */

/* DATA @Bits 0..31 : Data */
  #define OICR_FWPATCH_PATCHCODE_DATA_Pos (0UL)      /*!< Position of DATA field.                                              */
  #define OICR_FWPATCH_PATCHCODE_DATA_Msk (0xFFFFFFFFUL << OICR_FWPATCH_PATCHCODE_DATA_Pos) /*!< Bit mask of DATA field.       */


/* ======================================================= Struct OICR ======================================================= */
/**
  * @brief One time programmable Information Configuration Registers
  */
  typedef struct {                                   /*!< OICR Structure                                                       */
    __IOM NRF_OICR_DEVICE_Type DEVICE;               /*!< (@ 0x00000000) (unspecified)                                         */
    __IOM NRF_OICR_PUF_Type PUF;                     /*!< (@ 0x00000040) (unspecified)                                         */
    __IM uint32_t RESERVED[3];
    __IOM NRF_OICR_PRECALIB_Type PRECALIB;           /*!< (@ 0x00000050) (unspecified)                                         */
    __IM uint32_t RESERVED1[3];
    __IOM NRF_OICR_MRAM_Type MRAM[2];                /*!< (@ 0x00000260) (unspecified)                                         */
    __IM uint32_t RESERVED2[2];
    __IOM NRF_OICR_UROT_Type UROT;                   /*!< (@ 0x00000300) (unspecified)                                         */
    __IOM NRF_OICR_USER_Type USER;                   /*!< (@ 0x00000400) (unspecified)                                         */
    __IM uint32_t RESERVED3[72];
    __IOM NRF_OICR_NORDIC_Type NORDIC;               /*!< (@ 0x00000700) (unspecified)                                         */
    __IM uint32_t RESERVED4[55];
    __IOM NRF_OICR_PICR_Type PICR;                   /*!< (@ 0x00000A00) Product (paper-spin) Information Configuration
                                                                         Registers*/                                              
    __IM uint32_t RESERVED5[60];
    __IOM NRF_OICR_FWPATCH_Type FWPATCH;             /*!< (@ 0x00000C00) (unspecified)                                         */
  } NRF_OICR_Type;                                   /*!< Size = 15360 (0x3C00)                                                */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          OSCRFR                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct OSCRFR_CONFIG =================================================== */
/**
  * @brief CONFIG [OSCRFR_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFGSTATIC;                         /*!< (@ 0x00000000) OSCRFR static CFG configuration                       */
} NRF_OSCRFR_CONFIG_Type;                            /*!< Size = 4 (0x004)                                                     */

