adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* OSCRFR_CONFIG_CFGSTATIC: OSCRFR static CFG configuration */
  #define OSCRFR_CONFIG_CFGSTATIC_ResetValue (0x00000000UL) /*!< Reset value of CFGSTATIC register.                            */

/* DOUBLEBIAS @Bit 0 : Enable double bias */
  #define OSCRFR_CONFIG_CFGSTATIC_DOUBLEBIAS_Pos (0UL) /*!< Position of DOUBLEBIAS field.                                      */
  #define OSCRFR_CONFIG_CFGSTATIC_DOUBLEBIAS_Msk (0x1UL << OSCRFR_CONFIG_CFGSTATIC_DOUBLEBIAS_Pos) /*!< Bit mask of DOUBLEBIAS
                                                                            field.*/                                              
  #define OSCRFR_CONFIG_CFGSTATIC_DOUBLEBIAS_Min (0x0UL) /*!< Min enumerator value of DOUBLEBIAS field.                        */
  #define OSCRFR_CONFIG_CFGSTATIC_DOUBLEBIAS_Max (0x1UL) /*!< Max enumerator value of DOUBLEBIAS field.                        */
  #define OSCRFR_CONFIG_CFGSTATIC_DOUBLEBIAS_Disabled (0x0UL) /*!< Disabled                                                    */
  #define OSCRFR_CONFIG_CFGSTATIC_DOUBLEBIAS_Enabled (0x1UL) /*!< Enabled                                                      */

/* TRIGDELAY @Bit 1 : Increase TRIG signal delay */
  #define OSCRFR_CONFIG_CFGSTATIC_TRIGDELAY_Pos (1UL) /*!< Position of TRIGDELAY field.                                        */
  #define OSCRFR_CONFIG_CFGSTATIC_TRIGDELAY_Msk (0x1UL << OSCRFR_CONFIG_CFGSTATIC_TRIGDELAY_Pos) /*!< Bit mask of TRIGDELAY
                                                                            field.*/                                              
  #define OSCRFR_CONFIG_CFGSTATIC_TRIGDELAY_Min (0x0UL) /*!< Min enumerator value of TRIGDELAY field.                          */
  #define OSCRFR_CONFIG_CFGSTATIC_TRIGDELAY_Max (0x1UL) /*!< Max enumerator value of TRIGDELAY field.                          */
  #define OSCRFR_CONFIG_CFGSTATIC_TRIGDELAY_Disabled (0x0UL) /*!< Disabled                                                     */
  #define OSCRFR_CONFIG_CFGSTATIC_TRIGDELAY_Enabled (0x1UL) /*!< Enabled                                                       */

/* SPARE @Bit 2 : Spare */
  #define OSCRFR_CONFIG_CFGSTATIC_SPARE_Pos (2UL)    /*!< Position of SPARE field.                                             */
  #define OSCRFR_CONFIG_CFGSTATIC_SPARE_Msk (0x1UL << OSCRFR_CONFIG_CFGSTATIC_SPARE_Pos) /*!< Bit mask of SPARE field.         */



/* =================================================== Struct OSCRFR_TRIM ==================================================== */
/**
  * @brief TRIM [OSCRFR_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  OSC;                               /*!< (@ 0x00000000) Oscillation period trimming                           */
  __IOM uint32_t  IBPSR;                             /*!< (@ 0x00000004) IBPSR current trimming                                */
} NRF_OSCRFR_TRIM_Type;                              /*!< Size = 8 (0x008)                                                     */

/* OSCRFR_TRIM_OSC: Oscillation period trimming */
  #define OSCRFR_TRIM_OSC_ResetValue (0x00000000UL)  /*!< Reset value of OSC register.                                         */

/* VAL @Bits 0..2 : Oscillation period trimming value */
  #define OSCRFR_TRIM_OSC_VAL_Pos (0UL)              /*!< Position of VAL field.                                               */
  #define OSCRFR_TRIM_OSC_VAL_Msk (0x7UL << OSCRFR_TRIM_OSC_VAL_Pos) /*!< Bit mask of VAL field.                               */
  #define OSCRFR_TRIM_OSC_VAL_Min (0x0UL)            /*!< Min enumerator value of VAL field.                                   */
  #define OSCRFR_TRIM_OSC_VAL_Max (0x7UL)            /*!< Max enumerator value of VAL field.                                   */
  #define OSCRFR_TRIM_OSC_VAL_Normal (0x0UL)         /*!< Normal trim value                                                    */
  #define OSCRFR_TRIM_OSC_VAL_Val23 (0x1UL)          /*!< The trim value is 35 percent                                         */
  #define OSCRFR_TRIM_OSC_VAL_Val54 (0x2UL)          /*!< The trim value is 154 percent                                        */
  #define OSCRFR_TRIM_OSC_VAL_Val98 (0x3UL)          /*!< The trim value is 670 percent                                        */
  #define OSCRFR_TRIM_OSC_VAL_ValNeg51 (0x4UL)       /*!< The trim value is -54 percent                                        */
  #define OSCRFR_TRIM_OSC_VAL_ValNeg42 (0x5UL)       /*!< The trim value is -49 percent                                        */
  #define OSCRFR_TRIM_OSC_VAL_ValNeg31 (0x6UL)       /*!< The trim value is -37 percent                                        */
  #define OSCRFR_TRIM_OSC_VAL_ValNeg18 (0x7UL)       /*!< The trim value is -26 percent                                        */


/* OSCRFR_TRIM_IBPSR: IBPSR current trimming */
  #define OSCRFR_TRIM_IBPSR_ResetValue (0x00000000UL) /*!< Reset value of IBPSR register.                                      */

/* VAL @Bits 0..3 : IBPSR current and VREF voltage trimming value */
  #define OSCRFR_TRIM_IBPSR_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define OSCRFR_TRIM_IBPSR_VAL_Msk (0xFUL << OSCRFR_TRIM_IBPSR_VAL_Pos) /*!< Bit mask of VAL field.                           */
  #define OSCRFR_TRIM_IBPSR_VAL_Min (0xFFFFFFFFUL)   /*!< Min value of VAL field.                                              */
  #define OSCRFR_TRIM_IBPSR_VAL_Max (0xFFFFFFFFUL)   /*!< Max size of VAL field.                                               */



/* ================================================= Struct OSCRFR_OVERRIDE ================================================== */
/**
  * @brief OVERRIDE [OSCRFR_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000008) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x0000000C) Override the SETTLED signal from the analog module    */
} NRF_OSCRFR_OVERRIDE_Type;                          /*!< Size = 16 (0x010)                                                    */

/* OSCRFR_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define OSCRFR_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                  */

/* VAL @Bit 0 : Override value for the signal */
  #define OSCRFR_OVERRIDE_PWRUP_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define OSCRFR_OVERRIDE_PWRUP_VAL_Msk (0x1UL << OSCRFR_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define OSCRFR_OVERRIDE_PWRUP_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define OSCRFR_OVERRIDE_PWRUP_EN_Msk (0x1UL << OSCRFR_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                      */
  #define OSCRFR_OVERRIDE_PWRUP_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define OSCRFR_OVERRIDE_PWRUP_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define OSCRFR_OVERRIDE_PWRUP_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define OSCRFR_OVERRIDE_PWRUP_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */


