adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* OSCRFR_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define OSCRFR_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                                */

/* VAL @Bit 0 : Override value for the signal */
  #define OSCRFR_OVERRIDE_RETAIN_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define OSCRFR_OVERRIDE_RETAIN_VAL_Msk (0x1UL << OSCRFR_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define OSCRFR_OVERRIDE_RETAIN_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define OSCRFR_OVERRIDE_RETAIN_EN_Msk (0x1UL << OSCRFR_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.                    */
  #define OSCRFR_OVERRIDE_RETAIN_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define OSCRFR_OVERRIDE_RETAIN_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define OSCRFR_OVERRIDE_RETAIN_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define OSCRFR_OVERRIDE_RETAIN_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */


/* OSCRFR_OVERRIDE_READY: Override the READY signal from the analog module */
  #define OSCRFR_OVERRIDE_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                                  */

/* VAL @Bit 0 : Current value of the signal */
  #define OSCRFR_OVERRIDE_READY_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define OSCRFR_OVERRIDE_READY_VAL_Msk (0x1UL << OSCRFR_OVERRIDE_READY_VAL_Pos) /*!< Bit mask of VAL field.                   */

/* EN @Bit 31 : Enable the override */
  #define OSCRFR_OVERRIDE_READY_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define OSCRFR_OVERRIDE_READY_EN_Msk (0x1UL << OSCRFR_OVERRIDE_READY_EN_Pos) /*!< Bit mask of EN field.                      */
  #define OSCRFR_OVERRIDE_READY_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define OSCRFR_OVERRIDE_READY_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define OSCRFR_OVERRIDE_READY_EN_Disabled (0x0UL)  /*!< Override is disabled                                                 */
  #define OSCRFR_OVERRIDE_READY_EN_Enabled (0x1UL)   /*!< Override is enabled                                                  */


/* OSCRFR_OVERRIDE_SETTLED: Override the SETTLED signal from the analog module */
  #define OSCRFR_OVERRIDE_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of SETTLED register.                              */

/* VAL @Bit 0 : Current value of the signal */
  #define OSCRFR_OVERRIDE_SETTLED_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define OSCRFR_OVERRIDE_SETTLED_VAL_Msk (0x1UL << OSCRFR_OVERRIDE_SETTLED_VAL_Pos) /*!< Bit mask of VAL field.               */

/* EN @Bit 31 : Enable the override */
  #define OSCRFR_OVERRIDE_SETTLED_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define OSCRFR_OVERRIDE_SETTLED_EN_Msk (0x1UL << OSCRFR_OVERRIDE_SETTLED_EN_Pos) /*!< Bit mask of EN field.                  */
  #define OSCRFR_OVERRIDE_SETTLED_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define OSCRFR_OVERRIDE_SETTLED_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define OSCRFR_OVERRIDE_SETTLED_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define OSCRFR_OVERRIDE_SETTLED_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */



/* ==================================================== Struct OSCRFR_DFT ==================================================== */
/**
  * @brief DFT [OSCRFR_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IM  uint32_t  RESERVED[3];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  DTB3CONFIG;                        /*!< (@ 0x0000001C) Digital Test Bus 3 (DTB3) configuration               */
  __IM  uint32_t  RESERVED2[4];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
} NRF_OSCRFR_DFT_Type;                               /*!< Size = 52 (0x034)                                                    */

/* OSCRFR_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define OSCRFR_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                             */

/* SELMUX @Bit 0 : Select multiplexer for ATB0 */
  #define OSCRFR_DFT_ATB0CONFIG_SELMUX_Pos (0UL)     /*!< Position of SELMUX field.                                            */
  #define OSCRFR_DFT_ATB0CONFIG_SELMUX_Msk (0x1UL << OSCRFR_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.          */
  #define OSCRFR_DFT_ATB0CONFIG_SELMUX_Min (0x0UL)   /*!< Min enumerator value of SELMUX field.                                */
  #define OSCRFR_DFT_ATB0CONFIG_SELMUX_Max (0x1UL)   /*!< Max enumerator value of SELMUX field.                                */
  #define OSCRFR_DFT_ATB0CONFIG_SELMUX_IBPSR4U (0x0UL) /*!< IBPSR_4U signal selected                                           */
  #define OSCRFR_DFT_ATB0CONFIG_SELMUX_IBPP50N (0x1UL) /*!< IBPP_50N signal selected                                           */

