adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* OSCRFR_MODE: Oscillator mode */
  #define OSCRFR_MODE_ResetValue (0x00000000UL)      /*!< Reset value of MODE register.                                        */

/* MODE @Bit 0 : Mode */
  #define OSCRFR_MODE_MODE_Pos (0UL)                 /*!< Position of MODE field.                                              */
  #define OSCRFR_MODE_MODE_Msk (0x1UL << OSCRFR_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                    */
  #define OSCRFR_MODE_MODE_Min (0x0UL)               /*!< Min enumerator value of MODE field.                                  */
  #define OSCRFR_MODE_MODE_Max (0x1UL)               /*!< Max enumerator value of MODE field.                                  */
  #define OSCRFR_MODE_MODE_Normal (0x0UL)            /*!< Normal mode - Use internal oscillator                                */
  #define OSCRFR_MODE_MODE_Bypass (0x1UL)            /*!< Bypass mode - Use OSC_RFR_DIG_AO_0V8 signal                          */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           OTPC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct OTPC_POWER ==================================================== */
/**
  * @brief POWER [OTPC_POWER] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INIT;                              /*!< (@ 0x00000000) Initiates power mode switching sequence.              */
  __IOM uint32_t  MASK;                              /*!< (@ 0x00000004) Mask for overriding of the various voltage supplies
                                                                         while switching power modes.*/                           
  __IM  uint32_t  STATUS;                            /*!< (@ 0x00000008) Status on the power up/down sequence.                 */
  __IM  uint32_t  POWERUPACK;                        /*!< (@ 0x0000000C) Status of the power control signals acknowledgment
                                                                         during power up sequence.*/                              
  __IM  uint32_t  POWERDOWNACK;                      /*!< (@ 0x00000010) Status of the power control signals acknowledgment
                                                                         during power down sequence.*/                            
  __IOM uint32_t  FORCEON;                           /*!< (@ 0x00000014) Force ON the power supply.                            */
  __IOM uint32_t  FORCEOFF;                          /*!< (@ 0x00000018) Force OFF the power supply.                           */
} NRF_OTPC_POWER_Type;                               /*!< Size = 28 (0x01C)                                                    */

/* OTPC_POWER_INIT: Initiates power mode switching sequence. */
  #define OTPC_POWER_INIT_ResetValue (0x00000000UL)  /*!< Reset value of INIT register.                                        */

/* MODE @Bits 0..1 : Switch power mode. */
  #define OTPC_POWER_INIT_MODE_Pos (0UL)             /*!< Position of MODE field.                                              */
  #define OTPC_POWER_INIT_MODE_Msk (0x3UL << OTPC_POWER_INIT_MODE_Pos) /*!< Bit mask of MODE field.                            */
  #define OTPC_POWER_INIT_MODE_Min (0x0UL)           /*!< Min enumerator value of MODE field.                                  */
  #define OTPC_POWER_INIT_MODE_Max (0x1UL)           /*!< Max enumerator value of MODE field.                                  */
  #define OTPC_POWER_INIT_MODE_PowerDown (0x0UL)     /*!< Triggers power down sequence.                                        */
  #define OTPC_POWER_INIT_MODE_PowerUp (0x1UL)       /*!< Triggers power up sequence.                                          */

/* KEY @Bits 16..31 : Key to enable the writing to this register. Writes to this register are ignored if KEY is not set to
                      0xA66D. */                                                                                                  
                                                                                                                                  
  #define OTPC_POWER_INIT_KEY_Pos (16UL)             /*!< Position of KEY field.                                               */
  #define OTPC_POWER_INIT_KEY_Msk (0xFFFFUL << OTPC_POWER_INIT_KEY_Pos) /*!< Bit mask of KEY field.                            */
  #define OTPC_POWER_INIT_KEY_Min (0xA66DUL)         /*!< Min enumerator value of KEY field.                                   */
  #define OTPC_POWER_INIT_KEY_Max (0xA66DUL)         /*!< Max enumerator value of KEY field.                                   */
  #define OTPC_POWER_INIT_KEY_Allowed (0xA66DUL)     /*!< Write is allowed.                                                    */


/* OTPC_POWER_MASK: Mask for overriding of the various voltage supplies while switching power modes. */
  #define OTPC_POWER_MASK_ResetValue (0x00000000UL)  /*!< Reset value of MASK register.                                        */

/* VDD @Bit 0 : Mask VDD */
  #define OTPC_POWER_MASK_VDD_Pos (0UL)              /*!< Position of VDD field.                                               */
  #define OTPC_POWER_MASK_VDD_Msk (0x1UL << OTPC_POWER_MASK_VDD_Pos) /*!< Bit mask of VDD field.                               */
  #define OTPC_POWER_MASK_VDD_Min (0x0UL)            /*!< Min enumerator value of VDD field.                                   */
  #define OTPC_POWER_MASK_VDD_Max (0x1UL)            /*!< Max enumerator value of VDD field.                                   */
  #define OTPC_POWER_MASK_VDD_NoOperation (0x0UL)    /*!< No operation.                                                        */
  #define OTPC_POWER_MASK_VDD_Mask (0x1UL)           /*!< Mask VDD                                                             */

/* VDD2 @Bit 1 : Mask VDD2 */
  #define OTPC_POWER_MASK_VDD2_Pos (1UL)             /*!< Position of VDD2 field.                                              */
  #define OTPC_POWER_MASK_VDD2_Msk (0x1UL << OTPC_POWER_MASK_VDD2_Pos) /*!< Bit mask of VDD2 field.                            */
  #define OTPC_POWER_MASK_VDD2_Min (0x0UL)           /*!< Min enumerator value of VDD2 field.                                  */
  #define OTPC_POWER_MASK_VDD2_Max (0x1UL)           /*!< Max enumerator value of VDD2 field.                                  */
  #define OTPC_POWER_MASK_VDD2_NoOperation (0x0UL)   /*!< No operation                                                         */
  #define OTPC_POWER_MASK_VDD2_Mask (0x1UL)          /*!< Mask VDD2                                                            */

/* KEY @Bits 16..31 : Key to enable the writing to this register. Writes to this register are ignored if KEY is not set to
                      0xA66D. */                                                                                                  
                                                                                                                                  
  #define OTPC_POWER_MASK_KEY_Pos (16UL)             /*!< Position of KEY field.                                               */
  #define OTPC_POWER_MASK_KEY_Msk (0xFFFFUL << OTPC_POWER_MASK_KEY_Pos) /*!< Bit mask of KEY field.                            */
  #define OTPC_POWER_MASK_KEY_Min (0xA66DUL)         /*!< Min enumerator value of KEY field.                                   */
  #define OTPC_POWER_MASK_KEY_Max (0xA66DUL)         /*!< Max enumerator value of KEY field.                                   */
  #define OTPC_POWER_MASK_KEY_Allowed (0xA66DUL)     /*!< Write is allowed.                                                    */


/* OTPC_POWER_STATUS: Status on the power up/down sequence. */
  #define OTPC_POWER_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                                     */

/* STATE @Bits 0..2 : The current power up/down state. */
  #define OTPC_POWER_STATUS_STATE_Pos (0UL)          /*!< Position of STATE field.                                             */
  #define OTPC_POWER_STATUS_STATE_Msk (0x7UL << OTPC_POWER_STATUS_STATE_Pos) /*!< Bit mask of STATE field.                     */
  #define OTPC_POWER_STATUS_STATE_Min (0x0UL)        /*!< Min enumerator value of STATE field.                                 */
  #define OTPC_POWER_STATUS_STATE_Max (0x4UL)        /*!< Max enumerator value of STATE field.                                 */
  #define OTPC_POWER_STATUS_STATE_Off (0x0UL)        /*!< OTP is OFF.                                                          */
  #define OTPC_POWER_STATUS_STATE_PowerUpSeq (0x1UL) /*!< OTP power up sequence is active.                                     */
  #define OTPC_POWER_STATUS_STATE_Standby (0x2UL)    /*!< OTP is in standby mode.                                              */
  #define OTPC_POWER_STATUS_STATE_Active (0x3UL)     /*!< OTP is in active mode.                                               */
  #define OTPC_POWER_STATUS_STATE_PowerDownSeq (0x4UL) /*!< OTP power down sequence is active.                                 */


/* OTPC_POWER_POWERUPACK: Status of the power control signals acknowledgment during power up sequence. */
  #define OTPC_POWER_POWERUPACK_ResetValue (0x00000000UL) /*!< Reset value of POWERUPACK register.                             */

/* VDD @Bit 0 : Waiting for VDD up ACK or not. */
  #define OTPC_POWER_POWERUPACK_VDD_Pos (0UL)        /*!< Position of VDD field.                                               */
  #define OTPC_POWER_POWERUPACK_VDD_Msk (0x1UL << OTPC_POWER_POWERUPACK_VDD_Pos) /*!< Bit mask of VDD field.                   */
  #define OTPC_POWER_POWERUPACK_VDD_Min (0x0UL)      /*!< Min enumerator value of VDD field.                                   */
  #define OTPC_POWER_POWERUPACK_VDD_Max (0x1UL)      /*!< Max enumerator value of VDD field.                                   */
  #define OTPC_POWER_POWERUPACK_VDD_NoOperation (0x0UL) /*!< Not waiting for VDD up ACK.                                       */
  #define OTPC_POWER_POWERUPACK_VDD_Ack (0x1UL)      /*!< Waiting for VDD up ACK.                                              */

