adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VDD2 @Bit 1 : Force OFF the VDD2 supply. */
  #define OTPC_POWER_FORCEOFF_VDD2_Pos (1UL)         /*!< Position of VDD2 field.                                              */
  #define OTPC_POWER_FORCEOFF_VDD2_Msk (0x1UL << OTPC_POWER_FORCEOFF_VDD2_Pos) /*!< Bit mask of VDD2 field.                    */
  #define OTPC_POWER_FORCEOFF_VDD2_Min (0x0UL)       /*!< Min enumerator value of VDD2 field.                                  */
  #define OTPC_POWER_FORCEOFF_VDD2_Max (0x1UL)       /*!< Max enumerator value of VDD2 field.                                  */
  #define OTPC_POWER_FORCEOFF_VDD2_NoOperation (0x0UL) /*!< No Force OFF.                                                      */
  #define OTPC_POWER_FORCEOFF_VDD2_ForceOff (0x1UL)  /*!< Force OFF.                                                           */

/* KEY @Bits 16..31 : Key to enable the writing to this register. Writes to this register are ignored if KEY is not set to
                      0xA66D. */                                                                                                  
                                                                                                                                  
  #define OTPC_POWER_FORCEOFF_KEY_Pos (16UL)         /*!< Position of KEY field.                                               */
  #define OTPC_POWER_FORCEOFF_KEY_Msk (0xFFFFUL << OTPC_POWER_FORCEOFF_KEY_Pos) /*!< Bit mask of KEY field.                    */
  #define OTPC_POWER_FORCEOFF_KEY_Min (0xA66DUL)     /*!< Min enumerator value of KEY field.                                   */
  #define OTPC_POWER_FORCEOFF_KEY_Max (0xA66DUL)     /*!< Max enumerator value of KEY field.                                   */
  #define OTPC_POWER_FORCEOFF_KEY_Allowed (0xA66DUL) /*!< Write is allowed.                                                    */



/* ===================================================== Struct OTPC_PUF ===================================================== */
/**
  * @brief PUF [OTPC_PUF] (unspecified)
  */
typedef struct {
  __IM  uint32_t  READ;                              /*!< (@ 0x00000000) Read the PUF word XORed with the PUF pad value.       */
  __OM  uint32_t  PAD;                               /*!< (@ 0x00000004) The PUF pad value used to XOR with the PUF word read. */
  __IOM uint32_t  LOCK;                              /*!< (@ 0x00000008) Locks the reads to the PUF.                           */
} NRF_OTPC_PUF_Type;                                 /*!< Size = 12 (0x00C)                                                    */

/* OTPC_PUF_READ: Read the PUF word XORed with the PUF pad value. */
  #define OTPC_PUF_READ_ResetValue (0x00000000UL)    /*!< Reset value of READ register.                                        */

/* Value @Bits 0..31 : PUF word from the the PUF bits stream XORed with the PUF pad value. */
  #define OTPC_PUF_READ_Value_Pos (0UL)              /*!< Position of Value field.                                             */
  #define OTPC_PUF_READ_Value_Msk (0xFFFFFFFFUL << OTPC_PUF_READ_Value_Pos) /*!< Bit mask of Value field.                      */
  #define OTPC_PUF_READ_Value_Min (0x1UL)            /*!< Min value of Value field.                                            */
  #define OTPC_PUF_READ_Value_Max (0xFFFFFFFFUL)     /*!< Max size of Value field.                                             */
  #define OTPC_PUF_READ_Value_Locked (0x00000000UL)  /*!< Reads a 0 when the PUF is locked.                                    */


/* OTPC_PUF_PAD: The PUF pad value used to XOR with the PUF word read. */
  #define OTPC_PUF_PAD_ResetValue (0x00000000UL)     /*!< Reset value of PAD register.                                         */

/* Value @Bits 0..31 : PUF pad value */
  #define OTPC_PUF_PAD_Value_Pos (0UL)               /*!< Position of Value field.                                             */
  #define OTPC_PUF_PAD_Value_Msk (0xFFFFFFFFUL << OTPC_PUF_PAD_Value_Pos) /*!< Bit mask of Value field.                        */


/* OTPC_PUF_LOCK: Locks the reads to the PUF. */
  #define OTPC_PUF_LOCK_ResetValue (0x00000000UL)    /*!< Reset value of LOCK register.                                        */

/* LOCK @Bits 0..31 : Enables the lock for PUF.READ. */
  #define OTPC_PUF_LOCK_LOCK_Pos (0UL)               /*!< Position of LOCK field.                                              */
  #define OTPC_PUF_LOCK_LOCK_Msk (0xFFFFFFFFUL << OTPC_PUF_LOCK_LOCK_Pos) /*!< Bit mask of LOCK field.                         */
  #define OTPC_PUF_LOCK_LOCK_Min (0x0UL)             /*!< Min enumerator value of LOCK field.                                  */
  #define OTPC_PUF_LOCK_LOCK_Max (0x10CC10CCUL)      /*!< Max enumerator value of LOCK field.                                  */
  #define OTPC_PUF_LOCK_LOCK_Pending (0x00000000UL)  /*!< Read: The PUF.PAD is not written. The PUF.READ is locked.            */
  #define OTPC_PUF_LOCK_LOCK_Disabled (0x00000001UL) /*!< Read: PUF.READ is not locked.                                        */
  #define OTPC_PUF_LOCK_LOCK_Enabled (0x00000002UL)  /*!< Read: PUF.READ is locked.                                            */
  #define OTPC_PUF_LOCK_LOCK_Enable (0x10CC10CCUL)   /*!< Write: Enables the lock (Ignores any other value written).           */



/* ==================================================== Struct OTPC_TEST ===================================================== */
/**
  * @brief TEST [OTPC_TEST] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TESTMODE;                          /*!< (@ 0x00000000) Register for entering test mode. Refer to the OTP test
                                                                         flow documentation for more details.*/                   
  __IOM uint32_t  LOCKTESTMODE;                      /*!< (@ 0x00000004) Enables the lock for the TEST.TESTMODE                */
} NRF_OTPC_TEST_Type;                                /*!< Size = 8 (0x008)                                                     */

/* OTPC_TEST_TESTMODE: Register for entering test mode. Refer to the OTP test flow documentation for more details. */
  #define OTPC_TEST_TESTMODE_ResetValue (0x00000000UL) /*!< Reset value of TESTMODE register.                                  */

/* TESTMODE @Bits 0..15 : Register for entering test mode. This register does not return the same value as written. */
  #define OTPC_TEST_TESTMODE_TESTMODE_Pos (0UL)      /*!< Position of TESTMODE field.                                          */
  #define OTPC_TEST_TESTMODE_TESTMODE_Msk (0xFFFFUL << OTPC_TEST_TESTMODE_TESTMODE_Pos) /*!< Bit mask of TESTMODE field.       */
  #define OTPC_TEST_TESTMODE_TESTMODE_Min (0x0UL)    /*!< Min enumerator value of TESTMODE field.                              */
  #define OTPC_TEST_TESTMODE_TESTMODE_Max (0xBCDEUL) /*!< Max enumerator value of TESTMODE field.                              */
  #define OTPC_TEST_TESTMODE_TESTMODE_NORMAL (0x0000UL) /*!< Read: In normal mode.                                             */
  #define OTPC_TEST_TESTMODE_TESTMODE_TESTMODE1 (0x0001UL) /*!< Read: In TESTMODE1 mode.                                       */
  #define OTPC_TEST_TESTMODE_TESTMODE_TESTMODE2 (0x0002UL) /*!< Read: In TESTMODE2 mode.                                       */
  #define OTPC_TEST_TESTMODE_TESTMODE_SetNORMAL (0x0000UL) /*!< Write: Sets NORMAL mode.                                       */
  #define OTPC_TEST_TESTMODE_TESTMODE_SetTESTMODE1 (0xBCDEUL) /*!< Write: Sets TESTMODE1. Used for production tests.           */
  #define OTPC_TEST_TESTMODE_TESTMODE_SetTESTMODE2 (0xABCDUL) /*!< Write: Sets TESTMODE2. Used for production tests (Direct
                                                                   access to OTP macro signals).*/                                


/* OTPC_TEST_LOCKTESTMODE: Enables the lock for the TEST.TESTMODE */
  #define OTPC_TEST_LOCKTESTMODE_ResetValue (0x00000000UL) /*!< Reset value of LOCKTESTMODE register.                          */

/* EnableLock @Bits 0..31 : Enables the lock for TEST.TESTMODE. */
  #define OTPC_TEST_LOCKTESTMODE_EnableLock_Pos (0UL) /*!< Position of EnableLock field.                                       */
  #define OTPC_TEST_LOCKTESTMODE_EnableLock_Msk (0xFFFFFFFFUL << OTPC_TEST_LOCKTESTMODE_EnableLock_Pos) /*!< Bit mask of
                                                                            EnableLock field.*/                                   
  #define OTPC_TEST_LOCKTESTMODE_EnableLock_Min (0x0UL) /*!< Min enumerator value of EnableLock field.                         */
  #define OTPC_TEST_LOCKTESTMODE_EnableLock_Max (0x10CC10CCUL) /*!< Max enumerator value of EnableLock field.                  */
  #define OTPC_TEST_LOCKTESTMODE_EnableLock_LockDisabled (0x00000000UL) /*!< Read: TEST.TESTMODE is not locked.                */
  #define OTPC_TEST_LOCKTESTMODE_EnableLock_LockEnabled (0x00000001UL) /*!< Read: TEST.TESTMODE is locked.                     */
  #define OTPC_TEST_LOCKTESTMODE_EnableLock_EnableLock (0x10CC10CCUL) /*!< Write: Enables the lock (Ignores any other value
                                                                           written).*/                                            



/* ============================================== Struct OTPC_TESTMODE1_EMEMORY ============================================== */
/**
  * @brief EMEMORY [OTPC_TESTMODE1_EMEMORY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  READ;                              /*!< (@ 0x00000000) Configures the OTP memory read mode. The PTM signals of
                                                                         the OTP macro are set accordingly to this read mode
                                                                         during reads.*/                                          
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000004) Enables the PTR (PTR is the direct signal to the OTP
                                                                         macro, it enables the test row) for read or write. When
                                                                         enabled, the read and writes goes to test row instead
                                                                         of main OTP memory.*/                                    
} NRF_OTPC_TESTMODE1_EMEMORY_Type;                   /*!< Size = 8 (0x008)                                                     */

/* OTPC_TESTMODE1_EMEMORY_READ: Configures the OTP memory read mode. The PTM signals of the OTP macro are set accordingly to
                                 this read mode during reads. */                                                                  
                                                                                                                                  
  #define OTPC_TESTMODE1_EMEMORY_READ_ResetValue (0x00000000UL) /*!< Reset value of READ register.                             */

