adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RELOAD @Bits 0..8 : This is the counter reload value, used each time the decrementing counter is triggered. */
  #define OTPC_TESTMODE2_COUNTERRELOAD_RELOAD_Pos (0UL) /*!< Position of RELOAD field.                                         */
  #define OTPC_TESTMODE2_COUNTERRELOAD_RELOAD_Msk (0x1FFUL << OTPC_TESTMODE2_COUNTERRELOAD_RELOAD_Pos) /*!< Bit mask of RELOAD
                                                                            field.*/                                              


/* OTPC_TESTMODE2_COUNTERRUN: Status of the counter. */
  #define OTPC_TESTMODE2_COUNTERRUN_ResetValue (0x00000000UL) /*!< Reset value of COUNTERRUN register.                         */

/* RUNNING @Bit 0 : Checks if counter is running. */
  #define OTPC_TESTMODE2_COUNTERRUN_RUNNING_Pos (0UL) /*!< Position of RUNNING field.                                          */
  #define OTPC_TESTMODE2_COUNTERRUN_RUNNING_Msk (0x1UL << OTPC_TESTMODE2_COUNTERRUN_RUNNING_Pos) /*!< Bit mask of RUNNING
                                                                            field.*/                                              
  #define OTPC_TESTMODE2_COUNTERRUN_RUNNING_Min (0x0UL) /*!< Min enumerator value of RUNNING field.                            */
  #define OTPC_TESTMODE2_COUNTERRUN_RUNNING_Max (0x1UL) /*!< Max enumerator value of RUNNING field.                            */
  #define OTPC_TESTMODE2_COUNTERRUN_RUNNING_NotRunning (0x0UL) /*!< Counter is not running.                                    */
  #define OTPC_TESTMODE2_COUNTERRUN_RUNNING_Running (0x1UL) /*!< Counter is running.                                           */


/* ======================================================= Struct OTPC ======================================================= */
/**
  * @brief OTP controller
  */
  typedef struct {                                   /*!< OTPC Structure                                                       */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) Current OTPC operation is completed.                  */
    __IOM uint32_t EVENTS_READYNEXT;                 /*!< (@ 0x00000104) Ready to accept a new write operation.                */
    __IM uint32_t RESERVED1[126];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t READY;                             /*!< (@ 0x00000400) OTPC status.                                          */
    __IM uint32_t READYNEXT;                         /*!< (@ 0x00000404) Ready next flag.                                      */
    __IM uint32_t RESERVED3[62];
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000500) Configuration register.                               */
    __IM uint32_t RESERVED4[7];
    __IOM NRF_OTPC_POWER_Type POWER;                 /*!< (@ 0x00000520) (unspecified)                                         */
    __IM uint32_t RESERVED5;
    __IOM NRF_OTPC_PUF_Type PUF;                     /*!< (@ 0x00000540) (unspecified)                                         */
    __IM uint32_t RESERVED6;
    __IOM uint32_t WAITSTATES;                       /*!< (@ 0x00000550) Wait states for OTP read.                             */
    __IOM uint32_t STANDBYTIMEOUT;                   /*!< (@ 0x00000554) Timeout to go into standby mode.                      */
    __IOM uint32_t FREQUENCY;                        /*!< (@ 0x00000558) Clock frequency of OTPC.                              */
    __IM uint32_t RESERVED7;
    #if defined(_GNUC_)
      #pragma GCC diagnostic push
      #pragma GCC diagnostic ignored "-Wpedantic"
    #endif
    union {
      __IOM uint32_t REGION[6];                      /*!< (@ 0x00000560) Configuration for region [n]                          */
    };
    #if defined(_GNUC_)
      #pragma GCC diagnostic pop
    #endif
    __IM uint32_t RESERVED8[34];
    __IOM NRF_OTPC_TEST_Type TEST;                   /*!< (@ 0x00000600) (unspecified)                                         */
    __IM uint32_t RESERVED9[2];
    __IOM NRF_OTPC_TESTMODE1_Type TESTMODE1;         /*!< (@ 0x00000610) (unspecified)                                         */
    __IM uint32_t RESERVED10[2];
    __IOM NRF_OTPC_TESTMODE2_Type TESTMODE2;         /*!< (@ 0x00000620) (unspecified)                                         */
  } NRF_OTPC_Type;                                   /*!< Size = 1620 (0x654)                                                  */

/* OTPC_EVENTS_READY: Current OTPC operation is completed. */
  #define OTPC_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                               */

/* EVENTS_READY @Bit 0 : Current OTPC operation is completed. */
  #define OTPC_EVENTS_READY_EVENTS_READY_Pos (0UL)   /*!< Position of EVENTS_READY field.                                      */
  #define OTPC_EVENTS_READY_EVENTS_READY_Msk (0x1UL << OTPC_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of EVENTS_READY field.*/
  #define OTPC_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                          */
  #define OTPC_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                          */
  #define OTPC_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define OTPC_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                                */


/* OTPC_EVENTS_READYNEXT: Ready to accept a new write operation. */
  #define OTPC_EVENTS_READYNEXT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READYNEXT register.                       */

/* EVENTS_READYNEXT @Bit 0 : Ready to accept a new write operation. */
  #define OTPC_EVENTS_READYNEXT_EVENTS_READYNEXT_Pos (0UL) /*!< Position of EVENTS_READYNEXT field.                            */
  #define OTPC_EVENTS_READYNEXT_EVENTS_READYNEXT_Msk (0x1UL << OTPC_EVENTS_READYNEXT_EVENTS_READYNEXT_Pos) /*!< Bit mask of
                                                                            EVENTS_READYNEXT field.*/                             
  #define OTPC_EVENTS_READYNEXT_EVENTS_READYNEXT_Min (0x0UL) /*!< Min enumerator value of EVENTS_READYNEXT field.              */
  #define OTPC_EVENTS_READYNEXT_EVENTS_READYNEXT_Max (0x1UL) /*!< Max enumerator value of EVENTS_READYNEXT field.              */
  #define OTPC_EVENTS_READYNEXT_EVENTS_READYNEXT_NotGenerated (0x0UL) /*!< Event not generated                                 */
  #define OTPC_EVENTS_READYNEXT_EVENTS_READYNEXT_Generated (0x1UL) /*!< Event generated                                        */


/* OTPC_INTEN: Enable or disable interrupt */
  #define OTPC_INTEN_ResetValue (0x00000000UL)       /*!< Reset value of INTEN register.                                       */

