adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PCGCMASTER_SETPOWERCONSUMPTIONBASE: Set power consumption base for power/clock pair n */
  #define PCGCMASTER_SETPOWERCONSUMPTIONBASE_MaxCount (2UL) /*!< Max size of SETPOWERCONSUMPTIONBASE[2] array.                 */
  #define PCGCMASTER_SETPOWERCONSUMPTIONBASE_ResetValue (0x00000000UL) /*!< Reset value of SETPOWERCONSUMPTIONBASE[2] register.*/

/* POWERREQUIREMENT @Bits 0..3 : POWERREQUIREMENT */
  #define PCGCMASTER_SETPOWERCONSUMPTIONBASE_POWERREQUIREMENT_Pos (0UL) /*!< Position of POWERREQUIREMENT field.               */
  #define PCGCMASTER_SETPOWERCONSUMPTIONBASE_POWERREQUIREMENT_Msk (0xFUL << PCGCMASTER_SETPOWERCONSUMPTIONBASE_POWERREQUIREMENT_Pos)
                                                                            /*!< Bit mask of POWERREQUIREMENT field.*/            


/* PCGCMASTER_UNLOCKBACKDOORS: Unlock backdoors */
  #define PCGCMASTER_UNLOCKBACKDOORS_ResetValue (0x00000000UL) /*!< Reset value of UNLOCKBACKDOORS register.                   */

/* UNLOCKBACKDOORS @Bits 0..15 : Write: 0x00009375 to lock/unlock backdoors Read: 0x00000001 if backdoors is enabled Read:
                                 0x00000000 if backdoors is disabled */                                                           
                                                                                                                                  
  #define PCGCMASTER_UNLOCKBACKDOORS_UNLOCKBACKDOORS_Pos (0UL) /*!< Position of UNLOCKBACKDOORS field.                         */
  #define PCGCMASTER_UNLOCKBACKDOORS_UNLOCKBACKDOORS_Msk (0xFFFFUL << PCGCMASTER_UNLOCKBACKDOORS_UNLOCKBACKDOORS_Pos) /*!< Bit
                                                                            mask of UNLOCKBACKDOORS field.*/                      


/* PCGCMASTER_ENABLEPOWERREGFORCE: Enable power reg force */
  #define PCGCMASTER_ENABLEPOWERREGFORCE_ResetValue (0x00000000UL) /*!< Reset value of ENABLEPOWERREGFORCE register.           */

/* ENABLEPOWERREGFORCE @Bits 0..2 : ENABLEPOWERREGFORCE */
  #define PCGCMASTER_ENABLEPOWERREGFORCE_ENABLEPOWERREGFORCE_Pos (0UL) /*!< Position of ENABLEPOWERREGFORCE field.             */
  #define PCGCMASTER_ENABLEPOWERREGFORCE_ENABLEPOWERREGFORCE_Msk (0x7UL << PCGCMASTER_ENABLEPOWERREGFORCE_ENABLEPOWERREGFORCE_Pos)
                                                                            /*!< Bit mask of ENABLEPOWERREGFORCE field.*/         


/* PCGCMASTER_POWERREGFORCE: Force reg */
  #define PCGCMASTER_POWERREGFORCE_ResetValue (0x00000000UL) /*!< Reset value of POWERREGFORCE register.                       */

/* POWERREGFORCEREG @Bits 0..2 : POWERREGFORCEREG */
  #define PCGCMASTER_POWERREGFORCE_POWERREGFORCEREG_Pos (0UL) /*!< Position of POWERREGFORCEREG field.                         */
  #define PCGCMASTER_POWERREGFORCE_POWERREGFORCEREG_Msk (0x7UL << PCGCMASTER_POWERREGFORCE_POWERREGFORCEREG_Pos) /*!< Bit mask
                                                                            of POWERREGFORCEREG field.*/                          


/* PCGCMASTER_MASTERFORCEREG: Force reg */
  #define PCGCMASTER_MASTERFORCEREG_MaxCount (1UL)   /*!< Max size of MASTERFORCEREG[1] array.                                 */
  #define PCGCMASTER_MASTERFORCEREG_ResetValue (0x00000000UL) /*!< Reset value of MASTERFORCEREG[1] register.                  */

/* ENABLEPSWITCHFORCE @Bit 0 : ENABLEPSWITCHFORCE */
  #define PCGCMASTER_MASTERFORCEREG_ENABLEPSWITCHFORCE_Pos (0UL) /*!< Position of ENABLEPSWITCHFORCE field.                    */
  #define PCGCMASTER_MASTERFORCEREG_ENABLEPSWITCHFORCE_Msk (0x1UL << PCGCMASTER_MASTERFORCEREG_ENABLEPSWITCHFORCE_Pos) /*!< Bit
                                                                            mask of ENABLEPSWITCHFORCE field.*/                   

/* PSWITCHFORCEPRE @Bit 1 : PSWITCHFORCEPRE */
  #define PCGCMASTER_MASTERFORCEREG_PSWITCHFORCEPRE_Pos (1UL) /*!< Position of PSWITCHFORCEPRE field.                          */
  #define PCGCMASTER_MASTERFORCEREG_PSWITCHFORCEPRE_Msk (0x1UL << PCGCMASTER_MASTERFORCEREG_PSWITCHFORCEPRE_Pos) /*!< Bit mask
                                                                            of PSWITCHFORCEPRE field.*/                           

/* ENABLEISOLATIONFORCE @Bit 2 : ENABLEISOLATIONFORCE */
  #define PCGCMASTER_MASTERFORCEREG_ENABLEISOLATIONFORCE_Pos (2UL) /*!< Position of ENABLEISOLATIONFORCE field.                */
  #define PCGCMASTER_MASTERFORCEREG_ENABLEISOLATIONFORCE_Msk (0x1UL << PCGCMASTER_MASTERFORCEREG_ENABLEISOLATIONFORCE_Pos) /*!<
                                                                            Bit mask of ENABLEISOLATIONFORCE field.*/             

/* ISOLATIONFORCEPRE @Bit 3 : ISOLATIONFORCEPRE */
  #define PCGCMASTER_MASTERFORCEREG_ISOLATIONFORCEPRE_Pos (3UL) /*!< Position of ISOLATIONFORCEPRE field.                      */
  #define PCGCMASTER_MASTERFORCEREG_ISOLATIONFORCEPRE_Msk (0x1UL << PCGCMASTER_MASTERFORCEREG_ISOLATIONFORCEPRE_Pos) /*!< Bit
                                                                            mask of ISOLATIONFORCEPRE field.*/                    

/* ENABLEARSTFORCE @Bit 4 : ENABLEARSTFORCE */
  #define PCGCMASTER_MASTERFORCEREG_ENABLEARSTFORCE_Pos (4UL) /*!< Position of ENABLEARSTFORCE field.                          */
  #define PCGCMASTER_MASTERFORCEREG_ENABLEARSTFORCE_Msk (0x1UL << PCGCMASTER_MASTERFORCEREG_ENABLEARSTFORCE_Pos) /*!< Bit mask
                                                                            of ENABLEARSTFORCE field.*/                           

/* VALUEARSTFORCEPRE @Bit 5 : VALUEARSTFORCEPRE */
  #define PCGCMASTER_MASTERFORCEREG_VALUEARSTFORCEPRE_Pos (5UL) /*!< Position of VALUEARSTFORCEPRE field.                      */
  #define PCGCMASTER_MASTERFORCEREG_VALUEARSTFORCEPRE_Msk (0x1UL << PCGCMASTER_MASTERFORCEREG_VALUEARSTFORCEPRE_Pos) /*!< Bit
                                                                            mask of VALUEARSTFORCEPRE field.*/                    

/* ENABLEPOWERONFORCE @Bit 6 : ENABLEPOWERONFORCE */
  #define PCGCMASTER_MASTERFORCEREG_ENABLEPOWERONFORCE_Pos (6UL) /*!< Position of ENABLEPOWERONFORCE field.                    */
  #define PCGCMASTER_MASTERFORCEREG_ENABLEPOWERONFORCE_Msk (0x1UL << PCGCMASTER_MASTERFORCEREG_ENABLEPOWERONFORCE_Pos) /*!< Bit
                                                                            mask of ENABLEPOWERONFORCE field.*/                   

/* POWERONFORCEPRE @Bit 7 : POWERONFORCEPRE */
  #define PCGCMASTER_MASTERFORCEREG_POWERONFORCEPRE_Pos (7UL) /*!< Position of POWERONFORCEPRE field.                          */
  #define PCGCMASTER_MASTERFORCEREG_POWERONFORCEPRE_Msk (0x1UL << PCGCMASTER_MASTERFORCEREG_POWERONFORCEPRE_Pos) /*!< Bit mask
                                                                            of POWERONFORCEPRE field.*/                           

/* DISABLEWAITRESTORE @Bit 8 : Turn off waiting for arst deactivation before retention restore */
  #define PCGCMASTER_MASTERFORCEREG_DISABLEWAITRESTORE_Pos (8UL) /*!< Position of DISABLEWAITRESTORE field.                    */
  #define PCGCMASTER_MASTERFORCEREG_DISABLEWAITRESTORE_Msk (0x1UL << PCGCMASTER_MASTERFORCEREG_DISABLEWAITRESTORE_Pos) /*!< Bit
                                                                            mask of DISABLEWAITRESTORE field.*/                   
  #define PCGCMASTER_MASTERFORCEREG_DISABLEWAITRESTORE_Min (0x0UL) /*!< Min enumerator value of DISABLEWAITRESTORE field.      */
  #define PCGCMASTER_MASTERFORCEREG_DISABLEWAITRESTORE_Max (0x1UL) /*!< Max enumerator value of DISABLEWAITRESTORE field.      */
  #define PCGCMASTER_MASTERFORCEREG_DISABLEWAITRESTORE_Disable (0x1UL) /*!< Turn off waiting for arst deactivation before
                                                                            retention restore*/                                   
  #define PCGCMASTER_MASTERFORCEREG_DISABLEWAITRESTORE_Enable (0x0UL) /*!< Wait for arst deactivation before retention restore */


