adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PCGCMASTER_CLOCKFORCEREG: Force clock n */
  #define PCGCMASTER_CLOCKFORCEREG_MaxCount (5UL)    /*!< Max size of CLOCKFORCEREG[5] array.                                  */
  #define PCGCMASTER_CLOCKFORCEREG_ResetValue (0x00000000UL) /*!< Reset value of CLOCKFORCEREG[5] register.                    */

/* ENABLE @Bit 0 : Enable clock forcing */
  #define PCGCMASTER_CLOCKFORCEREG_ENABLE_Pos (0UL)  /*!< Position of ENABLE field.                                            */
  #define PCGCMASTER_CLOCKFORCEREG_ENABLE_Msk (0x1UL << PCGCMASTER_CLOCKFORCEREG_ENABLE_Pos) /*!< Bit mask of ENABLE field.    */

/* CLOCKFORCING @Bit 1 : CLOCKFORCING */
  #define PCGCMASTER_CLOCKFORCEREG_CLOCKFORCING_Pos (1UL) /*!< Position of CLOCKFORCING field.                                 */
  #define PCGCMASTER_CLOCKFORCEREG_CLOCKFORCING_Msk (0x1UL << PCGCMASTER_CLOCKFORCEREG_CLOCKFORCING_Pos) /*!< Bit mask of
                                                                            CLOCKFORCING field.*/                                 

/* CLOCKSOURCEFORCING @Bits 2..4 : CLOCKSOURCEFORCING */
  #define PCGCMASTER_CLOCKFORCEREG_CLOCKSOURCEFORCING_Pos (2UL) /*!< Position of CLOCKSOURCEFORCING field.                     */
  #define PCGCMASTER_CLOCKFORCEREG_CLOCKSOURCEFORCING_Msk (0x7UL << PCGCMASTER_CLOCKFORCEREG_CLOCKSOURCEFORCING_Pos) /*!< Bit
                                                                            mask of CLOCKSOURCEFORCING field.*/                   


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         PCGCSLAVE                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ==================================================== Struct PCGCSLAVE ===================================================== */
/**
  * @brief PCGCSlave
  */
  typedef struct {                                   /*!< PCGCSLAVE Structure                                                  */
    __IM uint32_t RESERVED[768];
    __IOM uint32_t PENALTY[2];                       /*!< (@ 0x00000C00) Penalty level for power/clock pair n                  */
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t FORCEOVERRIDE[2];                 /*!< (@ 0x00000C80) Force override of power/clock pair n                  */
  } NRF_PCGCSLAVE_Type;                              /*!< Size = 3208 (0xC88)                                                  */

/* PCGCSLAVE_PENALTY: Penalty level for power/clock pair n */
  #define PCGCSLAVE_PENALTY_MaxCount (2UL)           /*!< Max size of PENALTY[2] array.                                        */
  #define PCGCSLAVE_PENALTY_ResetValue (0x00000000UL) /*!< Reset value of PENALTY[2] register.                                 */

/* PENALTY @Bits 0..7 : Penalty level */
  #define PCGCSLAVE_PENALTY_PENALTY_Pos (0UL)        /*!< Position of PENALTY field.                                           */
  #define PCGCSLAVE_PENALTY_PENALTY_Msk (0xFFUL << PCGCSLAVE_PENALTY_PENALTY_Pos) /*!< Bit mask of PENALTY field.              */


/* PCGCSLAVE_FORCEOVERRIDE: Force override of power/clock pair n */
  #define PCGCSLAVE_FORCEOVERRIDE_MaxCount (2UL)     /*!< Max size of FORCEOVERRIDE[2] array.                                  */
  #define PCGCSLAVE_FORCEOVERRIDE_ResetValue (0x00000000UL) /*!< Reset value of FORCEOVERRIDE[2] register.                     */

/* CLOCKFORCINGPRE @Bits 0..3 : CLOCKFORCINGPRE */
  #define PCGCSLAVE_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos (0UL) /*!< Position of CLOCKFORCINGPRE field.                            */
  #define PCGCSLAVE_FORCEOVERRIDE_CLOCKFORCINGPRE_Msk (0xFUL << PCGCSLAVE_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos) /*!< Bit mask of
                                                                            CLOCKFORCINGPRE field.*/                              

/* DOFORCECLOCKPRE @Bit 7 : DOFORCECLOCKPRE */
  #define PCGCSLAVE_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos (7UL) /*!< Position of DOFORCECLOCKPRE field.                            */
  #define PCGCSLAVE_FORCEOVERRIDE_DOFORCECLOCKPRE_Msk (0x1UL << PCGCSLAVE_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos) /*!< Bit mask of
                                                                            DOFORCECLOCKPRE field.*/                              

/* POWERFORCINGPRE @Bits 8..9 : POWERFORCINGPRE */
  #define PCGCSLAVE_FORCEOVERRIDE_POWERFORCINGPRE_Pos (8UL) /*!< Position of POWERFORCINGPRE field.                            */
  #define PCGCSLAVE_FORCEOVERRIDE_POWERFORCINGPRE_Msk (0x3UL << PCGCSLAVE_FORCEOVERRIDE_POWERFORCINGPRE_Pos) /*!< Bit mask of
                                                                            POWERFORCINGPRE field.*/                              

/* DOFORCEPOWERPRE @Bit 15 : DOFORCEPOWERPRE */
  #define PCGCSLAVE_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos (15UL) /*!< Position of DOFORCEPOWERPRE field.                           */
  #define PCGCSLAVE_FORCEOVERRIDE_DOFORCEPOWERPRE_Msk (0x1UL << PCGCSLAVE_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos) /*!< Bit mask of
                                                                            DOFORCEPOWERPRE field.*/                              


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           PCRM                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

