adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CONSUMER22 @Bit 22 : Status of the request for consumer 22 */
  #define PCRM_REQUEST_STATUS_CONSUMER22_Pos (22UL)  /*!< Position of CONSUMER22 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER22_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER22_Pos) /*!< Bit mask of CONSUMER22 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER22_Min (0x0UL) /*!< Min enumerator value of CONSUMER22 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER22_Max (0x1UL) /*!< Max enumerator value of CONSUMER22 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER22_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER22_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER23 @Bit 23 : Status of the request for consumer 23 */
  #define PCRM_REQUEST_STATUS_CONSUMER23_Pos (23UL)  /*!< Position of CONSUMER23 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER23_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER23_Pos) /*!< Bit mask of CONSUMER23 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER23_Min (0x0UL) /*!< Min enumerator value of CONSUMER23 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER23_Max (0x1UL) /*!< Max enumerator value of CONSUMER23 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER23_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER23_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER24 @Bit 24 : Status of the request for consumer 24 */
  #define PCRM_REQUEST_STATUS_CONSUMER24_Pos (24UL)  /*!< Position of CONSUMER24 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER24_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER24_Pos) /*!< Bit mask of CONSUMER24 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER24_Min (0x0UL) /*!< Min enumerator value of CONSUMER24 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER24_Max (0x1UL) /*!< Max enumerator value of CONSUMER24 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER24_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER24_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER25 @Bit 25 : Status of the request for consumer 25 */
  #define PCRM_REQUEST_STATUS_CONSUMER25_Pos (25UL)  /*!< Position of CONSUMER25 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER25_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER25_Pos) /*!< Bit mask of CONSUMER25 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER25_Min (0x0UL) /*!< Min enumerator value of CONSUMER25 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER25_Max (0x1UL) /*!< Max enumerator value of CONSUMER25 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER25_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER25_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER26 @Bit 26 : Status of the request for consumer 26 */
  #define PCRM_REQUEST_STATUS_CONSUMER26_Pos (26UL)  /*!< Position of CONSUMER26 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER26_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER26_Pos) /*!< Bit mask of CONSUMER26 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER26_Min (0x0UL) /*!< Min enumerator value of CONSUMER26 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER26_Max (0x1UL) /*!< Max enumerator value of CONSUMER26 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER26_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER26_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER27 @Bit 27 : Status of the request for consumer 27 */
  #define PCRM_REQUEST_STATUS_CONSUMER27_Pos (27UL)  /*!< Position of CONSUMER27 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER27_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER27_Pos) /*!< Bit mask of CONSUMER27 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER27_Min (0x0UL) /*!< Min enumerator value of CONSUMER27 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER27_Max (0x1UL) /*!< Max enumerator value of CONSUMER27 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER27_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER27_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER28 @Bit 28 : Status of the request for consumer 28 */
  #define PCRM_REQUEST_STATUS_CONSUMER28_Pos (28UL)  /*!< Position of CONSUMER28 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER28_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER28_Pos) /*!< Bit mask of CONSUMER28 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER28_Min (0x0UL) /*!< Min enumerator value of CONSUMER28 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER28_Max (0x1UL) /*!< Max enumerator value of CONSUMER28 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER28_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER28_Rising (0x1UL) /*!< Request rising                                                    */

/* CONSUMER29 @Bit 29 : Status of the request for consumer 29 */
  #define PCRM_REQUEST_STATUS_CONSUMER29_Pos (29UL)  /*!< Position of CONSUMER29 field.                                        */
  #define PCRM_REQUEST_STATUS_CONSUMER29_Msk (0x1UL << PCRM_REQUEST_STATUS_CONSUMER29_Pos) /*!< Bit mask of CONSUMER29 field.  */
  #define PCRM_REQUEST_STATUS_CONSUMER29_Min (0x0UL) /*!< Min enumerator value of CONSUMER29 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER29_Max (0x1UL) /*!< Max enumerator value of CONSUMER29 field.                            */
  #define PCRM_REQUEST_STATUS_CONSUMER29_Falling (0x0UL) /*!< Request falling                                                  */
  #define PCRM_REQUEST_STATUS_CONSUMER29_Rising (0x1UL) /*!< Request rising                                                    */

