adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CONSUMER20 @Bit 20 : Ack status of the request for consumer [20] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER20_Pos (20UL) /*!< Position of CONSUMER20 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER20_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER20_Pos) /*!< Bit mask of CONSUMER20
                                                                            field.*/                                              
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER20_Min (0x0UL) /*!< Min enumerator value of CONSUMER20 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER20_Max (0x1UL) /*!< Max enumerator value of CONSUMER20 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER20_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER20_AckReceived (0x1UL) /*!< Ack received                                              */

/* CONSUMER21 @Bit 21 : Ack status of the request for consumer [21] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER21_Pos (21UL) /*!< Position of CONSUMER21 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER21_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER21_Pos) /*!< Bit mask of CONSUMER21
                                                                            field.*/                                              
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER21_Min (0x0UL) /*!< Min enumerator value of CONSUMER21 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER21_Max (0x1UL) /*!< Max enumerator value of CONSUMER21 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER21_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER21_AckReceived (0x1UL) /*!< Ack received                                              */

/* CONSUMER22 @Bit 22 : Ack status of the request for consumer [22] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER22_Pos (22UL) /*!< Position of CONSUMER22 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER22_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER22_Pos) /*!< Bit mask of CONSUMER22
                                                                            field.*/                                              
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER22_Min (0x0UL) /*!< Min enumerator value of CONSUMER22 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER22_Max (0x1UL) /*!< Max enumerator value of CONSUMER22 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER22_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER22_AckReceived (0x1UL) /*!< Ack received                                              */

/* CONSUMER23 @Bit 23 : Ack status of the request for consumer [23] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER23_Pos (23UL) /*!< Position of CONSUMER23 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER23_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER23_Pos) /*!< Bit mask of CONSUMER23
                                                                            field.*/                                              
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER23_Min (0x0UL) /*!< Min enumerator value of CONSUMER23 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER23_Max (0x1UL) /*!< Max enumerator value of CONSUMER23 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER23_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER23_AckReceived (0x1UL) /*!< Ack received                                              */

/* CONSUMER24 @Bit 24 : Ack status of the request for consumer [24] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER24_Pos (24UL) /*!< Position of CONSUMER24 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER24_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER24_Pos) /*!< Bit mask of CONSUMER24
                                                                            field.*/                                              
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER24_Min (0x0UL) /*!< Min enumerator value of CONSUMER24 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER24_Max (0x1UL) /*!< Max enumerator value of CONSUMER24 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER24_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER24_AckReceived (0x1UL) /*!< Ack received                                              */

/* CONSUMER25 @Bit 25 : Ack status of the request for consumer [25] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER25_Pos (25UL) /*!< Position of CONSUMER25 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER25_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER25_Pos) /*!< Bit mask of CONSUMER25
                                                                            field.*/                                              
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER25_Min (0x0UL) /*!< Min enumerator value of CONSUMER25 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER25_Max (0x1UL) /*!< Max enumerator value of CONSUMER25 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER25_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER25_AckReceived (0x1UL) /*!< Ack received                                              */

/* CONSUMER26 @Bit 26 : Ack status of the request for consumer [26] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER26_Pos (26UL) /*!< Position of CONSUMER26 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER26_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER26_Pos) /*!< Bit mask of CONSUMER26
                                                                            field.*/                                              
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER26_Min (0x0UL) /*!< Min enumerator value of CONSUMER26 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER26_Max (0x1UL) /*!< Max enumerator value of CONSUMER26 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER26_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER26_AckReceived (0x1UL) /*!< Ack received                                              */

/* CONSUMER27 @Bit 27 : Ack status of the request for consumer [27] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER27_Pos (27UL) /*!< Position of CONSUMER27 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER27_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER27_Pos) /*!< Bit mask of CONSUMER27
                                                                            field.*/                                              
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER27_Min (0x0UL) /*!< Min enumerator value of CONSUMER27 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER27_Max (0x1UL) /*!< Max enumerator value of CONSUMER27 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER27_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER27_AckReceived (0x1UL) /*!< Ack received                                              */

