adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CONSUMER28 @Bit 28 : Ack status of the request for consumer [28] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER28_Pos (28UL) /*!< Position of CONSUMER28 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER28_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER28_Pos) /*!< Bit mask of CONSUMER28
                                                                            field.*/                                              
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER28_Min (0x0UL) /*!< Min enumerator value of CONSUMER28 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER28_Max (0x1UL) /*!< Max enumerator value of CONSUMER28 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER28_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER28_AckReceived (0x1UL) /*!< Ack received                                              */

/* CONSUMER29 @Bit 29 : Ack status of the request for consumer [29] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER29_Pos (29UL) /*!< Position of CONSUMER29 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER29_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER29_Pos) /*!< Bit mask of CONSUMER29
                                                                            field.*/                                              
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER29_Min (0x0UL) /*!< Min enumerator value of CONSUMER29 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER29_Max (0x1UL) /*!< Max enumerator value of CONSUMER29 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER29_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER29_AckReceived (0x1UL) /*!< Ack received                                              */

/* CONSUMER30 @Bit 30 : Ack status of the request for consumer [30] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER30_Pos (30UL) /*!< Position of CONSUMER30 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER30_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER30_Pos) /*!< Bit mask of CONSUMER30
                                                                            field.*/                                              
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER30_Min (0x0UL) /*!< Min enumerator value of CONSUMER30 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER30_Max (0x1UL) /*!< Max enumerator value of CONSUMER30 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER30_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER30_AckReceived (0x1UL) /*!< Ack received                                              */

/* CONSUMER31 @Bit 31 : Ack status of the request for consumer [31] */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER31_Pos (31UL) /*!< Position of CONSUMER31 field.                                      */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER31_Msk (0x1UL << PCRM_REQUEST_ACKSTATUS_CONSUMER31_Pos) /*!< Bit mask of CONSUMER31
                                                                            field.*/                                              
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER31_Min (0x0UL) /*!< Min enumerator value of CONSUMER31 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER31_Max (0x1UL) /*!< Max enumerator value of CONSUMER31 field.                         */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER31_AckNotReceived (0x0UL) /*!< Ack not received                                       */
  #define PCRM_REQUEST_ACKSTATUS_CONSUMER31_AckReceived (0x1UL) /*!< Ack received                                              */



/* ==================================================== Struct PCRM_RAIL ===================================================== */
/**
  * @brief RAIL [PCRM_RAIL] (unspecified)
  */
typedef struct {
  __IM  uint32_t  STATUS[16];                        /*!< (@ 0x00000000) Status of the rail n                                  */
} NRF_PCRM_RAIL_Type;                                /*!< Size = 64 (0x040)                                                    */

/* PCRM_RAIL_STATUS: Status of the rail n */
  #define PCRM_RAIL_STATUS_MaxCount (16UL)           /*!< Max size of STATUS[16] array.                                        */
  #define PCRM_RAIL_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS[16] register.                                  */

/* VALUE @Bits 0..7 : Estimated value for the rail n */
  #define PCRM_RAIL_STATUS_VALUE_Pos (0UL)           /*!< Position of VALUE field.                                             */
  #define PCRM_RAIL_STATUS_VALUE_Msk (0xFFUL << PCRM_RAIL_STATUS_VALUE_Pos) /*!< Bit mask of VALUE field.                      */



/* =================================================== Struct PCRM_CONFIG ==================================================== */
/**
  * @brief CONFIG [PCRM_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LOAD[32];                          /*!< (@ 0x00000000) Load configuration table for consumer for consumer n  */
} NRF_PCRM_CONFIG_Type;                              /*!< Size = 128 (0x080)                                                   */

/* PCRM_CONFIG_LOAD: Load configuration table for consumer for consumer n */
  #define PCRM_CONFIG_LOAD_MaxCount (32UL)           /*!< Max size of LOAD[32] array.                                          */
  #define PCRM_CONFIG_LOAD_ResetValue (0x00000000UL) /*!< Reset value of LOAD[32] register.                                    */

/* VALUE @Bits 0..9 : Threshold value for the load for consumer n */
  #define PCRM_CONFIG_LOAD_VALUE_Pos (0UL)           /*!< Position of VALUE field.                                             */
  #define PCRM_CONFIG_LOAD_VALUE_Msk (0x3FFUL << PCRM_CONFIG_LOAD_VALUE_Pos) /*!< Bit mask of VALUE field.                     */



/* ================================================== Struct PCRM_OVERRIDE =================================================== */
/**
  * @brief OVERRIDE [PCRM_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  REQUEST[32];                       /*!< (@ 0x00000000) Override the request for consumer n                   */
  __IM  uint32_t  RESERVED[32];
  __IOM uint32_t  ACK[32];                           /*!< (@ 0x00000100) Override the Ack for the request for consumer n       */
  __IM  uint32_t  RESERVED1[32];
  __IOM uint32_t  CROSSCURRENT[16];                  /*!< (@ 0x00000200) Override the cross current for rail n                 */
} NRF_PCRM_OVERRIDE_Type;                            /*!< Size = 576 (0x240)                                                   */

/* PCRM_OVERRIDE_REQUEST: Override the request for consumer n */
  #define PCRM_OVERRIDE_REQUEST_MaxCount (32UL)      /*!< Max size of REQUEST[32] array.                                       */
  #define PCRM_OVERRIDE_REQUEST_ResetValue (0x00000000UL) /*!< Reset value of REQUEST[32] register.                            */

