adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VAL @Bit 0 : Override value for the request for consumer n */
  #define PCRM_OVERRIDE_REQUEST_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define PCRM_OVERRIDE_REQUEST_VAL_Msk (0x1UL << PCRM_OVERRIDE_REQUEST_VAL_Pos) /*!< Bit mask of VAL field.                   */
  #define PCRM_OVERRIDE_REQUEST_VAL_Min (0x0UL)      /*!< Min enumerator value of VAL field.                                   */
  #define PCRM_OVERRIDE_REQUEST_VAL_Max (0x1UL)      /*!< Max enumerator value of VAL field.                                   */
  #define PCRM_OVERRIDE_REQUEST_VAL_Clear (0x0UL)    /*!< Request cleared                                                      */
  #define PCRM_OVERRIDE_REQUEST_VAL_Set (0x1UL)      /*!< Request set                                                          */

/* MASK @Bit 31 : Mask to override the request for consumer n */
  #define PCRM_OVERRIDE_REQUEST_MASK_Pos (31UL)      /*!< Position of MASK field.                                              */
  #define PCRM_OVERRIDE_REQUEST_MASK_Msk (0x1UL << PCRM_OVERRIDE_REQUEST_MASK_Pos) /*!< Bit mask of MASK field.                */
  #define PCRM_OVERRIDE_REQUEST_MASK_Min (0x0UL)     /*!< Min enumerator value of MASK field.                                  */
  #define PCRM_OVERRIDE_REQUEST_MASK_Max (0x1UL)     /*!< Max enumerator value of MASK field.                                  */
  #define PCRM_OVERRIDE_REQUEST_MASK_Mask (0x0UL)    /*!< Override value masked                                                */
  #define PCRM_OVERRIDE_REQUEST_MASK_UnMask (0x1UL)  /*!< Override value unmasked                                              */


/* PCRM_OVERRIDE_ACK: Override the Ack for the request for consumer n */
  #define PCRM_OVERRIDE_ACK_MaxCount (32UL)          /*!< Max size of ACK[32] array.                                           */
  #define PCRM_OVERRIDE_ACK_ResetValue (0x00000000UL) /*!< Reset value of ACK[32] register.                                    */

/* VAL @Bit 0 : Override the Ack value for the request for consumer n */
  #define PCRM_OVERRIDE_ACK_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define PCRM_OVERRIDE_ACK_VAL_Msk (0x1UL << PCRM_OVERRIDE_ACK_VAL_Pos) /*!< Bit mask of VAL field.                           */
  #define PCRM_OVERRIDE_ACK_VAL_Min (0x0UL)          /*!< Min enumerator value of VAL field.                                   */
  #define PCRM_OVERRIDE_ACK_VAL_Max (0x1UL)          /*!< Max enumerator value of VAL field.                                   */
  #define PCRM_OVERRIDE_ACK_VAL_Clear (0x0UL)        /*!< Ack clear                                                            */
  #define PCRM_OVERRIDE_ACK_VAL_Set (0x1UL)          /*!< Ack set                                                              */

/* MASK @Bit 31 : Mask to override the Ack for the request for consumer n */
  #define PCRM_OVERRIDE_ACK_MASK_Pos (31UL)          /*!< Position of MASK field.                                              */
  #define PCRM_OVERRIDE_ACK_MASK_Msk (0x1UL << PCRM_OVERRIDE_ACK_MASK_Pos) /*!< Bit mask of MASK field.                        */
  #define PCRM_OVERRIDE_ACK_MASK_Min (0x0UL)         /*!< Min enumerator value of MASK field.                                  */
  #define PCRM_OVERRIDE_ACK_MASK_Max (0x1UL)         /*!< Max enumerator value of MASK field.                                  */
  #define PCRM_OVERRIDE_ACK_MASK_Mask (0x0UL)        /*!< Override value masked                                                */
  #define PCRM_OVERRIDE_ACK_MASK_UnMask (0x1UL)      /*!< Override value unmasked                                              */


/* PCRM_OVERRIDE_CROSSCURRENT: Override the cross current for rail n */
  #define PCRM_OVERRIDE_CROSSCURRENT_MaxCount (16UL) /*!< Max size of CROSSCURRENT[16] array.                                  */
  #define PCRM_OVERRIDE_CROSSCURRENT_ResetValue (0x00000000UL) /*!< Reset value of CROSSCURRENT[16] register.                  */

/* VAL @Bit 0 : Override value for the cross current for rail n */
  #define PCRM_OVERRIDE_CROSSCURRENT_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define PCRM_OVERRIDE_CROSSCURRENT_VAL_Msk (0x1UL << PCRM_OVERRIDE_CROSSCURRENT_VAL_Pos) /*!< Bit mask of VAL field.         */
  #define PCRM_OVERRIDE_CROSSCURRENT_VAL_Min (0x0UL) /*!< Min enumerator value of VAL field.                                   */
  #define PCRM_OVERRIDE_CROSSCURRENT_VAL_Max (0x1UL) /*!< Max enumerator value of VAL field.                                   */
  #define PCRM_OVERRIDE_CROSSCURRENT_VAL_Disabled (0x0UL) /*!< Cross current disabled                                          */
  #define PCRM_OVERRIDE_CROSSCURRENT_VAL_Enabled (0x1UL) /*!< Cross current enabled                                            */

/* MASK @Bit 31 : Mask to override the cross current value for rail n */
  #define PCRM_OVERRIDE_CROSSCURRENT_MASK_Pos (31UL) /*!< Position of MASK field.                                              */
  #define PCRM_OVERRIDE_CROSSCURRENT_MASK_Msk (0x1UL << PCRM_OVERRIDE_CROSSCURRENT_MASK_Pos) /*!< Bit mask of MASK field.      */
  #define PCRM_OVERRIDE_CROSSCURRENT_MASK_Min (0x0UL) /*!< Min enumerator value of MASK field.                                 */
  #define PCRM_OVERRIDE_CROSSCURRENT_MASK_Max (0x1UL) /*!< Max enumerator value of MASK field.                                 */
  #define PCRM_OVERRIDE_CROSSCURRENT_MASK_Mask (0x0UL) /*!< Override value masked                                              */
  #define PCRM_OVERRIDE_CROSSCURRENT_MASK_UnMask (0x1UL) /*!< Override value unmasked                                          */


/* ======================================================= Struct PCRM ======================================================= */
/**
  * @brief PCRM
  */
  typedef struct {                                   /*!< PCRM Structure                                                       */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_REQUESTRISING[32];         /*!< (@ 0x00000100) Request rising for the consumer n                     */
    __IM uint32_t RESERVED1[32];
    __IOM uint32_t EVENTS_REQUESTFALLING[32];        /*!< (@ 0x00000200) Request falling for the consumer n                    */
    __IM uint32_t RESERVED2[32];
    __IOM uint32_t EVENTS_LOADCHANGERAIL[16];        /*!< (@ 0x00000300) Load change on rail n                                 */
    __IM uint32_t RESERVED3[48];
    __IOM uint32_t INTEN0;                           /*!< (@ 0x00000400) Enable or disable interrupt                           */
    __IOM uint32_t INTEN1;                           /*!< (@ 0x00000404) Enable or disable interrupt                           */
    __IOM uint32_t INTEN2;                           /*!< (@ 0x00000408) Enable or disable interrupt                           */
    __IOM uint32_t INTEN3;                           /*!< (@ 0x0000040C) Enable or disable interrupt                           */
    __IOM uint32_t INTEN4;                           /*!< (@ 0x00000410) Enable or disable interrupt                           */
    __IOM uint32_t INTEN5;                           /*!< (@ 0x00000414) Enable or disable interrupt                           */
    __IOM uint32_t INTEN6;                           /*!< (@ 0x00000418) Enable or disable interrupt                           */
    __IOM uint32_t INTEN7;                           /*!< (@ 0x0000041C) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET0;                        /*!< (@ 0x00000420) Enable interrupt                                      */
    __IOM uint32_t INTENSET1;                        /*!< (@ 0x00000424) Enable interrupt                                      */
    __IOM uint32_t INTENSET2;                        /*!< (@ 0x00000428) Enable interrupt                                      */
    __IOM uint32_t INTENSET3;                        /*!< (@ 0x0000042C) Enable interrupt                                      */
    __IOM uint32_t INTENSET4;                        /*!< (@ 0x00000430) Enable interrupt                                      */
    __IOM uint32_t INTENSET5;                        /*!< (@ 0x00000434) Enable interrupt                                      */
    __IOM uint32_t INTENSET6;                        /*!< (@ 0x00000438) Enable interrupt                                      */
    __IOM uint32_t INTENSET7;                        /*!< (@ 0x0000043C) Enable interrupt                                      */
    __IOM uint32_t INTENCLR0;                        /*!< (@ 0x00000440) Disable interrupt                                     */
    __IOM uint32_t INTENCLR1;                        /*!< (@ 0x00000444) Disable interrupt                                     */
    __IOM uint32_t INTENCLR2;                        /*!< (@ 0x00000448) Disable interrupt                                     */
    __IOM uint32_t INTENCLR3;                        /*!< (@ 0x0000044C) Disable interrupt                                     */
    __IOM uint32_t INTENCLR4;                        /*!< (@ 0x00000450) Disable interrupt                                     */
    __IOM uint32_t INTENCLR5;                        /*!< (@ 0x00000454) Disable interrupt                                     */
    __IOM uint32_t INTENCLR6;                        /*!< (@ 0x00000458) Disable interrupt                                     */
    __IOM uint32_t INTENCLR7;                        /*!< (@ 0x0000045C) Disable interrupt                                     */
    __IM uint32_t INTPEND0;                          /*!< (@ 0x00000460) Pending interrupts                                    */
    __IM uint32_t INTPEND1;                          /*!< (@ 0x00000464) Pending interrupts                                    */
    __IM uint32_t INTPEND2;                          /*!< (@ 0x00000468) Pending interrupts                                    */
    __IM uint32_t INTPEND3;                          /*!< (@ 0x0000046C) Pending interrupts                                    */
    __IM uint32_t INTPEND4;                          /*!< (@ 0x00000470) Pending interrupts                                    */
    __IM uint32_t INTPEND5;                          /*!< (@ 0x00000474) Pending interrupts                                    */
    __IM uint32_t INTPEND6;                          /*!< (@ 0x00000478) Pending interrupts                                    */
    __IM uint32_t INTPEND7;                          /*!< (@ 0x0000047C) Pending interrupts                                    */
    __IM uint32_t RESERVED4[96];
    __IOM NRF_PCRM_REQUEST_Type REQUEST;             /*!< (@ 0x00000600) (unspecified)                                         */
    __IOM NRF_PCRM_RAIL_Type RAIL;                   /*!< (@ 0x00000610) (unspecified)                                         */
    __IOM NRF_PCRM_CONFIG_Type CONFIG;               /*!< (@ 0x00000650) (unspecified)                                         */
    __IM uint32_t RESERVED5[32];
    __IOM NRF_PCRM_OVERRIDE_Type OVERRIDE;           /*!< (@ 0x00000750) (unspecified)                                         */
  } NRF_PCRM_Type;                                   /*!< Size = 2448 (0x990)                                                  */

/* PCRM_EVENTS_REQUESTRISING: Request rising for the consumer n */
  #define PCRM_EVENTS_REQUESTRISING_MaxCount (32UL)  /*!< Max size of EVENTS_REQUESTRISING[32] array.                          */
  #define PCRM_EVENTS_REQUESTRISING_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_REQUESTRISING[32] register.           */

/* EVENTS_REQUESTRISING @Bit 0 : Request rising for the consumer n */
  #define PCRM_EVENTS_REQUESTRISING_EVENTS_REQUESTRISING_Pos (0UL) /*!< Position of EVENTS_REQUESTRISING field.                */
  #define PCRM_EVENTS_REQUESTRISING_EVENTS_REQUESTRISING_Msk (0x1UL << PCRM_EVENTS_REQUESTRISING_EVENTS_REQUESTRISING_Pos) /*!<
                                                                            Bit mask of EVENTS_REQUESTRISING field.*/             
  #define PCRM_EVENTS_REQUESTRISING_EVENTS_REQUESTRISING_Min (0x0UL) /*!< Min enumerator value of EVENTS_REQUESTRISING field.  */
  #define PCRM_EVENTS_REQUESTRISING_EVENTS_REQUESTRISING_Max (0x1UL) /*!< Max enumerator value of EVENTS_REQUESTRISING field.  */
  #define PCRM_EVENTS_REQUESTRISING_EVENTS_REQUESTRISING_NotGenerated (0x0UL) /*!< Event not generated                         */
  #define PCRM_EVENTS_REQUESTRISING_EVENTS_REQUESTRISING_Generated (0x1UL) /*!< Event generated                                */


