adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PCRM_EVENTS_REQUESTFALLING: Request falling for the consumer n */
  #define PCRM_EVENTS_REQUESTFALLING_MaxCount (32UL) /*!< Max size of EVENTS_REQUESTFALLING[32] array.                         */
  #define PCRM_EVENTS_REQUESTFALLING_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_REQUESTFALLING[32] register.         */

/* EVENTS_REQUESTFALLING @Bit 0 : Request falling for the consumer n */
  #define PCRM_EVENTS_REQUESTFALLING_EVENTS_REQUESTFALLING_Pos (0UL) /*!< Position of EVENTS_REQUESTFALLING field.             */
  #define PCRM_EVENTS_REQUESTFALLING_EVENTS_REQUESTFALLING_Msk (0x1UL << PCRM_EVENTS_REQUESTFALLING_EVENTS_REQUESTFALLING_Pos)
                                                                            /*!< Bit mask of EVENTS_REQUESTFALLING field.*/       
  #define PCRM_EVENTS_REQUESTFALLING_EVENTS_REQUESTFALLING_Min (0x0UL) /*!< Min enumerator value of EVENTS_REQUESTFALLING
                                                                            field.*/                                              
  #define PCRM_EVENTS_REQUESTFALLING_EVENTS_REQUESTFALLING_Max (0x1UL) /*!< Max enumerator value of EVENTS_REQUESTFALLING
                                                                            field.*/                                              
  #define PCRM_EVENTS_REQUESTFALLING_EVENTS_REQUESTFALLING_NotGenerated (0x0UL) /*!< Event not generated                       */
  #define PCRM_EVENTS_REQUESTFALLING_EVENTS_REQUESTFALLING_Generated (0x1UL) /*!< Event generated                              */


/* PCRM_EVENTS_LOADCHANGERAIL: Load change on rail n */
  #define PCRM_EVENTS_LOADCHANGERAIL_MaxCount (16UL) /*!< Max size of EVENTS_LOADCHANGERAIL[16] array.                         */
  #define PCRM_EVENTS_LOADCHANGERAIL_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_LOADCHANGERAIL[16] register.         */

/* EVENTS_LOADCHANGERAIL @Bit 0 : Load change on rail n */
  #define PCRM_EVENTS_LOADCHANGERAIL_EVENTS_LOADCHANGERAIL_Pos (0UL) /*!< Position of EVENTS_LOADCHANGERAIL field.             */
  #define PCRM_EVENTS_LOADCHANGERAIL_EVENTS_LOADCHANGERAIL_Msk (0x1UL << PCRM_EVENTS_LOADCHANGERAIL_EVENTS_LOADCHANGERAIL_Pos)
                                                                            /*!< Bit mask of EVENTS_LOADCHANGERAIL field.*/       
  #define PCRM_EVENTS_LOADCHANGERAIL_EVENTS_LOADCHANGERAIL_Min (0x0UL) /*!< Min enumerator value of EVENTS_LOADCHANGERAIL
                                                                            field.*/                                              
  #define PCRM_EVENTS_LOADCHANGERAIL_EVENTS_LOADCHANGERAIL_Max (0x1UL) /*!< Max enumerator value of EVENTS_LOADCHANGERAIL
                                                                            field.*/                                              
  #define PCRM_EVENTS_LOADCHANGERAIL_EVENTS_LOADCHANGERAIL_NotGenerated (0x0UL) /*!< Event not generated                       */
  #define PCRM_EVENTS_LOADCHANGERAIL_EVENTS_LOADCHANGERAIL_Generated (0x1UL) /*!< Event generated                              */


/* PCRM_INTEN0: Enable or disable interrupt */
  #define PCRM_INTEN0_ResetValue (0x00000000UL)      /*!< Reset value of INTEN0 register.                                      */

/* REQUESTRISING0 @Bit 0 : Enable or disable interrupt for event REQUESTRISING[0] */
  #define PCRM_INTEN0_REQUESTRISING0_Pos (0UL)       /*!< Position of REQUESTRISING0 field.                                    */
  #define PCRM_INTEN0_REQUESTRISING0_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING0_Pos) /*!< Bit mask of REQUESTRISING0 field.      */
  #define PCRM_INTEN0_REQUESTRISING0_Min (0x0UL)     /*!< Min enumerator value of REQUESTRISING0 field.                        */
  #define PCRM_INTEN0_REQUESTRISING0_Max (0x1UL)     /*!< Max enumerator value of REQUESTRISING0 field.                        */
  #define PCRM_INTEN0_REQUESTRISING0_Disabled (0x0UL) /*!< Disable                                                             */
  #define PCRM_INTEN0_REQUESTRISING0_Enabled (0x1UL) /*!< Enable                                                               */

/* REQUESTRISING1 @Bit 1 : Enable or disable interrupt for event REQUESTRISING[1] */
  #define PCRM_INTEN0_REQUESTRISING1_Pos (1UL)       /*!< Position of REQUESTRISING1 field.                                    */
  #define PCRM_INTEN0_REQUESTRISING1_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING1_Pos) /*!< Bit mask of REQUESTRISING1 field.      */
  #define PCRM_INTEN0_REQUESTRISING1_Min (0x0UL)     /*!< Min enumerator value of REQUESTRISING1 field.                        */
  #define PCRM_INTEN0_REQUESTRISING1_Max (0x1UL)     /*!< Max enumerator value of REQUESTRISING1 field.                        */
  #define PCRM_INTEN0_REQUESTRISING1_Disabled (0x0UL) /*!< Disable                                                             */
  #define PCRM_INTEN0_REQUESTRISING1_Enabled (0x1UL) /*!< Enable                                                               */

/* REQUESTRISING2 @Bit 2 : Enable or disable interrupt for event REQUESTRISING[2] */
  #define PCRM_INTEN0_REQUESTRISING2_Pos (2UL)       /*!< Position of REQUESTRISING2 field.                                    */
  #define PCRM_INTEN0_REQUESTRISING2_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING2_Pos) /*!< Bit mask of REQUESTRISING2 field.      */
  #define PCRM_INTEN0_REQUESTRISING2_Min (0x0UL)     /*!< Min enumerator value of REQUESTRISING2 field.                        */
  #define PCRM_INTEN0_REQUESTRISING2_Max (0x1UL)     /*!< Max enumerator value of REQUESTRISING2 field.                        */
  #define PCRM_INTEN0_REQUESTRISING2_Disabled (0x0UL) /*!< Disable                                                             */
  #define PCRM_INTEN0_REQUESTRISING2_Enabled (0x1UL) /*!< Enable                                                               */

/* REQUESTRISING3 @Bit 3 : Enable or disable interrupt for event REQUESTRISING[3] */
  #define PCRM_INTEN0_REQUESTRISING3_Pos (3UL)       /*!< Position of REQUESTRISING3 field.                                    */
  #define PCRM_INTEN0_REQUESTRISING3_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING3_Pos) /*!< Bit mask of REQUESTRISING3 field.      */
  #define PCRM_INTEN0_REQUESTRISING3_Min (0x0UL)     /*!< Min enumerator value of REQUESTRISING3 field.                        */
  #define PCRM_INTEN0_REQUESTRISING3_Max (0x1UL)     /*!< Max enumerator value of REQUESTRISING3 field.                        */
  #define PCRM_INTEN0_REQUESTRISING3_Disabled (0x0UL) /*!< Disable                                                             */
  #define PCRM_INTEN0_REQUESTRISING3_Enabled (0x1UL) /*!< Enable                                                               */

/* REQUESTRISING4 @Bit 4 : Enable or disable interrupt for event REQUESTRISING[4] */
  #define PCRM_INTEN0_REQUESTRISING4_Pos (4UL)       /*!< Position of REQUESTRISING4 field.                                    */
  #define PCRM_INTEN0_REQUESTRISING4_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING4_Pos) /*!< Bit mask of REQUESTRISING4 field.      */
  #define PCRM_INTEN0_REQUESTRISING4_Min (0x0UL)     /*!< Min enumerator value of REQUESTRISING4 field.                        */
  #define PCRM_INTEN0_REQUESTRISING4_Max (0x1UL)     /*!< Max enumerator value of REQUESTRISING4 field.                        */
  #define PCRM_INTEN0_REQUESTRISING4_Disabled (0x0UL) /*!< Disable                                                             */
  #define PCRM_INTEN0_REQUESTRISING4_Enabled (0x1UL) /*!< Enable                                                               */

/* REQUESTRISING5 @Bit 5 : Enable or disable interrupt for event REQUESTRISING[5] */
  #define PCRM_INTEN0_REQUESTRISING5_Pos (5UL)       /*!< Position of REQUESTRISING5 field.                                    */
  #define PCRM_INTEN0_REQUESTRISING5_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING5_Pos) /*!< Bit mask of REQUESTRISING5 field.      */
  #define PCRM_INTEN0_REQUESTRISING5_Min (0x0UL)     /*!< Min enumerator value of REQUESTRISING5 field.                        */
  #define PCRM_INTEN0_REQUESTRISING5_Max (0x1UL)     /*!< Max enumerator value of REQUESTRISING5 field.                        */
  #define PCRM_INTEN0_REQUESTRISING5_Disabled (0x0UL) /*!< Disable                                                             */
  #define PCRM_INTEN0_REQUESTRISING5_Enabled (0x1UL) /*!< Enable                                                               */

