adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQUESTRISING25 @Bit 25 : Enable or disable interrupt for event REQUESTRISING[25] */
  #define PCRM_INTEN0_REQUESTRISING25_Pos (25UL)     /*!< Position of REQUESTRISING25 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING25_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING25_Pos) /*!< Bit mask of REQUESTRISING25 field.   */
  #define PCRM_INTEN0_REQUESTRISING25_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING25 field.                       */
  #define PCRM_INTEN0_REQUESTRISING25_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING25 field.                       */
  #define PCRM_INTEN0_REQUESTRISING25_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING25_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING26 @Bit 26 : Enable or disable interrupt for event REQUESTRISING[26] */
  #define PCRM_INTEN0_REQUESTRISING26_Pos (26UL)     /*!< Position of REQUESTRISING26 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING26_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING26_Pos) /*!< Bit mask of REQUESTRISING26 field.   */
  #define PCRM_INTEN0_REQUESTRISING26_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING26 field.                       */
  #define PCRM_INTEN0_REQUESTRISING26_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING26 field.                       */
  #define PCRM_INTEN0_REQUESTRISING26_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING26_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING27 @Bit 27 : Enable or disable interrupt for event REQUESTRISING[27] */
  #define PCRM_INTEN0_REQUESTRISING27_Pos (27UL)     /*!< Position of REQUESTRISING27 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING27_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING27_Pos) /*!< Bit mask of REQUESTRISING27 field.   */
  #define PCRM_INTEN0_REQUESTRISING27_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING27 field.                       */
  #define PCRM_INTEN0_REQUESTRISING27_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING27 field.                       */
  #define PCRM_INTEN0_REQUESTRISING27_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING27_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING28 @Bit 28 : Enable or disable interrupt for event REQUESTRISING[28] */
  #define PCRM_INTEN0_REQUESTRISING28_Pos (28UL)     /*!< Position of REQUESTRISING28 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING28_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING28_Pos) /*!< Bit mask of REQUESTRISING28 field.   */
  #define PCRM_INTEN0_REQUESTRISING28_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING28 field.                       */
  #define PCRM_INTEN0_REQUESTRISING28_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING28 field.                       */
  #define PCRM_INTEN0_REQUESTRISING28_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING28_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING29 @Bit 29 : Enable or disable interrupt for event REQUESTRISING[29] */
  #define PCRM_INTEN0_REQUESTRISING29_Pos (29UL)     /*!< Position of REQUESTRISING29 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING29_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING29_Pos) /*!< Bit mask of REQUESTRISING29 field.   */
  #define PCRM_INTEN0_REQUESTRISING29_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING29 field.                       */
  #define PCRM_INTEN0_REQUESTRISING29_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING29 field.                       */
  #define PCRM_INTEN0_REQUESTRISING29_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING29_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING30 @Bit 30 : Enable or disable interrupt for event REQUESTRISING[30] */
  #define PCRM_INTEN0_REQUESTRISING30_Pos (30UL)     /*!< Position of REQUESTRISING30 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING30_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING30_Pos) /*!< Bit mask of REQUESTRISING30 field.   */
  #define PCRM_INTEN0_REQUESTRISING30_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING30 field.                       */
  #define PCRM_INTEN0_REQUESTRISING30_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING30 field.                       */
  #define PCRM_INTEN0_REQUESTRISING30_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING30_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTRISING31 @Bit 31 : Enable or disable interrupt for event REQUESTRISING[31] */
  #define PCRM_INTEN0_REQUESTRISING31_Pos (31UL)     /*!< Position of REQUESTRISING31 field.                                   */
  #define PCRM_INTEN0_REQUESTRISING31_Msk (0x1UL << PCRM_INTEN0_REQUESTRISING31_Pos) /*!< Bit mask of REQUESTRISING31 field.   */
  #define PCRM_INTEN0_REQUESTRISING31_Min (0x0UL)    /*!< Min enumerator value of REQUESTRISING31 field.                       */
  #define PCRM_INTEN0_REQUESTRISING31_Max (0x1UL)    /*!< Max enumerator value of REQUESTRISING31 field.                       */
  #define PCRM_INTEN0_REQUESTRISING31_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN0_REQUESTRISING31_Enabled (0x1UL) /*!< Enable                                                              */


/* PCRM_INTEN2: Enable or disable interrupt */
  #define PCRM_INTEN2_ResetValue (0x00000000UL)      /*!< Reset value of INTEN2 register.                                      */

/* REQUESTFALLING0 @Bit 0 : Enable or disable interrupt for event REQUESTFALLING[0] */
  #define PCRM_INTEN2_REQUESTFALLING0_Pos (0UL)      /*!< Position of REQUESTFALLING0 field.                                   */
  #define PCRM_INTEN2_REQUESTFALLING0_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING0_Pos) /*!< Bit mask of REQUESTFALLING0 field.   */
  #define PCRM_INTEN2_REQUESTFALLING0_Min (0x0UL)    /*!< Min enumerator value of REQUESTFALLING0 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING0_Max (0x1UL)    /*!< Max enumerator value of REQUESTFALLING0 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING0_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN2_REQUESTFALLING0_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTFALLING1 @Bit 1 : Enable or disable interrupt for event REQUESTFALLING[1] */
  #define PCRM_INTEN2_REQUESTFALLING1_Pos (1UL)      /*!< Position of REQUESTFALLING1 field.                                   */
  #define PCRM_INTEN2_REQUESTFALLING1_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING1_Pos) /*!< Bit mask of REQUESTFALLING1 field.   */
  #define PCRM_INTEN2_REQUESTFALLING1_Min (0x0UL)    /*!< Min enumerator value of REQUESTFALLING1 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING1_Max (0x1UL)    /*!< Max enumerator value of REQUESTFALLING1 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING1_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN2_REQUESTFALLING1_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTFALLING2 @Bit 2 : Enable or disable interrupt for event REQUESTFALLING[2] */
  #define PCRM_INTEN2_REQUESTFALLING2_Pos (2UL)      /*!< Position of REQUESTFALLING2 field.                                   */
  #define PCRM_INTEN2_REQUESTFALLING2_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING2_Pos) /*!< Bit mask of REQUESTFALLING2 field.   */
  #define PCRM_INTEN2_REQUESTFALLING2_Min (0x0UL)    /*!< Min enumerator value of REQUESTFALLING2 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING2_Max (0x1UL)    /*!< Max enumerator value of REQUESTFALLING2 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING2_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN2_REQUESTFALLING2_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTFALLING3 @Bit 3 : Enable or disable interrupt for event REQUESTFALLING[3] */
  #define PCRM_INTEN2_REQUESTFALLING3_Pos (3UL)      /*!< Position of REQUESTFALLING3 field.                                   */
  #define PCRM_INTEN2_REQUESTFALLING3_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING3_Pos) /*!< Bit mask of REQUESTFALLING3 field.   */
  #define PCRM_INTEN2_REQUESTFALLING3_Min (0x0UL)    /*!< Min enumerator value of REQUESTFALLING3 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING3_Max (0x1UL)    /*!< Max enumerator value of REQUESTFALLING3 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING3_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN2_REQUESTFALLING3_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTFALLING4 @Bit 4 : Enable or disable interrupt for event REQUESTFALLING[4] */
  #define PCRM_INTEN2_REQUESTFALLING4_Pos (4UL)      /*!< Position of REQUESTFALLING4 field.                                   */
  #define PCRM_INTEN2_REQUESTFALLING4_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING4_Pos) /*!< Bit mask of REQUESTFALLING4 field.   */
  #define PCRM_INTEN2_REQUESTFALLING4_Min (0x0UL)    /*!< Min enumerator value of REQUESTFALLING4 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING4_Max (0x1UL)    /*!< Max enumerator value of REQUESTFALLING4 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING4_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN2_REQUESTFALLING4_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTFALLING5 @Bit 5 : Enable or disable interrupt for event REQUESTFALLING[5] */
  #define PCRM_INTEN2_REQUESTFALLING5_Pos (5UL)      /*!< Position of REQUESTFALLING5 field.                                   */
  #define PCRM_INTEN2_REQUESTFALLING5_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING5_Pos) /*!< Bit mask of REQUESTFALLING5 field.   */
  #define PCRM_INTEN2_REQUESTFALLING5_Min (0x0UL)    /*!< Min enumerator value of REQUESTFALLING5 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING5_Max (0x1UL)    /*!< Max enumerator value of REQUESTFALLING5 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING5_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN2_REQUESTFALLING5_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTFALLING6 @Bit 6 : Enable or disable interrupt for event REQUESTFALLING[6] */
  #define PCRM_INTEN2_REQUESTFALLING6_Pos (6UL)      /*!< Position of REQUESTFALLING6 field.                                   */
  #define PCRM_INTEN2_REQUESTFALLING6_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING6_Pos) /*!< Bit mask of REQUESTFALLING6 field.   */
  #define PCRM_INTEN2_REQUESTFALLING6_Min (0x0UL)    /*!< Min enumerator value of REQUESTFALLING6 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING6_Max (0x1UL)    /*!< Max enumerator value of REQUESTFALLING6 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING6_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN2_REQUESTFALLING6_Enabled (0x1UL) /*!< Enable                                                              */

/* REQUESTFALLING7 @Bit 7 : Enable or disable interrupt for event REQUESTFALLING[7] */
  #define PCRM_INTEN2_REQUESTFALLING7_Pos (7UL)      /*!< Position of REQUESTFALLING7 field.                                   */
  #define PCRM_INTEN2_REQUESTFALLING7_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING7_Pos) /*!< Bit mask of REQUESTFALLING7 field.   */
  #define PCRM_INTEN2_REQUESTFALLING7_Min (0x0UL)    /*!< Min enumerator value of REQUESTFALLING7 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING7_Max (0x1UL)    /*!< Max enumerator value of REQUESTFALLING7 field.                       */
  #define PCRM_INTEN2_REQUESTFALLING7_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN2_REQUESTFALLING7_Enabled (0x1UL) /*!< Enable                                                              */

