adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQUESTFALLING22 @Bit 22 : Enable or disable interrupt for event REQUESTFALLING[22] */
  #define PCRM_INTEN2_REQUESTFALLING22_Pos (22UL)    /*!< Position of REQUESTFALLING22 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING22_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING22_Pos) /*!< Bit mask of REQUESTFALLING22 field.*/
  #define PCRM_INTEN2_REQUESTFALLING22_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING22 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING22_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING22 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING22_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING22_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING23 @Bit 23 : Enable or disable interrupt for event REQUESTFALLING[23] */
  #define PCRM_INTEN2_REQUESTFALLING23_Pos (23UL)    /*!< Position of REQUESTFALLING23 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING23_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING23_Pos) /*!< Bit mask of REQUESTFALLING23 field.*/
  #define PCRM_INTEN2_REQUESTFALLING23_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING23 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING23_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING23 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING23_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING23_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING24 @Bit 24 : Enable or disable interrupt for event REQUESTFALLING[24] */
  #define PCRM_INTEN2_REQUESTFALLING24_Pos (24UL)    /*!< Position of REQUESTFALLING24 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING24_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING24_Pos) /*!< Bit mask of REQUESTFALLING24 field.*/
  #define PCRM_INTEN2_REQUESTFALLING24_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING24 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING24_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING24 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING24_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING24_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING25 @Bit 25 : Enable or disable interrupt for event REQUESTFALLING[25] */
  #define PCRM_INTEN2_REQUESTFALLING25_Pos (25UL)    /*!< Position of REQUESTFALLING25 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING25_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING25_Pos) /*!< Bit mask of REQUESTFALLING25 field.*/
  #define PCRM_INTEN2_REQUESTFALLING25_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING25 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING25_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING25 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING25_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING25_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING26 @Bit 26 : Enable or disable interrupt for event REQUESTFALLING[26] */
  #define PCRM_INTEN2_REQUESTFALLING26_Pos (26UL)    /*!< Position of REQUESTFALLING26 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING26_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING26_Pos) /*!< Bit mask of REQUESTFALLING26 field.*/
  #define PCRM_INTEN2_REQUESTFALLING26_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING26 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING26_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING26 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING26_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING26_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING27 @Bit 27 : Enable or disable interrupt for event REQUESTFALLING[27] */
  #define PCRM_INTEN2_REQUESTFALLING27_Pos (27UL)    /*!< Position of REQUESTFALLING27 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING27_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING27_Pos) /*!< Bit mask of REQUESTFALLING27 field.*/
  #define PCRM_INTEN2_REQUESTFALLING27_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING27 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING27_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING27 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING27_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING27_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING28 @Bit 28 : Enable or disable interrupt for event REQUESTFALLING[28] */
  #define PCRM_INTEN2_REQUESTFALLING28_Pos (28UL)    /*!< Position of REQUESTFALLING28 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING28_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING28_Pos) /*!< Bit mask of REQUESTFALLING28 field.*/
  #define PCRM_INTEN2_REQUESTFALLING28_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING28 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING28_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING28 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING28_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING28_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING29 @Bit 29 : Enable or disable interrupt for event REQUESTFALLING[29] */
  #define PCRM_INTEN2_REQUESTFALLING29_Pos (29UL)    /*!< Position of REQUESTFALLING29 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING29_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING29_Pos) /*!< Bit mask of REQUESTFALLING29 field.*/
  #define PCRM_INTEN2_REQUESTFALLING29_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING29 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING29_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING29 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING29_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING29_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING30 @Bit 30 : Enable or disable interrupt for event REQUESTFALLING[30] */
  #define PCRM_INTEN2_REQUESTFALLING30_Pos (30UL)    /*!< Position of REQUESTFALLING30 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING30_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING30_Pos) /*!< Bit mask of REQUESTFALLING30 field.*/
  #define PCRM_INTEN2_REQUESTFALLING30_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING30 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING30_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING30 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING30_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING30_Enabled (0x1UL) /*!< Enable                                                             */

/* REQUESTFALLING31 @Bit 31 : Enable or disable interrupt for event REQUESTFALLING[31] */
  #define PCRM_INTEN2_REQUESTFALLING31_Pos (31UL)    /*!< Position of REQUESTFALLING31 field.                                  */
  #define PCRM_INTEN2_REQUESTFALLING31_Msk (0x1UL << PCRM_INTEN2_REQUESTFALLING31_Pos) /*!< Bit mask of REQUESTFALLING31 field.*/
  #define PCRM_INTEN2_REQUESTFALLING31_Min (0x0UL)   /*!< Min enumerator value of REQUESTFALLING31 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING31_Max (0x1UL)   /*!< Max enumerator value of REQUESTFALLING31 field.                      */
  #define PCRM_INTEN2_REQUESTFALLING31_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN2_REQUESTFALLING31_Enabled (0x1UL) /*!< Enable                                                             */


/* PCRM_INTEN4: Enable or disable interrupt */
  #define PCRM_INTEN4_ResetValue (0x00000000UL)      /*!< Reset value of INTEN4 register.                                      */

/* LOADCHANGERAIL0 @Bit 0 : Enable or disable interrupt for event LOADCHANGERAIL[0] */
  #define PCRM_INTEN4_LOADCHANGERAIL0_Pos (0UL)      /*!< Position of LOADCHANGERAIL0 field.                                   */
  #define PCRM_INTEN4_LOADCHANGERAIL0_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL0_Pos) /*!< Bit mask of LOADCHANGERAIL0 field.   */
  #define PCRM_INTEN4_LOADCHANGERAIL0_Min (0x0UL)    /*!< Min enumerator value of LOADCHANGERAIL0 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL0_Max (0x1UL)    /*!< Max enumerator value of LOADCHANGERAIL0 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL0_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN4_LOADCHANGERAIL0_Enabled (0x1UL) /*!< Enable                                                              */

/* LOADCHANGERAIL1 @Bit 1 : Enable or disable interrupt for event LOADCHANGERAIL[1] */
  #define PCRM_INTEN4_LOADCHANGERAIL1_Pos (1UL)      /*!< Position of LOADCHANGERAIL1 field.                                   */
  #define PCRM_INTEN4_LOADCHANGERAIL1_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL1_Pos) /*!< Bit mask of LOADCHANGERAIL1 field.   */
  #define PCRM_INTEN4_LOADCHANGERAIL1_Min (0x0UL)    /*!< Min enumerator value of LOADCHANGERAIL1 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL1_Max (0x1UL)    /*!< Max enumerator value of LOADCHANGERAIL1 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL1_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN4_LOADCHANGERAIL1_Enabled (0x1UL) /*!< Enable                                                              */

/* LOADCHANGERAIL2 @Bit 2 : Enable or disable interrupt for event LOADCHANGERAIL[2] */
  #define PCRM_INTEN4_LOADCHANGERAIL2_Pos (2UL)      /*!< Position of LOADCHANGERAIL2 field.                                   */
  #define PCRM_INTEN4_LOADCHANGERAIL2_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL2_Pos) /*!< Bit mask of LOADCHANGERAIL2 field.   */
  #define PCRM_INTEN4_LOADCHANGERAIL2_Min (0x0UL)    /*!< Min enumerator value of LOADCHANGERAIL2 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL2_Max (0x1UL)    /*!< Max enumerator value of LOADCHANGERAIL2 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL2_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN4_LOADCHANGERAIL2_Enabled (0x1UL) /*!< Enable                                                              */

/* LOADCHANGERAIL3 @Bit 3 : Enable or disable interrupt for event LOADCHANGERAIL[3] */
  #define PCRM_INTEN4_LOADCHANGERAIL3_Pos (3UL)      /*!< Position of LOADCHANGERAIL3 field.                                   */
  #define PCRM_INTEN4_LOADCHANGERAIL3_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL3_Pos) /*!< Bit mask of LOADCHANGERAIL3 field.   */
  #define PCRM_INTEN4_LOADCHANGERAIL3_Min (0x0UL)    /*!< Min enumerator value of LOADCHANGERAIL3 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL3_Max (0x1UL)    /*!< Max enumerator value of LOADCHANGERAIL3 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL3_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN4_LOADCHANGERAIL3_Enabled (0x1UL) /*!< Enable                                                              */

/* LOADCHANGERAIL4 @Bit 4 : Enable or disable interrupt for event LOADCHANGERAIL[4] */
  #define PCRM_INTEN4_LOADCHANGERAIL4_Pos (4UL)      /*!< Position of LOADCHANGERAIL4 field.                                   */
  #define PCRM_INTEN4_LOADCHANGERAIL4_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL4_Pos) /*!< Bit mask of LOADCHANGERAIL4 field.   */
  #define PCRM_INTEN4_LOADCHANGERAIL4_Min (0x0UL)    /*!< Min enumerator value of LOADCHANGERAIL4 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL4_Max (0x1UL)    /*!< Max enumerator value of LOADCHANGERAIL4 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL4_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN4_LOADCHANGERAIL4_Enabled (0x1UL) /*!< Enable                                                              */

/* LOADCHANGERAIL5 @Bit 5 : Enable or disable interrupt for event LOADCHANGERAIL[5] */
  #define PCRM_INTEN4_LOADCHANGERAIL5_Pos (5UL)      /*!< Position of LOADCHANGERAIL5 field.                                   */
  #define PCRM_INTEN4_LOADCHANGERAIL5_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL5_Pos) /*!< Bit mask of LOADCHANGERAIL5 field.   */
  #define PCRM_INTEN4_LOADCHANGERAIL5_Min (0x0UL)    /*!< Min enumerator value of LOADCHANGERAIL5 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL5_Max (0x1UL)    /*!< Max enumerator value of LOADCHANGERAIL5 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL5_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN4_LOADCHANGERAIL5_Enabled (0x1UL) /*!< Enable                                                              */

/* LOADCHANGERAIL6 @Bit 6 : Enable or disable interrupt for event LOADCHANGERAIL[6] */
  #define PCRM_INTEN4_LOADCHANGERAIL6_Pos (6UL)      /*!< Position of LOADCHANGERAIL6 field.                                   */
  #define PCRM_INTEN4_LOADCHANGERAIL6_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL6_Pos) /*!< Bit mask of LOADCHANGERAIL6 field.   */
  #define PCRM_INTEN4_LOADCHANGERAIL6_Min (0x0UL)    /*!< Min enumerator value of LOADCHANGERAIL6 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL6_Max (0x1UL)    /*!< Max enumerator value of LOADCHANGERAIL6 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL6_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN4_LOADCHANGERAIL6_Enabled (0x1UL) /*!< Enable                                                              */

/* LOADCHANGERAIL7 @Bit 7 : Enable or disable interrupt for event LOADCHANGERAIL[7] */
  #define PCRM_INTEN4_LOADCHANGERAIL7_Pos (7UL)      /*!< Position of LOADCHANGERAIL7 field.                                   */
  #define PCRM_INTEN4_LOADCHANGERAIL7_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL7_Pos) /*!< Bit mask of LOADCHANGERAIL7 field.   */
  #define PCRM_INTEN4_LOADCHANGERAIL7_Min (0x0UL)    /*!< Min enumerator value of LOADCHANGERAIL7 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL7_Max (0x1UL)    /*!< Max enumerator value of LOADCHANGERAIL7 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL7_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN4_LOADCHANGERAIL7_Enabled (0x1UL) /*!< Enable                                                              */

