adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LOADCHANGERAIL8 @Bit 8 : Enable or disable interrupt for event LOADCHANGERAIL[8] */
  #define PCRM_INTEN4_LOADCHANGERAIL8_Pos (8UL)      /*!< Position of LOADCHANGERAIL8 field.                                   */
  #define PCRM_INTEN4_LOADCHANGERAIL8_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL8_Pos) /*!< Bit mask of LOADCHANGERAIL8 field.   */
  #define PCRM_INTEN4_LOADCHANGERAIL8_Min (0x0UL)    /*!< Min enumerator value of LOADCHANGERAIL8 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL8_Max (0x1UL)    /*!< Max enumerator value of LOADCHANGERAIL8 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL8_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN4_LOADCHANGERAIL8_Enabled (0x1UL) /*!< Enable                                                              */

/* LOADCHANGERAIL9 @Bit 9 : Enable or disable interrupt for event LOADCHANGERAIL[9] */
  #define PCRM_INTEN4_LOADCHANGERAIL9_Pos (9UL)      /*!< Position of LOADCHANGERAIL9 field.                                   */
  #define PCRM_INTEN4_LOADCHANGERAIL9_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL9_Pos) /*!< Bit mask of LOADCHANGERAIL9 field.   */
  #define PCRM_INTEN4_LOADCHANGERAIL9_Min (0x0UL)    /*!< Min enumerator value of LOADCHANGERAIL9 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL9_Max (0x1UL)    /*!< Max enumerator value of LOADCHANGERAIL9 field.                       */
  #define PCRM_INTEN4_LOADCHANGERAIL9_Disabled (0x0UL) /*!< Disable                                                            */
  #define PCRM_INTEN4_LOADCHANGERAIL9_Enabled (0x1UL) /*!< Enable                                                              */

/* LOADCHANGERAIL10 @Bit 10 : Enable or disable interrupt for event LOADCHANGERAIL[10] */
  #define PCRM_INTEN4_LOADCHANGERAIL10_Pos (10UL)    /*!< Position of LOADCHANGERAIL10 field.                                  */
  #define PCRM_INTEN4_LOADCHANGERAIL10_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL10_Pos) /*!< Bit mask of LOADCHANGERAIL10 field.*/
  #define PCRM_INTEN4_LOADCHANGERAIL10_Min (0x0UL)   /*!< Min enumerator value of LOADCHANGERAIL10 field.                      */
  #define PCRM_INTEN4_LOADCHANGERAIL10_Max (0x1UL)   /*!< Max enumerator value of LOADCHANGERAIL10 field.                      */
  #define PCRM_INTEN4_LOADCHANGERAIL10_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN4_LOADCHANGERAIL10_Enabled (0x1UL) /*!< Enable                                                             */

/* LOADCHANGERAIL11 @Bit 11 : Enable or disable interrupt for event LOADCHANGERAIL[11] */
  #define PCRM_INTEN4_LOADCHANGERAIL11_Pos (11UL)    /*!< Position of LOADCHANGERAIL11 field.                                  */
  #define PCRM_INTEN4_LOADCHANGERAIL11_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL11_Pos) /*!< Bit mask of LOADCHANGERAIL11 field.*/
  #define PCRM_INTEN4_LOADCHANGERAIL11_Min (0x0UL)   /*!< Min enumerator value of LOADCHANGERAIL11 field.                      */
  #define PCRM_INTEN4_LOADCHANGERAIL11_Max (0x1UL)   /*!< Max enumerator value of LOADCHANGERAIL11 field.                      */
  #define PCRM_INTEN4_LOADCHANGERAIL11_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN4_LOADCHANGERAIL11_Enabled (0x1UL) /*!< Enable                                                             */

/* LOADCHANGERAIL12 @Bit 12 : Enable or disable interrupt for event LOADCHANGERAIL[12] */
  #define PCRM_INTEN4_LOADCHANGERAIL12_Pos (12UL)    /*!< Position of LOADCHANGERAIL12 field.                                  */
  #define PCRM_INTEN4_LOADCHANGERAIL12_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL12_Pos) /*!< Bit mask of LOADCHANGERAIL12 field.*/
  #define PCRM_INTEN4_LOADCHANGERAIL12_Min (0x0UL)   /*!< Min enumerator value of LOADCHANGERAIL12 field.                      */
  #define PCRM_INTEN4_LOADCHANGERAIL12_Max (0x1UL)   /*!< Max enumerator value of LOADCHANGERAIL12 field.                      */
  #define PCRM_INTEN4_LOADCHANGERAIL12_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN4_LOADCHANGERAIL12_Enabled (0x1UL) /*!< Enable                                                             */

/* LOADCHANGERAIL13 @Bit 13 : Enable or disable interrupt for event LOADCHANGERAIL[13] */
  #define PCRM_INTEN4_LOADCHANGERAIL13_Pos (13UL)    /*!< Position of LOADCHANGERAIL13 field.                                  */
  #define PCRM_INTEN4_LOADCHANGERAIL13_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL13_Pos) /*!< Bit mask of LOADCHANGERAIL13 field.*/
  #define PCRM_INTEN4_LOADCHANGERAIL13_Min (0x0UL)   /*!< Min enumerator value of LOADCHANGERAIL13 field.                      */
  #define PCRM_INTEN4_LOADCHANGERAIL13_Max (0x1UL)   /*!< Max enumerator value of LOADCHANGERAIL13 field.                      */
  #define PCRM_INTEN4_LOADCHANGERAIL13_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN4_LOADCHANGERAIL13_Enabled (0x1UL) /*!< Enable                                                             */

/* LOADCHANGERAIL14 @Bit 14 : Enable or disable interrupt for event LOADCHANGERAIL[14] */
  #define PCRM_INTEN4_LOADCHANGERAIL14_Pos (14UL)    /*!< Position of LOADCHANGERAIL14 field.                                  */
  #define PCRM_INTEN4_LOADCHANGERAIL14_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL14_Pos) /*!< Bit mask of LOADCHANGERAIL14 field.*/
  #define PCRM_INTEN4_LOADCHANGERAIL14_Min (0x0UL)   /*!< Min enumerator value of LOADCHANGERAIL14 field.                      */
  #define PCRM_INTEN4_LOADCHANGERAIL14_Max (0x1UL)   /*!< Max enumerator value of LOADCHANGERAIL14 field.                      */
  #define PCRM_INTEN4_LOADCHANGERAIL14_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN4_LOADCHANGERAIL14_Enabled (0x1UL) /*!< Enable                                                             */

