adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LOADCHANGERAIL15 @Bit 15 : Enable or disable interrupt for event LOADCHANGERAIL[15] */
  #define PCRM_INTEN4_LOADCHANGERAIL15_Pos (15UL)    /*!< Position of LOADCHANGERAIL15 field.                                  */
  #define PCRM_INTEN4_LOADCHANGERAIL15_Msk (0x1UL << PCRM_INTEN4_LOADCHANGERAIL15_Pos) /*!< Bit mask of LOADCHANGERAIL15 field.*/
  #define PCRM_INTEN4_LOADCHANGERAIL15_Min (0x0UL)   /*!< Min enumerator value of LOADCHANGERAIL15 field.                      */
  #define PCRM_INTEN4_LOADCHANGERAIL15_Max (0x1UL)   /*!< Max enumerator value of LOADCHANGERAIL15 field.                      */
  #define PCRM_INTEN4_LOADCHANGERAIL15_Disabled (0x0UL) /*!< Disable                                                           */
  #define PCRM_INTEN4_LOADCHANGERAIL15_Enabled (0x1UL) /*!< Enable                                                             */


/* PCRM_INTENSET0: Enable interrupt */
  #define PCRM_INTENSET0_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET0 register.                                   */

/* REQUESTRISING0 @Bit 0 : Write '1' to enable interrupt for event REQUESTRISING[0] */
  #define PCRM_INTENSET0_REQUESTRISING0_Pos (0UL)    /*!< Position of REQUESTRISING0 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING0_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING0_Pos) /*!< Bit mask of REQUESTRISING0 field.*/
  #define PCRM_INTENSET0_REQUESTRISING0_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING0 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING0_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING0 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING0_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING0_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING0_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING1 @Bit 1 : Write '1' to enable interrupt for event REQUESTRISING[1] */
  #define PCRM_INTENSET0_REQUESTRISING1_Pos (1UL)    /*!< Position of REQUESTRISING1 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING1_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING1_Pos) /*!< Bit mask of REQUESTRISING1 field.*/
  #define PCRM_INTENSET0_REQUESTRISING1_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING1 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING1_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING1 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING1_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING1_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING1_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING2 @Bit 2 : Write '1' to enable interrupt for event REQUESTRISING[2] */
  #define PCRM_INTENSET0_REQUESTRISING2_Pos (2UL)    /*!< Position of REQUESTRISING2 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING2_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING2_Pos) /*!< Bit mask of REQUESTRISING2 field.*/
  #define PCRM_INTENSET0_REQUESTRISING2_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING2 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING2_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING2 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING2_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING2_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING2_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING3 @Bit 3 : Write '1' to enable interrupt for event REQUESTRISING[3] */
  #define PCRM_INTENSET0_REQUESTRISING3_Pos (3UL)    /*!< Position of REQUESTRISING3 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING3_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING3_Pos) /*!< Bit mask of REQUESTRISING3 field.*/
  #define PCRM_INTENSET0_REQUESTRISING3_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING3 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING3_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING3 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING3_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING3_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING3_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING4 @Bit 4 : Write '1' to enable interrupt for event REQUESTRISING[4] */
  #define PCRM_INTENSET0_REQUESTRISING4_Pos (4UL)    /*!< Position of REQUESTRISING4 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING4_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING4_Pos) /*!< Bit mask of REQUESTRISING4 field.*/
  #define PCRM_INTENSET0_REQUESTRISING4_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING4 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING4_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING4 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING4_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING4_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING4_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING5 @Bit 5 : Write '1' to enable interrupt for event REQUESTRISING[5] */
  #define PCRM_INTENSET0_REQUESTRISING5_Pos (5UL)    /*!< Position of REQUESTRISING5 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING5_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING5_Pos) /*!< Bit mask of REQUESTRISING5 field.*/
  #define PCRM_INTENSET0_REQUESTRISING5_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING5 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING5_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING5 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING5_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING5_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING5_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING6 @Bit 6 : Write '1' to enable interrupt for event REQUESTRISING[6] */
  #define PCRM_INTENSET0_REQUESTRISING6_Pos (6UL)    /*!< Position of REQUESTRISING6 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING6_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING6_Pos) /*!< Bit mask of REQUESTRISING6 field.*/
  #define PCRM_INTENSET0_REQUESTRISING6_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING6 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING6_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING6 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING6_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING6_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING6_Enabled (0x1UL) /*!< Read: Enabled                                                     */

