adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQUESTRISING7 @Bit 7 : Write '1' to enable interrupt for event REQUESTRISING[7] */
  #define PCRM_INTENSET0_REQUESTRISING7_Pos (7UL)    /*!< Position of REQUESTRISING7 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING7_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING7_Pos) /*!< Bit mask of REQUESTRISING7 field.*/
  #define PCRM_INTENSET0_REQUESTRISING7_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING7 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING7_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING7 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING7_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING7_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING7_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING8 @Bit 8 : Write '1' to enable interrupt for event REQUESTRISING[8] */
  #define PCRM_INTENSET0_REQUESTRISING8_Pos (8UL)    /*!< Position of REQUESTRISING8 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING8_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING8_Pos) /*!< Bit mask of REQUESTRISING8 field.*/
  #define PCRM_INTENSET0_REQUESTRISING8_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING8 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING8_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING8 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING8_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING8_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING8_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING9 @Bit 9 : Write '1' to enable interrupt for event REQUESTRISING[9] */
  #define PCRM_INTENSET0_REQUESTRISING9_Pos (9UL)    /*!< Position of REQUESTRISING9 field.                                    */
  #define PCRM_INTENSET0_REQUESTRISING9_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING9_Pos) /*!< Bit mask of REQUESTRISING9 field.*/
  #define PCRM_INTENSET0_REQUESTRISING9_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING9 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING9_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING9 field.                        */
  #define PCRM_INTENSET0_REQUESTRISING9_Set (0x1UL)  /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING9_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define PCRM_INTENSET0_REQUESTRISING9_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* REQUESTRISING10 @Bit 10 : Write '1' to enable interrupt for event REQUESTRISING[10] */
  #define PCRM_INTENSET0_REQUESTRISING10_Pos (10UL)  /*!< Position of REQUESTRISING10 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING10_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING10_Pos) /*!< Bit mask of REQUESTRISING10
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING10_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING10 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING10_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING10 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING10_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING10_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING10_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING11 @Bit 11 : Write '1' to enable interrupt for event REQUESTRISING[11] */
  #define PCRM_INTENSET0_REQUESTRISING11_Pos (11UL)  /*!< Position of REQUESTRISING11 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING11_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING11_Pos) /*!< Bit mask of REQUESTRISING11
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING11_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING11 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING11_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING11 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING11_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING11_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING11_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING12 @Bit 12 : Write '1' to enable interrupt for event REQUESTRISING[12] */
  #define PCRM_INTENSET0_REQUESTRISING12_Pos (12UL)  /*!< Position of REQUESTRISING12 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING12_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING12_Pos) /*!< Bit mask of REQUESTRISING12
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING12_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING12 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING12_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING12 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING12_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING12_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING12_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING13 @Bit 13 : Write '1' to enable interrupt for event REQUESTRISING[13] */
  #define PCRM_INTENSET0_REQUESTRISING13_Pos (13UL)  /*!< Position of REQUESTRISING13 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING13_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING13_Pos) /*!< Bit mask of REQUESTRISING13
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING13_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING13 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING13_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING13 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING13_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING13_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING13_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING14 @Bit 14 : Write '1' to enable interrupt for event REQUESTRISING[14] */
  #define PCRM_INTENSET0_REQUESTRISING14_Pos (14UL)  /*!< Position of REQUESTRISING14 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING14_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING14_Pos) /*!< Bit mask of REQUESTRISING14
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING14_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING14 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING14_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING14 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING14_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING14_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING14_Enabled (0x1UL) /*!< Read: Enabled                                                    */

