adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQUESTRISING15 @Bit 15 : Write '1' to enable interrupt for event REQUESTRISING[15] */
  #define PCRM_INTENSET0_REQUESTRISING15_Pos (15UL)  /*!< Position of REQUESTRISING15 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING15_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING15_Pos) /*!< Bit mask of REQUESTRISING15
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING15_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING15 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING15_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING15 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING15_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING15_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING15_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING16 @Bit 16 : Write '1' to enable interrupt for event REQUESTRISING[16] */
  #define PCRM_INTENSET0_REQUESTRISING16_Pos (16UL)  /*!< Position of REQUESTRISING16 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING16_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING16_Pos) /*!< Bit mask of REQUESTRISING16
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING16_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING16 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING16_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING16 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING16_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING16_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING16_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING17 @Bit 17 : Write '1' to enable interrupt for event REQUESTRISING[17] */
  #define PCRM_INTENSET0_REQUESTRISING17_Pos (17UL)  /*!< Position of REQUESTRISING17 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING17_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING17_Pos) /*!< Bit mask of REQUESTRISING17
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING17_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING17 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING17_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING17 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING17_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING17_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING17_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING18 @Bit 18 : Write '1' to enable interrupt for event REQUESTRISING[18] */
  #define PCRM_INTENSET0_REQUESTRISING18_Pos (18UL)  /*!< Position of REQUESTRISING18 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING18_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING18_Pos) /*!< Bit mask of REQUESTRISING18
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING18_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING18 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING18_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING18 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING18_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING18_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING18_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING19 @Bit 19 : Write '1' to enable interrupt for event REQUESTRISING[19] */
  #define PCRM_INTENSET0_REQUESTRISING19_Pos (19UL)  /*!< Position of REQUESTRISING19 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING19_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING19_Pos) /*!< Bit mask of REQUESTRISING19
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING19_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING19 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING19_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING19 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING19_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING19_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING19_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING20 @Bit 20 : Write '1' to enable interrupt for event REQUESTRISING[20] */
  #define PCRM_INTENSET0_REQUESTRISING20_Pos (20UL)  /*!< Position of REQUESTRISING20 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING20_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING20_Pos) /*!< Bit mask of REQUESTRISING20
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING20_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING20 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING20_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING20 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING20_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING20_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING20_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING21 @Bit 21 : Write '1' to enable interrupt for event REQUESTRISING[21] */
  #define PCRM_INTENSET0_REQUESTRISING21_Pos (21UL)  /*!< Position of REQUESTRISING21 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING21_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING21_Pos) /*!< Bit mask of REQUESTRISING21
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING21_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING21 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING21_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING21 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING21_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING21_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING21_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING22 @Bit 22 : Write '1' to enable interrupt for event REQUESTRISING[22] */
  #define PCRM_INTENSET0_REQUESTRISING22_Pos (22UL)  /*!< Position of REQUESTRISING22 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING22_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING22_Pos) /*!< Bit mask of REQUESTRISING22
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING22_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING22 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING22_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING22 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING22_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING22_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING22_Enabled (0x1UL) /*!< Read: Enabled                                                    */

