adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQUESTRISING23 @Bit 23 : Write '1' to enable interrupt for event REQUESTRISING[23] */
  #define PCRM_INTENSET0_REQUESTRISING23_Pos (23UL)  /*!< Position of REQUESTRISING23 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING23_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING23_Pos) /*!< Bit mask of REQUESTRISING23
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING23_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING23 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING23_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING23 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING23_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING23_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING23_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING24 @Bit 24 : Write '1' to enable interrupt for event REQUESTRISING[24] */
  #define PCRM_INTENSET0_REQUESTRISING24_Pos (24UL)  /*!< Position of REQUESTRISING24 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING24_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING24_Pos) /*!< Bit mask of REQUESTRISING24
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING24_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING24 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING24_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING24 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING24_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING24_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING24_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING25 @Bit 25 : Write '1' to enable interrupt for event REQUESTRISING[25] */
  #define PCRM_INTENSET0_REQUESTRISING25_Pos (25UL)  /*!< Position of REQUESTRISING25 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING25_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING25_Pos) /*!< Bit mask of REQUESTRISING25
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING25_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING25 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING25_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING25 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING25_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING25_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING25_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING26 @Bit 26 : Write '1' to enable interrupt for event REQUESTRISING[26] */
  #define PCRM_INTENSET0_REQUESTRISING26_Pos (26UL)  /*!< Position of REQUESTRISING26 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING26_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING26_Pos) /*!< Bit mask of REQUESTRISING26
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING26_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING26 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING26_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING26 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING26_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING26_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING26_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING27 @Bit 27 : Write '1' to enable interrupt for event REQUESTRISING[27] */
  #define PCRM_INTENSET0_REQUESTRISING27_Pos (27UL)  /*!< Position of REQUESTRISING27 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING27_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING27_Pos) /*!< Bit mask of REQUESTRISING27
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING27_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING27 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING27_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING27 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING27_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING27_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING27_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING28 @Bit 28 : Write '1' to enable interrupt for event REQUESTRISING[28] */
  #define PCRM_INTENSET0_REQUESTRISING28_Pos (28UL)  /*!< Position of REQUESTRISING28 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING28_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING28_Pos) /*!< Bit mask of REQUESTRISING28
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING28_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING28 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING28_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING28 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING28_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING28_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING28_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING29 @Bit 29 : Write '1' to enable interrupt for event REQUESTRISING[29] */
  #define PCRM_INTENSET0_REQUESTRISING29_Pos (29UL)  /*!< Position of REQUESTRISING29 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING29_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING29_Pos) /*!< Bit mask of REQUESTRISING29
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING29_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING29 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING29_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING29 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING29_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING29_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING29_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING30 @Bit 30 : Write '1' to enable interrupt for event REQUESTRISING[30] */
  #define PCRM_INTENSET0_REQUESTRISING30_Pos (30UL)  /*!< Position of REQUESTRISING30 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING30_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING30_Pos) /*!< Bit mask of REQUESTRISING30
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING30_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING30 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING30_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING30 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING30_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING30_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING30_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTRISING31 @Bit 31 : Write '1' to enable interrupt for event REQUESTRISING[31] */
  #define PCRM_INTENSET0_REQUESTRISING31_Pos (31UL)  /*!< Position of REQUESTRISING31 field.                                   */
  #define PCRM_INTENSET0_REQUESTRISING31_Msk (0x1UL << PCRM_INTENSET0_REQUESTRISING31_Pos) /*!< Bit mask of REQUESTRISING31
                                                                            field.*/                                              
  #define PCRM_INTENSET0_REQUESTRISING31_Min (0x0UL) /*!< Min enumerator value of REQUESTRISING31 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING31_Max (0x1UL) /*!< Max enumerator value of REQUESTRISING31 field.                       */
  #define PCRM_INTENSET0_REQUESTRISING31_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET0_REQUESTRISING31_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET0_REQUESTRISING31_Enabled (0x1UL) /*!< Read: Enabled                                                    */


/* PCRM_INTENSET2: Enable interrupt */
  #define PCRM_INTENSET2_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET2 register.                                   */

