adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQUESTFALLING0 @Bit 0 : Write '1' to enable interrupt for event REQUESTFALLING[0] */
  #define PCRM_INTENSET2_REQUESTFALLING0_Pos (0UL)   /*!< Position of REQUESTFALLING0 field.                                   */
  #define PCRM_INTENSET2_REQUESTFALLING0_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING0_Pos) /*!< Bit mask of REQUESTFALLING0
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING0_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING0 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING0_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING0 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING0_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET2_REQUESTFALLING0_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET2_REQUESTFALLING0_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTFALLING1 @Bit 1 : Write '1' to enable interrupt for event REQUESTFALLING[1] */
  #define PCRM_INTENSET2_REQUESTFALLING1_Pos (1UL)   /*!< Position of REQUESTFALLING1 field.                                   */
  #define PCRM_INTENSET2_REQUESTFALLING1_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING1_Pos) /*!< Bit mask of REQUESTFALLING1
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING1_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING1 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING1_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING1 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING1_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET2_REQUESTFALLING1_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET2_REQUESTFALLING1_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTFALLING2 @Bit 2 : Write '1' to enable interrupt for event REQUESTFALLING[2] */
  #define PCRM_INTENSET2_REQUESTFALLING2_Pos (2UL)   /*!< Position of REQUESTFALLING2 field.                                   */
  #define PCRM_INTENSET2_REQUESTFALLING2_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING2_Pos) /*!< Bit mask of REQUESTFALLING2
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING2_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING2 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING2_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING2 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING2_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET2_REQUESTFALLING2_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET2_REQUESTFALLING2_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTFALLING3 @Bit 3 : Write '1' to enable interrupt for event REQUESTFALLING[3] */
  #define PCRM_INTENSET2_REQUESTFALLING3_Pos (3UL)   /*!< Position of REQUESTFALLING3 field.                                   */
  #define PCRM_INTENSET2_REQUESTFALLING3_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING3_Pos) /*!< Bit mask of REQUESTFALLING3
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING3_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING3 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING3_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING3 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING3_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET2_REQUESTFALLING3_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET2_REQUESTFALLING3_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTFALLING4 @Bit 4 : Write '1' to enable interrupt for event REQUESTFALLING[4] */
  #define PCRM_INTENSET2_REQUESTFALLING4_Pos (4UL)   /*!< Position of REQUESTFALLING4 field.                                   */
  #define PCRM_INTENSET2_REQUESTFALLING4_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING4_Pos) /*!< Bit mask of REQUESTFALLING4
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING4_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING4 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING4_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING4 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING4_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET2_REQUESTFALLING4_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET2_REQUESTFALLING4_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTFALLING5 @Bit 5 : Write '1' to enable interrupt for event REQUESTFALLING[5] */
  #define PCRM_INTENSET2_REQUESTFALLING5_Pos (5UL)   /*!< Position of REQUESTFALLING5 field.                                   */
  #define PCRM_INTENSET2_REQUESTFALLING5_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING5_Pos) /*!< Bit mask of REQUESTFALLING5
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING5_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING5 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING5_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING5 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING5_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET2_REQUESTFALLING5_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET2_REQUESTFALLING5_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTFALLING6 @Bit 6 : Write '1' to enable interrupt for event REQUESTFALLING[6] */
  #define PCRM_INTENSET2_REQUESTFALLING6_Pos (6UL)   /*!< Position of REQUESTFALLING6 field.                                   */
  #define PCRM_INTENSET2_REQUESTFALLING6_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING6_Pos) /*!< Bit mask of REQUESTFALLING6
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING6_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING6 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING6_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING6 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING6_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET2_REQUESTFALLING6_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET2_REQUESTFALLING6_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTFALLING7 @Bit 7 : Write '1' to enable interrupt for event REQUESTFALLING[7] */
  #define PCRM_INTENSET2_REQUESTFALLING7_Pos (7UL)   /*!< Position of REQUESTFALLING7 field.                                   */
  #define PCRM_INTENSET2_REQUESTFALLING7_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING7_Pos) /*!< Bit mask of REQUESTFALLING7
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING7_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING7 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING7_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING7 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING7_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET2_REQUESTFALLING7_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET2_REQUESTFALLING7_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTFALLING8 @Bit 8 : Write '1' to enable interrupt for event REQUESTFALLING[8] */
  #define PCRM_INTENSET2_REQUESTFALLING8_Pos (8UL)   /*!< Position of REQUESTFALLING8 field.                                   */
  #define PCRM_INTENSET2_REQUESTFALLING8_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING8_Pos) /*!< Bit mask of REQUESTFALLING8
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING8_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING8 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING8_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING8 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING8_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET2_REQUESTFALLING8_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET2_REQUESTFALLING8_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTFALLING9 @Bit 9 : Write '1' to enable interrupt for event REQUESTFALLING[9] */
  #define PCRM_INTENSET2_REQUESTFALLING9_Pos (9UL)   /*!< Position of REQUESTFALLING9 field.                                   */
  #define PCRM_INTENSET2_REQUESTFALLING9_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING9_Pos) /*!< Bit mask of REQUESTFALLING9
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING9_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING9 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING9_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING9 field.                       */
  #define PCRM_INTENSET2_REQUESTFALLING9_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET2_REQUESTFALLING9_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET2_REQUESTFALLING9_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTFALLING10 @Bit 10 : Write '1' to enable interrupt for event REQUESTFALLING[10] */
  #define PCRM_INTENSET2_REQUESTFALLING10_Pos (10UL) /*!< Position of REQUESTFALLING10 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING10_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING10_Pos) /*!< Bit mask of REQUESTFALLING10
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING10_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING10 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING10_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING10 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING10_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING10_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING10_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING11 @Bit 11 : Write '1' to enable interrupt for event REQUESTFALLING[11] */
  #define PCRM_INTENSET2_REQUESTFALLING11_Pos (11UL) /*!< Position of REQUESTFALLING11 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING11_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING11_Pos) /*!< Bit mask of REQUESTFALLING11
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING11_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING11 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING11_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING11 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING11_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING11_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING11_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING12 @Bit 12 : Write '1' to enable interrupt for event REQUESTFALLING[12] */
  #define PCRM_INTENSET2_REQUESTFALLING12_Pos (12UL) /*!< Position of REQUESTFALLING12 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING12_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING12_Pos) /*!< Bit mask of REQUESTFALLING12
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING12_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING12 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING12_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING12 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING12_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING12_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING12_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING13 @Bit 13 : Write '1' to enable interrupt for event REQUESTFALLING[13] */
  #define PCRM_INTENSET2_REQUESTFALLING13_Pos (13UL) /*!< Position of REQUESTFALLING13 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING13_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING13_Pos) /*!< Bit mask of REQUESTFALLING13
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING13_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING13 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING13_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING13 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING13_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING13_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING13_Enabled (0x1UL) /*!< Read: Enabled                                                   */

