adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQUESTFALLING14 @Bit 14 : Write '1' to enable interrupt for event REQUESTFALLING[14] */
  #define PCRM_INTENSET2_REQUESTFALLING14_Pos (14UL) /*!< Position of REQUESTFALLING14 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING14_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING14_Pos) /*!< Bit mask of REQUESTFALLING14
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING14_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING14 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING14_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING14 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING14_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING14_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING14_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING15 @Bit 15 : Write '1' to enable interrupt for event REQUESTFALLING[15] */
  #define PCRM_INTENSET2_REQUESTFALLING15_Pos (15UL) /*!< Position of REQUESTFALLING15 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING15_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING15_Pos) /*!< Bit mask of REQUESTFALLING15
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING15_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING15 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING15_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING15 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING15_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING15_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING15_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING16 @Bit 16 : Write '1' to enable interrupt for event REQUESTFALLING[16] */
  #define PCRM_INTENSET2_REQUESTFALLING16_Pos (16UL) /*!< Position of REQUESTFALLING16 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING16_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING16_Pos) /*!< Bit mask of REQUESTFALLING16
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING16_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING16 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING16_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING16 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING16_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING16_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING16_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING17 @Bit 17 : Write '1' to enable interrupt for event REQUESTFALLING[17] */
  #define PCRM_INTENSET2_REQUESTFALLING17_Pos (17UL) /*!< Position of REQUESTFALLING17 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING17_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING17_Pos) /*!< Bit mask of REQUESTFALLING17
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING17_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING17 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING17_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING17 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING17_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING17_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING17_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING18 @Bit 18 : Write '1' to enable interrupt for event REQUESTFALLING[18] */
  #define PCRM_INTENSET2_REQUESTFALLING18_Pos (18UL) /*!< Position of REQUESTFALLING18 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING18_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING18_Pos) /*!< Bit mask of REQUESTFALLING18
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING18_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING18 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING18_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING18 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING18_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING18_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING18_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING19 @Bit 19 : Write '1' to enable interrupt for event REQUESTFALLING[19] */
  #define PCRM_INTENSET2_REQUESTFALLING19_Pos (19UL) /*!< Position of REQUESTFALLING19 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING19_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING19_Pos) /*!< Bit mask of REQUESTFALLING19
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING19_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING19 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING19_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING19 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING19_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING19_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING19_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING20 @Bit 20 : Write '1' to enable interrupt for event REQUESTFALLING[20] */
  #define PCRM_INTENSET2_REQUESTFALLING20_Pos (20UL) /*!< Position of REQUESTFALLING20 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING20_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING20_Pos) /*!< Bit mask of REQUESTFALLING20
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING20_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING20 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING20_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING20 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING20_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING20_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING20_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING21 @Bit 21 : Write '1' to enable interrupt for event REQUESTFALLING[21] */
  #define PCRM_INTENSET2_REQUESTFALLING21_Pos (21UL) /*!< Position of REQUESTFALLING21 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING21_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING21_Pos) /*!< Bit mask of REQUESTFALLING21
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING21_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING21 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING21_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING21 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING21_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING21_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING21_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING22 @Bit 22 : Write '1' to enable interrupt for event REQUESTFALLING[22] */
  #define PCRM_INTENSET2_REQUESTFALLING22_Pos (22UL) /*!< Position of REQUESTFALLING22 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING22_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING22_Pos) /*!< Bit mask of REQUESTFALLING22
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING22_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING22 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING22_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING22 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING22_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING22_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING22_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING23 @Bit 23 : Write '1' to enable interrupt for event REQUESTFALLING[23] */
  #define PCRM_INTENSET2_REQUESTFALLING23_Pos (23UL) /*!< Position of REQUESTFALLING23 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING23_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING23_Pos) /*!< Bit mask of REQUESTFALLING23
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING23_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING23 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING23_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING23 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING23_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING23_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING23_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING24 @Bit 24 : Write '1' to enable interrupt for event REQUESTFALLING[24] */
  #define PCRM_INTENSET2_REQUESTFALLING24_Pos (24UL) /*!< Position of REQUESTFALLING24 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING24_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING24_Pos) /*!< Bit mask of REQUESTFALLING24
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING24_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING24 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING24_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING24 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING24_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING24_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING24_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING25 @Bit 25 : Write '1' to enable interrupt for event REQUESTFALLING[25] */
  #define PCRM_INTENSET2_REQUESTFALLING25_Pos (25UL) /*!< Position of REQUESTFALLING25 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING25_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING25_Pos) /*!< Bit mask of REQUESTFALLING25
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING25_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING25 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING25_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING25 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING25_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING25_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING25_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING26 @Bit 26 : Write '1' to enable interrupt for event REQUESTFALLING[26] */
  #define PCRM_INTENSET2_REQUESTFALLING26_Pos (26UL) /*!< Position of REQUESTFALLING26 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING26_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING26_Pos) /*!< Bit mask of REQUESTFALLING26
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING26_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING26 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING26_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING26 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING26_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING26_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING26_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING27 @Bit 27 : Write '1' to enable interrupt for event REQUESTFALLING[27] */
  #define PCRM_INTENSET2_REQUESTFALLING27_Pos (27UL) /*!< Position of REQUESTFALLING27 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING27_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING27_Pos) /*!< Bit mask of REQUESTFALLING27
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING27_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING27 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING27_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING27 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING27_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING27_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING27_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING28 @Bit 28 : Write '1' to enable interrupt for event REQUESTFALLING[28] */
  #define PCRM_INTENSET2_REQUESTFALLING28_Pos (28UL) /*!< Position of REQUESTFALLING28 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING28_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING28_Pos) /*!< Bit mask of REQUESTFALLING28
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING28_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING28 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING28_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING28 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING28_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING28_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING28_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING29 @Bit 29 : Write '1' to enable interrupt for event REQUESTFALLING[29] */
  #define PCRM_INTENSET2_REQUESTFALLING29_Pos (29UL) /*!< Position of REQUESTFALLING29 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING29_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING29_Pos) /*!< Bit mask of REQUESTFALLING29
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING29_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING29 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING29_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING29 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING29_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING29_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING29_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING30 @Bit 30 : Write '1' to enable interrupt for event REQUESTFALLING[30] */
  #define PCRM_INTENSET2_REQUESTFALLING30_Pos (30UL) /*!< Position of REQUESTFALLING30 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING30_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING30_Pos) /*!< Bit mask of REQUESTFALLING30
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING30_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING30 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING30_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING30 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING30_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING30_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING30_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING31 @Bit 31 : Write '1' to enable interrupt for event REQUESTFALLING[31] */
  #define PCRM_INTENSET2_REQUESTFALLING31_Pos (31UL) /*!< Position of REQUESTFALLING31 field.                                  */
  #define PCRM_INTENSET2_REQUESTFALLING31_Msk (0x1UL << PCRM_INTENSET2_REQUESTFALLING31_Pos) /*!< Bit mask of REQUESTFALLING31
                                                                            field.*/                                              
  #define PCRM_INTENSET2_REQUESTFALLING31_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING31 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING31_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING31 field.                     */
  #define PCRM_INTENSET2_REQUESTFALLING31_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET2_REQUESTFALLING31_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET2_REQUESTFALLING31_Enabled (0x1UL) /*!< Read: Enabled                                                   */


/* PCRM_INTENSET4: Enable interrupt */
  #define PCRM_INTENSET4_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET4 register.                                   */

/* LOADCHANGERAIL0 @Bit 0 : Write '1' to enable interrupt for event LOADCHANGERAIL[0] */
  #define PCRM_INTENSET4_LOADCHANGERAIL0_Pos (0UL)   /*!< Position of LOADCHANGERAIL0 field.                                   */
  #define PCRM_INTENSET4_LOADCHANGERAIL0_Msk (0x1UL << PCRM_INTENSET4_LOADCHANGERAIL0_Pos) /*!< Bit mask of LOADCHANGERAIL0
                                                                            field.*/                                              
  #define PCRM_INTENSET4_LOADCHANGERAIL0_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL0 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL0_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL0 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL0_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET4_LOADCHANGERAIL0_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET4_LOADCHANGERAIL0_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL1 @Bit 1 : Write '1' to enable interrupt for event LOADCHANGERAIL[1] */
  #define PCRM_INTENSET4_LOADCHANGERAIL1_Pos (1UL)   /*!< Position of LOADCHANGERAIL1 field.                                   */
  #define PCRM_INTENSET4_LOADCHANGERAIL1_Msk (0x1UL << PCRM_INTENSET4_LOADCHANGERAIL1_Pos) /*!< Bit mask of LOADCHANGERAIL1
                                                                            field.*/                                              
  #define PCRM_INTENSET4_LOADCHANGERAIL1_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL1 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL1_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL1 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL1_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET4_LOADCHANGERAIL1_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET4_LOADCHANGERAIL1_Enabled (0x1UL) /*!< Read: Enabled                                                    */

