adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LOADCHANGERAIL2 @Bit 2 : Write '1' to enable interrupt for event LOADCHANGERAIL[2] */
  #define PCRM_INTENSET4_LOADCHANGERAIL2_Pos (2UL)   /*!< Position of LOADCHANGERAIL2 field.                                   */
  #define PCRM_INTENSET4_LOADCHANGERAIL2_Msk (0x1UL << PCRM_INTENSET4_LOADCHANGERAIL2_Pos) /*!< Bit mask of LOADCHANGERAIL2
                                                                            field.*/                                              
  #define PCRM_INTENSET4_LOADCHANGERAIL2_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL2 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL2_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL2 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL2_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET4_LOADCHANGERAIL2_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET4_LOADCHANGERAIL2_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL3 @Bit 3 : Write '1' to enable interrupt for event LOADCHANGERAIL[3] */
  #define PCRM_INTENSET4_LOADCHANGERAIL3_Pos (3UL)   /*!< Position of LOADCHANGERAIL3 field.                                   */
  #define PCRM_INTENSET4_LOADCHANGERAIL3_Msk (0x1UL << PCRM_INTENSET4_LOADCHANGERAIL3_Pos) /*!< Bit mask of LOADCHANGERAIL3
                                                                            field.*/                                              
  #define PCRM_INTENSET4_LOADCHANGERAIL3_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL3 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL3_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL3 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL3_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET4_LOADCHANGERAIL3_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET4_LOADCHANGERAIL3_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL4 @Bit 4 : Write '1' to enable interrupt for event LOADCHANGERAIL[4] */
  #define PCRM_INTENSET4_LOADCHANGERAIL4_Pos (4UL)   /*!< Position of LOADCHANGERAIL4 field.                                   */
  #define PCRM_INTENSET4_LOADCHANGERAIL4_Msk (0x1UL << PCRM_INTENSET4_LOADCHANGERAIL4_Pos) /*!< Bit mask of LOADCHANGERAIL4
                                                                            field.*/                                              
  #define PCRM_INTENSET4_LOADCHANGERAIL4_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL4 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL4_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL4 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL4_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET4_LOADCHANGERAIL4_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET4_LOADCHANGERAIL4_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL5 @Bit 5 : Write '1' to enable interrupt for event LOADCHANGERAIL[5] */
  #define PCRM_INTENSET4_LOADCHANGERAIL5_Pos (5UL)   /*!< Position of LOADCHANGERAIL5 field.                                   */
  #define PCRM_INTENSET4_LOADCHANGERAIL5_Msk (0x1UL << PCRM_INTENSET4_LOADCHANGERAIL5_Pos) /*!< Bit mask of LOADCHANGERAIL5
                                                                            field.*/                                              
  #define PCRM_INTENSET4_LOADCHANGERAIL5_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL5 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL5_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL5 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL5_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET4_LOADCHANGERAIL5_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET4_LOADCHANGERAIL5_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL6 @Bit 6 : Write '1' to enable interrupt for event LOADCHANGERAIL[6] */
  #define PCRM_INTENSET4_LOADCHANGERAIL6_Pos (6UL)   /*!< Position of LOADCHANGERAIL6 field.                                   */
  #define PCRM_INTENSET4_LOADCHANGERAIL6_Msk (0x1UL << PCRM_INTENSET4_LOADCHANGERAIL6_Pos) /*!< Bit mask of LOADCHANGERAIL6
                                                                            field.*/                                              
  #define PCRM_INTENSET4_LOADCHANGERAIL6_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL6 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL6_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL6 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL6_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET4_LOADCHANGERAIL6_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET4_LOADCHANGERAIL6_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL7 @Bit 7 : Write '1' to enable interrupt for event LOADCHANGERAIL[7] */
  #define PCRM_INTENSET4_LOADCHANGERAIL7_Pos (7UL)   /*!< Position of LOADCHANGERAIL7 field.                                   */
  #define PCRM_INTENSET4_LOADCHANGERAIL7_Msk (0x1UL << PCRM_INTENSET4_LOADCHANGERAIL7_Pos) /*!< Bit mask of LOADCHANGERAIL7
                                                                            field.*/                                              
  #define PCRM_INTENSET4_LOADCHANGERAIL7_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL7 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL7_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL7 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL7_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET4_LOADCHANGERAIL7_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET4_LOADCHANGERAIL7_Enabled (0x1UL) /*!< Read: Enabled                                                    */

