adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LOADCHANGERAIL8 @Bit 8 : Write '1' to enable interrupt for event LOADCHANGERAIL[8] */
  #define PCRM_INTENSET4_LOADCHANGERAIL8_Pos (8UL)   /*!< Position of LOADCHANGERAIL8 field.                                   */
  #define PCRM_INTENSET4_LOADCHANGERAIL8_Msk (0x1UL << PCRM_INTENSET4_LOADCHANGERAIL8_Pos) /*!< Bit mask of LOADCHANGERAIL8
                                                                            field.*/                                              
  #define PCRM_INTENSET4_LOADCHANGERAIL8_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL8 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL8_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL8 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL8_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET4_LOADCHANGERAIL8_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET4_LOADCHANGERAIL8_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL9 @Bit 9 : Write '1' to enable interrupt for event LOADCHANGERAIL[9] */
  #define PCRM_INTENSET4_LOADCHANGERAIL9_Pos (9UL)   /*!< Position of LOADCHANGERAIL9 field.                                   */
  #define PCRM_INTENSET4_LOADCHANGERAIL9_Msk (0x1UL << PCRM_INTENSET4_LOADCHANGERAIL9_Pos) /*!< Bit mask of LOADCHANGERAIL9
                                                                            field.*/                                              
  #define PCRM_INTENSET4_LOADCHANGERAIL9_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL9 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL9_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL9 field.                       */
  #define PCRM_INTENSET4_LOADCHANGERAIL9_Set (0x1UL) /*!< Enable                                                               */
  #define PCRM_INTENSET4_LOADCHANGERAIL9_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENSET4_LOADCHANGERAIL9_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL10 @Bit 10 : Write '1' to enable interrupt for event LOADCHANGERAIL[10] */
  #define PCRM_INTENSET4_LOADCHANGERAIL10_Pos (10UL) /*!< Position of LOADCHANGERAIL10 field.                                  */
  #define PCRM_INTENSET4_LOADCHANGERAIL10_Msk (0x1UL << PCRM_INTENSET4_LOADCHANGERAIL10_Pos) /*!< Bit mask of LOADCHANGERAIL10
                                                                            field.*/                                              
  #define PCRM_INTENSET4_LOADCHANGERAIL10_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL10 field.                     */
  #define PCRM_INTENSET4_LOADCHANGERAIL10_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL10 field.                     */
  #define PCRM_INTENSET4_LOADCHANGERAIL10_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET4_LOADCHANGERAIL10_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET4_LOADCHANGERAIL10_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* LOADCHANGERAIL11 @Bit 11 : Write '1' to enable interrupt for event LOADCHANGERAIL[11] */
  #define PCRM_INTENSET4_LOADCHANGERAIL11_Pos (11UL) /*!< Position of LOADCHANGERAIL11 field.                                  */
  #define PCRM_INTENSET4_LOADCHANGERAIL11_Msk (0x1UL << PCRM_INTENSET4_LOADCHANGERAIL11_Pos) /*!< Bit mask of LOADCHANGERAIL11
                                                                            field.*/                                              
  #define PCRM_INTENSET4_LOADCHANGERAIL11_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL11 field.                     */
  #define PCRM_INTENSET4_LOADCHANGERAIL11_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL11 field.                     */
  #define PCRM_INTENSET4_LOADCHANGERAIL11_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET4_LOADCHANGERAIL11_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET4_LOADCHANGERAIL11_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* LOADCHANGERAIL12 @Bit 12 : Write '1' to enable interrupt for event LOADCHANGERAIL[12] */
  #define PCRM_INTENSET4_LOADCHANGERAIL12_Pos (12UL) /*!< Position of LOADCHANGERAIL12 field.                                  */
  #define PCRM_INTENSET4_LOADCHANGERAIL12_Msk (0x1UL << PCRM_INTENSET4_LOADCHANGERAIL12_Pos) /*!< Bit mask of LOADCHANGERAIL12
                                                                            field.*/                                              
  #define PCRM_INTENSET4_LOADCHANGERAIL12_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL12 field.                     */
  #define PCRM_INTENSET4_LOADCHANGERAIL12_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL12 field.                     */
  #define PCRM_INTENSET4_LOADCHANGERAIL12_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET4_LOADCHANGERAIL12_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET4_LOADCHANGERAIL12_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* LOADCHANGERAIL13 @Bit 13 : Write '1' to enable interrupt for event LOADCHANGERAIL[13] */
  #define PCRM_INTENSET4_LOADCHANGERAIL13_Pos (13UL) /*!< Position of LOADCHANGERAIL13 field.                                  */
  #define PCRM_INTENSET4_LOADCHANGERAIL13_Msk (0x1UL << PCRM_INTENSET4_LOADCHANGERAIL13_Pos) /*!< Bit mask of LOADCHANGERAIL13
                                                                            field.*/                                              
  #define PCRM_INTENSET4_LOADCHANGERAIL13_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL13 field.                     */
  #define PCRM_INTENSET4_LOADCHANGERAIL13_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL13 field.                     */
  #define PCRM_INTENSET4_LOADCHANGERAIL13_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET4_LOADCHANGERAIL13_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET4_LOADCHANGERAIL13_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* LOADCHANGERAIL14 @Bit 14 : Write '1' to enable interrupt for event LOADCHANGERAIL[14] */
  #define PCRM_INTENSET4_LOADCHANGERAIL14_Pos (14UL) /*!< Position of LOADCHANGERAIL14 field.                                  */
  #define PCRM_INTENSET4_LOADCHANGERAIL14_Msk (0x1UL << PCRM_INTENSET4_LOADCHANGERAIL14_Pos) /*!< Bit mask of LOADCHANGERAIL14
                                                                            field.*/                                              
  #define PCRM_INTENSET4_LOADCHANGERAIL14_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL14 field.                     */
  #define PCRM_INTENSET4_LOADCHANGERAIL14_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL14 field.                     */
  #define PCRM_INTENSET4_LOADCHANGERAIL14_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET4_LOADCHANGERAIL14_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET4_LOADCHANGERAIL14_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* LOADCHANGERAIL15 @Bit 15 : Write '1' to enable interrupt for event LOADCHANGERAIL[15] */
  #define PCRM_INTENSET4_LOADCHANGERAIL15_Pos (15UL) /*!< Position of LOADCHANGERAIL15 field.                                  */
  #define PCRM_INTENSET4_LOADCHANGERAIL15_Msk (0x1UL << PCRM_INTENSET4_LOADCHANGERAIL15_Pos) /*!< Bit mask of LOADCHANGERAIL15
                                                                            field.*/                                              
  #define PCRM_INTENSET4_LOADCHANGERAIL15_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL15 field.                     */
  #define PCRM_INTENSET4_LOADCHANGERAIL15_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL15 field.                     */
  #define PCRM_INTENSET4_LOADCHANGERAIL15_Set (0x1UL) /*!< Enable                                                              */
  #define PCRM_INTENSET4_LOADCHANGERAIL15_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENSET4_LOADCHANGERAIL15_Enabled (0x1UL) /*!< Read: Enabled                                                   */


/* PCRM_INTENCLR0: Disable interrupt */
  #define PCRM_INTENCLR0_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR0 register.                                   */

