adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQUESTFALLING7 @Bit 7 : Write '1' to disable interrupt for event REQUESTFALLING[7] */
  #define PCRM_INTENCLR2_REQUESTFALLING7_Pos (7UL)   /*!< Position of REQUESTFALLING7 field.                                   */
  #define PCRM_INTENCLR2_REQUESTFALLING7_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING7_Pos) /*!< Bit mask of REQUESTFALLING7
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING7_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING7 field.                       */
  #define PCRM_INTENCLR2_REQUESTFALLING7_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING7 field.                       */
  #define PCRM_INTENCLR2_REQUESTFALLING7_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR2_REQUESTFALLING7_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING7_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTFALLING8 @Bit 8 : Write '1' to disable interrupt for event REQUESTFALLING[8] */
  #define PCRM_INTENCLR2_REQUESTFALLING8_Pos (8UL)   /*!< Position of REQUESTFALLING8 field.                                   */
  #define PCRM_INTENCLR2_REQUESTFALLING8_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING8_Pos) /*!< Bit mask of REQUESTFALLING8
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING8_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING8 field.                       */
  #define PCRM_INTENCLR2_REQUESTFALLING8_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING8 field.                       */
  #define PCRM_INTENCLR2_REQUESTFALLING8_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR2_REQUESTFALLING8_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING8_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTFALLING9 @Bit 9 : Write '1' to disable interrupt for event REQUESTFALLING[9] */
  #define PCRM_INTENCLR2_REQUESTFALLING9_Pos (9UL)   /*!< Position of REQUESTFALLING9 field.                                   */
  #define PCRM_INTENCLR2_REQUESTFALLING9_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING9_Pos) /*!< Bit mask of REQUESTFALLING9
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING9_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING9 field.                       */
  #define PCRM_INTENCLR2_REQUESTFALLING9_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING9 field.                       */
  #define PCRM_INTENCLR2_REQUESTFALLING9_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR2_REQUESTFALLING9_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING9_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* REQUESTFALLING10 @Bit 10 : Write '1' to disable interrupt for event REQUESTFALLING[10] */
  #define PCRM_INTENCLR2_REQUESTFALLING10_Pos (10UL) /*!< Position of REQUESTFALLING10 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING10_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING10_Pos) /*!< Bit mask of REQUESTFALLING10
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING10_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING10 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING10_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING10 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING10_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING10_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING10_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING11 @Bit 11 : Write '1' to disable interrupt for event REQUESTFALLING[11] */
  #define PCRM_INTENCLR2_REQUESTFALLING11_Pos (11UL) /*!< Position of REQUESTFALLING11 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING11_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING11_Pos) /*!< Bit mask of REQUESTFALLING11
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING11_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING11 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING11_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING11 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING11_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING11_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING11_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING12 @Bit 12 : Write '1' to disable interrupt for event REQUESTFALLING[12] */
  #define PCRM_INTENCLR2_REQUESTFALLING12_Pos (12UL) /*!< Position of REQUESTFALLING12 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING12_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING12_Pos) /*!< Bit mask of REQUESTFALLING12
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING12_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING12 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING12_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING12 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING12_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING12_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING12_Enabled (0x1UL) /*!< Read: Enabled                                                   */

