adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQUESTFALLING13 @Bit 13 : Write '1' to disable interrupt for event REQUESTFALLING[13] */
  #define PCRM_INTENCLR2_REQUESTFALLING13_Pos (13UL) /*!< Position of REQUESTFALLING13 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING13_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING13_Pos) /*!< Bit mask of REQUESTFALLING13
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING13_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING13 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING13_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING13 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING13_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING13_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING13_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING14 @Bit 14 : Write '1' to disable interrupt for event REQUESTFALLING[14] */
  #define PCRM_INTENCLR2_REQUESTFALLING14_Pos (14UL) /*!< Position of REQUESTFALLING14 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING14_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING14_Pos) /*!< Bit mask of REQUESTFALLING14
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING14_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING14 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING14_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING14 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING14_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING14_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING14_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING15 @Bit 15 : Write '1' to disable interrupt for event REQUESTFALLING[15] */
  #define PCRM_INTENCLR2_REQUESTFALLING15_Pos (15UL) /*!< Position of REQUESTFALLING15 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING15_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING15_Pos) /*!< Bit mask of REQUESTFALLING15
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING15_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING15 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING15_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING15 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING15_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING15_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING15_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING16 @Bit 16 : Write '1' to disable interrupt for event REQUESTFALLING[16] */
  #define PCRM_INTENCLR2_REQUESTFALLING16_Pos (16UL) /*!< Position of REQUESTFALLING16 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING16_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING16_Pos) /*!< Bit mask of REQUESTFALLING16
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING16_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING16 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING16_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING16 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING16_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING16_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING16_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING17 @Bit 17 : Write '1' to disable interrupt for event REQUESTFALLING[17] */
  #define PCRM_INTENCLR2_REQUESTFALLING17_Pos (17UL) /*!< Position of REQUESTFALLING17 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING17_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING17_Pos) /*!< Bit mask of REQUESTFALLING17
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING17_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING17 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING17_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING17 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING17_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING17_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING17_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING18 @Bit 18 : Write '1' to disable interrupt for event REQUESTFALLING[18] */
  #define PCRM_INTENCLR2_REQUESTFALLING18_Pos (18UL) /*!< Position of REQUESTFALLING18 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING18_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING18_Pos) /*!< Bit mask of REQUESTFALLING18
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING18_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING18 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING18_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING18 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING18_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING18_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING18_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING19 @Bit 19 : Write '1' to disable interrupt for event REQUESTFALLING[19] */
  #define PCRM_INTENCLR2_REQUESTFALLING19_Pos (19UL) /*!< Position of REQUESTFALLING19 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING19_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING19_Pos) /*!< Bit mask of REQUESTFALLING19
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING19_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING19 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING19_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING19 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING19_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING19_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING19_Enabled (0x1UL) /*!< Read: Enabled                                                   */

