adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQUESTFALLING20 @Bit 20 : Write '1' to disable interrupt for event REQUESTFALLING[20] */
  #define PCRM_INTENCLR2_REQUESTFALLING20_Pos (20UL) /*!< Position of REQUESTFALLING20 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING20_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING20_Pos) /*!< Bit mask of REQUESTFALLING20
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING20_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING20 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING20_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING20 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING20_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING20_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING20_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING21 @Bit 21 : Write '1' to disable interrupt for event REQUESTFALLING[21] */
  #define PCRM_INTENCLR2_REQUESTFALLING21_Pos (21UL) /*!< Position of REQUESTFALLING21 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING21_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING21_Pos) /*!< Bit mask of REQUESTFALLING21
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING21_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING21 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING21_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING21 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING21_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING21_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING21_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING22 @Bit 22 : Write '1' to disable interrupt for event REQUESTFALLING[22] */
  #define PCRM_INTENCLR2_REQUESTFALLING22_Pos (22UL) /*!< Position of REQUESTFALLING22 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING22_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING22_Pos) /*!< Bit mask of REQUESTFALLING22
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING22_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING22 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING22_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING22 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING22_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING22_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING22_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING23 @Bit 23 : Write '1' to disable interrupt for event REQUESTFALLING[23] */
  #define PCRM_INTENCLR2_REQUESTFALLING23_Pos (23UL) /*!< Position of REQUESTFALLING23 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING23_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING23_Pos) /*!< Bit mask of REQUESTFALLING23
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING23_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING23 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING23_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING23 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING23_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING23_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING23_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING24 @Bit 24 : Write '1' to disable interrupt for event REQUESTFALLING[24] */
  #define PCRM_INTENCLR2_REQUESTFALLING24_Pos (24UL) /*!< Position of REQUESTFALLING24 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING24_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING24_Pos) /*!< Bit mask of REQUESTFALLING24
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING24_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING24 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING24_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING24 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING24_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING24_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING24_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING25 @Bit 25 : Write '1' to disable interrupt for event REQUESTFALLING[25] */
  #define PCRM_INTENCLR2_REQUESTFALLING25_Pos (25UL) /*!< Position of REQUESTFALLING25 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING25_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING25_Pos) /*!< Bit mask of REQUESTFALLING25
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING25_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING25 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING25_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING25 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING25_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING25_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING25_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING26 @Bit 26 : Write '1' to disable interrupt for event REQUESTFALLING[26] */
  #define PCRM_INTENCLR2_REQUESTFALLING26_Pos (26UL) /*!< Position of REQUESTFALLING26 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING26_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING26_Pos) /*!< Bit mask of REQUESTFALLING26
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING26_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING26 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING26_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING26 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING26_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING26_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING26_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING27 @Bit 27 : Write '1' to disable interrupt for event REQUESTFALLING[27] */
  #define PCRM_INTENCLR2_REQUESTFALLING27_Pos (27UL) /*!< Position of REQUESTFALLING27 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING27_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING27_Pos) /*!< Bit mask of REQUESTFALLING27
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING27_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING27 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING27_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING27 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING27_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING27_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING27_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING28 @Bit 28 : Write '1' to disable interrupt for event REQUESTFALLING[28] */
  #define PCRM_INTENCLR2_REQUESTFALLING28_Pos (28UL) /*!< Position of REQUESTFALLING28 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING28_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING28_Pos) /*!< Bit mask of REQUESTFALLING28
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING28_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING28 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING28_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING28 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING28_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING28_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING28_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING29 @Bit 29 : Write '1' to disable interrupt for event REQUESTFALLING[29] */
  #define PCRM_INTENCLR2_REQUESTFALLING29_Pos (29UL) /*!< Position of REQUESTFALLING29 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING29_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING29_Pos) /*!< Bit mask of REQUESTFALLING29
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING29_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING29 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING29_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING29 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING29_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING29_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING29_Enabled (0x1UL) /*!< Read: Enabled                                                   */

