adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQUESTFALLING30 @Bit 30 : Write '1' to disable interrupt for event REQUESTFALLING[30] */
  #define PCRM_INTENCLR2_REQUESTFALLING30_Pos (30UL) /*!< Position of REQUESTFALLING30 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING30_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING30_Pos) /*!< Bit mask of REQUESTFALLING30
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING30_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING30 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING30_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING30 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING30_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING30_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING30_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* REQUESTFALLING31 @Bit 31 : Write '1' to disable interrupt for event REQUESTFALLING[31] */
  #define PCRM_INTENCLR2_REQUESTFALLING31_Pos (31UL) /*!< Position of REQUESTFALLING31 field.                                  */
  #define PCRM_INTENCLR2_REQUESTFALLING31_Msk (0x1UL << PCRM_INTENCLR2_REQUESTFALLING31_Pos) /*!< Bit mask of REQUESTFALLING31
                                                                            field.*/                                              
  #define PCRM_INTENCLR2_REQUESTFALLING31_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING31 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING31_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING31 field.                     */
  #define PCRM_INTENCLR2_REQUESTFALLING31_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR2_REQUESTFALLING31_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR2_REQUESTFALLING31_Enabled (0x1UL) /*!< Read: Enabled                                                   */


/* PCRM_INTENCLR4: Disable interrupt */
  #define PCRM_INTENCLR4_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR4 register.                                   */

/* LOADCHANGERAIL0 @Bit 0 : Write '1' to disable interrupt for event LOADCHANGERAIL[0] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL0_Pos (0UL)   /*!< Position of LOADCHANGERAIL0 field.                                   */
  #define PCRM_INTENCLR4_LOADCHANGERAIL0_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL0_Pos) /*!< Bit mask of LOADCHANGERAIL0
                                                                            field.*/                                              
  #define PCRM_INTENCLR4_LOADCHANGERAIL0_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL0 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL0_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL0 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL0_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR4_LOADCHANGERAIL0_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL0_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL1 @Bit 1 : Write '1' to disable interrupt for event LOADCHANGERAIL[1] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL1_Pos (1UL)   /*!< Position of LOADCHANGERAIL1 field.                                   */
  #define PCRM_INTENCLR4_LOADCHANGERAIL1_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL1_Pos) /*!< Bit mask of LOADCHANGERAIL1
                                                                            field.*/                                              
  #define PCRM_INTENCLR4_LOADCHANGERAIL1_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL1 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL1_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL1 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL1_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR4_LOADCHANGERAIL1_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL1_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL2 @Bit 2 : Write '1' to disable interrupt for event LOADCHANGERAIL[2] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL2_Pos (2UL)   /*!< Position of LOADCHANGERAIL2 field.                                   */
  #define PCRM_INTENCLR4_LOADCHANGERAIL2_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL2_Pos) /*!< Bit mask of LOADCHANGERAIL2
                                                                            field.*/                                              
  #define PCRM_INTENCLR4_LOADCHANGERAIL2_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL2 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL2_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL2 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL2_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR4_LOADCHANGERAIL2_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL2_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL3 @Bit 3 : Write '1' to disable interrupt for event LOADCHANGERAIL[3] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL3_Pos (3UL)   /*!< Position of LOADCHANGERAIL3 field.                                   */
  #define PCRM_INTENCLR4_LOADCHANGERAIL3_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL3_Pos) /*!< Bit mask of LOADCHANGERAIL3
                                                                            field.*/                                              
  #define PCRM_INTENCLR4_LOADCHANGERAIL3_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL3 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL3_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL3 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL3_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR4_LOADCHANGERAIL3_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL3_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL4 @Bit 4 : Write '1' to disable interrupt for event LOADCHANGERAIL[4] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL4_Pos (4UL)   /*!< Position of LOADCHANGERAIL4 field.                                   */
  #define PCRM_INTENCLR4_LOADCHANGERAIL4_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL4_Pos) /*!< Bit mask of LOADCHANGERAIL4
                                                                            field.*/                                              
  #define PCRM_INTENCLR4_LOADCHANGERAIL4_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL4 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL4_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL4 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL4_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR4_LOADCHANGERAIL4_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL4_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL5 @Bit 5 : Write '1' to disable interrupt for event LOADCHANGERAIL[5] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL5_Pos (5UL)   /*!< Position of LOADCHANGERAIL5 field.                                   */
  #define PCRM_INTENCLR4_LOADCHANGERAIL5_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL5_Pos) /*!< Bit mask of LOADCHANGERAIL5
                                                                            field.*/                                              
  #define PCRM_INTENCLR4_LOADCHANGERAIL5_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL5 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL5_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL5 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL5_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR4_LOADCHANGERAIL5_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL5_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL6 @Bit 6 : Write '1' to disable interrupt for event LOADCHANGERAIL[6] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL6_Pos (6UL)   /*!< Position of LOADCHANGERAIL6 field.                                   */
  #define PCRM_INTENCLR4_LOADCHANGERAIL6_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL6_Pos) /*!< Bit mask of LOADCHANGERAIL6
                                                                            field.*/                                              
  #define PCRM_INTENCLR4_LOADCHANGERAIL6_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL6 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL6_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL6 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL6_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR4_LOADCHANGERAIL6_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL6_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL7 @Bit 7 : Write '1' to disable interrupt for event LOADCHANGERAIL[7] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL7_Pos (7UL)   /*!< Position of LOADCHANGERAIL7 field.                                   */
  #define PCRM_INTENCLR4_LOADCHANGERAIL7_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL7_Pos) /*!< Bit mask of LOADCHANGERAIL7
                                                                            field.*/                                              
  #define PCRM_INTENCLR4_LOADCHANGERAIL7_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL7 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL7_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL7 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL7_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR4_LOADCHANGERAIL7_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL7_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL8 @Bit 8 : Write '1' to disable interrupt for event LOADCHANGERAIL[8] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL8_Pos (8UL)   /*!< Position of LOADCHANGERAIL8 field.                                   */
  #define PCRM_INTENCLR4_LOADCHANGERAIL8_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL8_Pos) /*!< Bit mask of LOADCHANGERAIL8
                                                                            field.*/                                              
  #define PCRM_INTENCLR4_LOADCHANGERAIL8_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL8 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL8_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL8 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL8_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR4_LOADCHANGERAIL8_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL8_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* LOADCHANGERAIL9 @Bit 9 : Write '1' to disable interrupt for event LOADCHANGERAIL[9] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL9_Pos (9UL)   /*!< Position of LOADCHANGERAIL9 field.                                   */
  #define PCRM_INTENCLR4_LOADCHANGERAIL9_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL9_Pos) /*!< Bit mask of LOADCHANGERAIL9
                                                                            field.*/                                              
  #define PCRM_INTENCLR4_LOADCHANGERAIL9_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL9 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL9_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL9 field.                       */
  #define PCRM_INTENCLR4_LOADCHANGERAIL9_Clear (0x1UL) /*!< Disable                                                            */
  #define PCRM_INTENCLR4_LOADCHANGERAIL9_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL9_Enabled (0x1UL) /*!< Read: Enabled                                                    */

