adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LOADCHANGERAIL10 @Bit 10 : Write '1' to disable interrupt for event LOADCHANGERAIL[10] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL10_Pos (10UL) /*!< Position of LOADCHANGERAIL10 field.                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL10_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL10_Pos) /*!< Bit mask of LOADCHANGERAIL10
                                                                            field.*/                                              
  #define PCRM_INTENCLR4_LOADCHANGERAIL10_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL10 field.                     */
  #define PCRM_INTENCLR4_LOADCHANGERAIL10_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL10 field.                     */
  #define PCRM_INTENCLR4_LOADCHANGERAIL10_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR4_LOADCHANGERAIL10_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR4_LOADCHANGERAIL10_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* LOADCHANGERAIL11 @Bit 11 : Write '1' to disable interrupt for event LOADCHANGERAIL[11] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL11_Pos (11UL) /*!< Position of LOADCHANGERAIL11 field.                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL11_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL11_Pos) /*!< Bit mask of LOADCHANGERAIL11
                                                                            field.*/                                              
  #define PCRM_INTENCLR4_LOADCHANGERAIL11_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL11 field.                     */
  #define PCRM_INTENCLR4_LOADCHANGERAIL11_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL11 field.                     */
  #define PCRM_INTENCLR4_LOADCHANGERAIL11_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR4_LOADCHANGERAIL11_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR4_LOADCHANGERAIL11_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* LOADCHANGERAIL12 @Bit 12 : Write '1' to disable interrupt for event LOADCHANGERAIL[12] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL12_Pos (12UL) /*!< Position of LOADCHANGERAIL12 field.                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL12_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL12_Pos) /*!< Bit mask of LOADCHANGERAIL12
                                                                            field.*/                                              
  #define PCRM_INTENCLR4_LOADCHANGERAIL12_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL12 field.                     */
  #define PCRM_INTENCLR4_LOADCHANGERAIL12_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL12 field.                     */
  #define PCRM_INTENCLR4_LOADCHANGERAIL12_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR4_LOADCHANGERAIL12_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR4_LOADCHANGERAIL12_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* LOADCHANGERAIL13 @Bit 13 : Write '1' to disable interrupt for event LOADCHANGERAIL[13] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL13_Pos (13UL) /*!< Position of LOADCHANGERAIL13 field.                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL13_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL13_Pos) /*!< Bit mask of LOADCHANGERAIL13
                                                                            field.*/                                              
  #define PCRM_INTENCLR4_LOADCHANGERAIL13_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL13 field.                     */
  #define PCRM_INTENCLR4_LOADCHANGERAIL13_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL13 field.                     */
  #define PCRM_INTENCLR4_LOADCHANGERAIL13_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR4_LOADCHANGERAIL13_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR4_LOADCHANGERAIL13_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* LOADCHANGERAIL14 @Bit 14 : Write '1' to disable interrupt for event LOADCHANGERAIL[14] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL14_Pos (14UL) /*!< Position of LOADCHANGERAIL14 field.                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL14_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL14_Pos) /*!< Bit mask of LOADCHANGERAIL14
                                                                            field.*/                                              
  #define PCRM_INTENCLR4_LOADCHANGERAIL14_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL14 field.                     */
  #define PCRM_INTENCLR4_LOADCHANGERAIL14_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL14 field.                     */
  #define PCRM_INTENCLR4_LOADCHANGERAIL14_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR4_LOADCHANGERAIL14_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR4_LOADCHANGERAIL14_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* LOADCHANGERAIL15 @Bit 15 : Write '1' to disable interrupt for event LOADCHANGERAIL[15] */
  #define PCRM_INTENCLR4_LOADCHANGERAIL15_Pos (15UL) /*!< Position of LOADCHANGERAIL15 field.                                  */
  #define PCRM_INTENCLR4_LOADCHANGERAIL15_Msk (0x1UL << PCRM_INTENCLR4_LOADCHANGERAIL15_Pos) /*!< Bit mask of LOADCHANGERAIL15
                                                                            field.*/                                              
  #define PCRM_INTENCLR4_LOADCHANGERAIL15_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL15 field.                     */
  #define PCRM_INTENCLR4_LOADCHANGERAIL15_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL15 field.                     */
  #define PCRM_INTENCLR4_LOADCHANGERAIL15_Clear (0x1UL) /*!< Disable                                                           */
  #define PCRM_INTENCLR4_LOADCHANGERAIL15_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define PCRM_INTENCLR4_LOADCHANGERAIL15_Enabled (0x1UL) /*!< Read: Enabled                                                   */


/* PCRM_INTPEND0: Pending interrupts */
  #define PCRM_INTPEND0_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND0 register.                                    */

/* REQUESTRISING0 @Bit 0 : Read pending status of interrupt for event REQUESTRISING[0] */
  #define PCRM_INTPEND0_REQUESTRISING0_Pos (0UL)     /*!< Position of REQUESTRISING0 field.                                    */
  #define PCRM_INTPEND0_REQUESTRISING0_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING0_Pos) /*!< Bit mask of REQUESTRISING0 field.  */
  #define PCRM_INTPEND0_REQUESTRISING0_Min (0x0UL)   /*!< Min enumerator value of REQUESTRISING0 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING0_Max (0x1UL)   /*!< Max enumerator value of REQUESTRISING0 field.                        */
  #define PCRM_INTPEND0_REQUESTRISING0_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define PCRM_INTPEND0_REQUESTRISING0_Pending (0x1UL) /*!< Read: Pending                                                      */

