adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQUESTRISING20 @Bit 20 : Read pending status of interrupt for event REQUESTRISING[20] */
  #define PCRM_INTPEND0_REQUESTRISING20_Pos (20UL)   /*!< Position of REQUESTRISING20 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING20_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING20_Pos) /*!< Bit mask of REQUESTRISING20
                                                                            field.*/                                              
  #define PCRM_INTPEND0_REQUESTRISING20_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING20 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING20_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING20 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING20_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING20_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTRISING21 @Bit 21 : Read pending status of interrupt for event REQUESTRISING[21] */
  #define PCRM_INTPEND0_REQUESTRISING21_Pos (21UL)   /*!< Position of REQUESTRISING21 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING21_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING21_Pos) /*!< Bit mask of REQUESTRISING21
                                                                            field.*/                                              
  #define PCRM_INTPEND0_REQUESTRISING21_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING21 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING21_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING21 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING21_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING21_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTRISING22 @Bit 22 : Read pending status of interrupt for event REQUESTRISING[22] */
  #define PCRM_INTPEND0_REQUESTRISING22_Pos (22UL)   /*!< Position of REQUESTRISING22 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING22_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING22_Pos) /*!< Bit mask of REQUESTRISING22
                                                                            field.*/                                              
  #define PCRM_INTPEND0_REQUESTRISING22_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING22 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING22_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING22 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING22_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING22_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTRISING23 @Bit 23 : Read pending status of interrupt for event REQUESTRISING[23] */
  #define PCRM_INTPEND0_REQUESTRISING23_Pos (23UL)   /*!< Position of REQUESTRISING23 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING23_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING23_Pos) /*!< Bit mask of REQUESTRISING23
                                                                            field.*/                                              
  #define PCRM_INTPEND0_REQUESTRISING23_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING23 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING23_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING23 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING23_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING23_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTRISING24 @Bit 24 : Read pending status of interrupt for event REQUESTRISING[24] */
  #define PCRM_INTPEND0_REQUESTRISING24_Pos (24UL)   /*!< Position of REQUESTRISING24 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING24_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING24_Pos) /*!< Bit mask of REQUESTRISING24
                                                                            field.*/                                              
  #define PCRM_INTPEND0_REQUESTRISING24_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING24 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING24_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING24 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING24_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING24_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTRISING25 @Bit 25 : Read pending status of interrupt for event REQUESTRISING[25] */
  #define PCRM_INTPEND0_REQUESTRISING25_Pos (25UL)   /*!< Position of REQUESTRISING25 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING25_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING25_Pos) /*!< Bit mask of REQUESTRISING25
                                                                            field.*/                                              
  #define PCRM_INTPEND0_REQUESTRISING25_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING25 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING25_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING25 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING25_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING25_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTRISING26 @Bit 26 : Read pending status of interrupt for event REQUESTRISING[26] */
  #define PCRM_INTPEND0_REQUESTRISING26_Pos (26UL)   /*!< Position of REQUESTRISING26 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING26_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING26_Pos) /*!< Bit mask of REQUESTRISING26
                                                                            field.*/                                              
  #define PCRM_INTPEND0_REQUESTRISING26_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING26 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING26_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING26 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING26_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING26_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTRISING27 @Bit 27 : Read pending status of interrupt for event REQUESTRISING[27] */
  #define PCRM_INTPEND0_REQUESTRISING27_Pos (27UL)   /*!< Position of REQUESTRISING27 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING27_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING27_Pos) /*!< Bit mask of REQUESTRISING27
                                                                            field.*/                                              
  #define PCRM_INTPEND0_REQUESTRISING27_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING27 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING27_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING27 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING27_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING27_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTRISING28 @Bit 28 : Read pending status of interrupt for event REQUESTRISING[28] */
  #define PCRM_INTPEND0_REQUESTRISING28_Pos (28UL)   /*!< Position of REQUESTRISING28 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING28_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING28_Pos) /*!< Bit mask of REQUESTRISING28
                                                                            field.*/                                              
  #define PCRM_INTPEND0_REQUESTRISING28_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING28 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING28_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING28 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING28_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING28_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTRISING29 @Bit 29 : Read pending status of interrupt for event REQUESTRISING[29] */
  #define PCRM_INTPEND0_REQUESTRISING29_Pos (29UL)   /*!< Position of REQUESTRISING29 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING29_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING29_Pos) /*!< Bit mask of REQUESTRISING29
                                                                            field.*/                                              
  #define PCRM_INTPEND0_REQUESTRISING29_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING29 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING29_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING29 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING29_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING29_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTRISING30 @Bit 30 : Read pending status of interrupt for event REQUESTRISING[30] */
  #define PCRM_INTPEND0_REQUESTRISING30_Pos (30UL)   /*!< Position of REQUESTRISING30 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING30_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING30_Pos) /*!< Bit mask of REQUESTRISING30
                                                                            field.*/                                              
  #define PCRM_INTPEND0_REQUESTRISING30_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING30 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING30_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING30 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING30_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING30_Pending (0x1UL) /*!< Read: Pending                                                     */

