adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQUESTRISING31 @Bit 31 : Read pending status of interrupt for event REQUESTRISING[31] */
  #define PCRM_INTPEND0_REQUESTRISING31_Pos (31UL)   /*!< Position of REQUESTRISING31 field.                                   */
  #define PCRM_INTPEND0_REQUESTRISING31_Msk (0x1UL << PCRM_INTPEND0_REQUESTRISING31_Pos) /*!< Bit mask of REQUESTRISING31
                                                                            field.*/                                              
  #define PCRM_INTPEND0_REQUESTRISING31_Min (0x0UL)  /*!< Min enumerator value of REQUESTRISING31 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING31_Max (0x1UL)  /*!< Max enumerator value of REQUESTRISING31 field.                       */
  #define PCRM_INTPEND0_REQUESTRISING31_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND0_REQUESTRISING31_Pending (0x1UL) /*!< Read: Pending                                                     */


/* PCRM_INTPEND2: Pending interrupts */
  #define PCRM_INTPEND2_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND2 register.                                    */

/* REQUESTFALLING0 @Bit 0 : Read pending status of interrupt for event REQUESTFALLING[0] */
  #define PCRM_INTPEND2_REQUESTFALLING0_Pos (0UL)    /*!< Position of REQUESTFALLING0 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING0_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING0_Pos) /*!< Bit mask of REQUESTFALLING0
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING0_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING0 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING0_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING0 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING0_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING0_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTFALLING1 @Bit 1 : Read pending status of interrupt for event REQUESTFALLING[1] */
  #define PCRM_INTPEND2_REQUESTFALLING1_Pos (1UL)    /*!< Position of REQUESTFALLING1 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING1_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING1_Pos) /*!< Bit mask of REQUESTFALLING1
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING1_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING1 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING1_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING1 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING1_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING1_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTFALLING2 @Bit 2 : Read pending status of interrupt for event REQUESTFALLING[2] */
  #define PCRM_INTPEND2_REQUESTFALLING2_Pos (2UL)    /*!< Position of REQUESTFALLING2 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING2_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING2_Pos) /*!< Bit mask of REQUESTFALLING2
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING2_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING2 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING2_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING2 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING2_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING2_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTFALLING3 @Bit 3 : Read pending status of interrupt for event REQUESTFALLING[3] */
  #define PCRM_INTPEND2_REQUESTFALLING3_Pos (3UL)    /*!< Position of REQUESTFALLING3 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING3_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING3_Pos) /*!< Bit mask of REQUESTFALLING3
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING3_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING3 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING3_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING3 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING3_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING3_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTFALLING4 @Bit 4 : Read pending status of interrupt for event REQUESTFALLING[4] */
  #define PCRM_INTPEND2_REQUESTFALLING4_Pos (4UL)    /*!< Position of REQUESTFALLING4 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING4_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING4_Pos) /*!< Bit mask of REQUESTFALLING4
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING4_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING4 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING4_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING4 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING4_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING4_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTFALLING5 @Bit 5 : Read pending status of interrupt for event REQUESTFALLING[5] */
  #define PCRM_INTPEND2_REQUESTFALLING5_Pos (5UL)    /*!< Position of REQUESTFALLING5 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING5_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING5_Pos) /*!< Bit mask of REQUESTFALLING5
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING5_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING5 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING5_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING5 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING5_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING5_Pending (0x1UL) /*!< Read: Pending                                                     */

