adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQUESTFALLING6 @Bit 6 : Read pending status of interrupt for event REQUESTFALLING[6] */
  #define PCRM_INTPEND2_REQUESTFALLING6_Pos (6UL)    /*!< Position of REQUESTFALLING6 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING6_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING6_Pos) /*!< Bit mask of REQUESTFALLING6
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING6_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING6 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING6_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING6 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING6_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING6_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTFALLING7 @Bit 7 : Read pending status of interrupt for event REQUESTFALLING[7] */
  #define PCRM_INTPEND2_REQUESTFALLING7_Pos (7UL)    /*!< Position of REQUESTFALLING7 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING7_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING7_Pos) /*!< Bit mask of REQUESTFALLING7
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING7_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING7 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING7_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING7 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING7_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING7_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTFALLING8 @Bit 8 : Read pending status of interrupt for event REQUESTFALLING[8] */
  #define PCRM_INTPEND2_REQUESTFALLING8_Pos (8UL)    /*!< Position of REQUESTFALLING8 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING8_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING8_Pos) /*!< Bit mask of REQUESTFALLING8
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING8_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING8 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING8_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING8 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING8_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING8_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTFALLING9 @Bit 9 : Read pending status of interrupt for event REQUESTFALLING[9] */
  #define PCRM_INTPEND2_REQUESTFALLING9_Pos (9UL)    /*!< Position of REQUESTFALLING9 field.                                   */
  #define PCRM_INTPEND2_REQUESTFALLING9_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING9_Pos) /*!< Bit mask of REQUESTFALLING9
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING9_Min (0x0UL)  /*!< Min enumerator value of REQUESTFALLING9 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING9_Max (0x1UL)  /*!< Max enumerator value of REQUESTFALLING9 field.                       */
  #define PCRM_INTPEND2_REQUESTFALLING9_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND2_REQUESTFALLING9_Pending (0x1UL) /*!< Read: Pending                                                     */

/* REQUESTFALLING10 @Bit 10 : Read pending status of interrupt for event REQUESTFALLING[10] */
  #define PCRM_INTPEND2_REQUESTFALLING10_Pos (10UL)  /*!< Position of REQUESTFALLING10 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING10_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING10_Pos) /*!< Bit mask of REQUESTFALLING10
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING10_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING10 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING10_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING10 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING10_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING10_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING11 @Bit 11 : Read pending status of interrupt for event REQUESTFALLING[11] */
  #define PCRM_INTPEND2_REQUESTFALLING11_Pos (11UL)  /*!< Position of REQUESTFALLING11 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING11_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING11_Pos) /*!< Bit mask of REQUESTFALLING11
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING11_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING11 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING11_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING11 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING11_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING11_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING12 @Bit 12 : Read pending status of interrupt for event REQUESTFALLING[12] */
  #define PCRM_INTPEND2_REQUESTFALLING12_Pos (12UL)  /*!< Position of REQUESTFALLING12 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING12_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING12_Pos) /*!< Bit mask of REQUESTFALLING12
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING12_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING12 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING12_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING12 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING12_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING12_Pending (0x1UL) /*!< Read: Pending                                                    */

