adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQUESTFALLING13 @Bit 13 : Read pending status of interrupt for event REQUESTFALLING[13] */
  #define PCRM_INTPEND2_REQUESTFALLING13_Pos (13UL)  /*!< Position of REQUESTFALLING13 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING13_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING13_Pos) /*!< Bit mask of REQUESTFALLING13
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING13_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING13 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING13_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING13 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING13_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING13_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING14 @Bit 14 : Read pending status of interrupt for event REQUESTFALLING[14] */
  #define PCRM_INTPEND2_REQUESTFALLING14_Pos (14UL)  /*!< Position of REQUESTFALLING14 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING14_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING14_Pos) /*!< Bit mask of REQUESTFALLING14
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING14_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING14 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING14_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING14 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING14_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING14_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING15 @Bit 15 : Read pending status of interrupt for event REQUESTFALLING[15] */
  #define PCRM_INTPEND2_REQUESTFALLING15_Pos (15UL)  /*!< Position of REQUESTFALLING15 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING15_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING15_Pos) /*!< Bit mask of REQUESTFALLING15
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING15_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING15 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING15_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING15 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING15_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING15_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING16 @Bit 16 : Read pending status of interrupt for event REQUESTFALLING[16] */
  #define PCRM_INTPEND2_REQUESTFALLING16_Pos (16UL)  /*!< Position of REQUESTFALLING16 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING16_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING16_Pos) /*!< Bit mask of REQUESTFALLING16
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING16_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING16 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING16_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING16 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING16_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING16_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING17 @Bit 17 : Read pending status of interrupt for event REQUESTFALLING[17] */
  #define PCRM_INTPEND2_REQUESTFALLING17_Pos (17UL)  /*!< Position of REQUESTFALLING17 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING17_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING17_Pos) /*!< Bit mask of REQUESTFALLING17
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING17_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING17 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING17_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING17 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING17_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING17_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING18 @Bit 18 : Read pending status of interrupt for event REQUESTFALLING[18] */
  #define PCRM_INTPEND2_REQUESTFALLING18_Pos (18UL)  /*!< Position of REQUESTFALLING18 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING18_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING18_Pos) /*!< Bit mask of REQUESTFALLING18
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING18_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING18 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING18_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING18 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING18_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING18_Pending (0x1UL) /*!< Read: Pending                                                    */

