adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQUESTFALLING19 @Bit 19 : Read pending status of interrupt for event REQUESTFALLING[19] */
  #define PCRM_INTPEND2_REQUESTFALLING19_Pos (19UL)  /*!< Position of REQUESTFALLING19 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING19_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING19_Pos) /*!< Bit mask of REQUESTFALLING19
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING19_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING19 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING19_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING19 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING19_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING19_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING20 @Bit 20 : Read pending status of interrupt for event REQUESTFALLING[20] */
  #define PCRM_INTPEND2_REQUESTFALLING20_Pos (20UL)  /*!< Position of REQUESTFALLING20 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING20_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING20_Pos) /*!< Bit mask of REQUESTFALLING20
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING20_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING20 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING20_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING20 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING20_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING20_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING21 @Bit 21 : Read pending status of interrupt for event REQUESTFALLING[21] */
  #define PCRM_INTPEND2_REQUESTFALLING21_Pos (21UL)  /*!< Position of REQUESTFALLING21 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING21_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING21_Pos) /*!< Bit mask of REQUESTFALLING21
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING21_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING21 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING21_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING21 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING21_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING21_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING22 @Bit 22 : Read pending status of interrupt for event REQUESTFALLING[22] */
  #define PCRM_INTPEND2_REQUESTFALLING22_Pos (22UL)  /*!< Position of REQUESTFALLING22 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING22_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING22_Pos) /*!< Bit mask of REQUESTFALLING22
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING22_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING22 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING22_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING22 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING22_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING22_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING23 @Bit 23 : Read pending status of interrupt for event REQUESTFALLING[23] */
  #define PCRM_INTPEND2_REQUESTFALLING23_Pos (23UL)  /*!< Position of REQUESTFALLING23 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING23_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING23_Pos) /*!< Bit mask of REQUESTFALLING23
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING23_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING23 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING23_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING23 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING23_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING23_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING24 @Bit 24 : Read pending status of interrupt for event REQUESTFALLING[24] */
  #define PCRM_INTPEND2_REQUESTFALLING24_Pos (24UL)  /*!< Position of REQUESTFALLING24 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING24_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING24_Pos) /*!< Bit mask of REQUESTFALLING24
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING24_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING24 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING24_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING24 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING24_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING24_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING25 @Bit 25 : Read pending status of interrupt for event REQUESTFALLING[25] */
  #define PCRM_INTPEND2_REQUESTFALLING25_Pos (25UL)  /*!< Position of REQUESTFALLING25 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING25_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING25_Pos) /*!< Bit mask of REQUESTFALLING25
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING25_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING25 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING25_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING25 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING25_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING25_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING26 @Bit 26 : Read pending status of interrupt for event REQUESTFALLING[26] */
  #define PCRM_INTPEND2_REQUESTFALLING26_Pos (26UL)  /*!< Position of REQUESTFALLING26 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING26_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING26_Pos) /*!< Bit mask of REQUESTFALLING26
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING26_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING26 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING26_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING26 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING26_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING26_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING27 @Bit 27 : Read pending status of interrupt for event REQUESTFALLING[27] */
  #define PCRM_INTPEND2_REQUESTFALLING27_Pos (27UL)  /*!< Position of REQUESTFALLING27 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING27_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING27_Pos) /*!< Bit mask of REQUESTFALLING27
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING27_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING27 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING27_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING27 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING27_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING27_Pending (0x1UL) /*!< Read: Pending                                                    */

