adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQUESTFALLING28 @Bit 28 : Read pending status of interrupt for event REQUESTFALLING[28] */
  #define PCRM_INTPEND2_REQUESTFALLING28_Pos (28UL)  /*!< Position of REQUESTFALLING28 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING28_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING28_Pos) /*!< Bit mask of REQUESTFALLING28
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING28_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING28 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING28_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING28 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING28_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING28_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING29 @Bit 29 : Read pending status of interrupt for event REQUESTFALLING[29] */
  #define PCRM_INTPEND2_REQUESTFALLING29_Pos (29UL)  /*!< Position of REQUESTFALLING29 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING29_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING29_Pos) /*!< Bit mask of REQUESTFALLING29
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING29_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING29 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING29_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING29 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING29_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING29_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING30 @Bit 30 : Read pending status of interrupt for event REQUESTFALLING[30] */
  #define PCRM_INTPEND2_REQUESTFALLING30_Pos (30UL)  /*!< Position of REQUESTFALLING30 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING30_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING30_Pos) /*!< Bit mask of REQUESTFALLING30
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING30_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING30 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING30_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING30 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING30_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING30_Pending (0x1UL) /*!< Read: Pending                                                    */

/* REQUESTFALLING31 @Bit 31 : Read pending status of interrupt for event REQUESTFALLING[31] */
  #define PCRM_INTPEND2_REQUESTFALLING31_Pos (31UL)  /*!< Position of REQUESTFALLING31 field.                                  */
  #define PCRM_INTPEND2_REQUESTFALLING31_Msk (0x1UL << PCRM_INTPEND2_REQUESTFALLING31_Pos) /*!< Bit mask of REQUESTFALLING31
                                                                            field.*/                                              
  #define PCRM_INTPEND2_REQUESTFALLING31_Min (0x0UL) /*!< Min enumerator value of REQUESTFALLING31 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING31_Max (0x1UL) /*!< Max enumerator value of REQUESTFALLING31 field.                      */
  #define PCRM_INTPEND2_REQUESTFALLING31_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND2_REQUESTFALLING31_Pending (0x1UL) /*!< Read: Pending                                                    */


/* PCRM_INTPEND4: Pending interrupts */
  #define PCRM_INTPEND4_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND4 register.                                    */

/* LOADCHANGERAIL0 @Bit 0 : Read pending status of interrupt for event LOADCHANGERAIL[0] */
  #define PCRM_INTPEND4_LOADCHANGERAIL0_Pos (0UL)    /*!< Position of LOADCHANGERAIL0 field.                                   */
  #define PCRM_INTPEND4_LOADCHANGERAIL0_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL0_Pos) /*!< Bit mask of LOADCHANGERAIL0
                                                                            field.*/                                              
  #define PCRM_INTPEND4_LOADCHANGERAIL0_Min (0x0UL)  /*!< Min enumerator value of LOADCHANGERAIL0 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL0_Max (0x1UL)  /*!< Max enumerator value of LOADCHANGERAIL0 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL0_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND4_LOADCHANGERAIL0_Pending (0x1UL) /*!< Read: Pending                                                     */

/* LOADCHANGERAIL1 @Bit 1 : Read pending status of interrupt for event LOADCHANGERAIL[1] */
  #define PCRM_INTPEND4_LOADCHANGERAIL1_Pos (1UL)    /*!< Position of LOADCHANGERAIL1 field.                                   */
  #define PCRM_INTPEND4_LOADCHANGERAIL1_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL1_Pos) /*!< Bit mask of LOADCHANGERAIL1
                                                                            field.*/                                              
  #define PCRM_INTPEND4_LOADCHANGERAIL1_Min (0x0UL)  /*!< Min enumerator value of LOADCHANGERAIL1 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL1_Max (0x1UL)  /*!< Max enumerator value of LOADCHANGERAIL1 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL1_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND4_LOADCHANGERAIL1_Pending (0x1UL) /*!< Read: Pending                                                     */

/* LOADCHANGERAIL2 @Bit 2 : Read pending status of interrupt for event LOADCHANGERAIL[2] */
  #define PCRM_INTPEND4_LOADCHANGERAIL2_Pos (2UL)    /*!< Position of LOADCHANGERAIL2 field.                                   */
  #define PCRM_INTPEND4_LOADCHANGERAIL2_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL2_Pos) /*!< Bit mask of LOADCHANGERAIL2
                                                                            field.*/                                              
  #define PCRM_INTPEND4_LOADCHANGERAIL2_Min (0x0UL)  /*!< Min enumerator value of LOADCHANGERAIL2 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL2_Max (0x1UL)  /*!< Max enumerator value of LOADCHANGERAIL2 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL2_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND4_LOADCHANGERAIL2_Pending (0x1UL) /*!< Read: Pending                                                     */

/* LOADCHANGERAIL3 @Bit 3 : Read pending status of interrupt for event LOADCHANGERAIL[3] */
  #define PCRM_INTPEND4_LOADCHANGERAIL3_Pos (3UL)    /*!< Position of LOADCHANGERAIL3 field.                                   */
  #define PCRM_INTPEND4_LOADCHANGERAIL3_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL3_Pos) /*!< Bit mask of LOADCHANGERAIL3
                                                                            field.*/                                              
  #define PCRM_INTPEND4_LOADCHANGERAIL3_Min (0x0UL)  /*!< Min enumerator value of LOADCHANGERAIL3 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL3_Max (0x1UL)  /*!< Max enumerator value of LOADCHANGERAIL3 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL3_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND4_LOADCHANGERAIL3_Pending (0x1UL) /*!< Read: Pending                                                     */

/* LOADCHANGERAIL4 @Bit 4 : Read pending status of interrupt for event LOADCHANGERAIL[4] */
  #define PCRM_INTPEND4_LOADCHANGERAIL4_Pos (4UL)    /*!< Position of LOADCHANGERAIL4 field.                                   */
  #define PCRM_INTPEND4_LOADCHANGERAIL4_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL4_Pos) /*!< Bit mask of LOADCHANGERAIL4
                                                                            field.*/                                              
  #define PCRM_INTPEND4_LOADCHANGERAIL4_Min (0x0UL)  /*!< Min enumerator value of LOADCHANGERAIL4 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL4_Max (0x1UL)  /*!< Max enumerator value of LOADCHANGERAIL4 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL4_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND4_LOADCHANGERAIL4_Pending (0x1UL) /*!< Read: Pending                                                     */

/* LOADCHANGERAIL5 @Bit 5 : Read pending status of interrupt for event LOADCHANGERAIL[5] */
  #define PCRM_INTPEND4_LOADCHANGERAIL5_Pos (5UL)    /*!< Position of LOADCHANGERAIL5 field.                                   */
  #define PCRM_INTPEND4_LOADCHANGERAIL5_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL5_Pos) /*!< Bit mask of LOADCHANGERAIL5
                                                                            field.*/                                              
  #define PCRM_INTPEND4_LOADCHANGERAIL5_Min (0x0UL)  /*!< Min enumerator value of LOADCHANGERAIL5 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL5_Max (0x1UL)  /*!< Max enumerator value of LOADCHANGERAIL5 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL5_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND4_LOADCHANGERAIL5_Pending (0x1UL) /*!< Read: Pending                                                     */

