adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LOADCHANGERAIL6 @Bit 6 : Read pending status of interrupt for event LOADCHANGERAIL[6] */
  #define PCRM_INTPEND4_LOADCHANGERAIL6_Pos (6UL)    /*!< Position of LOADCHANGERAIL6 field.                                   */
  #define PCRM_INTPEND4_LOADCHANGERAIL6_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL6_Pos) /*!< Bit mask of LOADCHANGERAIL6
                                                                            field.*/                                              
  #define PCRM_INTPEND4_LOADCHANGERAIL6_Min (0x0UL)  /*!< Min enumerator value of LOADCHANGERAIL6 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL6_Max (0x1UL)  /*!< Max enumerator value of LOADCHANGERAIL6 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL6_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND4_LOADCHANGERAIL6_Pending (0x1UL) /*!< Read: Pending                                                     */

/* LOADCHANGERAIL7 @Bit 7 : Read pending status of interrupt for event LOADCHANGERAIL[7] */
  #define PCRM_INTPEND4_LOADCHANGERAIL7_Pos (7UL)    /*!< Position of LOADCHANGERAIL7 field.                                   */
  #define PCRM_INTPEND4_LOADCHANGERAIL7_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL7_Pos) /*!< Bit mask of LOADCHANGERAIL7
                                                                            field.*/                                              
  #define PCRM_INTPEND4_LOADCHANGERAIL7_Min (0x0UL)  /*!< Min enumerator value of LOADCHANGERAIL7 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL7_Max (0x1UL)  /*!< Max enumerator value of LOADCHANGERAIL7 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL7_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND4_LOADCHANGERAIL7_Pending (0x1UL) /*!< Read: Pending                                                     */

/* LOADCHANGERAIL8 @Bit 8 : Read pending status of interrupt for event LOADCHANGERAIL[8] */
  #define PCRM_INTPEND4_LOADCHANGERAIL8_Pos (8UL)    /*!< Position of LOADCHANGERAIL8 field.                                   */
  #define PCRM_INTPEND4_LOADCHANGERAIL8_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL8_Pos) /*!< Bit mask of LOADCHANGERAIL8
                                                                            field.*/                                              
  #define PCRM_INTPEND4_LOADCHANGERAIL8_Min (0x0UL)  /*!< Min enumerator value of LOADCHANGERAIL8 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL8_Max (0x1UL)  /*!< Max enumerator value of LOADCHANGERAIL8 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL8_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND4_LOADCHANGERAIL8_Pending (0x1UL) /*!< Read: Pending                                                     */

/* LOADCHANGERAIL9 @Bit 9 : Read pending status of interrupt for event LOADCHANGERAIL[9] */
  #define PCRM_INTPEND4_LOADCHANGERAIL9_Pos (9UL)    /*!< Position of LOADCHANGERAIL9 field.                                   */
  #define PCRM_INTPEND4_LOADCHANGERAIL9_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL9_Pos) /*!< Bit mask of LOADCHANGERAIL9
                                                                            field.*/                                              
  #define PCRM_INTPEND4_LOADCHANGERAIL9_Min (0x0UL)  /*!< Min enumerator value of LOADCHANGERAIL9 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL9_Max (0x1UL)  /*!< Max enumerator value of LOADCHANGERAIL9 field.                       */
  #define PCRM_INTPEND4_LOADCHANGERAIL9_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define PCRM_INTPEND4_LOADCHANGERAIL9_Pending (0x1UL) /*!< Read: Pending                                                     */

/* LOADCHANGERAIL10 @Bit 10 : Read pending status of interrupt for event LOADCHANGERAIL[10] */
  #define PCRM_INTPEND4_LOADCHANGERAIL10_Pos (10UL)  /*!< Position of LOADCHANGERAIL10 field.                                  */
  #define PCRM_INTPEND4_LOADCHANGERAIL10_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL10_Pos) /*!< Bit mask of LOADCHANGERAIL10
                                                                            field.*/                                              
  #define PCRM_INTPEND4_LOADCHANGERAIL10_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL10 field.                      */
  #define PCRM_INTPEND4_LOADCHANGERAIL10_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL10 field.                      */
  #define PCRM_INTPEND4_LOADCHANGERAIL10_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND4_LOADCHANGERAIL10_Pending (0x1UL) /*!< Read: Pending                                                    */

/* LOADCHANGERAIL11 @Bit 11 : Read pending status of interrupt for event LOADCHANGERAIL[11] */
  #define PCRM_INTPEND4_LOADCHANGERAIL11_Pos (11UL)  /*!< Position of LOADCHANGERAIL11 field.                                  */
  #define PCRM_INTPEND4_LOADCHANGERAIL11_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL11_Pos) /*!< Bit mask of LOADCHANGERAIL11
                                                                            field.*/                                              
  #define PCRM_INTPEND4_LOADCHANGERAIL11_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL11 field.                      */
  #define PCRM_INTPEND4_LOADCHANGERAIL11_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL11 field.                      */
  #define PCRM_INTPEND4_LOADCHANGERAIL11_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND4_LOADCHANGERAIL11_Pending (0x1UL) /*!< Read: Pending                                                    */

/* LOADCHANGERAIL12 @Bit 12 : Read pending status of interrupt for event LOADCHANGERAIL[12] */
  #define PCRM_INTPEND4_LOADCHANGERAIL12_Pos (12UL)  /*!< Position of LOADCHANGERAIL12 field.                                  */
  #define PCRM_INTPEND4_LOADCHANGERAIL12_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL12_Pos) /*!< Bit mask of LOADCHANGERAIL12
                                                                            field.*/                                              
  #define PCRM_INTPEND4_LOADCHANGERAIL12_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL12 field.                      */
  #define PCRM_INTPEND4_LOADCHANGERAIL12_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL12 field.                      */
  #define PCRM_INTPEND4_LOADCHANGERAIL12_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND4_LOADCHANGERAIL12_Pending (0x1UL) /*!< Read: Pending                                                    */

/* LOADCHANGERAIL13 @Bit 13 : Read pending status of interrupt for event LOADCHANGERAIL[13] */
  #define PCRM_INTPEND4_LOADCHANGERAIL13_Pos (13UL)  /*!< Position of LOADCHANGERAIL13 field.                                  */
  #define PCRM_INTPEND4_LOADCHANGERAIL13_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL13_Pos) /*!< Bit mask of LOADCHANGERAIL13
                                                                            field.*/                                              
  #define PCRM_INTPEND4_LOADCHANGERAIL13_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL13 field.                      */
  #define PCRM_INTPEND4_LOADCHANGERAIL13_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL13 field.                      */
  #define PCRM_INTPEND4_LOADCHANGERAIL13_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND4_LOADCHANGERAIL13_Pending (0x1UL) /*!< Read: Pending                                                    */

/* LOADCHANGERAIL14 @Bit 14 : Read pending status of interrupt for event LOADCHANGERAIL[14] */
  #define PCRM_INTPEND4_LOADCHANGERAIL14_Pos (14UL)  /*!< Position of LOADCHANGERAIL14 field.                                  */
  #define PCRM_INTPEND4_LOADCHANGERAIL14_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL14_Pos) /*!< Bit mask of LOADCHANGERAIL14
                                                                            field.*/                                              
  #define PCRM_INTPEND4_LOADCHANGERAIL14_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL14 field.                      */
  #define PCRM_INTPEND4_LOADCHANGERAIL14_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL14 field.                      */
  #define PCRM_INTPEND4_LOADCHANGERAIL14_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND4_LOADCHANGERAIL14_Pending (0x1UL) /*!< Read: Pending                                                    */

/* LOADCHANGERAIL15 @Bit 15 : Read pending status of interrupt for event LOADCHANGERAIL[15] */
  #define PCRM_INTPEND4_LOADCHANGERAIL15_Pos (15UL)  /*!< Position of LOADCHANGERAIL15 field.                                  */
  #define PCRM_INTPEND4_LOADCHANGERAIL15_Msk (0x1UL << PCRM_INTPEND4_LOADCHANGERAIL15_Pos) /*!< Bit mask of LOADCHANGERAIL15
                                                                            field.*/                                              
  #define PCRM_INTPEND4_LOADCHANGERAIL15_Min (0x0UL) /*!< Min enumerator value of LOADCHANGERAIL15 field.                      */
  #define PCRM_INTPEND4_LOADCHANGERAIL15_Max (0x1UL) /*!< Max enumerator value of LOADCHANGERAIL15 field.                      */
  #define PCRM_INTPEND4_LOADCHANGERAIL15_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define PCRM_INTPEND4_LOADCHANGERAIL15_Pending (0x1UL) /*!< Read: Pending                                                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            PDM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

