adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PDM_SAMPLE_PTR: RAM address pointer to write samples to with EasyDMA */
  #define PDM_SAMPLE_PTR_ResetValue (0x00000000UL)   /*!< Reset value of PTR register.                                         */

/* SAMPLEPTR @Bits 0..31 : Address to write PDM samples to over DMA */
  #define PDM_SAMPLE_PTR_SAMPLEPTR_Pos (0UL)         /*!< Position of SAMPLEPTR field.                                         */
  #define PDM_SAMPLE_PTR_SAMPLEPTR_Msk (0xFFFFFFFFUL << PDM_SAMPLE_PTR_SAMPLEPTR_Pos) /*!< Bit mask of SAMPLEPTR field.        */


/* PDM_SAMPLE_MAXCNT: Number of samples to allocate memory for in EasyDMA mode */
  #define PDM_SAMPLE_MAXCNT_ResetValue (0x00000000UL) /*!< Reset value of MAXCNT register.                                     */

/* BUFFSIZE @Bits 0..14 : Length of DMA RAM allocation in number of samples */
  #define PDM_SAMPLE_MAXCNT_BUFFSIZE_Pos (0UL)       /*!< Position of BUFFSIZE field.                                          */
  #define PDM_SAMPLE_MAXCNT_BUFFSIZE_Msk (0x7FFFUL << PDM_SAMPLE_MAXCNT_BUFFSIZE_Pos) /*!< Bit mask of BUFFSIZE field.         */
  #define PDM_SAMPLE_MAXCNT_BUFFSIZE_Min (0x0UL)     /*!< Min value of BUFFSIZE field.                                         */
  #define PDM_SAMPLE_MAXCNT_BUFFSIZE_Max (0x7FFFUL)  /*!< Max size of BUFFSIZE field.                                          */


/* PDM_SAMPLE_AMOUNT: Number of samples transferred into Data RAM since last START task */
  #define PDM_SAMPLE_AMOUNT_ResetValue (0x00000000UL) /*!< Reset value of AMOUNT register.                                     */

/* AMOUNT @Bits 0..14 : Number of samples transferred into Data RAM since last START task */
  #define PDM_SAMPLE_AMOUNT_AMOUNT_Pos (0UL)         /*!< Position of AMOUNT field.                                            */
  #define PDM_SAMPLE_AMOUNT_AMOUNT_Msk (0x7FFFUL << PDM_SAMPLE_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.               */



/* ===================================================== Struct PDM_DMA ====================================================== */
/**
  * @brief DMA [PDM_DMA] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x00000000) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/                                              
  __IOM uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000004) Address of transaction that generated the last BUSERROR
                                                                         event.*/                                                 
} NRF_PDM_DMA_Type;                                  /*!< Size = 8 (0x008)                                                     */

/* PDM_DMA_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define PDM_DMA_TERMINATEONBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of TERMINATEONBUSERROR register.              */

/* ENABLE @Bit 0 : (unspecified) */
  #define PDM_DMA_TERMINATEONBUSERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                          */
  #define PDM_DMA_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << PDM_DMA_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of ENABLE
                                                                            field.*/                                              
  #define PDM_DMA_TERMINATEONBUSERROR_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                            */
  #define PDM_DMA_TERMINATEONBUSERROR_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                            */
  #define PDM_DMA_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL) /*!< Disable                                                     */
  #define PDM_DMA_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL) /*!< Enable                                                       */


/* PDM_DMA_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define PDM_DMA_BUSERRORADDRESS_ResetValue (0x00000000UL) /*!< Reset value of BUSERRORADDRESS register.                      */

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define PDM_DMA_BUSERRORADDRESS_ADDRESS_Pos (0UL)  /*!< Position of ADDRESS field.                                           */
  #define PDM_DMA_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << PDM_DMA_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/                                              


/* ======================================================= Struct PDM ======================================================== */
/**
  * @brief Pulse Density Modulation (Digital Microphone) Interface
  */
  typedef struct {                                   /*!< PDM Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Starts continuous PDM transfer                        */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stops PDM transfer                                    */
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t EVENTS_STARTED;                   /*!< (@ 0x00000100) PDM transfer has started                              */
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000104) PDM transfer has finished                             */
    __IOM uint32_t EVENTS_END;                       /*!< (@ 0x00000108) The PDM has written the last sample specified by
                                                                         SAMPLE.MAXCNT (or the last sample after a STOP task has
                                                                         been received) to Data RAM*/                             
    __IOM uint32_t EVENTS_OVERRUN;                   /*!< (@ 0x0000010C) PDM samples lost due to DMA destination not available */
    __IM uint32_t RESERVED2[28];
    __IOM uint32_t PUBLISH_STARTED;                  /*!< (@ 0x00000180) Publish configuration for event STARTED               */
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000184) Publish configuration for event STOPPED               */
    __IOM uint32_t PUBLISH_END;                      /*!< (@ 0x00000188) Publish configuration for event END                   */
    __IOM uint32_t PUBLISH_OVERRUN;                  /*!< (@ 0x0000018C) Publish configuration for event OVERRUN               */
    __IM uint32_t RESERVED3[92];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED4[124];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) PDM module enable register                            */
    __IOM uint32_t PDMCLKCTRL;                       /*!< (@ 0x00000504) PDM clock generator control                           */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000508) Defines the routing of the connected PDM microphones'
                                                                         signals*/                                                
    __IOM uint32_t FDBYPASS;                         /*!< (@ 0x0000050C) Bypass the frequency doubler in the PDM clock
                                                                         generation*/                                             
    __IM uint32_t RXDLDATA;                          /*!< (@ 0x00000510) Left sample from filter output                        */
    __IM uint32_t RXDRDATA;                          /*!< (@ 0x00000514) Right sample from filter output                       */
    __IOM uint32_t GAINL;                            /*!< (@ 0x00000518) Left output gain adjustment                           */
    __IOM uint32_t GAINR;                            /*!< (@ 0x0000051C) Right output gain adjustment                          */
    __IOM uint32_t RATIO;                            /*!< (@ 0x00000520) Selects the ratio between PDM_CLK and output sample
                                                                         rate. Change PDMCLKCTRL accordingly.*/                   
    __IM uint32_t RESERVED5;
    __IOM NRF_PDM_FILTER_Type FILTER;                /*!< (@ 0x00000528) (unspecified)                                         */
    __IOM uint32_t PHASE;                            /*!< (@ 0x0000053C) Selection of delay on the clock line (to avoid
                                                                         potential setup&hold timing violation on input data)*/   
    __IOM NRF_PDM_PSEL_Type PSEL;                    /*!< (@ 0x00000540) (unspecified)                                         */
    __IOM uint32_t RAMCONFIG;                        /*!< (@ 0x00000548) Trim value for internal PDM RAM                       */
    __IOM uint32_t MCLKCONFIG;                       /*!< (@ 0x0000054C) Master clock generator configuration                  */
    __IM uint32_t RESERVED6[4];
    __IOM NRF_PDM_SAMPLE_Type SAMPLE;                /*!< (@ 0x00000560) (unspecified)                                         */
    __IM uint32_t RESERVED7[101];
    __IOM NRF_PDM_DMA_Type DMA;                      /*!< (@ 0x00000700) (unspecified)                                         */
  } NRF_PDM_Type;                                    /*!< Size = 1800 (0x708)                                                  */

/* PDM_TASKS_START: Starts continuous PDM transfer */
  #define PDM_TASKS_START_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_START register.                                 */

/* TASKS_START @Bit 0 : Starts continuous PDM transfer */
  #define PDM_TASKS_START_TASKS_START_Pos (0UL)      /*!< Position of TASKS_START field.                                       */
  #define PDM_TASKS_START_TASKS_START_Msk (0x1UL << PDM_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.       */
  #define PDM_TASKS_START_TASKS_START_Min (0x1UL)    /*!< Min enumerator value of TASKS_START field.                           */
  #define PDM_TASKS_START_TASKS_START_Max (0x1UL)    /*!< Max enumerator value of TASKS_START field.                           */
  #define PDM_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                        */


/* PDM_TASKS_STOP: Stops PDM transfer */
  #define PDM_TASKS_STOP_ResetValue (0x00000000UL)   /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stops PDM transfer */
  #define PDM_TASKS_STOP_TASKS_STOP_Pos (0UL)        /*!< Position of TASKS_STOP field.                                        */
  #define PDM_TASKS_STOP_TASKS_STOP_Msk (0x1UL << PDM_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.            */
  #define PDM_TASKS_STOP_TASKS_STOP_Min (0x1UL)      /*!< Min enumerator value of TASKS_STOP field.                            */
  #define PDM_TASKS_STOP_TASKS_STOP_Max (0x1UL)      /*!< Max enumerator value of TASKS_STOP field.                            */
  #define PDM_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)  /*!< Trigger task                                                         */


/* PDM_SUBSCRIBE_START: Subscribe configuration for task START */
  #define PDM_SUBSCRIBE_START_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_START register.                          */

