adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ============================================== Struct POWER_EVENTS_SEMAPHORE ============================================== */
/**
  * @brief EVENTS_SEMAPHORE [POWER_EVENTS_SEMAPHORE] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  ACQUIRED;                          /*!< (@ 0x00000000) Acquired the semaphore for regulator voltage scaling
                                                                         procedure.*/                                             
  __IOM uint32_t  RELEASED;                          /*!< (@ 0x00000004) Released the semaphore for regulator voltage scaling
                                                                         procedure.*/                                             
} NRF_POWER_EVENTS_SEMAPHORE_Type;                   /*!< Size = 8 (0x008)                                                     */

/* POWER_EVENTS_SEMAPHORE_ACQUIRED: Acquired the semaphore for regulator voltage scaling procedure. */
  #define POWER_EVENTS_SEMAPHORE_ACQUIRED_ResetValue (0x00000000UL) /*!< Reset value of ACQUIRED register.                     */

/* ACQUIRED @Bit 0 : Acquired the semaphore for regulator voltage scaling procedure. */
  #define POWER_EVENTS_SEMAPHORE_ACQUIRED_ACQUIRED_Pos (0UL) /*!< Position of ACQUIRED field.                                  */
  #define POWER_EVENTS_SEMAPHORE_ACQUIRED_ACQUIRED_Msk (0x1UL << POWER_EVENTS_SEMAPHORE_ACQUIRED_ACQUIRED_Pos) /*!< Bit mask of
                                                                            ACQUIRED field.*/                                     
  #define POWER_EVENTS_SEMAPHORE_ACQUIRED_ACQUIRED_Min (0x0UL) /*!< Min enumerator value of ACQUIRED field.                    */
  #define POWER_EVENTS_SEMAPHORE_ACQUIRED_ACQUIRED_Max (0x1UL) /*!< Max enumerator value of ACQUIRED field.                    */
  #define POWER_EVENTS_SEMAPHORE_ACQUIRED_ACQUIRED_NotGenerated (0x0UL) /*!< Event not generated                               */
  #define POWER_EVENTS_SEMAPHORE_ACQUIRED_ACQUIRED_Generated (0x1UL) /*!< Event generated                                      */


/* POWER_EVENTS_SEMAPHORE_RELEASED: Released the semaphore for regulator voltage scaling procedure. */
  #define POWER_EVENTS_SEMAPHORE_RELEASED_ResetValue (0x00000000UL) /*!< Reset value of RELEASED register.                     */

/* RELEASED @Bit 0 : Released the semaphore for regulator voltage scaling procedure. */
  #define POWER_EVENTS_SEMAPHORE_RELEASED_RELEASED_Pos (0UL) /*!< Position of RELEASED field.                                  */
  #define POWER_EVENTS_SEMAPHORE_RELEASED_RELEASED_Msk (0x1UL << POWER_EVENTS_SEMAPHORE_RELEASED_RELEASED_Pos) /*!< Bit mask of
                                                                            RELEASED field.*/                                     
  #define POWER_EVENTS_SEMAPHORE_RELEASED_RELEASED_Min (0x0UL) /*!< Min enumerator value of RELEASED field.                    */
  #define POWER_EVENTS_SEMAPHORE_RELEASED_RELEASED_Max (0x1UL) /*!< Max enumerator value of RELEASED field.                    */
  #define POWER_EVENTS_SEMAPHORE_RELEASED_RELEASED_NotGenerated (0x0UL) /*!< Event not generated                               */
  #define POWER_EVENTS_SEMAPHORE_RELEASED_RELEASED_Generated (0x1UL) /*!< Event generated                                      */



/* ==================================================== Struct POWER_ABB ===================================================== */
/**
  * @brief ABB [POWER_ABB] (unspecified)
  */
typedef struct {
  __IM  uint32_t  STATUS;                            /*!< (@ 0x00000000) ABB Status for ABB domain [n]                         */
  __IOM uint32_t  OPPOINT;                           /*!< (@ 0x00000004) Select ABB operating point for ABB domain [n]         */
  __IOM uint32_t  FORCELOCK;                         /*!< (@ 0x00000008) Force lock for the ABB at ABB domain [n]              */
} NRF_POWER_ABB_Type;                                /*!< Size = 12 (0x00C)                                                    */
  #define POWER_ABB_MaxCount (3UL)                   /*!< Max size of ABB[3] array.                                            */

/* POWER_ABB_STATUS: ABB Status for ABB domain [n] */
  #define POWER_ABB_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                                      */

/* STATUS @Bit 0 : ABB status */
  #define POWER_ABB_STATUS_STATUS_Pos (0UL)          /*!< Position of STATUS field.                                            */
  #define POWER_ABB_STATUS_STATUS_Msk (0x1UL << POWER_ABB_STATUS_STATUS_Pos) /*!< Bit mask of STATUS field.                    */
  #define POWER_ABB_STATUS_STATUS_Min (0x0UL)        /*!< Min enumerator value of STATUS field.                                */
  #define POWER_ABB_STATUS_STATUS_Max (0x1UL)        /*!< Max enumerator value of STATUS field.                                */
  #define POWER_ABB_STATUS_STATUS_Ready (0x0UL)      /*!< The ABB is ready to accept the new operating point                   */
  #define POWER_ABB_STATUS_STATUS_Busy (0x1UL)       /*!< The ABB is busy in applying the new operating point                  */


/* POWER_ABB_OPPOINT: Select ABB operating point for ABB domain [n] */
  #define POWER_ABB_OPPOINT_ResetValue (0x00000000UL) /*!< Reset value of OPPOINT register.                                    */

/* OPPOINT @Bits 0..1 : The ABB operating point */
  #define POWER_ABB_OPPOINT_OPPOINT_Pos (0UL)        /*!< Position of OPPOINT field.                                           */
  #define POWER_ABB_OPPOINT_OPPOINT_Msk (0x3UL << POWER_ABB_OPPOINT_OPPOINT_Pos) /*!< Bit mask of OPPOINT field.               */
  #define POWER_ABB_OPPOINT_OPPOINT_Min (0x0UL)      /*!< Min enumerator value of OPPOINT field.                               */
  #define POWER_ABB_OPPOINT_OPPOINT_Max (0x3UL)      /*!< Max enumerator value of OPPOINT field.                               */
  #define POWER_ABB_OPPOINT_OPPOINT_OpPoint0V4 (0x0UL) /*!< Operating point 0.4V                                               */
  #define POWER_ABB_OPPOINT_OPPOINT_OpPoint0V5 (0x1UL) /*!< Operating point 0.5V                                               */
  #define POWER_ABB_OPPOINT_OPPOINT_OpPoint0V6 (0x2UL) /*!< Operating point 0.6V                                               */
  #define POWER_ABB_OPPOINT_OPPOINT_OpPoint0V8 (0x3UL) /*!< Operating point 0.8V                                               */

/* ABBPWROVERRIDEVAL @Bit 30 : Override value of ABB analog macro powerup signal */
  #define POWER_ABB_OPPOINT_ABBPWROVERRIDEVAL_Pos (30UL) /*!< Position of ABBPWROVERRIDEVAL field.                             */
  #define POWER_ABB_OPPOINT_ABBPWROVERRIDEVAL_Msk (0x1UL << POWER_ABB_OPPOINT_ABBPWROVERRIDEVAL_Pos) /*!< Bit mask of
                                                                            ABBPWROVERRIDEVAL field.*/                            
  #define POWER_ABB_OPPOINT_ABBPWROVERRIDEVAL_Min (0x0UL) /*!< Min enumerator value of ABBPWROVERRIDEVAL field.                */
  #define POWER_ABB_OPPOINT_ABBPWROVERRIDEVAL_Max (0x1UL) /*!< Max enumerator value of ABBPWROVERRIDEVAL field.                */
  #define POWER_ABB_OPPOINT_ABBPWROVERRIDEVAL_PowerDown (0x0UL) /*!< ABB analog macro powered down                             */
  #define POWER_ABB_OPPOINT_ABBPWROVERRIDEVAL_PowerUp (0x1UL) /*!< ABB analog macro powered up                                 */

/* ABBPWROVERRIDEEN @Bit 31 : Enable the override of ABB analog macro powerup signal */
  #define POWER_ABB_OPPOINT_ABBPWROVERRIDEEN_Pos (31UL) /*!< Position of ABBPWROVERRIDEEN field.                               */
  #define POWER_ABB_OPPOINT_ABBPWROVERRIDEEN_Msk (0x1UL << POWER_ABB_OPPOINT_ABBPWROVERRIDEEN_Pos) /*!< Bit mask of
                                                                            ABBPWROVERRIDEEN field.*/                             
  #define POWER_ABB_OPPOINT_ABBPWROVERRIDEEN_Min (0x0UL) /*!< Min enumerator value of ABBPWROVERRIDEEN field.                  */
  #define POWER_ABB_OPPOINT_ABBPWROVERRIDEEN_Max (0x1UL) /*!< Max enumerator value of ABBPWROVERRIDEEN field.                  */
  #define POWER_ABB_OPPOINT_ABBPWROVERRIDEEN_Disabled (0x0UL) /*!< Override disabled                                           */
  #define POWER_ABB_OPPOINT_ABBPWROVERRIDEEN_Enabled (0x1UL) /*!< Override enabled                                             */


/* POWER_ABB_FORCELOCK: Force lock for the ABB at ABB domain [n] */
  #define POWER_ABB_FORCELOCK_ResetValue (0x00000000UL) /*!< Reset value of FORCELOCK register.                                */

/* ENABLE @Bit 0 : Enable force lock */
  #define POWER_ABB_FORCELOCK_ENABLE_Pos (0UL)       /*!< Position of ENABLE field.                                            */
  #define POWER_ABB_FORCELOCK_ENABLE_Msk (0x1UL << POWER_ABB_FORCELOCK_ENABLE_Pos) /*!< Bit mask of ENABLE field.              */
  #define POWER_ABB_FORCELOCK_ENABLE_Min (0x0UL)     /*!< Min enumerator value of ENABLE field.                                */
  #define POWER_ABB_FORCELOCK_ENABLE_Max (0x1UL)     /*!< Max enumerator value of ENABLE field.                                */
  #define POWER_ABB_FORCELOCK_ENABLE_Disabled (0x0UL) /*!< Force lock disabled                                                 */
  #define POWER_ABB_FORCELOCK_ENABLE_Enabled (0x1UL) /*!< Force lock enabled                                                   */


/* ====================================================== Struct POWER ======================================================= */
/**
  * @brief POWER
  */
  typedef struct {                                   /*!< POWER Structure                                                      */
    __OM NRF_POWER_TASKS_SEMAPHORE_Type TASKS_SEMAPHORE; /*!< (@ 0x00000000) Peripheral tasks.                                 */
    __OM uint32_t TASKS_REGUPDATE;                   /*!< (@ 0x00000008) Update the regulator configuration.                   */
    __OM uint32_t TASKS_TDDPDREQCLR;                 /*!< (@ 0x0000000C) Clear the power domain request for Trace data and debug
                                                                         (TDD).*/                                                 
    __IM uint32_t RESERVED[60];
    __IOM NRF_POWER_EVENTS_SEMAPHORE_Type EVENTS_SEMAPHORE; /*!< (@ 0x00000100) Peripheral events.                             */
    __IOM uint32_t EVENTS_REGUPDATED;                /*!< (@ 0x00000108) Updated the regulator configuration.                  */
    __IOM uint32_t EVENTS_ABBLOCK[3];                /*!< (@ 0x0000010C) ABB lock for the ABB domain [n]                       */
    __IM uint32_t RESERVED1[122];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[61];
    __IOM uint32_t DFTTAPPINENABLE;                  /*!< (@ 0x00000404) Routed to DFT tap controllers and enables target power
                                                                         domain.*/                                                
    __IOM uint32_t ATBGNDCLAMP;                      /*!< (@ 0x00000408) Control of ground clamps for Analog Test Bus lines.   */
    __IOM uint32_t FORCEALLPOWERON;                  /*!< (@ 0x0000040C) Forces all the power domains to remain ON.            */
    __IOM NRF_POWER_ABB_Type ABB[3];                 /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED3[51];
    __IOM uint32_t REGCONFIG;                        /*!< (@ 0x00000500) Regulator configuration                               */
    __IOM uint32_t PMICENABLE;                       /*!< (@ 0x00000504) Enable PMIC interface                                 */
    __IOM uint32_t ULPENABLE;                        /*!< (@ 0x00000508) Enable ULP mode                                       */
    __IOM uint32_t ULVENABLE;                        /*!< (@ 0x0000050C) Enable ULV mode                                       */
    __IOM uint32_t SEMAPHORESTATUS;                  /*!< (@ 0x00000510) Semaphore status                                      */
    __IOM uint32_t BILSENABLE;                       /*!< (@ 0x00000514) Enable BILS instances                                 */
  } NRF_POWER_Type;                                  /*!< Size = 1304 (0x518)                                                  */

/* POWER_TASKS_REGUPDATE: Update the regulator configuration. */
  #define POWER_TASKS_REGUPDATE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_REGUPDATE register.                        */

