adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* POWER_INTPEND: Pending interrupts */
  #define POWER_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* SEMAPHOREACQUIRED @Bit 0 : Read pending status of interrupt for event SEMAPHOREACQUIRED */
  #define POWER_INTPEND_SEMAPHOREACQUIRED_Pos (0UL)  /*!< Position of SEMAPHOREACQUIRED field.                                 */
  #define POWER_INTPEND_SEMAPHOREACQUIRED_Msk (0x1UL << POWER_INTPEND_SEMAPHOREACQUIRED_Pos) /*!< Bit mask of SEMAPHOREACQUIRED
                                                                            field.*/                                              
  #define POWER_INTPEND_SEMAPHOREACQUIRED_Min (0x0UL) /*!< Min enumerator value of SEMAPHOREACQUIRED field.                    */
  #define POWER_INTPEND_SEMAPHOREACQUIRED_Max (0x1UL) /*!< Max enumerator value of SEMAPHOREACQUIRED field.                    */
  #define POWER_INTPEND_SEMAPHOREACQUIRED_NotPending (0x0UL) /*!< Read: Not pending                                            */
  #define POWER_INTPEND_SEMAPHOREACQUIRED_Pending (0x1UL) /*!< Read: Pending                                                   */

/* SEMAPHORERELEASED @Bit 1 : Read pending status of interrupt for event SEMAPHORERELEASED */
  #define POWER_INTPEND_SEMAPHORERELEASED_Pos (1UL)  /*!< Position of SEMAPHORERELEASED field.                                 */
  #define POWER_INTPEND_SEMAPHORERELEASED_Msk (0x1UL << POWER_INTPEND_SEMAPHORERELEASED_Pos) /*!< Bit mask of SEMAPHORERELEASED
                                                                            field.*/                                              
  #define POWER_INTPEND_SEMAPHORERELEASED_Min (0x0UL) /*!< Min enumerator value of SEMAPHORERELEASED field.                    */
  #define POWER_INTPEND_SEMAPHORERELEASED_Max (0x1UL) /*!< Max enumerator value of SEMAPHORERELEASED field.                    */
  #define POWER_INTPEND_SEMAPHORERELEASED_NotPending (0x0UL) /*!< Read: Not pending                                            */
  #define POWER_INTPEND_SEMAPHORERELEASED_Pending (0x1UL) /*!< Read: Pending                                                   */

/* REGUPDATED @Bit 2 : Read pending status of interrupt for event REGUPDATED */
  #define POWER_INTPEND_REGUPDATED_Pos (2UL)         /*!< Position of REGUPDATED field.                                        */
  #define POWER_INTPEND_REGUPDATED_Msk (0x1UL << POWER_INTPEND_REGUPDATED_Pos) /*!< Bit mask of REGUPDATED field.              */
  #define POWER_INTPEND_REGUPDATED_Min (0x0UL)       /*!< Min enumerator value of REGUPDATED field.                            */
  #define POWER_INTPEND_REGUPDATED_Max (0x1UL)       /*!< Max enumerator value of REGUPDATED field.                            */
  #define POWER_INTPEND_REGUPDATED_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define POWER_INTPEND_REGUPDATED_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* ABBLOCK0 @Bit 3 : Read pending status of interrupt for event ABBLOCK[0] */
  #define POWER_INTPEND_ABBLOCK0_Pos (3UL)           /*!< Position of ABBLOCK0 field.                                          */
  #define POWER_INTPEND_ABBLOCK0_Msk (0x1UL << POWER_INTPEND_ABBLOCK0_Pos) /*!< Bit mask of ABBLOCK0 field.                    */
  #define POWER_INTPEND_ABBLOCK0_Min (0x0UL)         /*!< Min enumerator value of ABBLOCK0 field.                              */
  #define POWER_INTPEND_ABBLOCK0_Max (0x1UL)         /*!< Max enumerator value of ABBLOCK0 field.                              */
  #define POWER_INTPEND_ABBLOCK0_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define POWER_INTPEND_ABBLOCK0_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* ABBLOCK1 @Bit 4 : Read pending status of interrupt for event ABBLOCK[1] */
  #define POWER_INTPEND_ABBLOCK1_Pos (4UL)           /*!< Position of ABBLOCK1 field.                                          */
  #define POWER_INTPEND_ABBLOCK1_Msk (0x1UL << POWER_INTPEND_ABBLOCK1_Pos) /*!< Bit mask of ABBLOCK1 field.                    */
  #define POWER_INTPEND_ABBLOCK1_Min (0x0UL)         /*!< Min enumerator value of ABBLOCK1 field.                              */
  #define POWER_INTPEND_ABBLOCK1_Max (0x1UL)         /*!< Max enumerator value of ABBLOCK1 field.                              */
  #define POWER_INTPEND_ABBLOCK1_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define POWER_INTPEND_ABBLOCK1_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* ABBLOCK2 @Bit 5 : Read pending status of interrupt for event ABBLOCK[2] */
  #define POWER_INTPEND_ABBLOCK2_Pos (5UL)           /*!< Position of ABBLOCK2 field.                                          */
  #define POWER_INTPEND_ABBLOCK2_Msk (0x1UL << POWER_INTPEND_ABBLOCK2_Pos) /*!< Bit mask of ABBLOCK2 field.                    */
  #define POWER_INTPEND_ABBLOCK2_Min (0x0UL)         /*!< Min enumerator value of ABBLOCK2 field.                              */
  #define POWER_INTPEND_ABBLOCK2_Max (0x1UL)         /*!< Max enumerator value of ABBLOCK2 field.                              */
  #define POWER_INTPEND_ABBLOCK2_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define POWER_INTPEND_ABBLOCK2_Pending (0x1UL)     /*!< Read: Pending                                                        */


/* POWER_DFTTAPPINENABLE: Routed to DFT tap controllers and enables target power domain. */
  #define POWER_DFTTAPPINENABLE_ResetValue (0x00000000UL) /*!< Reset value of DFTTAPPINENABLE register.                        */

/* ENABLE @Bits 0..1 : Enable */
  #define POWER_DFTTAPPINENABLE_ENABLE_Pos (0UL)     /*!< Position of ENABLE field.                                            */
  #define POWER_DFTTAPPINENABLE_ENABLE_Msk (0x3UL << POWER_DFTTAPPINENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.          */
  #define POWER_DFTTAPPINENABLE_ENABLE_Min (0x0UL)   /*!< Min enumerator value of ENABLE field.                                */
  #define POWER_DFTTAPPINENABLE_ENABLE_Max (0x2UL)   /*!< Max enumerator value of ENABLE field.                                */
  #define POWER_DFTTAPPINENABLE_ENABLE_Disabled (0x0UL) /*!< Tap controllers disabled                                          */
  #define POWER_DFTTAPPINENABLE_ENABLE_EnabledMain (0x1UL) /*!< Main tap enabled                                               */
  #define POWER_DFTTAPPINENABLE_ENABLE_EnabledCryptoIsland (0x2UL) /*!< Crypto island tap enabled                              */


/* POWER_ATBGNDCLAMP: Control of ground clamps for Analog Test Bus lines. */
  #define POWER_ATBGNDCLAMP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ATBGNDCLAMP register.                                */

/* GNDCLAMPCTRL0 @Bit 0 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL0_Pos (0UL)  /*!< Position of GNDCLAMPCTRL0 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL0_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL0_Pos) /*!< Bit mask of GNDCLAMPCTRL0
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL0_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL0 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL0_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL0 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL0_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL0_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

/* GNDCLAMPCTRL1 @Bit 1 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL1_Pos (1UL)  /*!< Position of GNDCLAMPCTRL1 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL1_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL1_Pos) /*!< Bit mask of GNDCLAMPCTRL1
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL1_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL1 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL1_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL1 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL1_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL1_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

