adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GNDCLAMPCTRL2 @Bit 2 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL2_Pos (2UL)  /*!< Position of GNDCLAMPCTRL2 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL2_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL2_Pos) /*!< Bit mask of GNDCLAMPCTRL2
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL2_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL2 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL2_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL2 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL2_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL2_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

/* GNDCLAMPCTRL3 @Bit 3 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL3_Pos (3UL)  /*!< Position of GNDCLAMPCTRL3 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL3_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL3_Pos) /*!< Bit mask of GNDCLAMPCTRL3
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL3_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL3 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL3_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL3 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL3_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL3_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

/* GNDCLAMPCTRL4 @Bit 4 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL4_Pos (4UL)  /*!< Position of GNDCLAMPCTRL4 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL4_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL4_Pos) /*!< Bit mask of GNDCLAMPCTRL4
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL4_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL4 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL4_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL4 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL4_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL4_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

/* GNDCLAMPCTRL5 @Bit 5 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL5_Pos (5UL)  /*!< Position of GNDCLAMPCTRL5 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL5_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL5_Pos) /*!< Bit mask of GNDCLAMPCTRL5
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL5_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL5 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL5_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL5 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL5_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL5_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

/* GNDCLAMPCTRL6 @Bit 6 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL6_Pos (6UL)  /*!< Position of GNDCLAMPCTRL6 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL6_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL6_Pos) /*!< Bit mask of GNDCLAMPCTRL6
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL6_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL6 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL6_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL6 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL6_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL6_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

/* GNDCLAMPCTRL7 @Bit 7 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL7_Pos (7UL)  /*!< Position of GNDCLAMPCTRL7 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL7_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL7_Pos) /*!< Bit mask of GNDCLAMPCTRL7
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL7_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL7 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL7_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL7 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL7_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL7_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

/* GNDCLAMPCTRL8 @Bit 8 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL8_Pos (8UL)  /*!< Position of GNDCLAMPCTRL8 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL8_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL8_Pos) /*!< Bit mask of GNDCLAMPCTRL8
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL8_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL8 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL8_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL8 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL8_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL8_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

/* GNDCLAMPCTRL9 @Bit 9 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL9_Pos (9UL)  /*!< Position of GNDCLAMPCTRL9 field.                                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL9_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL9_Pos) /*!< Bit mask of GNDCLAMPCTRL9
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL9_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL9 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL9_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL9 field.                        */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL9_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL9_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                        */

