adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GNDCLAMPCTRL10 @Bit 10 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL10_Pos (10UL) /*!< Position of GNDCLAMPCTRL10 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL10_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL10_Pos) /*!< Bit mask of GNDCLAMPCTRL10
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL10_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL10 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL10_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL10 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL10_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL10_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL11 @Bit 11 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL11_Pos (11UL) /*!< Position of GNDCLAMPCTRL11 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL11_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL11_Pos) /*!< Bit mask of GNDCLAMPCTRL11
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL11_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL11 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL11_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL11 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL11_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL11_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL12 @Bit 12 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL12_Pos (12UL) /*!< Position of GNDCLAMPCTRL12 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL12_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL12_Pos) /*!< Bit mask of GNDCLAMPCTRL12
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL12_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL12 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL12_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL12 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL12_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL12_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL13 @Bit 13 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL13_Pos (13UL) /*!< Position of GNDCLAMPCTRL13 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL13_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL13_Pos) /*!< Bit mask of GNDCLAMPCTRL13
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL13_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL13 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL13_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL13 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL13_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL13_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL14 @Bit 14 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL14_Pos (14UL) /*!< Position of GNDCLAMPCTRL14 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL14_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL14_Pos) /*!< Bit mask of GNDCLAMPCTRL14
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL14_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL14 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL14_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL14 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL14_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL14_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL15 @Bit 15 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL15_Pos (15UL) /*!< Position of GNDCLAMPCTRL15 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL15_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL15_Pos) /*!< Bit mask of GNDCLAMPCTRL15
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL15_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL15 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL15_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL15 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL15_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL15_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL16 @Bit 16 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL16_Pos (16UL) /*!< Position of GNDCLAMPCTRL16 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL16_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL16_Pos) /*!< Bit mask of GNDCLAMPCTRL16
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL16_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL16 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL16_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL16 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL16_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL16_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

