adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GNDCLAMPCTRL17 @Bit 17 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL17_Pos (17UL) /*!< Position of GNDCLAMPCTRL17 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL17_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL17_Pos) /*!< Bit mask of GNDCLAMPCTRL17
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL17_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL17 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL17_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL17 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL17_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL17_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL18 @Bit 18 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL18_Pos (18UL) /*!< Position of GNDCLAMPCTRL18 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL18_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL18_Pos) /*!< Bit mask of GNDCLAMPCTRL18
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL18_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL18 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL18_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL18 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL18_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL18_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL19 @Bit 19 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL19_Pos (19UL) /*!< Position of GNDCLAMPCTRL19 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL19_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL19_Pos) /*!< Bit mask of GNDCLAMPCTRL19
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL19_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL19 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL19_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL19 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL19_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL19_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL20 @Bit 20 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL20_Pos (20UL) /*!< Position of GNDCLAMPCTRL20 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL20_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL20_Pos) /*!< Bit mask of GNDCLAMPCTRL20
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL20_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL20 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL20_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL20 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL20_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL20_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL21 @Bit 21 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL21_Pos (21UL) /*!< Position of GNDCLAMPCTRL21 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL21_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL21_Pos) /*!< Bit mask of GNDCLAMPCTRL21
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL21_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL21 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL21_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL21 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL21_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL21_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL22 @Bit 22 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL22_Pos (22UL) /*!< Position of GNDCLAMPCTRL22 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL22_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL22_Pos) /*!< Bit mask of GNDCLAMPCTRL22
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL22_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL22 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL22_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL22 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL22_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL22_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL23 @Bit 23 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL23_Pos (23UL) /*!< Position of GNDCLAMPCTRL23 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL23_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL23_Pos) /*!< Bit mask of GNDCLAMPCTRL23
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL23_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL23 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL23_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL23 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL23_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL23_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL24 @Bit 24 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL24_Pos (24UL) /*!< Position of GNDCLAMPCTRL24 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL24_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL24_Pos) /*!< Bit mask of GNDCLAMPCTRL24
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL24_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL24 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL24_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL24 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL24_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL24_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL25 @Bit 25 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL25_Pos (25UL) /*!< Position of GNDCLAMPCTRL25 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL25_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL25_Pos) /*!< Bit mask of GNDCLAMPCTRL25
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL25_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL25 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL25_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL25 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL25_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL25_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

