adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GNDCLAMPCTRL26 @Bit 26 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL26_Pos (26UL) /*!< Position of GNDCLAMPCTRL26 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL26_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL26_Pos) /*!< Bit mask of GNDCLAMPCTRL26
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL26_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL26 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL26_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL26 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL26_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL26_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL27 @Bit 27 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL27_Pos (27UL) /*!< Position of GNDCLAMPCTRL27 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL27_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL27_Pos) /*!< Bit mask of GNDCLAMPCTRL27
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL27_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL27 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL27_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL27 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL27_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL27_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL28 @Bit 28 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL28_Pos (28UL) /*!< Position of GNDCLAMPCTRL28 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL28_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL28_Pos) /*!< Bit mask of GNDCLAMPCTRL28
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL28_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL28 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL28_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL28 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL28_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL28_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL29 @Bit 29 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL29_Pos (29UL) /*!< Position of GNDCLAMPCTRL29 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL29_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL29_Pos) /*!< Bit mask of GNDCLAMPCTRL29
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL29_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL29 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL29_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL29 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL29_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL29_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL30 @Bit 30 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL30_Pos (30UL) /*!< Position of GNDCLAMPCTRL30 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL30_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL30_Pos) /*!< Bit mask of GNDCLAMPCTRL30
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL30_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL30 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL30_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL30 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL30_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL30_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */

/* GNDCLAMPCTRL31 @Bit 31 : (unspecified) */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL31_Pos (31UL) /*!< Position of GNDCLAMPCTRL31 field.                                   */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL31_Msk (0x1UL << POWER_ATBGNDCLAMP_GNDCLAMPCTRL31_Pos) /*!< Bit mask of GNDCLAMPCTRL31
                                                                            field.*/                                              
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL31_Min (0x0UL) /*!< Min enumerator value of GNDCLAMPCTRL31 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL31_Max (0x1UL) /*!< Max enumerator value of GNDCLAMPCTRL31 field.                      */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL31_Disabled (0x0UL) /*!< Ground clamp is disabled, net is floating                     */
  #define POWER_ATBGNDCLAMP_GNDCLAMPCTRL31_Enabled (0x1UL) /*!< Ground clamp is enabled, net is grounded                       */


/* POWER_FORCEALLPOWERON: Forces all the power domains to remain ON. */
  #define POWER_FORCEALLPOWERON_ResetValue (0x00000000UL) /*!< Reset value of FORCEALLPOWERON register.                        */

/* EN @Bit 0 : Enable the forcing all power domains to remain ON. */
  #define POWER_FORCEALLPOWERON_EN_Pos (0UL)         /*!< Position of EN field.                                                */
  #define POWER_FORCEALLPOWERON_EN_Msk (0x1UL << POWER_FORCEALLPOWERON_EN_Pos) /*!< Bit mask of EN field.                      */
  #define POWER_FORCEALLPOWERON_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define POWER_FORCEALLPOWERON_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define POWER_FORCEALLPOWERON_EN_Disabled (0x0UL)  /*!< Forcing disabled                                                     */
  #define POWER_FORCEALLPOWERON_EN_Enabled (0x1UL)   /*!< Forcing enabled                                                      */


