adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* POWER_REGCONFIG: Regulator configuration */
  #define POWER_REGCONFIG_ResetValue (0x80000007UL)  /*!< Reset value of REGCONFIG register.                                   */

/* VREG1V8 @Bit 0 : Enable 1.8V regulator */
  #define POWER_REGCONFIG_VREG1V8_Pos (0UL)          /*!< Position of VREG1V8 field.                                           */
  #define POWER_REGCONFIG_VREG1V8_Msk (0x1UL << POWER_REGCONFIG_VREG1V8_Pos) /*!< Bit mask of VREG1V8 field.                   */
  #define POWER_REGCONFIG_VREG1V8_Min (0x0UL)        /*!< Min enumerator value of VREG1V8 field.                               */
  #define POWER_REGCONFIG_VREG1V8_Max (0x1UL)        /*!< Max enumerator value of VREG1V8 field.                               */
  #define POWER_REGCONFIG_VREG1V8_Disabled (0x0UL)   /*!< Regulator disabled                                                   */
  #define POWER_REGCONFIG_VREG1V8_Enabled (0x1UL)    /*!< Regulator enabled                                                    */

/* VREG1V0 @Bit 1 : Enable 1.0V regulator */
  #define POWER_REGCONFIG_VREG1V0_Pos (1UL)          /*!< Position of VREG1V0 field.                                           */
  #define POWER_REGCONFIG_VREG1V0_Msk (0x1UL << POWER_REGCONFIG_VREG1V0_Pos) /*!< Bit mask of VREG1V0 field.                   */
  #define POWER_REGCONFIG_VREG1V0_Min (0x0UL)        /*!< Min enumerator value of VREG1V0 field.                               */
  #define POWER_REGCONFIG_VREG1V0_Max (0x1UL)        /*!< Max enumerator value of VREG1V0 field.                               */
  #define POWER_REGCONFIG_VREG1V0_Disabled (0x0UL)   /*!< Regulator disabled                                                   */
  #define POWER_REGCONFIG_VREG1V0_Enabled (0x1UL)    /*!< Regulator enabled                                                    */

/* VREG0V8 @Bit 2 : Enable 0.8V regulator */
  #define POWER_REGCONFIG_VREG0V8_Pos (2UL)          /*!< Position of VREG0V8 field.                                           */
  #define POWER_REGCONFIG_VREG0V8_Msk (0x1UL << POWER_REGCONFIG_VREG0V8_Pos) /*!< Bit mask of VREG0V8 field.                   */
  #define POWER_REGCONFIG_VREG0V8_Min (0x0UL)        /*!< Min enumerator value of VREG0V8 field.                               */
  #define POWER_REGCONFIG_VREG0V8_Max (0x1UL)        /*!< Max enumerator value of VREG0V8 field.                               */
  #define POWER_REGCONFIG_VREG0V8_Disabled (0x0UL)   /*!< Regulator disabled                                                   */
  #define POWER_REGCONFIG_VREG0V8_Enabled (0x1UL)    /*!< Regulator enabled                                                    */

/* VREGVS @Bit 3 : Enable voltage scaled regulator */
  #define POWER_REGCONFIG_VREGVS_Pos (3UL)           /*!< Position of VREGVS field.                                            */
  #define POWER_REGCONFIG_VREGVS_Msk (0x1UL << POWER_REGCONFIG_VREGVS_Pos) /*!< Bit mask of VREGVS field.                      */
  #define POWER_REGCONFIG_VREGVS_Min (0x0UL)         /*!< Min enumerator value of VREGVS field.                                */
  #define POWER_REGCONFIG_VREGVS_Max (0x1UL)         /*!< Max enumerator value of VREGVS field.                                */
  #define POWER_REGCONFIG_VREGVS_Disabled (0x0UL)    /*!< Regulator disabled                                                   */
  #define POWER_REGCONFIG_VREGVS_Enabled (0x1UL)     /*!< Regulator enabled                                                    */

/* VREGMAIN1V8 @Bit 4 : Enable 1.8V rail at VREGMAIN regulator */
  #define POWER_REGCONFIG_VREGMAIN1V8_Pos (4UL)      /*!< Position of VREGMAIN1V8 field.                                       */
  #define POWER_REGCONFIG_VREGMAIN1V8_Msk (0x1UL << POWER_REGCONFIG_VREGMAIN1V8_Pos) /*!< Bit mask of VREGMAIN1V8 field.       */
  #define POWER_REGCONFIG_VREGMAIN1V8_Min (0x0UL)    /*!< Min enumerator value of VREGMAIN1V8 field.                           */
  #define POWER_REGCONFIG_VREGMAIN1V8_Max (0x1UL)    /*!< Max enumerator value of VREGMAIN1V8 field.                           */
  #define POWER_REGCONFIG_VREGMAIN1V8_Disabled (0x0UL) /*!< Regulator disabled                                                 */
  #define POWER_REGCONFIG_VREGMAIN1V8_Enabled (0x1UL) /*!< Regulator enabled                                                   */

/* VREGMAIN1V0 @Bit 5 : Enable 1.0V rail at VREGMAIN regulator */
  #define POWER_REGCONFIG_VREGMAIN1V0_Pos (5UL)      /*!< Position of VREGMAIN1V0 field.                                       */
  #define POWER_REGCONFIG_VREGMAIN1V0_Msk (0x1UL << POWER_REGCONFIG_VREGMAIN1V0_Pos) /*!< Bit mask of VREGMAIN1V0 field.       */
  #define POWER_REGCONFIG_VREGMAIN1V0_Min (0x0UL)    /*!< Min enumerator value of VREGMAIN1V0 field.                           */
  #define POWER_REGCONFIG_VREGMAIN1V0_Max (0x1UL)    /*!< Max enumerator value of VREGMAIN1V0 field.                           */
  #define POWER_REGCONFIG_VREGMAIN1V0_Disabled (0x0UL) /*!< Regulator disabled                                                 */
  #define POWER_REGCONFIG_VREGMAIN1V0_Enabled (0x1UL) /*!< Regulator enabled                                                   */

/* VREGMAINVS @Bit 6 : Enable voltage scaled rail at VREGMAIN regulator */
  #define POWER_REGCONFIG_VREGMAINVS_Pos (6UL)       /*!< Position of VREGMAINVS field.                                        */
  #define POWER_REGCONFIG_VREGMAINVS_Msk (0x1UL << POWER_REGCONFIG_VREGMAINVS_Pos) /*!< Bit mask of VREGMAINVS field.          */
  #define POWER_REGCONFIG_VREGMAINVS_Min (0x0UL)     /*!< Min enumerator value of VREGMAINVS field.                            */
  #define POWER_REGCONFIG_VREGMAINVS_Max (0x1UL)     /*!< Max enumerator value of VREGMAINVS field.                            */
  #define POWER_REGCONFIG_VREGMAINVS_Disabled (0x0UL) /*!< Regulator disabled                                                  */
  #define POWER_REGCONFIG_VREGMAINVS_Enabled (0x1UL) /*!< Regulator enabled                                                    */

/* FORCE @Bit 31 : Force the regulator enable configuration */
  #define POWER_REGCONFIG_FORCE_Pos (31UL)           /*!< Position of FORCE field.                                             */
  #define POWER_REGCONFIG_FORCE_Msk (0x1UL << POWER_REGCONFIG_FORCE_Pos) /*!< Bit mask of FORCE field.                         */
  #define POWER_REGCONFIG_FORCE_Min (0x0UL)          /*!< Min enumerator value of FORCE field.                                 */
  #define POWER_REGCONFIG_FORCE_Max (0x1UL)          /*!< Max enumerator value of FORCE field.                                 */
  #define POWER_REGCONFIG_FORCE_Disabled (0x0UL)     /*!< Force disabled                                                       */
  #define POWER_REGCONFIG_FORCE_Enabled (0x1UL)      /*!< Force enabled                                                        */


/* POWER_PMICENABLE: Enable PMIC interface */
  #define POWER_PMICENABLE_ResetValue (0x00000000UL) /*!< Reset value of PMICENABLE register.                                  */

/* ENABLE @Bit 0 : Enable PMIC interface */
  #define POWER_PMICENABLE_ENABLE_Pos (0UL)          /*!< Position of ENABLE field.                                            */
  #define POWER_PMICENABLE_ENABLE_Msk (0x1UL << POWER_PMICENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                    */
  #define POWER_PMICENABLE_ENABLE_Min (0x0UL)        /*!< Min enumerator value of ENABLE field.                                */
  #define POWER_PMICENABLE_ENABLE_Max (0x1UL)        /*!< Max enumerator value of ENABLE field.                                */
  #define POWER_PMICENABLE_ENABLE_Disabled (0x0UL)   /*!< Disabled                                                             */
  #define POWER_PMICENABLE_ENABLE_Enabled (0x1UL)    /*!< Enabled                                                              */


/* POWER_ULPENABLE: Enable ULP mode */
  #define POWER_ULPENABLE_ResetValue (0x00000001UL)  /*!< Reset value of ULPENABLE register.                                   */

/* ENABLE @Bit 0 : Enable ULP mode */
  #define POWER_ULPENABLE_ENABLE_Pos (0UL)           /*!< Position of ENABLE field.                                            */
  #define POWER_ULPENABLE_ENABLE_Msk (0x1UL << POWER_ULPENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                      */
  #define POWER_ULPENABLE_ENABLE_Min (0x0UL)         /*!< Min enumerator value of ENABLE field.                                */
  #define POWER_ULPENABLE_ENABLE_Max (0x1UL)         /*!< Max enumerator value of ENABLE field.                                */
  #define POWER_ULPENABLE_ENABLE_Disabled (0x0UL)    /*!< Disabled                                                             */
  #define POWER_ULPENABLE_ENABLE_Enabled (0x1UL)     /*!< Enabled                                                              */


/* POWER_ULVENABLE: Enable ULV mode */
  #define POWER_ULVENABLE_ResetValue (0x00000001UL)  /*!< Reset value of ULVENABLE register.                                   */

/* ENABLE @Bit 0 : Enable ULV mode */
  #define POWER_ULVENABLE_ENABLE_Pos (0UL)           /*!< Position of ENABLE field.                                            */
  #define POWER_ULVENABLE_ENABLE_Msk (0x1UL << POWER_ULVENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                      */
  #define POWER_ULVENABLE_ENABLE_Min (0x0UL)         /*!< Min enumerator value of ENABLE field.                                */
  #define POWER_ULVENABLE_ENABLE_Max (0x1UL)         /*!< Max enumerator value of ENABLE field.                                */
  #define POWER_ULVENABLE_ENABLE_Disabled (0x0UL)    /*!< Disabled                                                             */
  #define POWER_ULVENABLE_ENABLE_Enabled (0x1UL)     /*!< Enabled                                                              */


/* POWER_SEMAPHORESTATUS: Semaphore status */
  #define POWER_SEMAPHORESTATUS_ResetValue (0x00000000UL) /*!< Reset value of SEMAPHORESTATUS register.                        */

/* STATUS @Bit 0 : Semaphore status */
  #define POWER_SEMAPHORESTATUS_STATUS_Pos (0UL)     /*!< Position of STATUS field.                                            */
  #define POWER_SEMAPHORESTATUS_STATUS_Msk (0x1UL << POWER_SEMAPHORESTATUS_STATUS_Pos) /*!< Bit mask of STATUS field.          */
  #define POWER_SEMAPHORESTATUS_STATUS_Min (0x0UL)   /*!< Min enumerator value of STATUS field.                                */
  #define POWER_SEMAPHORESTATUS_STATUS_Max (0x1UL)   /*!< Max enumerator value of STATUS field.                                */
  #define POWER_SEMAPHORESTATUS_STATUS_Released (0x0UL) /*!< Semaphore released                                                */
  #define POWER_SEMAPHORESTATUS_STATUS_Acquired (0x1UL) /*!< Semaphore acquired                                                */


/* POWER_BILSENABLE: Enable BILS instances */
  #define POWER_BILSENABLE_ResetValue (0x00000000UL) /*!< Reset value of BILSENABLE register.                                  */

/* ENABLE @Bit 0 : Enable */
  #define POWER_BILSENABLE_ENABLE_Pos (0UL)          /*!< Position of ENABLE field.                                            */
  #define POWER_BILSENABLE_ENABLE_Msk (0x1UL << POWER_BILSENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                    */
  #define POWER_BILSENABLE_ENABLE_Min (0x0UL)        /*!< Min enumerator value of ENABLE field.                                */
  #define POWER_BILSENABLE_ENABLE_Max (0x1UL)        /*!< Max enumerator value of ENABLE field.                                */
  #define POWER_BILSENABLE_ENABLE_Disabled (0x0UL)   /*!< All BILS instances are disabled                                      */
  #define POWER_BILSENABLE_ENABLE_Enabled (0x1UL)    /*!< All configured BILS instances are enabled                            */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           PPIB                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

