adamkondraciuk/nrfx/mdk/nrf7140_types.h
  #define PWM_TASKS_DMA_SEQ_STOP_ResetValue (0x00000000UL) /*!< Reset value of STOP register.                                  */

/* STOP @Bit 0 : Stops operation using easyDMA. This does not trigger an END event. After a STOP task, the easyDMA (channel)
                 will also enter its lowest required power level. */                                                              
                                                                                                                                  
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Pos (0UL)      /*!< Position of STOP field.                                              */
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Msk (0x1UL << PWM_TASKS_DMA_SEQ_STOP_STOP_Pos) /*!< Bit mask of STOP field.              */
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Min (0x1UL)    /*!< Min enumerator value of STOP field.                                  */
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Max (0x1UL)    /*!< Max enumerator value of STOP field.                                  */
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */



/* ================================================== Struct PWM_TASKS_DMA =================================================== */
/**
  * @brief TASKS_DMA [PWM_TASKS_DMA] Peripheral tasks.
  */
typedef struct {
  __OM  NRF_PWM_TASKS_DMA_SEQ_Type SEQ[2];           /*!< (@ 0x00000000) Peripheral tasks.                                     */
} NRF_PWM_TASKS_DMA_Type;                            /*!< Size = 16 (0x010)                                                    */


/* ============================================== Struct PWM_SUBSCRIBE_DMA_SEQ =============================================== */
/**
  * @brief SEQ [PWM_SUBSCRIBE_DMA_SEQ] Subscribe configuration for tasks
  */
typedef struct {
  __IOM uint32_t  START;                             /*!< (@ 0x00000000) Subscribe configuration for task START                */
  __IOM uint32_t  STOP;                              /*!< (@ 0x00000004) Subscribe configuration for task STOP                 */
} NRF_PWM_SUBSCRIBE_DMA_SEQ_Type;                    /*!< Size = 8 (0x008)                                                     */
  #define PWM_SUBSCRIBE_DMA_SEQ_MaxCount (2UL)       /*!< Max size of SEQ[2] array.                                            */

/* PWM_SUBSCRIBE_DMA_SEQ_START: Subscribe configuration for task START */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_CHIDX_Msk (0xFFUL << PWM_SUBSCRIBE_DMA_SEQ_START_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define PWM_SUBSCRIBE_DMA_SEQ_START_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                         */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_EN_Msk (0x1UL << PWM_SUBSCRIBE_DMA_SEQ_START_EN_Pos) /*!< Bit mask of EN field.          */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_EN_Disabled (0x0UL) /*!< Disable subscription                                            */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_EN_Enabled (0x1UL) /*!< Enable subscription                                              */


/* PWM_SUBSCRIBE_DMA_SEQ_STOP: Subscribe configuration for task STOP */
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_ResetValue (0x00000000UL) /*!< Reset value of STOP register.                              */

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_CHIDX_Msk (0xFFUL << PWM_SUBSCRIBE_DMA_SEQ_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                          */
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_EN_Msk (0x1UL << PWM_SUBSCRIBE_DMA_SEQ_STOP_EN_Pos) /*!< Bit mask of EN field.            */
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_EN_Enabled (0x1UL) /*!< Enable subscription                                               */



/* ================================================ Struct PWM_SUBSCRIBE_DMA ================================================= */
/**
  * @brief SUBSCRIBE_DMA [PWM_SUBSCRIBE_DMA] Subscribe configuration for tasks
  */
typedef struct {
  __IOM NRF_PWM_SUBSCRIBE_DMA_SEQ_Type SEQ[2];       /*!< (@ 0x00000000) Subscribe configuration for tasks                     */
} NRF_PWM_SUBSCRIBE_DMA_Type;                        /*!< Size = 16 (0x010)                                                    */


/* ================================================ Struct PWM_EVENTS_DMA_SEQ ================================================ */
/**
  * @brief SEQ [PWM_EVENTS_DMA_SEQ] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  END;                               /*!< (@ 0x00000000) Generated after all MAXCNT bytes have been transferred
                                                                         Equivalent to eventDmaEnd[Channel]*/                     
  __IOM uint32_t  READY;                             /*!< (@ 0x00000004) Generated when EasyDMA has buffered the .PTR and
                                                                         .MAXCNT registers for the channel, allowing them to be
                                                                         written to prepare for the next sequence.*/              
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000008) An error occured during the bus transfer. This event is
                                                                         generated on an AHB / AXI error response.*/              
} NRF_PWM_EVENTS_DMA_SEQ_Type;                       /*!< Size = 12 (0x00C)                                                    */
  #define PWM_EVENTS_DMA_SEQ_MaxCount (2UL)          /*!< Max size of SEQ[2] array.                                            */

