adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PWM_EVENTS_DMA_SEQ_END: Generated after all MAXCNT bytes have been transferred Equivalent to eventDmaEnd[Channel] */
  #define PWM_EVENTS_DMA_SEQ_END_ResetValue (0x00000000UL) /*!< Reset value of END register.                                   */

/* END @Bit 0 : Generated after all MAXCNT bytes have been transferred Equivalent to eventDmaEnd[Channel] */
  #define PWM_EVENTS_DMA_SEQ_END_END_Pos (0UL)       /*!< Position of END field.                                               */
  #define PWM_EVENTS_DMA_SEQ_END_END_Msk (0x1UL << PWM_EVENTS_DMA_SEQ_END_END_Pos) /*!< Bit mask of END field.                 */
  #define PWM_EVENTS_DMA_SEQ_END_END_Min (0x0UL)     /*!< Min enumerator value of END field.                                   */
  #define PWM_EVENTS_DMA_SEQ_END_END_Max (0x1UL)     /*!< Max enumerator value of END field.                                   */
  #define PWM_EVENTS_DMA_SEQ_END_END_NotGenerated (0x0UL) /*!< Event not generated                                             */
  #define PWM_EVENTS_DMA_SEQ_END_END_Generated (0x1UL) /*!< Event generated                                                    */


/* PWM_EVENTS_DMA_SEQ_READY: Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them
                              to be written to prepare for the next sequence. */                                                  
                                                                                                                                  
  #define PWM_EVENTS_DMA_SEQ_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                               */

/* READY @Bit 0 : Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them to be
                  written to prepare for the next sequence. */                                                                    
                                                                                                                                  
  #define PWM_EVENTS_DMA_SEQ_READY_READY_Pos (0UL)   /*!< Position of READY field.                                             */
  #define PWM_EVENTS_DMA_SEQ_READY_READY_Msk (0x1UL << PWM_EVENTS_DMA_SEQ_READY_READY_Pos) /*!< Bit mask of READY field.       */
  #define PWM_EVENTS_DMA_SEQ_READY_READY_Min (0x0UL) /*!< Min enumerator value of READY field.                                 */
  #define PWM_EVENTS_DMA_SEQ_READY_READY_Max (0x1UL) /*!< Max enumerator value of READY field.                                 */
  #define PWM_EVENTS_DMA_SEQ_READY_READY_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define PWM_EVENTS_DMA_SEQ_READY_READY_Generated (0x1UL) /*!< Event generated                                                */


/* PWM_EVENTS_DMA_SEQ_BUSERROR: An error occured during the bus transfer. This event is generated on an AHB / AXI error
                                 response. */                                                                                     
                                                                                                                                  
  #define PWM_EVENTS_DMA_SEQ_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                         */

/* BUSERROR @Bit 0 : An error occured during the bus transfer. This event is generated on an AHB / AXI error response. */
  #define PWM_EVENTS_DMA_SEQ_BUSERROR_BUSERROR_Pos (0UL) /*!< Position of BUSERROR field.                                      */
  #define PWM_EVENTS_DMA_SEQ_BUSERROR_BUSERROR_Msk (0x1UL << PWM_EVENTS_DMA_SEQ_BUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR
                                                                            field.*/                                              
  #define PWM_EVENTS_DMA_SEQ_BUSERROR_BUSERROR_Min (0x0UL) /*!< Min enumerator value of BUSERROR field.                        */
  #define PWM_EVENTS_DMA_SEQ_BUSERROR_BUSERROR_Max (0x1UL) /*!< Max enumerator value of BUSERROR field.                        */
  #define PWM_EVENTS_DMA_SEQ_BUSERROR_BUSERROR_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define PWM_EVENTS_DMA_SEQ_BUSERROR_BUSERROR_Generated (0x1UL) /*!< Event generated                                          */



/* ================================================== Struct PWM_EVENTS_DMA ================================================== */
/**
  * @brief EVENTS_DMA [PWM_EVENTS_DMA] Peripheral events.
  */
typedef struct {
  __IOM NRF_PWM_EVENTS_DMA_SEQ_Type SEQ[2];          /*!< (@ 0x00000000) Peripheral events.                                    */
} NRF_PWM_EVENTS_DMA_Type;                           /*!< Size = 24 (0x018)                                                    */


/* =============================================== Struct PWM_PUBLISH_DMA_SEQ ================================================ */
/**
  * @brief SEQ [PWM_PUBLISH_DMA_SEQ] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  END;                               /*!< (@ 0x00000000) Publish configuration for event END                   */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000004) Publish configuration for event READY                 */
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000008) Publish configuration for event BUSERROR              */
} NRF_PWM_PUBLISH_DMA_SEQ_Type;                      /*!< Size = 12 (0x00C)                                                    */
  #define PWM_PUBLISH_DMA_SEQ_MaxCount (2UL)         /*!< Max size of SEQ[2] array.                                            */

/* PWM_PUBLISH_DMA_SEQ_END: Publish configuration for event END */
  #define PWM_PUBLISH_DMA_SEQ_END_ResetValue (0x00000000UL) /*!< Reset value of END register.                                  */

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define PWM_PUBLISH_DMA_SEQ_END_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define PWM_PUBLISH_DMA_SEQ_END_CHIDX_Msk (0xFFUL << PWM_PUBLISH_DMA_SEQ_END_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define PWM_PUBLISH_DMA_SEQ_END_CHIDX_Min (0x0UL)  /*!< Min value of CHIDX field.                                            */
  #define PWM_PUBLISH_DMA_SEQ_END_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_DMA_SEQ_END_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define PWM_PUBLISH_DMA_SEQ_END_EN_Msk (0x1UL << PWM_PUBLISH_DMA_SEQ_END_EN_Pos) /*!< Bit mask of EN field.                  */
  #define PWM_PUBLISH_DMA_SEQ_END_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define PWM_PUBLISH_DMA_SEQ_END_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define PWM_PUBLISH_DMA_SEQ_END_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define PWM_PUBLISH_DMA_SEQ_END_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* PWM_PUBLISH_DMA_SEQ_READY: Publish configuration for event READY */
  #define PWM_PUBLISH_DMA_SEQ_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                              */

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define PWM_PUBLISH_DMA_SEQ_READY_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define PWM_PUBLISH_DMA_SEQ_READY_CHIDX_Msk (0xFFUL << PWM_PUBLISH_DMA_SEQ_READY_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define PWM_PUBLISH_DMA_SEQ_READY_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                           */
  #define PWM_PUBLISH_DMA_SEQ_READY_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_DMA_SEQ_READY_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define PWM_PUBLISH_DMA_SEQ_READY_EN_Msk (0x1UL << PWM_PUBLISH_DMA_SEQ_READY_EN_Pos) /*!< Bit mask of EN field.              */
  #define PWM_PUBLISH_DMA_SEQ_READY_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define PWM_PUBLISH_DMA_SEQ_READY_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define PWM_PUBLISH_DMA_SEQ_READY_EN_Disabled (0x0UL) /*!< Disable publishing                                                */
  #define PWM_PUBLISH_DMA_SEQ_READY_EN_Enabled (0x1UL) /*!< Enable publishing                                                  */


/* PWM_PUBLISH_DMA_SEQ_BUSERROR: Publish configuration for event BUSERROR */
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR will publish to */
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                           */
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_CHIDX_Msk (0xFFUL << PWM_PUBLISH_DMA_SEQ_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                        */
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                        */

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_EN_Msk (0x1UL << PWM_PUBLISH_DMA_SEQ_BUSERROR_EN_Pos) /*!< Bit mask of EN field.        */
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                             */
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                               */



/* ================================================= Struct PWM_PUBLISH_DMA ================================================== */
/**
  * @brief PUBLISH_DMA [PWM_PUBLISH_DMA] Publish configuration for events
  */
typedef struct {
  __IOM NRF_PWM_PUBLISH_DMA_SEQ_Type SEQ[2];         /*!< (@ 0x00000000) Publish configuration for events                      */
} NRF_PWM_PUBLISH_DMA_Type;                          /*!< Size = 24 (0x018)                                                    */


