adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PWM_DECODER: Configuration of the decoder */
  #define PWM_DECODER_ResetValue (0x0003F000UL)      /*!< Reset value of DECODER register.                                     */

/* LOAD @Bits 0..2 : How a sequence is read from RAM and spread to the compare register */
  #define PWM_DECODER_LOAD_Pos (0UL)                 /*!< Position of LOAD field.                                              */
  #define PWM_DECODER_LOAD_Msk (0x7UL << PWM_DECODER_LOAD_Pos) /*!< Bit mask of LOAD field.                                    */
  #define PWM_DECODER_LOAD_Min (0x0UL)               /*!< Min enumerator value of LOAD field.                                  */
  #define PWM_DECODER_LOAD_Max (0x4UL)               /*!< Max enumerator value of LOAD field.                                  */
  #define PWM_DECODER_LOAD_Common (0x0UL)            /*!< 1st half word (16-bit) used in all PWM channels 0..3                 */
  #define PWM_DECODER_LOAD_Grouped (0x1UL)           /*!< 1st half word (16-bit) used in channel 0..1; 2nd word in channel 2..3*/
  #define PWM_DECODER_LOAD_Individual (0x2UL)        /*!< 1st half word (16-bit) in ch.0; 2nd in ch.1; ...; 4th in ch.3        */
  #define PWM_DECODER_LOAD_WaveForm (0x3UL)          /*!< 1st half word (16-bit) in ch.0; 2nd in ch.1; ...; 4th in COUNTERTOP  */
  #define PWM_DECODER_LOAD_WaveformRefresh (0x4UL)   /*!< 1st half word (16-bit) in ch.0; 2nd in ch.1; 3rd in refresh count; 4th
                                                          in COUNTERTOP*/                                                         

/* LOADDATAWIDTH @Bits 4..5 : Load data width of sequence read from RAM */
  #define PWM_DECODER_LOADDATAWIDTH_Pos (4UL)        /*!< Position of LOADDATAWIDTH field.                                     */
  #define PWM_DECODER_LOADDATAWIDTH_Msk (0x3UL << PWM_DECODER_LOADDATAWIDTH_Pos) /*!< Bit mask of LOADDATAWIDTH field.         */
  #define PWM_DECODER_LOADDATAWIDTH_Min (0x0UL)      /*!< Min enumerator value of LOADDATAWIDTH field.                         */
  #define PWM_DECODER_LOADDATAWIDTH_Max (0x2UL)      /*!< Max enumerator value of LOADDATAWIDTH field.                         */
  #define PWM_DECODER_LOADDATAWIDTH_LoadDataWidth16 (0x0UL) /*!< Load data width is 16 bit                                     */
  #define PWM_DECODER_LOADDATAWIDTH_LoadDataWidth8 (0x1UL) /*!< Load data width is 8 bit                                       */
  #define PWM_DECODER_LOADDATAWIDTH_LoadDataWidth4 (0x2UL) /*!< Load data width is 4 bit                                       */

/* MODE @Bit 8 : Selects source for advancing the active sequence */
  #define PWM_DECODER_MODE_Pos (8UL)                 /*!< Position of MODE field.                                              */
  #define PWM_DECODER_MODE_Msk (0x1UL << PWM_DECODER_MODE_Pos) /*!< Bit mask of MODE field.                                    */
  #define PWM_DECODER_MODE_Min (0x0UL)               /*!< Min enumerator value of MODE field.                                  */
  #define PWM_DECODER_MODE_Max (0x1UL)               /*!< Max enumerator value of MODE field.                                  */
  #define PWM_DECODER_MODE_RefreshCount (0x0UL)      /*!< SEQ[n].REFRESH is used to determine loading internal compare
                                                          registers*/                                                             
  #define PWM_DECODER_MODE_NextStep (0x1UL)          /*!< NEXTSTEP task causes a new value to be loaded to internal compare
                                                          registers*/                                                             

/* PWMCHEN0 @Bit 12 : PWM channel [0] enable configuration for the sequence */
  #define PWM_DECODER_PWMCHEN0_Pos (12UL)            /*!< Position of PWMCHEN0 field.                                          */
  #define PWM_DECODER_PWMCHEN0_Msk (0x1UL << PWM_DECODER_PWMCHEN0_Pos) /*!< Bit mask of PWMCHEN0 field.                        */
  #define PWM_DECODER_PWMCHEN0_Min (0x0UL)           /*!< Min enumerator value of PWMCHEN0 field.                              */
  #define PWM_DECODER_PWMCHEN0_Max (0x1UL)           /*!< Max enumerator value of PWMCHEN0 field.                              */
  #define PWM_DECODER_PWMCHEN0_Disable (0x0UL)       /*!< PWM channel disabled                                                 */
  #define PWM_DECODER_PWMCHEN0_Enable (0x1UL)        /*!< PWM channel enabled                                                  */

/* PWMCHEN1 @Bit 13 : PWM channel [1] enable configuration for the sequence */
  #define PWM_DECODER_PWMCHEN1_Pos (13UL)            /*!< Position of PWMCHEN1 field.                                          */
  #define PWM_DECODER_PWMCHEN1_Msk (0x1UL << PWM_DECODER_PWMCHEN1_Pos) /*!< Bit mask of PWMCHEN1 field.                        */
  #define PWM_DECODER_PWMCHEN1_Min (0x0UL)           /*!< Min enumerator value of PWMCHEN1 field.                              */
  #define PWM_DECODER_PWMCHEN1_Max (0x1UL)           /*!< Max enumerator value of PWMCHEN1 field.                              */
  #define PWM_DECODER_PWMCHEN1_Disable (0x0UL)       /*!< PWM channel disabled                                                 */
  #define PWM_DECODER_PWMCHEN1_Enable (0x1UL)        /*!< PWM channel enabled                                                  */

/* PWMCHEN2 @Bit 14 : PWM channel [2] enable configuration for the sequence */
  #define PWM_DECODER_PWMCHEN2_Pos (14UL)            /*!< Position of PWMCHEN2 field.                                          */
  #define PWM_DECODER_PWMCHEN2_Msk (0x1UL << PWM_DECODER_PWMCHEN2_Pos) /*!< Bit mask of PWMCHEN2 field.                        */
  #define PWM_DECODER_PWMCHEN2_Min (0x0UL)           /*!< Min enumerator value of PWMCHEN2 field.                              */
  #define PWM_DECODER_PWMCHEN2_Max (0x1UL)           /*!< Max enumerator value of PWMCHEN2 field.                              */
  #define PWM_DECODER_PWMCHEN2_Disable (0x0UL)       /*!< PWM channel disabled                                                 */
  #define PWM_DECODER_PWMCHEN2_Enable (0x1UL)        /*!< PWM channel enabled                                                  */

/* PWMCHEN3 @Bit 15 : PWM channel [3] enable configuration for the sequence */
  #define PWM_DECODER_PWMCHEN3_Pos (15UL)            /*!< Position of PWMCHEN3 field.                                          */
  #define PWM_DECODER_PWMCHEN3_Msk (0x1UL << PWM_DECODER_PWMCHEN3_Pos) /*!< Bit mask of PWMCHEN3 field.                        */
  #define PWM_DECODER_PWMCHEN3_Min (0x0UL)           /*!< Min enumerator value of PWMCHEN3 field.                              */
  #define PWM_DECODER_PWMCHEN3_Max (0x1UL)           /*!< Max enumerator value of PWMCHEN3 field.                              */
  #define PWM_DECODER_PWMCHEN3_Disable (0x0UL)       /*!< PWM channel disabled                                                 */
  #define PWM_DECODER_PWMCHEN3_Enable (0x1UL)        /*!< PWM channel enabled                                                  */

/* PWMREFRESHCOUNTEREN @Bit 16 : PWM Refresh counter enable configuration for the sequence */
  #define PWM_DECODER_PWMREFRESHCOUNTEREN_Pos (16UL) /*!< Position of PWMREFRESHCOUNTEREN field.                               */
  #define PWM_DECODER_PWMREFRESHCOUNTEREN_Msk (0x1UL << PWM_DECODER_PWMREFRESHCOUNTEREN_Pos) /*!< Bit mask of
                                                                            PWMREFRESHCOUNTEREN field.*/                          
  #define PWM_DECODER_PWMREFRESHCOUNTEREN_Min (0x0UL) /*!< Min enumerator value of PWMREFRESHCOUNTEREN field.                  */
  #define PWM_DECODER_PWMREFRESHCOUNTEREN_Max (0x1UL) /*!< Max enumerator value of PWMREFRESHCOUNTEREN field.                  */
  #define PWM_DECODER_PWMREFRESHCOUNTEREN_Disable (0x0UL) /*!< PWM Refresh counter disabled                                    */
  #define PWM_DECODER_PWMREFRESHCOUNTEREN_Enable (0x1UL) /*!< PWM Refresh counter enabled                                      */

/* PWMCOUNTERTOPEN @Bit 17 : PWM COUNTERTOP enable configuration for the sequence */
  #define PWM_DECODER_PWMCOUNTERTOPEN_Pos (17UL)     /*!< Position of PWMCOUNTERTOPEN field.                                   */
  #define PWM_DECODER_PWMCOUNTERTOPEN_Msk (0x1UL << PWM_DECODER_PWMCOUNTERTOPEN_Pos) /*!< Bit mask of PWMCOUNTERTOPEN field.   */
  #define PWM_DECODER_PWMCOUNTERTOPEN_Min (0x0UL)    /*!< Min enumerator value of PWMCOUNTERTOPEN field.                       */
  #define PWM_DECODER_PWMCOUNTERTOPEN_Max (0x1UL)    /*!< Max enumerator value of PWMCOUNTERTOPEN field.                       */
  #define PWM_DECODER_PWMCOUNTERTOPEN_Disable (0x0UL) /*!< PWM COUNTERTOP disabled                                             */
  #define PWM_DECODER_PWMCOUNTERTOPEN_Enable (0x1UL) /*!< PWM COUNTERTOP enabled                                               */


/* PWM_LOOP: Number of playbacks of a loop */
  #define PWM_LOOP_ResetValue (0x00000000UL)         /*!< Reset value of LOOP register.                                        */

