adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ACCDBL @Bits 0..3 : Register accumulating the number of detected double or illegal transitions. ( SAMPLE = 2 ). */
  #define QDEC_ACCDBL_ACCDBL_Pos (0UL)               /*!< Position of ACCDBL field.                                            */
  #define QDEC_ACCDBL_ACCDBL_Msk (0xFUL << QDEC_ACCDBL_ACCDBL_Pos) /*!< Bit mask of ACCDBL field.                              */
  #define QDEC_ACCDBL_ACCDBL_Min (0x0UL)             /*!< Min value of ACCDBL field.                                           */
  #define QDEC_ACCDBL_ACCDBL_Max (0xFUL)             /*!< Max size of ACCDBL field.                                            */


/* QDEC_ACCDBLREAD: Snapshot of the ACCDBL, updated by the READCLRACC or RDCLRDBL task */
  #define QDEC_ACCDBLREAD_ResetValue (0x00000000UL)  /*!< Reset value of ACCDBLREAD register.                                  */

/* ACCDBLREAD @Bits 0..3 : Snapshot of the ACCDBL register. This field is updated when the READCLRACC or RDCLRDBL task is
                           triggered. */                                                                                          
                                                                                                                                  
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Pos (0UL)       /*!< Position of ACCDBLREAD field.                                        */
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Msk (0xFUL << QDEC_ACCDBLREAD_ACCDBLREAD_Pos) /*!< Bit mask of ACCDBLREAD field.          */
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Min (0x0UL)     /*!< Min value of ACCDBLREAD field.                                       */
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Max (0xFUL)     /*!< Max size of ACCDBLREAD field.                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           QSPI                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct QSPI_TASKS_DMA ================================================== */
/**
  * @brief TASKS_DMA [QSPI_TASKS_DMA] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  TXACK;                             /*!< (@ 0x00000000) Task to indicate the DMA for Tx is completed (to the
                                                                         third party IP)*/                                        
  __OM  uint32_t  RXACK;                             /*!< (@ 0x00000004) Task to indicate the DMA for Rx is completed (to the
                                                                         third party IP)*/                                        
} NRF_QSPI_TASKS_DMA_Type;                           /*!< Size = 8 (0x008)                                                     */

/* QSPI_TASKS_DMA_TXACK: Task to indicate the DMA for Tx is completed (to the third party IP) */
  #define QSPI_TASKS_DMA_TXACK_ResetValue (0x00000000UL) /*!< Reset value of TXACK register.                                   */

/* TXACK @Bit 0 : Task to indicate the DMA for Tx is completed (to the third party IP) */
  #define QSPI_TASKS_DMA_TXACK_TXACK_Pos (0UL)       /*!< Position of TXACK field.                                             */
  #define QSPI_TASKS_DMA_TXACK_TXACK_Msk (0x1UL << QSPI_TASKS_DMA_TXACK_TXACK_Pos) /*!< Bit mask of TXACK field.               */
  #define QSPI_TASKS_DMA_TXACK_TXACK_Min (0x1UL)     /*!< Min enumerator value of TXACK field.                                 */
  #define QSPI_TASKS_DMA_TXACK_TXACK_Max (0x1UL)     /*!< Max enumerator value of TXACK field.                                 */
  #define QSPI_TASKS_DMA_TXACK_TXACK_Trigger (0x1UL) /*!< Trigger task                                                         */


/* QSPI_TASKS_DMA_RXACK: Task to indicate the DMA for Rx is completed (to the third party IP) */
  #define QSPI_TASKS_DMA_RXACK_ResetValue (0x00000000UL) /*!< Reset value of RXACK register.                                   */

/* RXACK @Bit 0 : Task to indicate the DMA for Rx is completed (to the third party IP) */
  #define QSPI_TASKS_DMA_RXACK_RXACK_Pos (0UL)       /*!< Position of RXACK field.                                             */
  #define QSPI_TASKS_DMA_RXACK_RXACK_Msk (0x1UL << QSPI_TASKS_DMA_RXACK_RXACK_Pos) /*!< Bit mask of RXACK field.               */
  #define QSPI_TASKS_DMA_RXACK_RXACK_Min (0x1UL)     /*!< Min enumerator value of RXACK field.                                 */
  #define QSPI_TASKS_DMA_RXACK_RXACK_Max (0x1UL)     /*!< Max enumerator value of RXACK field.                                 */
  #define QSPI_TASKS_DMA_RXACK_RXACK_Trigger (0x1UL) /*!< Trigger task                                                         */



/* ================================================ Struct QSPI_SUBSCRIBE_DMA ================================================ */
/**
  * @brief SUBSCRIBE_DMA [QSPI_SUBSCRIBE_DMA] Subscribe configuration for tasks
  */
typedef struct {
  __IOM uint32_t  TXACK;                             /*!< (@ 0x00000000) Subscribe configuration for task DMA.TXACK            */
  __IOM uint32_t  RXACK;                             /*!< (@ 0x00000004) Subscribe configuration for task DMA.RXACK            */
} NRF_QSPI_SUBSCRIBE_DMA_Type;                       /*!< Size = 8 (0x008)                                                     */

/* QSPI_SUBSCRIBE_DMA_TXACK: Subscribe configuration for task DMA.TXACK */
  #define QSPI_SUBSCRIBE_DMA_TXACK_ResetValue (0x00000000UL) /*!< Reset value of TXACK register.                               */

