adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task DMA.TXACK will subscribe to */
  #define QSPI_SUBSCRIBE_DMA_TXACK_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define QSPI_SUBSCRIBE_DMA_TXACK_CHIDX_Msk (0xFFUL << QSPI_SUBSCRIBE_DMA_TXACK_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define QSPI_SUBSCRIBE_DMA_TXACK_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                            */
  #define QSPI_SUBSCRIBE_DMA_TXACK_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define QSPI_SUBSCRIBE_DMA_TXACK_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define QSPI_SUBSCRIBE_DMA_TXACK_EN_Msk (0x1UL << QSPI_SUBSCRIBE_DMA_TXACK_EN_Pos) /*!< Bit mask of EN field.                */
  #define QSPI_SUBSCRIBE_DMA_TXACK_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define QSPI_SUBSCRIBE_DMA_TXACK_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define QSPI_SUBSCRIBE_DMA_TXACK_EN_Disabled (0x0UL) /*!< Disable subscription                                               */
  #define QSPI_SUBSCRIBE_DMA_TXACK_EN_Enabled (0x1UL) /*!< Enable subscription                                                 */


/* QSPI_SUBSCRIBE_DMA_RXACK: Subscribe configuration for task DMA.RXACK */
  #define QSPI_SUBSCRIBE_DMA_RXACK_ResetValue (0x00000000UL) /*!< Reset value of RXACK register.                               */

/* CHIDX @Bits 0..7 : DPPI channel that task DMA.RXACK will subscribe to */
  #define QSPI_SUBSCRIBE_DMA_RXACK_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define QSPI_SUBSCRIBE_DMA_RXACK_CHIDX_Msk (0xFFUL << QSPI_SUBSCRIBE_DMA_RXACK_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define QSPI_SUBSCRIBE_DMA_RXACK_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                            */
  #define QSPI_SUBSCRIBE_DMA_RXACK_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define QSPI_SUBSCRIBE_DMA_RXACK_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define QSPI_SUBSCRIBE_DMA_RXACK_EN_Msk (0x1UL << QSPI_SUBSCRIBE_DMA_RXACK_EN_Pos) /*!< Bit mask of EN field.                */
  #define QSPI_SUBSCRIBE_DMA_RXACK_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define QSPI_SUBSCRIBE_DMA_RXACK_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define QSPI_SUBSCRIBE_DMA_RXACK_EN_Disabled (0x0UL) /*!< Disable subscription                                               */
  #define QSPI_SUBSCRIBE_DMA_RXACK_EN_Enabled (0x1UL) /*!< Enable subscription                                                 */



/* ================================================= Struct QSPI_EVENTS_DMA ================================================== */
/**
  * @brief EVENTS_DMA [QSPI_EVENTS_DMA] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  TX;                                /*!< (@ 0x00000000) Event requesting DMA for Tx (from the third party IP) */
  __IOM uint32_t  RX;                                /*!< (@ 0x00000004) Event requesting DMA for Rx (from the third party IP) */
} NRF_QSPI_EVENTS_DMA_Type;                          /*!< Size = 8 (0x008)                                                     */

/* QSPI_EVENTS_DMA_TX: Event requesting DMA for Tx (from the third party IP) */
  #define QSPI_EVENTS_DMA_TX_ResetValue (0x00000000UL) /*!< Reset value of TX register.                                        */

/* TX @Bit 0 : Event requesting DMA for Tx (from the third party IP) */
  #define QSPI_EVENTS_DMA_TX_TX_Pos (0UL)            /*!< Position of TX field.                                                */
  #define QSPI_EVENTS_DMA_TX_TX_Msk (0x1UL << QSPI_EVENTS_DMA_TX_TX_Pos) /*!< Bit mask of TX field.                            */
  #define QSPI_EVENTS_DMA_TX_TX_Min (0x0UL)          /*!< Min enumerator value of TX field.                                    */
  #define QSPI_EVENTS_DMA_TX_TX_Max (0x1UL)          /*!< Max enumerator value of TX field.                                    */
  #define QSPI_EVENTS_DMA_TX_TX_NotGenerated (0x0UL) /*!< Event not generated                                                  */
  #define QSPI_EVENTS_DMA_TX_TX_Generated (0x1UL)    /*!< Event generated                                                      */


/* QSPI_EVENTS_DMA_RX: Event requesting DMA for Rx (from the third party IP) */
  #define QSPI_EVENTS_DMA_RX_ResetValue (0x00000000UL) /*!< Reset value of RX register.                                        */

/* RX @Bit 0 : Event requesting DMA for Rx (from the third party IP) */
  #define QSPI_EVENTS_DMA_RX_RX_Pos (0UL)            /*!< Position of RX field.                                                */
  #define QSPI_EVENTS_DMA_RX_RX_Msk (0x1UL << QSPI_EVENTS_DMA_RX_RX_Pos) /*!< Bit mask of RX field.                            */
  #define QSPI_EVENTS_DMA_RX_RX_Min (0x0UL)          /*!< Min enumerator value of RX field.                                    */
  #define QSPI_EVENTS_DMA_RX_RX_Max (0x1UL)          /*!< Max enumerator value of RX field.                                    */
  #define QSPI_EVENTS_DMA_RX_RX_NotGenerated (0x0UL) /*!< Event not generated                                                  */
  #define QSPI_EVENTS_DMA_RX_RX_Generated (0x1UL)    /*!< Event generated                                                      */



/* ================================================= Struct QSPI_PUBLISH_DMA ================================================= */
/**
  * @brief PUBLISH_DMA [QSPI_PUBLISH_DMA] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  TX;                                /*!< (@ 0x00000000) Publish configuration for event DMA.TX                */
  __IOM uint32_t  RX;                                /*!< (@ 0x00000004) Publish configuration for event DMA.RX                */
} NRF_QSPI_PUBLISH_DMA_Type;                         /*!< Size = 8 (0x008)                                                     */

/* QSPI_PUBLISH_DMA_TX: Publish configuration for event DMA.TX */
  #define QSPI_PUBLISH_DMA_TX_ResetValue (0x00000000UL) /*!< Reset value of TX register.                                       */

/* CHIDX @Bits 0..7 : DPPI channel that event DMA.TX will publish to */
  #define QSPI_PUBLISH_DMA_TX_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define QSPI_PUBLISH_DMA_TX_CHIDX_Msk (0xFFUL << QSPI_PUBLISH_DMA_TX_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define QSPI_PUBLISH_DMA_TX_CHIDX_Min (0x0UL)      /*!< Min value of CHIDX field.                                            */
  #define QSPI_PUBLISH_DMA_TX_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define QSPI_PUBLISH_DMA_TX_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define QSPI_PUBLISH_DMA_TX_EN_Msk (0x1UL << QSPI_PUBLISH_DMA_TX_EN_Pos) /*!< Bit mask of EN field.                          */
  #define QSPI_PUBLISH_DMA_TX_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define QSPI_PUBLISH_DMA_TX_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define QSPI_PUBLISH_DMA_TX_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define QSPI_PUBLISH_DMA_TX_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* QSPI_PUBLISH_DMA_RX: Publish configuration for event DMA.RX */
  #define QSPI_PUBLISH_DMA_RX_ResetValue (0x00000000UL) /*!< Reset value of RX register.                                       */

