adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event DMA.RX will publish to */
  #define QSPI_PUBLISH_DMA_RX_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define QSPI_PUBLISH_DMA_RX_CHIDX_Msk (0xFFUL << QSPI_PUBLISH_DMA_RX_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define QSPI_PUBLISH_DMA_RX_CHIDX_Min (0x0UL)      /*!< Min value of CHIDX field.                                            */
  #define QSPI_PUBLISH_DMA_RX_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define QSPI_PUBLISH_DMA_RX_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define QSPI_PUBLISH_DMA_RX_EN_Msk (0x1UL << QSPI_PUBLISH_DMA_RX_EN_Pos) /*!< Bit mask of EN field.                          */
  #define QSPI_PUBLISH_DMA_RX_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define QSPI_PUBLISH_DMA_RX_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define QSPI_PUBLISH_DMA_RX_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define QSPI_PUBLISH_DMA_RX_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */



/* ==================================================== Struct QSPI_CORE ===================================================== */
/**
  * @brief CORE [QSPI_CORE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CTRLR0;                            /*!< (@ 0x00000000) This register controls the serial data transfer.      */
  __IOM uint32_t  CTRLR1;                            /*!< (@ 0x00000004) This register exists only when the DWC_ssi is
                                                                         configured as a master device.*/                         
  __IOM uint32_t  SSIENR;                            /*!< (@ 0x00000008) This register enables and disables the DWC_ssi.       */
  __IOM uint32_t  MWCR;                              /*!< (@ 0x0000000C) This register controls the direction of the data word
                                                                         for the half-duplex Microwire serial protocol.*/         
  __IOM uint32_t  SER;                               /*!< (@ 0x00000010) Serial slave select                                   */
  __IOM uint32_t  BAUDR;                             /*!< (@ 0x00000014) Baudrate                                              */
  __IOM uint32_t  TXFTLR;                            /*!< (@ 0x00000018) This register controls the threshold value for the
                                                                         transmit FIFO memory.*/                                  
  __IOM uint32_t  RXFTLR;                            /*!< (@ 0x0000001C) This register controls the threshold value for the
                                                                         receive FIFO memory.*/                                   
  __IOM uint32_t  TXFLR;                             /*!< (@ 0x00000020) This register contains the number of valid data entries
                                                                         in the transmit FIFO memory.*/                           
  __IOM uint32_t  RXFLR;                             /*!< (@ 0x00000024) This register contains the number of valid data entries
                                                                         in the receive FIFO memory.*/                            
  __IOM uint32_t  SR;                                /*!< (@ 0x00000028) Transfer Status Register                              */
  __IOM uint32_t  IMR;                               /*!< (@ 0x0000002C) Interrupt Mask Register                               */
  __IOM uint32_t  ISR;                               /*!< (@ 0x00000030) Interrupt Status Register                             */
  __IOM uint32_t  RISR;                              /*!< (@ 0x00000034) Raw Interrupt Status Register                         */
  __IOM uint32_t  TXEICR;                            /*!< (@ 0x00000038) Transmit FIFO Error Interrupt Clear Register          */
  __IOM uint32_t  RXOICR;                            /*!< (@ 0x0000003C) Receive FIFO Overflow Interrupt Clear Register        */
  __IOM uint32_t  RXUICR;                            /*!< (@ 0x00000040) Receive FIFO Underflow Interrupt Clear Register       */
  __IOM uint32_t  MSTICR;                            /*!< (@ 0x00000044) Multi-Master Interrupt Clear Register                 */
  __IOM uint32_t  ICR;                               /*!< (@ 0x00000048) Interrupt Clear Register                              */
  __IOM uint32_t  DMACR;                             /*!< (@ 0x0000004C) DMA Control Register.                                 */
  __IOM uint32_t  DMATDLR;                           /*!< (@ 0x00000050) DMA Transmit Data Level Register                      */
  __IOM uint32_t  DMARDLR;                           /*!< (@ 0x00000054) DMA Receive Data Level Register                       */
  __IOM uint32_t  IDR;                               /*!< (@ 0x00000058) This register contains the peripherals identification
                                                                         code, which is written into the register at
                                                                         configuration time using coreConsultant.*/               
  __IOM uint32_t  SSICVERSIONID;                     /*!< (@ 0x0000005C) This read-only register stores the specific DWC_ssi
                                                                         component version.*/                                     
  __IOM uint32_t  DR0[36];                           /*!< (@ 0x00000060) Data register [n]                                     */
  __IOM uint32_t  RXSAMPLEDELAY;                     /*!< (@ 0x000000F0) Receive Data sample delay                             */
  __IOM uint32_t  SPICTRLR0;                         /*!< (@ 0x000000F4) SPI Control Register 0                                */
  __IM  uint32_t  RESERVED[8];
  __IOM uint32_t  SPICTRLR1;                         /*!< (@ 0x00000118) SPI Control Register 1                                */
  __IOM uint32_t  SPITECR;                           /*!< (@ 0x0000011C) SPI Transmit Error Interrupt Clear Register           */
} NRF_QSPI_CORE_Type;                                /*!< Size = 288 (0x120)                                                   */

/* QSPI_CORE_CTRLR0: This register controls the serial data transfer. */
  #define QSPI_CORE_CTRLR0_ResetValue (0x00004007UL) /*!< Reset value of CTRLR0 register.                                      */

