adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SPIFRF @Bits 22..23 : SPI Frame Format */
  #define QSPI_CORE_CTRLR0_SPIFRF_Pos (22UL)         /*!< Position of SPIFRF field.                                            */
  #define QSPI_CORE_CTRLR0_SPIFRF_Msk (0x3UL << QSPI_CORE_CTRLR0_SPIFRF_Pos) /*!< Bit mask of SPIFRF field.                    */
  #define QSPI_CORE_CTRLR0_SPIFRF_Min (0x0UL)        /*!< Min enumerator value of SPIFRF field.                                */
  #define QSPI_CORE_CTRLR0_SPIFRF_Max (0x3UL)        /*!< Max enumerator value of SPIFRF field.                                */
  #define QSPI_CORE_CTRLR0_SPIFRF_SPI_STANDARD (0x0UL) /*!< (unspecified)                                                      */
  #define QSPI_CORE_CTRLR0_SPIFRF_SPI_DUAL (0x1UL)   /*!< (unspecified)                                                        */
  #define QSPI_CORE_CTRLR0_SPIFRF_SPI_QUAD (0x2UL)   /*!< (unspecified)                                                        */
  #define QSPI_CORE_CTRLR0_SPIFRF_SPI_OCTAL (0x3UL)  /*!< (unspecified)                                                        */

/* SPIHYPERBUSEN @Bit 24 : SPI Hyperbus Frame format enable. */
  #define QSPI_CORE_CTRLR0_SPIHYPERBUSEN_Pos (24UL)  /*!< Position of SPIHYPERBUSEN field.                                     */
  #define QSPI_CORE_CTRLR0_SPIHYPERBUSEN_Msk (0x1UL << QSPI_CORE_CTRLR0_SPIHYPERBUSEN_Pos) /*!< Bit mask of SPIHYPERBUSEN
                                                                            field.*/                                              
  #define QSPI_CORE_CTRLR0_SPIHYPERBUSEN_Min (0x0UL) /*!< Min enumerator value of SPIHYPERBUSEN field.                         */
  #define QSPI_CORE_CTRLR0_SPIHYPERBUSEN_Max (0x1UL) /*!< Max enumerator value of SPIHYPERBUSEN field.                         */
  #define QSPI_CORE_CTRLR0_SPIHYPERBUSEN_DISABLE (0x0UL) /*!< (unspecified)                                                    */
  #define QSPI_CORE_CTRLR0_SPIHYPERBUSEN_ENABLE (0x1UL) /*!< (unspecified)                                                     */

/* SPIDWSEN @Bit 25 : Enable Dynamic wait states in SPI mode of operation. This field is only applicable when CTRLR0.FRF is set
                      to 0 (Motorola SPI Frame Format). */                                                                        
                                                                                                                                  
  #define QSPI_CORE_CTRLR0_SPIDWSEN_Pos (25UL)       /*!< Position of SPIDWSEN field.                                          */
  #define QSPI_CORE_CTRLR0_SPIDWSEN_Msk (0x1UL << QSPI_CORE_CTRLR0_SPIDWSEN_Pos) /*!< Bit mask of SPIDWSEN field.              */
  #define QSPI_CORE_CTRLR0_SPIDWSEN_Min (0x0UL)      /*!< Min enumerator value of SPIDWSEN field.                              */
  #define QSPI_CORE_CTRLR0_SPIDWSEN_Max (0x1UL)      /*!< Max enumerator value of SPIDWSEN field.                              */
  #define QSPI_CORE_CTRLR0_SPIDWSEN_DISABLE (0x0UL)  /*!< (unspecified)                                                        */
  #define QSPI_CORE_CTRLR0_SPIDWSEN_ENABLE (0x1UL)   /*!< (unspecified)                                                        */

/* RSVDCTRLR02631 @Bits 26..30 : Reserved bits - read as zero */
  #define QSPI_CORE_CTRLR0_RSVDCTRLR02631_Pos (26UL) /*!< Position of RSVDCTRLR02631 field.                                    */
  #define QSPI_CORE_CTRLR0_RSVDCTRLR02631_Msk (0x1FUL << QSPI_CORE_CTRLR0_RSVDCTRLR02631_Pos) /*!< Bit mask of RSVDCTRLR02631
                                                                            field.*/                                              

/* SSIISMST @Bit 31 : This field selects if DWC_ssi is working in Master or Slave mode */
  #define QSPI_CORE_CTRLR0_SSIISMST_Pos (31UL)       /*!< Position of SSIISMST field.                                          */
  #define QSPI_CORE_CTRLR0_SSIISMST_Msk (0x1UL << QSPI_CORE_CTRLR0_SSIISMST_Pos) /*!< Bit mask of SSIISMST field.              */
  #define QSPI_CORE_CTRLR0_SSIISMST_Min (0x0UL)      /*!< Min enumerator value of SSIISMST field.                              */
  #define QSPI_CORE_CTRLR0_SSIISMST_Max (0x1UL)      /*!< Max enumerator value of SSIISMST field.                              */
  #define QSPI_CORE_CTRLR0_SSIISMST_SLAVE (0x0UL)    /*!< (unspecified)                                                        */
  #define QSPI_CORE_CTRLR0_SSIISMST_MASTER (0x1UL)   /*!< (unspecified)                                                        */


/* QSPI_CORE_CTRLR1: This register exists only when the DWC_ssi is configured as a master device. */
  #define QSPI_CORE_CTRLR1_ResetValue (0x00000000UL) /*!< Reset value of CTRLR1 register.                                      */

/* NDF @Bits 0..15 : Number of Data Frames. */
  #define QSPI_CORE_CTRLR1_NDF_Pos (0UL)             /*!< Position of NDF field.                                               */
  #define QSPI_CORE_CTRLR1_NDF_Msk (0xFFFFUL << QSPI_CORE_CTRLR1_NDF_Pos) /*!< Bit mask of NDF field.                          */

/* RSVDCTRLR1 @Bits 16..31 : Reserved bits - read as zero */
  #define QSPI_CORE_CTRLR1_RSVDCTRLR1_Pos (16UL)     /*!< Position of RSVDCTRLR1 field.                                        */
  #define QSPI_CORE_CTRLR1_RSVDCTRLR1_Msk (0xFFFFUL << QSPI_CORE_CTRLR1_RSVDCTRLR1_Pos) /*!< Bit mask of RSVDCTRLR1 field.     */


/* QSPI_CORE_SSIENR: This register enables and disables the DWC_ssi. */
  #define QSPI_CORE_SSIENR_ResetValue (0x00000000UL) /*!< Reset value of SSIENR register.                                      */

/* SSICEN @Bit 0 : SSI Enable. */
  #define QSPI_CORE_SSIENR_SSICEN_Pos (0UL)          /*!< Position of SSICEN field.                                            */
  #define QSPI_CORE_SSIENR_SSICEN_Msk (0x1UL << QSPI_CORE_SSIENR_SSICEN_Pos) /*!< Bit mask of SSICEN field.                    */
  #define QSPI_CORE_SSIENR_SSICEN_Min (0x0UL)        /*!< Min enumerator value of SSICEN field.                                */
  #define QSPI_CORE_SSIENR_SSICEN_Max (0x1UL)        /*!< Max enumerator value of SSICEN field.                                */
  #define QSPI_CORE_SSIENR_SSICEN_DISABLE (0x0UL)    /*!< (unspecified)                                                        */
  #define QSPI_CORE_SSIENR_SSICEN_ENABLED (0x1UL)    /*!< (unspecified)                                                        */

/* RSVDSSIENR @Bits 1..31 : Reserved bits - read as zero */
  #define QSPI_CORE_SSIENR_RSVDSSIENR_Pos (1UL)      /*!< Position of RSVDSSIENR field.                                        */
  #define QSPI_CORE_SSIENR_RSVDSSIENR_Msk (0x7FFFFFFFUL << QSPI_CORE_SSIENR_RSVDSSIENR_Pos) /*!< Bit mask of RSVDSSIENR field. */


/* QSPI_CORE_MWCR: This register controls the direction of the data word for the half-duplex Microwire serial protocol. */
  #define QSPI_CORE_MWCR_ResetValue (0x00000000UL)   /*!< Reset value of MWCR register.                                        */

