adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* MWMOD @Bit 0 : Microwire Transfer Mode. */
  #define QSPI_CORE_MWCR_MWMOD_Pos (0UL)             /*!< Position of MWMOD field.                                             */
  #define QSPI_CORE_MWCR_MWMOD_Msk (0x1UL << QSPI_CORE_MWCR_MWMOD_Pos) /*!< Bit mask of MWMOD field.                           */
  #define QSPI_CORE_MWCR_MWMOD_Min (0x0UL)           /*!< Min enumerator value of MWMOD field.                                 */
  #define QSPI_CORE_MWCR_MWMOD_Max (0x1UL)           /*!< Max enumerator value of MWMOD field.                                 */
  #define QSPI_CORE_MWCR_MWMOD_NON_SEQUENTIAL (0x0UL) /*!< (unspecified)                                                       */
  #define QSPI_CORE_MWCR_MWMOD_SEQUENTIAL (0x1UL)    /*!< (unspecified)                                                        */

/* MDD @Bit 1 : Microwire Control. */
  #define QSPI_CORE_MWCR_MDD_Pos (1UL)               /*!< Position of MDD field.                                               */
  #define QSPI_CORE_MWCR_MDD_Msk (0x1UL << QSPI_CORE_MWCR_MDD_Pos) /*!< Bit mask of MDD field.                                 */
  #define QSPI_CORE_MWCR_MDD_Min (0x0UL)             /*!< Min enumerator value of MDD field.                                   */
  #define QSPI_CORE_MWCR_MDD_Max (0x1UL)             /*!< Max enumerator value of MDD field.                                   */
  #define QSPI_CORE_MWCR_MDD_RECEIVE (0x0UL)         /*!< (unspecified)                                                        */
  #define QSPI_CORE_MWCR_MDD_TRANSMIT (0x1UL)        /*!< (unspecified)                                                        */

/* MHS @Bit 2 : Microwire Handshaking. */
  #define QSPI_CORE_MWCR_MHS_Pos (2UL)               /*!< Position of MHS field.                                               */
  #define QSPI_CORE_MWCR_MHS_Msk (0x1UL << QSPI_CORE_MWCR_MHS_Pos) /*!< Bit mask of MHS field.                                 */
  #define QSPI_CORE_MWCR_MHS_Min (0x0UL)             /*!< Min enumerator value of MHS field.                                   */
  #define QSPI_CORE_MWCR_MHS_Max (0x1UL)             /*!< Max enumerator value of MHS field.                                   */
  #define QSPI_CORE_MWCR_MHS_DISABLE (0x0UL)         /*!< (unspecified)                                                        */
  #define QSPI_CORE_MWCR_MHS_ENABLED (0x1UL)         /*!< (unspecified)                                                        */

/* RSVDMWCR @Bits 3..31 : Reserved bits - read as zero */
  #define QSPI_CORE_MWCR_RSVDMWCR_Pos (3UL)          /*!< Position of RSVDMWCR field.                                          */
  #define QSPI_CORE_MWCR_RSVDMWCR_Msk (0x1FFFFFFFUL << QSPI_CORE_MWCR_RSVDMWCR_Pos) /*!< Bit mask of RSVDMWCR field.           */


/* QSPI_CORE_SER: Serial slave select */
  #define QSPI_CORE_SER_ResetValue (0x00000000UL)    /*!< Reset value of SER register.                                         */

/* SER @Bits 0..1 : Slave Select Enable Flag. */
  #define QSPI_CORE_SER_SER_Pos (0UL)                /*!< Position of SER field.                                               */
  #define QSPI_CORE_SER_SER_Msk (0x3UL << QSPI_CORE_SER_SER_Pos) /*!< Bit mask of SER field.                                   */

/* RSVDSER @Bits 2..31 : Reserved bits - read as zero */
  #define QSPI_CORE_SER_RSVDSER_Pos (2UL)            /*!< Position of RSVDSER field.                                           */
  #define QSPI_CORE_SER_RSVDSER_Msk (0x3FFFFFFFUL << QSPI_CORE_SER_RSVDSER_Pos) /*!< Bit mask of RSVDSER field.                */


/* QSPI_CORE_BAUDR: Baudrate */
  #define QSPI_CORE_BAUDR_ResetValue (0x00000000UL)  /*!< Reset value of BAUDR register.                                       */

/* RSVDBAUDR0 @Bit 0 : Reserved bits - read as zero */
  #define QSPI_CORE_BAUDR_RSVDBAUDR0_Pos (0UL)       /*!< Position of RSVDBAUDR0 field.                                        */
  #define QSPI_CORE_BAUDR_RSVDBAUDR0_Msk (0x1UL << QSPI_CORE_BAUDR_RSVDBAUDR0_Pos) /*!< Bit mask of RSVDBAUDR0 field.          */

/* SCKDV @Bits 1..15 : SSI Clock Divider. */
  #define QSPI_CORE_BAUDR_SCKDV_Pos (1UL)            /*!< Position of SCKDV field.                                             */
  #define QSPI_CORE_BAUDR_SCKDV_Msk (0x7FFFUL << QSPI_CORE_BAUDR_SCKDV_Pos) /*!< Bit mask of SCKDV field.                      */

/* RSVDBAUDR1631 @Bits 16..31 : Reserved bits - read as zero */
  #define QSPI_CORE_BAUDR_RSVDBAUDR1631_Pos (16UL)   /*!< Position of RSVDBAUDR1631 field.                                     */
  #define QSPI_CORE_BAUDR_RSVDBAUDR1631_Msk (0xFFFFUL << QSPI_CORE_BAUDR_RSVDBAUDR1631_Pos) /*!< Bit mask of RSVDBAUDR1631
                                                                            field.*/                                              


/* QSPI_CORE_TXFTLR: This register controls the threshold value for the transmit FIFO memory. */
  #define QSPI_CORE_TXFTLR_ResetValue (0x00000000UL) /*!< Reset value of TXFTLR register.                                      */

/* TFT @Bits 0..3 : Transmit FIFO Threshold. */
  #define QSPI_CORE_TXFTLR_TFT_Pos (0UL)             /*!< Position of TFT field.                                               */
  #define QSPI_CORE_TXFTLR_TFT_Msk (0xFUL << QSPI_CORE_TXFTLR_TFT_Pos) /*!< Bit mask of TFT field.                             */

/* RSVDTXFTLR @Bits 4..15 : Reserved bits - read as zero */
  #define QSPI_CORE_TXFTLR_RSVDTXFTLR_Pos (4UL)      /*!< Position of RSVDTXFTLR field.                                        */
  #define QSPI_CORE_TXFTLR_RSVDTXFTLR_Msk (0xFFFUL << QSPI_CORE_TXFTLR_RSVDTXFTLR_Pos) /*!< Bit mask of RSVDTXFTLR field.      */

/* TXFTHR @Bits 16..19 : Transfer start FIFO level. */
  #define QSPI_CORE_TXFTLR_TXFTHR_Pos (16UL)         /*!< Position of TXFTHR field.                                            */
  #define QSPI_CORE_TXFTLR_TXFTHR_Msk (0xFUL << QSPI_CORE_TXFTLR_TXFTHR_Pos) /*!< Bit mask of TXFTHR field.                    */

/* RSVDTXFTHR @Bits 20..31 : Reserved bits - read as zero */
  #define QSPI_CORE_TXFTLR_RSVDTXFTHR_Pos (20UL)     /*!< Position of RSVDTXFTHR field.                                        */
  #define QSPI_CORE_TXFTLR_RSVDTXFTHR_Msk (0xFFFUL << QSPI_CORE_TXFTLR_RSVDTXFTHR_Pos) /*!< Bit mask of RSVDTXFTHR field.      */


/* QSPI_CORE_RXFTLR: This register controls the threshold value for the receive FIFO memory. */
  #define QSPI_CORE_RXFTLR_ResetValue (0x00000000UL) /*!< Reset value of RXFTLR register.                                      */

/* RFT @Bits 0..3 : Receive FIFO Threshold. */
  #define QSPI_CORE_RXFTLR_RFT_Pos (0UL)             /*!< Position of RFT field.                                               */
  #define QSPI_CORE_RXFTLR_RFT_Msk (0xFUL << QSPI_CORE_RXFTLR_RFT_Pos) /*!< Bit mask of RFT field.                             */

