adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RSVDRXFTLR @Bits 4..31 : Reserved bits - read as zero */
  #define QSPI_CORE_RXFTLR_RSVDRXFTLR_Pos (4UL)      /*!< Position of RSVDRXFTLR field.                                        */
  #define QSPI_CORE_RXFTLR_RSVDRXFTLR_Msk (0xFFFFFFFUL << QSPI_CORE_RXFTLR_RSVDRXFTLR_Pos) /*!< Bit mask of RSVDRXFTLR field.  */


/* QSPI_CORE_TXFLR: This register contains the number of valid data entries in the transmit FIFO memory. */
  #define QSPI_CORE_TXFLR_ResetValue (0x00000000UL)  /*!< Reset value of TXFLR register.                                       */

/* TXTFL @Bits 0..4 : Transmit FIFO Level. */
  #define QSPI_CORE_TXFLR_TXTFL_Pos (0UL)            /*!< Position of TXTFL field.                                             */
  #define QSPI_CORE_TXFLR_TXTFL_Msk (0x1FUL << QSPI_CORE_TXFLR_TXTFL_Pos) /*!< Bit mask of TXTFL field.                        */

/* RSVDTXFLR @Bits 5..31 : Reserved bits - read as zero */
  #define QSPI_CORE_TXFLR_RSVDTXFLR_Pos (5UL)        /*!< Position of RSVDTXFLR field.                                         */
  #define QSPI_CORE_TXFLR_RSVDTXFLR_Msk (0x7FFFFFFUL << QSPI_CORE_TXFLR_RSVDTXFLR_Pos) /*!< Bit mask of RSVDTXFLR field.       */


/* QSPI_CORE_RXFLR: This register contains the number of valid data entries in the receive FIFO memory. */
  #define QSPI_CORE_RXFLR_ResetValue (0x00000000UL)  /*!< Reset value of RXFLR register.                                       */

/* RXTFL @Bits 0..4 : Receive FIFO Level. */
  #define QSPI_CORE_RXFLR_RXTFL_Pos (0UL)            /*!< Position of RXTFL field.                                             */
  #define QSPI_CORE_RXFLR_RXTFL_Msk (0x1FUL << QSPI_CORE_RXFLR_RXTFL_Pos) /*!< Bit mask of RXTFL field.                        */

/* RSVDRXFLR @Bits 5..31 : Reserved bits - read as zero */
  #define QSPI_CORE_RXFLR_RSVDRXFLR_Pos (5UL)        /*!< Position of RSVDRXFLR field.                                         */
  #define QSPI_CORE_RXFLR_RSVDRXFLR_Msk (0x7FFFFFFUL << QSPI_CORE_RXFLR_RSVDRXFLR_Pos) /*!< Bit mask of RSVDRXFLR field.       */


/* QSPI_CORE_SR: Transfer Status Register */
  #define QSPI_CORE_SR_ResetValue (0x00000006UL)     /*!< Reset value of SR register.                                          */

/* BUSY @Bit 0 : SSI Busy Flag. */
  #define QSPI_CORE_SR_BUSY_Pos (0UL)                /*!< Position of BUSY field.                                              */
  #define QSPI_CORE_SR_BUSY_Msk (0x1UL << QSPI_CORE_SR_BUSY_Pos) /*!< Bit mask of BUSY field.                                  */
  #define QSPI_CORE_SR_BUSY_Min (0x0UL)              /*!< Min enumerator value of BUSY field.                                  */
  #define QSPI_CORE_SR_BUSY_Max (0x1UL)              /*!< Max enumerator value of BUSY field.                                  */
  #define QSPI_CORE_SR_BUSY_INACTIVE (0x0UL)         /*!< (unspecified)                                                        */
  #define QSPI_CORE_SR_BUSY_ACTIVE (0x1UL)           /*!< (unspecified)                                                        */

/* TFNF @Bit 1 : Transmit FIFO Not Full. */
  #define QSPI_CORE_SR_TFNF_Pos (1UL)                /*!< Position of TFNF field.                                              */
  #define QSPI_CORE_SR_TFNF_Msk (0x1UL << QSPI_CORE_SR_TFNF_Pos) /*!< Bit mask of TFNF field.                                  */
  #define QSPI_CORE_SR_TFNF_Min (0x0UL)              /*!< Min enumerator value of TFNF field.                                  */
  #define QSPI_CORE_SR_TFNF_Max (0x1UL)              /*!< Max enumerator value of TFNF field.                                  */
  #define QSPI_CORE_SR_TFNF_FULL (0x0UL)             /*!< (unspecified)                                                        */
  #define QSPI_CORE_SR_TFNF_NOT_FULL (0x1UL)         /*!< (unspecified)                                                        */

/* TFE @Bit 2 : Transmit FIFO Empty. */
  #define QSPI_CORE_SR_TFE_Pos (2UL)                 /*!< Position of TFE field.                                               */
  #define QSPI_CORE_SR_TFE_Msk (0x1UL << QSPI_CORE_SR_TFE_Pos) /*!< Bit mask of TFE field.                                     */
  #define QSPI_CORE_SR_TFE_Min (0x0UL)               /*!< Min enumerator value of TFE field.                                   */
  #define QSPI_CORE_SR_TFE_Max (0x1UL)               /*!< Max enumerator value of TFE field.                                   */
  #define QSPI_CORE_SR_TFE_NOT_EMPTY (0x0UL)         /*!< (unspecified)                                                        */
  #define QSPI_CORE_SR_TFE_EMPTY (0x1UL)             /*!< (unspecified)                                                        */

/* RFNE @Bit 3 : Receive FIFO Not Empty. */
  #define QSPI_CORE_SR_RFNE_Pos (3UL)                /*!< Position of RFNE field.                                              */
  #define QSPI_CORE_SR_RFNE_Msk (0x1UL << QSPI_CORE_SR_RFNE_Pos) /*!< Bit mask of RFNE field.                                  */
  #define QSPI_CORE_SR_RFNE_Min (0x0UL)              /*!< Min enumerator value of RFNE field.                                  */
  #define QSPI_CORE_SR_RFNE_Max (0x1UL)              /*!< Max enumerator value of RFNE field.                                  */
  #define QSPI_CORE_SR_RFNE_EMPTY (0x0UL)            /*!< (unspecified)                                                        */
  #define QSPI_CORE_SR_RFNE_NOT_EMPTY (0x1UL)        /*!< (unspecified)                                                        */

/* RFF @Bit 4 : Receive FIFO Full. */
  #define QSPI_CORE_SR_RFF_Pos (4UL)                 /*!< Position of RFF field.                                               */
  #define QSPI_CORE_SR_RFF_Msk (0x1UL << QSPI_CORE_SR_RFF_Pos) /*!< Bit mask of RFF field.                                     */
  #define QSPI_CORE_SR_RFF_Min (0x0UL)               /*!< Min enumerator value of RFF field.                                   */
  #define QSPI_CORE_SR_RFF_Max (0x1UL)               /*!< Max enumerator value of RFF field.                                   */
  #define QSPI_CORE_SR_RFF_NOT_FULL (0x0UL)          /*!< (unspecified)                                                        */
  #define QSPI_CORE_SR_RFF_FULL (0x1UL)              /*!< (unspecified)                                                        */

/* TXE @Bit 5 : Transmission Error. */
  #define QSPI_CORE_SR_TXE_Pos (5UL)                 /*!< Position of TXE field.                                               */
  #define QSPI_CORE_SR_TXE_Msk (0x1UL << QSPI_CORE_SR_TXE_Pos) /*!< Bit mask of TXE field.                                     */
  #define QSPI_CORE_SR_TXE_Min (0x0UL)               /*!< Min enumerator value of TXE field.                                   */
  #define QSPI_CORE_SR_TXE_Max (0x1UL)               /*!< Max enumerator value of TXE field.                                   */
  #define QSPI_CORE_SR_TXE_NO_ERROR (0x0UL)          /*!< (unspecified)                                                        */
  #define QSPI_CORE_SR_TXE_TX_ERROR (0x1UL)          /*!< (unspecified)                                                        */

/* DCOL @Bit 6 : Data Collision Error. */
  #define QSPI_CORE_SR_DCOL_Pos (6UL)                /*!< Position of DCOL field.                                              */
  #define QSPI_CORE_SR_DCOL_Msk (0x1UL << QSPI_CORE_SR_DCOL_Pos) /*!< Bit mask of DCOL field.                                  */
  #define QSPI_CORE_SR_DCOL_Min (0x0UL)              /*!< Min enumerator value of DCOL field.                                  */
  #define QSPI_CORE_SR_DCOL_Max (0x1UL)              /*!< Max enumerator value of DCOL field.                                  */
  #define QSPI_CORE_SR_DCOL_NO_ERROR_CONDITION (0x0UL) /*!< (unspecified)                                                      */
  #define QSPI_CORE_SR_DCOL_TX_COLLISION_ERROR (0x1UL) /*!< (unspecified)                                                      */

/* RSVDSR @Bits 7..14 : Reserved bits - read as zero */
  #define QSPI_CORE_SR_RSVDSR_Pos (7UL)              /*!< Position of RSVDSR field.                                            */
  #define QSPI_CORE_SR_RSVDSR_Msk (0xFFUL << QSPI_CORE_SR_RSVDSR_Pos) /*!< Bit mask of RSVDSR field.                           */

/* CMPLTDDF @Bits 15..31 : Completed Data frames */
  #define QSPI_CORE_SR_CMPLTDDF_Pos (15UL)           /*!< Position of CMPLTDDF field.                                          */
  #define QSPI_CORE_SR_CMPLTDDF_Msk (0x1FFFFUL << QSPI_CORE_SR_CMPLTDDF_Pos) /*!< Bit mask of CMPLTDDF field.                  */


/* QSPI_CORE_IMR: Interrupt Mask Register */
  #define QSPI_CORE_IMR_ResetValue (0x0000043FUL)    /*!< Reset value of IMR register.                                         */

