adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TXEIM @Bit 0 : Transmit FIFO Empty Interrupt Mask */
  #define QSPI_CORE_IMR_TXEIM_Pos (0UL)              /*!< Position of TXEIM field.                                             */
  #define QSPI_CORE_IMR_TXEIM_Msk (0x1UL << QSPI_CORE_IMR_TXEIM_Pos) /*!< Bit mask of TXEIM field.                             */
  #define QSPI_CORE_IMR_TXEIM_Min (0x0UL)            /*!< Min enumerator value of TXEIM field.                                 */
  #define QSPI_CORE_IMR_TXEIM_Max (0x1UL)            /*!< Max enumerator value of TXEIM field.                                 */
  #define QSPI_CORE_IMR_TXEIM_MASKED (0x0UL)         /*!< (unspecified)                                                        */
  #define QSPI_CORE_IMR_TXEIM_UNMASKED (0x1UL)       /*!< (unspecified)                                                        */

/* TXOIM @Bit 1 : Transmit FIFO Overflow Interrupt Mask */
  #define QSPI_CORE_IMR_TXOIM_Pos (1UL)              /*!< Position of TXOIM field.                                             */
  #define QSPI_CORE_IMR_TXOIM_Msk (0x1UL << QSPI_CORE_IMR_TXOIM_Pos) /*!< Bit mask of TXOIM field.                             */
  #define QSPI_CORE_IMR_TXOIM_Min (0x0UL)            /*!< Min enumerator value of TXOIM field.                                 */
  #define QSPI_CORE_IMR_TXOIM_Max (0x1UL)            /*!< Max enumerator value of TXOIM field.                                 */
  #define QSPI_CORE_IMR_TXOIM_MASKED (0x0UL)         /*!< (unspecified)                                                        */
  #define QSPI_CORE_IMR_TXOIM_UNMASKED (0x1UL)       /*!< (unspecified)                                                        */

/* RXUIM @Bit 2 : Receive FIFO Underflow Interrupt Mask */
  #define QSPI_CORE_IMR_RXUIM_Pos (2UL)              /*!< Position of RXUIM field.                                             */
  #define QSPI_CORE_IMR_RXUIM_Msk (0x1UL << QSPI_CORE_IMR_RXUIM_Pos) /*!< Bit mask of RXUIM field.                             */
  #define QSPI_CORE_IMR_RXUIM_Min (0x0UL)            /*!< Min enumerator value of RXUIM field.                                 */
  #define QSPI_CORE_IMR_RXUIM_Max (0x1UL)            /*!< Max enumerator value of RXUIM field.                                 */
  #define QSPI_CORE_IMR_RXUIM_MASKED (0x0UL)         /*!< (unspecified)                                                        */
  #define QSPI_CORE_IMR_RXUIM_UNMASKED (0x1UL)       /*!< (unspecified)                                                        */

/* RXOIM @Bit 3 : Receive FIFO Overflow Interrupt Mask */
  #define QSPI_CORE_IMR_RXOIM_Pos (3UL)              /*!< Position of RXOIM field.                                             */
  #define QSPI_CORE_IMR_RXOIM_Msk (0x1UL << QSPI_CORE_IMR_RXOIM_Pos) /*!< Bit mask of RXOIM field.                             */
  #define QSPI_CORE_IMR_RXOIM_Min (0x0UL)            /*!< Min enumerator value of RXOIM field.                                 */
  #define QSPI_CORE_IMR_RXOIM_Max (0x1UL)            /*!< Max enumerator value of RXOIM field.                                 */
  #define QSPI_CORE_IMR_RXOIM_MASKED (0x0UL)         /*!< (unspecified)                                                        */
  #define QSPI_CORE_IMR_RXOIM_UNMASKED (0x1UL)       /*!< (unspecified)                                                        */

/* RXFIM @Bit 4 : Receive FIFO Full Interrupt Mask */
  #define QSPI_CORE_IMR_RXFIM_Pos (4UL)              /*!< Position of RXFIM field.                                             */
  #define QSPI_CORE_IMR_RXFIM_Msk (0x1UL << QSPI_CORE_IMR_RXFIM_Pos) /*!< Bit mask of RXFIM field.                             */
  #define QSPI_CORE_IMR_RXFIM_Min (0x0UL)            /*!< Min enumerator value of RXFIM field.                                 */
  #define QSPI_CORE_IMR_RXFIM_Max (0x1UL)            /*!< Max enumerator value of RXFIM field.                                 */
  #define QSPI_CORE_IMR_RXFIM_MASKED (0x0UL)         /*!< (unspecified)                                                        */
  #define QSPI_CORE_IMR_RXFIM_UNMASKED (0x1UL)       /*!< (unspecified)                                                        */

/* MSTIM @Bit 5 : Multi-Master Contention Interrupt Mask. This bit field is not present if the DWC_ssi is configured as a
                  serial-master device. */                                                                                        
                                                                                                                                  
  #define QSPI_CORE_IMR_MSTIM_Pos (5UL)              /*!< Position of MSTIM field.                                             */
  #define QSPI_CORE_IMR_MSTIM_Msk (0x1UL << QSPI_CORE_IMR_MSTIM_Pos) /*!< Bit mask of MSTIM field.                             */
  #define QSPI_CORE_IMR_MSTIM_Min (0x0UL)            /*!< Min enumerator value of MSTIM field.                                 */
  #define QSPI_CORE_IMR_MSTIM_Max (0x1UL)            /*!< Max enumerator value of MSTIM field.                                 */
  #define QSPI_CORE_IMR_MSTIM_MASKED (0x0UL)         /*!< (unspecified)                                                        */
  #define QSPI_CORE_IMR_MSTIM_UNMASKED (0x1UL)       /*!< (unspecified)                                                        */

/* XRXOIM @Bit 6 : XIP Receive FIFO Overflow Interrupt Mask */
  #define QSPI_CORE_IMR_XRXOIM_Pos (6UL)             /*!< Position of XRXOIM field.                                            */
  #define QSPI_CORE_IMR_XRXOIM_Msk (0x1UL << QSPI_CORE_IMR_XRXOIM_Pos) /*!< Bit mask of XRXOIM field.                          */
  #define QSPI_CORE_IMR_XRXOIM_Min (0x0UL)           /*!< Min enumerator value of XRXOIM field.                                */
  #define QSPI_CORE_IMR_XRXOIM_Max (0x1UL)           /*!< Max enumerator value of XRXOIM field.                                */
  #define QSPI_CORE_IMR_XRXOIM_MASKED (0x0UL)        /*!< (unspecified)                                                        */
  #define QSPI_CORE_IMR_XRXOIM_UNMASKED (0x1UL)      /*!< (unspecified)                                                        */

/* TXUIM @Bit 7 : Transmit FIFO Underflow Interrupt Mask */
  #define QSPI_CORE_IMR_TXUIM_Pos (7UL)              /*!< Position of TXUIM field.                                             */
  #define QSPI_CORE_IMR_TXUIM_Msk (0x1UL << QSPI_CORE_IMR_TXUIM_Pos) /*!< Bit mask of TXUIM field.                             */
  #define QSPI_CORE_IMR_TXUIM_Min (0x0UL)            /*!< Min enumerator value of TXUIM field.                                 */
  #define QSPI_CORE_IMR_TXUIM_Max (0x1UL)            /*!< Max enumerator value of TXUIM field.                                 */
  #define QSPI_CORE_IMR_TXUIM_MASKED (0x0UL)         /*!< (unspecified)                                                        */
  #define QSPI_CORE_IMR_TXUIM_UNMASKED (0x1UL)       /*!< (unspecified)                                                        */

/* AXIEM @Bit 8 : AXI Error Interrupt Mask */
  #define QSPI_CORE_IMR_AXIEM_Pos (8UL)              /*!< Position of AXIEM field.                                             */
  #define QSPI_CORE_IMR_AXIEM_Msk (0x1UL << QSPI_CORE_IMR_AXIEM_Pos) /*!< Bit mask of AXIEM field.                             */
  #define QSPI_CORE_IMR_AXIEM_Min (0x0UL)            /*!< Min enumerator value of AXIEM field.                                 */
  #define QSPI_CORE_IMR_AXIEM_Max (0x1UL)            /*!< Max enumerator value of AXIEM field.                                 */
  #define QSPI_CORE_IMR_AXIEM_MASKED (0x0UL)         /*!< (unspecified)                                                        */
  #define QSPI_CORE_IMR_AXIEM_UNMASKED (0x1UL)       /*!< (unspecified)                                                        */

/* RSVD9IMR @Bit 9 : Reserved bits - read as zero */
  #define QSPI_CORE_IMR_RSVD9IMR_Pos (9UL)           /*!< Position of RSVD9IMR field.                                          */
  #define QSPI_CORE_IMR_RSVD9IMR_Msk (0x1UL << QSPI_CORE_IMR_RSVD9IMR_Pos) /*!< Bit mask of RSVD9IMR field.                    */

/* SPITEM @Bit 10 : SPI Transmit Error Interrupt Mask */
  #define QSPI_CORE_IMR_SPITEM_Pos (10UL)            /*!< Position of SPITEM field.                                            */
  #define QSPI_CORE_IMR_SPITEM_Msk (0x1UL << QSPI_CORE_IMR_SPITEM_Pos) /*!< Bit mask of SPITEM field.                          */
  #define QSPI_CORE_IMR_SPITEM_Min (0x0UL)           /*!< Min enumerator value of SPITEM field.                                */
  #define QSPI_CORE_IMR_SPITEM_Max (0x1UL)           /*!< Max enumerator value of SPITEM field.                                */
  #define QSPI_CORE_IMR_SPITEM_MASKED (0x0UL)        /*!< (unspecified)                                                        */
  #define QSPI_CORE_IMR_SPITEM_UNMASKED (0x1UL)      /*!< (unspecified)                                                        */

/* DONEM @Bit 11 : SSI Done Interrupt Mask */
  #define QSPI_CORE_IMR_DONEM_Pos (11UL)             /*!< Position of DONEM field.                                             */
  #define QSPI_CORE_IMR_DONEM_Msk (0x1UL << QSPI_CORE_IMR_DONEM_Pos) /*!< Bit mask of DONEM field.                             */
  #define QSPI_CORE_IMR_DONEM_Min (0x0UL)            /*!< Min enumerator value of DONEM field.                                 */
  #define QSPI_CORE_IMR_DONEM_Max (0x1UL)            /*!< Max enumerator value of DONEM field.                                 */
  #define QSPI_CORE_IMR_DONEM_MASKED (0x0UL)         /*!< (unspecified)                                                        */
  #define QSPI_CORE_IMR_DONEM_UNMASKED (0x1UL)       /*!< (unspecified)                                                        */

