adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* AXIER @Bit 8 : AXI Error Interrupt Raw Status */
  #define QSPI_CORE_RISR_AXIER_Pos (8UL)             /*!< Position of AXIER field.                                             */
  #define QSPI_CORE_RISR_AXIER_Msk (0x1UL << QSPI_CORE_RISR_AXIER_Pos) /*!< Bit mask of AXIER field.                           */
  #define QSPI_CORE_RISR_AXIER_Min (0x0UL)           /*!< Min enumerator value of AXIER field.                                 */
  #define QSPI_CORE_RISR_AXIER_Max (0x1UL)           /*!< Max enumerator value of AXIER field.                                 */
  #define QSPI_CORE_RISR_AXIER_INACTIVE (0x0UL)      /*!< (unspecified)                                                        */
  #define QSPI_CORE_RISR_AXIER_ACTIVE (0x1UL)        /*!< (unspecified)                                                        */

/* RSVD9RISR @Bit 9 : Reserved bits - read as zero */
  #define QSPI_CORE_RISR_RSVD9RISR_Pos (9UL)         /*!< Position of RSVD9RISR field.                                         */
  #define QSPI_CORE_RISR_RSVD9RISR_Msk (0x1UL << QSPI_CORE_RISR_RSVD9RISR_Pos) /*!< Bit mask of RSVD9RISR field.               */

/* SPITER @Bit 10 : SPI Transmit Error Interrupt status. */
  #define QSPI_CORE_RISR_SPITER_Pos (10UL)           /*!< Position of SPITER field.                                            */
  #define QSPI_CORE_RISR_SPITER_Msk (0x1UL << QSPI_CORE_RISR_SPITER_Pos) /*!< Bit mask of SPITER field.                        */
  #define QSPI_CORE_RISR_SPITER_Min (0x0UL)          /*!< Min enumerator value of SPITER field.                                */
  #define QSPI_CORE_RISR_SPITER_Max (0x1UL)          /*!< Max enumerator value of SPITER field.                                */
  #define QSPI_CORE_RISR_SPITER_INACTIVE (0x0UL)     /*!< (unspecified)                                                        */
  #define QSPI_CORE_RISR_SPITER_ACTIVE (0x1UL)       /*!< (unspecified)                                                        */

/* DONER @Bit 11 : SSI Done Interrupt Raw Status */
  #define QSPI_CORE_RISR_DONER_Pos (11UL)            /*!< Position of DONER field.                                             */
  #define QSPI_CORE_RISR_DONER_Msk (0x1UL << QSPI_CORE_RISR_DONER_Pos) /*!< Bit mask of DONER field.                           */
  #define QSPI_CORE_RISR_DONER_Min (0x0UL)           /*!< Min enumerator value of DONER field.                                 */
  #define QSPI_CORE_RISR_DONER_Max (0x1UL)           /*!< Max enumerator value of DONER field.                                 */
  #define QSPI_CORE_RISR_DONER_INACTIVE (0x0UL)      /*!< (unspecified)                                                        */
  #define QSPI_CORE_RISR_DONER_ACTIVE (0x1UL)        /*!< (unspecified)                                                        */

/* RSVD1232RISR @Bits 12..31 : Reserved bits - read as zero */
  #define QSPI_CORE_RISR_RSVD1232RISR_Pos (12UL)     /*!< Position of RSVD1232RISR field.                                      */
  #define QSPI_CORE_RISR_RSVD1232RISR_Msk (0xFFFFFUL << QSPI_CORE_RISR_RSVD1232RISR_Pos) /*!< Bit mask of RSVD1232RISR field.  */


/* QSPI_CORE_TXEICR: Transmit FIFO Error Interrupt Clear Register */
  #define QSPI_CORE_TXEICR_ResetValue (0x00000000UL) /*!< Reset value of TXEICR register.                                      */

/* TXEICR @Bit 0 : Clear Transmit FIFO Overflow/Underflow Interrupt. */
  #define QSPI_CORE_TXEICR_TXEICR_Pos (0UL)          /*!< Position of TXEICR field.                                            */
  #define QSPI_CORE_TXEICR_TXEICR_Msk (0x1UL << QSPI_CORE_TXEICR_TXEICR_Pos) /*!< Bit mask of TXEICR field.                    */

/* RSVDTXEICR @Bits 1..31 : Reserved bits - read as zero */
  #define QSPI_CORE_TXEICR_RSVDTXEICR_Pos (1UL)      /*!< Position of RSVDTXEICR field.                                        */
  #define QSPI_CORE_TXEICR_RSVDTXEICR_Msk (0x7FFFFFFFUL << QSPI_CORE_TXEICR_RSVDTXEICR_Pos) /*!< Bit mask of RSVDTXEICR field. */


/* QSPI_CORE_RXOICR: Receive FIFO Overflow Interrupt Clear Register */
  #define QSPI_CORE_RXOICR_ResetValue (0x00000000UL) /*!< Reset value of RXOICR register.                                      */

/* RXOICR @Bit 0 : Clear Receive FIFO Overflow Interrupt. */
  #define QSPI_CORE_RXOICR_RXOICR_Pos (0UL)          /*!< Position of RXOICR field.                                            */
  #define QSPI_CORE_RXOICR_RXOICR_Msk (0x1UL << QSPI_CORE_RXOICR_RXOICR_Pos) /*!< Bit mask of RXOICR field.                    */

/* RSVDRXOICR @Bits 1..31 : Reserved bits - read as zero */
  #define QSPI_CORE_RXOICR_RSVDRXOICR_Pos (1UL)      /*!< Position of RSVDRXOICR field.                                        */
  #define QSPI_CORE_RXOICR_RSVDRXOICR_Msk (0x7FFFFFFFUL << QSPI_CORE_RXOICR_RSVDRXOICR_Pos) /*!< Bit mask of RSVDRXOICR field. */


/* QSPI_CORE_RXUICR: Receive FIFO Underflow Interrupt Clear Register */
  #define QSPI_CORE_RXUICR_ResetValue (0x00000000UL) /*!< Reset value of RXUICR register.                                      */

/* RXUICR @Bit 0 : Clear Receive FIFO Underflow Interrupt. */
  #define QSPI_CORE_RXUICR_RXUICR_Pos (0UL)          /*!< Position of RXUICR field.                                            */
  #define QSPI_CORE_RXUICR_RXUICR_Msk (0x1UL << QSPI_CORE_RXUICR_RXUICR_Pos) /*!< Bit mask of RXUICR field.                    */

/* RSVDRXUICR @Bits 1..31 : Reserved bits - read as zero */
  #define QSPI_CORE_RXUICR_RSVDRXUICR_Pos (1UL)      /*!< Position of RSVDRXUICR field.                                        */
  #define QSPI_CORE_RXUICR_RSVDRXUICR_Msk (0x7FFFFFFFUL << QSPI_CORE_RXUICR_RSVDRXUICR_Pos) /*!< Bit mask of RSVDRXUICR field. */


/* QSPI_CORE_MSTICR: Multi-Master Interrupt Clear Register */
  #define QSPI_CORE_MSTICR_ResetValue (0x00000000UL) /*!< Reset value of MSTICR register.                                      */

/* MSTICR @Bit 0 : Clear Multi-Master Contention Interrupt. */
  #define QSPI_CORE_MSTICR_MSTICR_Pos (0UL)          /*!< Position of MSTICR field.                                            */
  #define QSPI_CORE_MSTICR_MSTICR_Msk (0x1UL << QSPI_CORE_MSTICR_MSTICR_Pos) /*!< Bit mask of MSTICR field.                    */

