adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RSVDMSTICR @Bits 1..31 : Reserved bits - read as zero */
  #define QSPI_CORE_MSTICR_RSVDMSTICR_Pos (1UL)      /*!< Position of RSVDMSTICR field.                                        */
  #define QSPI_CORE_MSTICR_RSVDMSTICR_Msk (0x7FFFFFFFUL << QSPI_CORE_MSTICR_RSVDMSTICR_Pos) /*!< Bit mask of RSVDMSTICR field. */


/* QSPI_CORE_ICR: Interrupt Clear Register */
  #define QSPI_CORE_ICR_ResetValue (0x00000000UL)    /*!< Reset value of ICR register.                                         */

/* ICR @Bit 0 : Clear Interrupts. */
  #define QSPI_CORE_ICR_ICR_Pos (0UL)                /*!< Position of ICR field.                                               */
  #define QSPI_CORE_ICR_ICR_Msk (0x1UL << QSPI_CORE_ICR_ICR_Pos) /*!< Bit mask of ICR field.                                   */

/* RSVDICR @Bits 1..31 : Reserved bits - read as zero */
  #define QSPI_CORE_ICR_RSVDICR_Pos (1UL)            /*!< Position of RSVDICR field.                                           */
  #define QSPI_CORE_ICR_RSVDICR_Msk (0x7FFFFFFFUL << QSPI_CORE_ICR_RSVDICR_Pos) /*!< Bit mask of RSVDICR field.                */


/* QSPI_CORE_DMACR: DMA Control Register. */
  #define QSPI_CORE_DMACR_ResetValue (0x00000000UL)  /*!< Reset value of DMACR register.                                       */

/* RDMAE @Bit 0 : Receive DMA Enable. This bit enables/disables the receive FIFO DMA channel. */
  #define QSPI_CORE_DMACR_RDMAE_Pos (0UL)            /*!< Position of RDMAE field.                                             */
  #define QSPI_CORE_DMACR_RDMAE_Msk (0x1UL << QSPI_CORE_DMACR_RDMAE_Pos) /*!< Bit mask of RDMAE field.                         */
  #define QSPI_CORE_DMACR_RDMAE_Min (0x0UL)          /*!< Min enumerator value of RDMAE field.                                 */
  #define QSPI_CORE_DMACR_RDMAE_Max (0x1UL)          /*!< Max enumerator value of RDMAE field.                                 */
  #define QSPI_CORE_DMACR_RDMAE_DISABLE (0x0UL)      /*!< (unspecified)                                                        */
  #define QSPI_CORE_DMACR_RDMAE_ENABLED (0x1UL)      /*!< (unspecified)                                                        */

/* TDMAE @Bit 1 : Transmit DMA Enable. This bit enables/disables the transmit FIFO DMA channel. */
  #define QSPI_CORE_DMACR_TDMAE_Pos (1UL)            /*!< Position of TDMAE field.                                             */
  #define QSPI_CORE_DMACR_TDMAE_Msk (0x1UL << QSPI_CORE_DMACR_TDMAE_Pos) /*!< Bit mask of TDMAE field.                         */
  #define QSPI_CORE_DMACR_TDMAE_Min (0x0UL)          /*!< Min enumerator value of TDMAE field.                                 */
  #define QSPI_CORE_DMACR_TDMAE_Max (0x1UL)          /*!< Max enumerator value of TDMAE field.                                 */
  #define QSPI_CORE_DMACR_TDMAE_DISABLE (0x0UL)      /*!< (unspecified)                                                        */
  #define QSPI_CORE_DMACR_TDMAE_ENABLED (0x1UL)      /*!< (unspecified)                                                        */

/* IDMAE @Bit 2 : Internal DMA Enable. This bit should be enabled only when CTRLR0.FRF = 0 (Motorola SPI) and CTRLR0.SPI_FRF
                  FIXME GT 0. */                                                                                                  
                                                                                                                                  
  #define QSPI_CORE_DMACR_IDMAE_Pos (2UL)            /*!< Position of IDMAE field.                                             */
  #define QSPI_CORE_DMACR_IDMAE_Msk (0x1UL << QSPI_CORE_DMACR_IDMAE_Pos) /*!< Bit mask of IDMAE field.                         */

/* ATW @Bits 3..4 : AXI transfer width for DMA transfers mapped to arsize/awsize. This value must be less than or equal to
                    SSIC_AXI_DW. Values: */                                                                                       
                                                                                                                                  
  #define QSPI_CORE_DMACR_ATW_Pos (3UL)              /*!< Position of ATW field.                                               */
  #define QSPI_CORE_DMACR_ATW_Msk (0x3UL << QSPI_CORE_DMACR_ATW_Pos) /*!< Bit mask of ATW field.                               */

/* RSVDDMACR5 @Bit 5 : Reserved bits - read as zero */
  #define QSPI_CORE_DMACR_RSVDDMACR5_Pos (5UL)       /*!< Position of RSVDDMACR5 field.                                        */
  #define QSPI_CORE_DMACR_RSVDDMACR5_Msk (0x1UL << QSPI_CORE_DMACR_RSVDDMACR5_Pos) /*!< Bit mask of RSVDDMACR5 field.          */

/* AINC @Bit 6 : Address Increment. Indicates whether to increment the AXI address on every transfer. */
  #define QSPI_CORE_DMACR_AINC_Pos (6UL)             /*!< Position of AINC field.                                              */
  #define QSPI_CORE_DMACR_AINC_Msk (0x1UL << QSPI_CORE_DMACR_AINC_Pos) /*!< Bit mask of AINC field.                            */

/* RSVDDMACR7 @Bit 7 : Reserved bits - read as zero */
  #define QSPI_CORE_DMACR_RSVDDMACR7_Pos (7UL)       /*!< Position of RSVDDMACR7 field.                                        */
  #define QSPI_CORE_DMACR_RSVDDMACR7_Msk (0x1UL << QSPI_CORE_DMACR_RSVDDMACR7_Pos) /*!< Bit mask of RSVDDMACR7 field.          */

/* ACACHE @Bits 8..11 : AXI arcache/awcache signal value. */
  #define QSPI_CORE_DMACR_ACACHE_Pos (8UL)           /*!< Position of ACACHE field.                                            */
  #define QSPI_CORE_DMACR_ACACHE_Msk (0xFUL << QSPI_CORE_DMACR_ACACHE_Pos) /*!< Bit mask of ACACHE field.                      */

/* APROT @Bits 12..14 : AXI arprot/awprot signal value. */
  #define QSPI_CORE_DMACR_APROT_Pos (12UL)           /*!< Position of APROT field.                                             */
  #define QSPI_CORE_DMACR_APROT_Msk (0x7UL << QSPI_CORE_DMACR_APROT_Pos) /*!< Bit mask of APROT field.                         */

/* AID @Bits 15..20 : AXI awid/arid signal value. */
  #define QSPI_CORE_DMACR_AID_Pos (15UL)             /*!< Position of AID field.                                               */
  #define QSPI_CORE_DMACR_AID_Msk (0x3FUL << QSPI_CORE_DMACR_AID_Pos) /*!< Bit mask of AID field.                              */

/* RSVDDMACR @Bits 21..31 : Reserved bits - read as zero */
  #define QSPI_CORE_DMACR_RSVDDMACR_Pos (21UL)       /*!< Position of RSVDDMACR field.                                         */
  #define QSPI_CORE_DMACR_RSVDDMACR_Msk (0x7FFUL << QSPI_CORE_DMACR_RSVDDMACR_Pos) /*!< Bit mask of RSVDDMACR field.           */


