adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* QSPI_CORE_DMATDLR: DMA Transmit Data Level Register */
  #define QSPI_CORE_DMATDLR_ResetValue (0x00000000UL) /*!< Reset value of DMATDLR register.                                    */

/* DMATDL @Bits 0..3 : Transmit Data Level. This bit field controls the level at which a DMA request is made by the transmit
                       logic. It is equal to the watermark level; that is, the dma_tx_req signal is generated when the number of
                       valid data entries in the transmit FIFO is equal to or below this field value, and TDMAE = 1. */           
                                                                                                                                  
  #define QSPI_CORE_DMATDLR_DMATDL_Pos (0UL)         /*!< Position of DMATDL field.                                            */
  #define QSPI_CORE_DMATDLR_DMATDL_Msk (0xFUL << QSPI_CORE_DMATDLR_DMATDL_Pos) /*!< Bit mask of DMATDL field.                  */

/* RSVDDMATDLR @Bits 4..31 : Reserved bits - read as zero */
  #define QSPI_CORE_DMATDLR_RSVDDMATDLR_Pos (4UL)    /*!< Position of RSVDDMATDLR field.                                       */
  #define QSPI_CORE_DMATDLR_RSVDDMATDLR_Msk (0xFFFFFFFUL << QSPI_CORE_DMATDLR_RSVDDMATDLR_Pos) /*!< Bit mask of RSVDDMATDLR
                                                                            field.*/                                              


/* QSPI_CORE_DMARDLR: DMA Receive Data Level Register */
  #define QSPI_CORE_DMARDLR_ResetValue (0x00000000UL) /*!< Reset value of DMARDLR register.                                    */

/* DMARDL @Bits 0..3 : Receive Data Level. This bit field controls the level at which a DMA request is made by the receive
                       logic. The watermark level = DMARDL+1; that is, dma_rx_req is generated when the number of valid data
                       entries in the receive FIFO is equal to or above this field value + 1, and RDMAE=1. */                     
                                                                                                                                  
  #define QSPI_CORE_DMARDLR_DMARDL_Pos (0UL)         /*!< Position of DMARDL field.                                            */
  #define QSPI_CORE_DMARDLR_DMARDL_Msk (0xFUL << QSPI_CORE_DMARDLR_DMARDL_Pos) /*!< Bit mask of DMARDL field.                  */

/* RSVDDMARDLR @Bits 4..31 : Reserved bits - read as zero */
  #define QSPI_CORE_DMARDLR_RSVDDMARDLR_Pos (4UL)    /*!< Position of RSVDDMARDLR field.                                       */
  #define QSPI_CORE_DMARDLR_RSVDDMARDLR_Msk (0xFFFFFFFUL << QSPI_CORE_DMARDLR_RSVDDMARDLR_Pos) /*!< Bit mask of RSVDDMARDLR
                                                                            field.*/                                              


/* QSPI_CORE_IDR: This register contains the peripherals identification code, which is written into the register at
                   configuration time using coreConsultant. */                                                                    
                                                                                                                                  
  #define QSPI_CORE_IDR_ResetValue (0x51535049UL)    /*!< Reset value of IDR register.                                         */

/* IDCODE @Bits 0..31 : Identification code. The register contains the peripherals identification code, which is written into
                        the register at configuration time using CoreConsultant. */                                               
                                                                                                                                  
  #define QSPI_CORE_IDR_IDCODE_Pos (0UL)             /*!< Position of IDCODE field.                                            */
  #define QSPI_CORE_IDR_IDCODE_Msk (0xFFFFFFFFUL << QSPI_CORE_IDR_IDCODE_Pos) /*!< Bit mask of IDCODE field.                   */


/* QSPI_CORE_SSICVERSIONID: This read-only register stores the specific DWC_ssi component version. */
  #define QSPI_CORE_SSICVERSIONID_ResetValue (0x3130332AUL) /*!< Reset value of SSICVERSIONID register.                        */

/* SSICCOMPVERSION @Bits 0..31 : Contains the hex representation of the Synopsys component version. Consists of ASCII value for
                                 each number in the version, followed by *. For example 31_30_33_2A represents the version
                                 1.03*. */                                                                                        
                                                                                                                                  
  #define QSPI_CORE_SSICVERSIONID_SSICCOMPVERSION_Pos (0UL) /*!< Position of SSICCOMPVERSION field.                            */
  #define QSPI_CORE_SSICVERSIONID_SSICCOMPVERSION_Msk (0xFFFFFFFFUL << QSPI_CORE_SSICVERSIONID_SSICCOMPVERSION_Pos) /*!< Bit
                                                                            mask of SSICCOMPVERSION field.*/                      


/* QSPI_CORE_DR0: Data register [n] */
  #define QSPI_CORE_DR0_MaxCount (36UL)              /*!< Max size of DR0[36] array.                                           */
  #define QSPI_CORE_DR0_ResetValue (0x00000000UL)    /*!< Reset value of DR0[36] register.                                     */

/* DR @Bits 0..31 : Data Register. When writing to this register, you must right-justify the data. Read data are automatically
                    right-justified. */                                                                                           
                                                                                                                                  
  #define QSPI_CORE_DR0_DR_Pos (0UL)                 /*!< Position of DR field.                                                */
  #define QSPI_CORE_DR0_DR_Msk (0xFFFFFFFFUL << QSPI_CORE_DR0_DR_Pos) /*!< Bit mask of DR field.                               */


/* QSPI_CORE_RXSAMPLEDELAY: Receive Data sample delay */
  #define QSPI_CORE_RXSAMPLEDELAY_ResetValue (0x00000000UL) /*!< Reset value of RXSAMPLEDELAY register.                        */

/* RSD @Bits 0..7 : Receive Data (rxd) Sample Delay. This register is used to delay the sample of the rxd input port. Each value
                    */                                                                                                            
                                                                                                                                  
  #define QSPI_CORE_RXSAMPLEDELAY_RSD_Pos (0UL)      /*!< Position of RSD field.                                               */
  #define QSPI_CORE_RXSAMPLEDELAY_RSD_Msk (0xFFUL << QSPI_CORE_RXSAMPLEDELAY_RSD_Pos) /*!< Bit mask of RSD field.              */

/* RSVD0RXSAMPLEDLY @Bits 8..15 : Reserved bits - read as zero */
  #define QSPI_CORE_RXSAMPLEDELAY_RSVD0RXSAMPLEDLY_Pos (8UL) /*!< Position of RSVD0RXSAMPLEDLY field.                          */
  #define QSPI_CORE_RXSAMPLEDELAY_RSVD0RXSAMPLEDLY_Msk (0xFFUL << QSPI_CORE_RXSAMPLEDELAY_RSVD0RXSAMPLEDLY_Pos) /*!< Bit mask of
                                                                            RSVD0RXSAMPLEDLY field.*/                             

