adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SE @Bit 16 : Receive Data (rxd) Sampling Edge. This register is used to decide the sampling edge for RXD signal with ssi_clk.
                Then this bit is set to 1 then negative edge of ssi_clk will be used to sample the incoming data, otherwise
                positive edge will be used for sampling. */                                                                       
                                                                                                                                  
  #define QSPI_CORE_RXSAMPLEDELAY_SE_Pos (16UL)      /*!< Position of SE field.                                                */
  #define QSPI_CORE_RXSAMPLEDELAY_SE_Msk (0x1UL << QSPI_CORE_RXSAMPLEDELAY_SE_Pos) /*!< Bit mask of SE field.                  */

/* RSVD1RXSAMPLEDLY @Bits 17..31 : Reserved bits - read as zero */
  #define QSPI_CORE_RXSAMPLEDELAY_RSVD1RXSAMPLEDLY_Pos (17UL) /*!< Position of RSVD1RXSAMPLEDLY field.                         */
  #define QSPI_CORE_RXSAMPLEDELAY_RSVD1RXSAMPLEDLY_Msk (0x7FFFUL << QSPI_CORE_RXSAMPLEDELAY_RSVD1RXSAMPLEDLY_Pos) /*!< Bit mask
                                                                            of RSVD1RXSAMPLEDLY field.*/                          


/* QSPI_CORE_SPICTRLR0: SPI Control Register 0 */
  #define QSPI_CORE_SPICTRLR0_ResetValue (0x00000200UL) /*!< Reset value of SPICTRLR0 register.                                */

/* TRANSTYPE @Bits 0..1 : Address and instruction transfer format. */
  #define QSPI_CORE_SPICTRLR0_TRANSTYPE_Pos (0UL)    /*!< Position of TRANSTYPE field.                                         */
  #define QSPI_CORE_SPICTRLR0_TRANSTYPE_Msk (0x3UL << QSPI_CORE_SPICTRLR0_TRANSTYPE_Pos) /*!< Bit mask of TRANSTYPE field.     */
  #define QSPI_CORE_SPICTRLR0_TRANSTYPE_Min (0x0UL)  /*!< Min enumerator value of TRANSTYPE field.                             */
  #define QSPI_CORE_SPICTRLR0_TRANSTYPE_Max (0x3UL)  /*!< Max enumerator value of TRANSTYPE field.                             */
  #define QSPI_CORE_SPICTRLR0_TRANSTYPE_TT0 (0x0UL)  /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_TRANSTYPE_TT1 (0x1UL)  /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_TRANSTYPE_TT2 (0x2UL)  /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_TRANSTYPE_TT3 (0x3UL)  /*!< (unspecified)                                                        */

/* ADDRL @Bits 2..5 : This bit defines Length of Address to be transmitted. Only after this much bits are programmed in to the
                      FIFO the transfer can begin. */                                                                             
                                                                                                                                  
  #define QSPI_CORE_SPICTRLR0_ADDRL_Pos (2UL)        /*!< Position of ADDRL field.                                             */
  #define QSPI_CORE_SPICTRLR0_ADDRL_Msk (0xFUL << QSPI_CORE_SPICTRLR0_ADDRL_Pos) /*!< Bit mask of ADDRL field.                 */
  #define QSPI_CORE_SPICTRLR0_ADDRL_Min (0x0UL)      /*!< Min enumerator value of ADDRL field.                                 */
  #define QSPI_CORE_SPICTRLR0_ADDRL_Max (0xFUL)      /*!< Max enumerator value of ADDRL field.                                 */
  #define QSPI_CORE_SPICTRLR0_ADDRL_ADDR_L0 (0x0UL)  /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_ADDRL_ADDR_L4 (0x1UL)  /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_ADDRL_ADDR_L8 (0x2UL)  /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_ADDRL_ADDR_L12 (0x3UL) /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_ADDRL_ADDR_L16 (0x4UL) /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_ADDRL_ADDR_L20 (0x5UL) /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_ADDRL_ADDR_L24 (0x6UL) /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_ADDRL_ADDR_L28 (0x7UL) /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_ADDRL_ADDR_L32 (0x8UL) /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_ADDRL_ADDR_L36 (0x9UL) /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_ADDRL_ADDR_L40 (0xAUL) /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_ADDRL_ADDR_L44 (0xBUL) /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_ADDRL_ADDR_L48 (0xCUL) /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_ADDRL_ADDR_L52 (0xDUL) /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_ADDRL_ADDR_L56 (0xEUL) /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_ADDRL_ADDR_L60 (0xFUL) /*!< (unspecified)                                                        */

/* RSVDSPICTRLR06 @Bit 6 : Reserved bits - read as zero */
  #define QSPI_CORE_SPICTRLR0_RSVDSPICTRLR06_Pos (6UL) /*!< Position of RSVDSPICTRLR06 field.                                  */
  #define QSPI_CORE_SPICTRLR0_RSVDSPICTRLR06_Msk (0x1UL << QSPI_CORE_SPICTRLR0_RSVDSPICTRLR06_Pos) /*!< Bit mask of
                                                                            RSVDSPICTRLR06 field.*/                               

/* XIPMDBITEN @Bit 7 : Mode bits enable in XIP mode. If this bit is set to 1, then in XIP mode of operation DWC_ssi will insert
                       mode bits after the address phase. These bits are set in register XIP_MODE_BITS register. The length of
                       mode bits is always set to 8 bits. */                                                                      
                                                                                                                                  
  #define QSPI_CORE_SPICTRLR0_XIPMDBITEN_Pos (7UL)   /*!< Position of XIPMDBITEN field.                                        */
  #define QSPI_CORE_SPICTRLR0_XIPMDBITEN_Msk (0x1UL << QSPI_CORE_SPICTRLR0_XIPMDBITEN_Pos) /*!< Bit mask of XIPMDBITEN field.  */

/* INSTL @Bits 8..9 : Dual/Quad/Octal mode instruction length in bits. */
  #define QSPI_CORE_SPICTRLR0_INSTL_Pos (8UL)        /*!< Position of INSTL field.                                             */
  #define QSPI_CORE_SPICTRLR0_INSTL_Msk (0x3UL << QSPI_CORE_SPICTRLR0_INSTL_Pos) /*!< Bit mask of INSTL field.                 */
  #define QSPI_CORE_SPICTRLR0_INSTL_Min (0x0UL)      /*!< Min enumerator value of INSTL field.                                 */
  #define QSPI_CORE_SPICTRLR0_INSTL_Max (0x3UL)      /*!< Max enumerator value of INSTL field.                                 */
  #define QSPI_CORE_SPICTRLR0_INSTL_INST_L0 (0x0UL)  /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_INSTL_INST_L4 (0x1UL)  /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_INSTL_INST_L8 (0x2UL)  /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_INSTL_INST_L16 (0x3UL) /*!< (unspecified)                                                        */

/* RSVDSPICTRLR010 @Bit 10 : Reserved bits - read as zero */
  #define QSPI_CORE_SPICTRLR0_RSVDSPICTRLR010_Pos (10UL) /*!< Position of RSVDSPICTRLR010 field.                               */
  #define QSPI_CORE_SPICTRLR0_RSVDSPICTRLR010_Msk (0x1UL << QSPI_CORE_SPICTRLR0_RSVDSPICTRLR010_Pos) /*!< Bit mask of
                                                                            RSVDSPICTRLR010 field.*/                              

/* WAITCYCLES @Bits 11..15 : Wait cycles in Dual/Quad/Octal mode between control frames transmit and data reception. Specified
                             as number of SPI clock cycles. */                                                                    
                                                                                                                                  
