adamkondraciuk/nrfx/mdk/nrf7140_types.h
  #define QSPI_CORE_SPICTRLR0_WAITCYCLES_Pos (11UL)  /*!< Position of WAITCYCLES field.                                        */
  #define QSPI_CORE_SPICTRLR0_WAITCYCLES_Msk (0x1FUL << QSPI_CORE_SPICTRLR0_WAITCYCLES_Pos) /*!< Bit mask of WAITCYCLES field. */

/* SPIDDREN @Bit 16 : SPI DDR Enable bit. This will enable Dual-data rate transfers in Dual/Quad/Octal frame formats of SPI. */
  #define QSPI_CORE_SPICTRLR0_SPIDDREN_Pos (16UL)    /*!< Position of SPIDDREN field.                                          */
  #define QSPI_CORE_SPICTRLR0_SPIDDREN_Msk (0x1UL << QSPI_CORE_SPICTRLR0_SPIDDREN_Pos) /*!< Bit mask of SPIDDREN field.        */

/* INSTDDREN @Bit 17 : Instruction DDR Enable bit. This will enable Dual-data rate transfer for Instruction phase. */
  #define QSPI_CORE_SPICTRLR0_INSTDDREN_Pos (17UL)   /*!< Position of INSTDDREN field.                                         */
  #define QSPI_CORE_SPICTRLR0_INSTDDREN_Msk (0x1UL << QSPI_CORE_SPICTRLR0_INSTDDREN_Pos) /*!< Bit mask of INSTDDREN field.     */

/* SPIRXDSEN @Bit 18 : Read data strobe enable bit. Once this bit is set to 1 DWC_ssi will use Read data strobe (rxds) to
                       capture read data in DDR mode. */                                                                          
                                                                                                                                  
  #define QSPI_CORE_SPICTRLR0_SPIRXDSEN_Pos (18UL)   /*!< Position of SPIRXDSEN field.                                         */
  #define QSPI_CORE_SPICTRLR0_SPIRXDSEN_Msk (0x1UL << QSPI_CORE_SPICTRLR0_SPIRXDSEN_Pos) /*!< Bit mask of SPIRXDSEN field.     */

/* XIPDFSHC @Bit 19 : Fix DFS for XIP transfers. If this bit is set to 1 then data frame size for XIP transfers will be fixed to
                      the programmed value in CTRLR0.DFS. The number of data frames to fetch will be determined by HSIZE and
                      HBURST signals. If this bit is set to 0 then data frame size and number of data frames to fetch will be
                      determined by HSIZE and HBURST signals */                                                                   
                                                                                                                                  
  #define QSPI_CORE_SPICTRLR0_XIPDFSHC_Pos (19UL)    /*!< Position of XIPDFSHC field.                                          */
  #define QSPI_CORE_SPICTRLR0_XIPDFSHC_Msk (0x1UL << QSPI_CORE_SPICTRLR0_XIPDFSHC_Pos) /*!< Bit mask of XIPDFSHC field.        */

/* XIPINSTEN @Bit 20 : XIP instruction enable bit. If this bit is set to 1 then XIP transfers will also have instruction phase.
                       The instruction op-codes will be chosen from XIP_INCR_INST or XIP_WRAP_INST registers bases on AHB
                       transfer type. */                                                                                          
                                                                                                                                  
  #define QSPI_CORE_SPICTRLR0_XIPINSTEN_Pos (20UL)   /*!< Position of XIPINSTEN field.                                         */
  #define QSPI_CORE_SPICTRLR0_XIPINSTEN_Msk (0x1UL << QSPI_CORE_SPICTRLR0_XIPINSTEN_Pos) /*!< Bit mask of XIPINSTEN field.     */

/* SSICXIPCONTXFEREN @Bit 21 : Enable continuous transfer in XIP mode. If this bit is set to 1 then continuous transfer mode in
                               XIP will be enabled, in this mode DWC_ssi will keep slave selected until a non-XIP transfer is
                               detected on the AHB interface. */                                                                  
                                                                                                                                  
  #define QSPI_CORE_SPICTRLR0_SSICXIPCONTXFEREN_Pos (21UL) /*!< Position of SSICXIPCONTXFEREN field.                           */
  #define QSPI_CORE_SPICTRLR0_SSICXIPCONTXFEREN_Msk (0x1UL << QSPI_CORE_SPICTRLR0_SSICXIPCONTXFEREN_Pos) /*!< Bit mask of
                                                                            SSICXIPCONTXFEREN field.*/                            

/* RSVDSPICTRLR02223 @Bits 22..23 : Reserved bits - read as zero */
  #define QSPI_CORE_SPICTRLR0_RSVDSPICTRLR02223_Pos (22UL) /*!< Position of RSVDSPICTRLR02223 field.                           */
  #define QSPI_CORE_SPICTRLR0_RSVDSPICTRLR02223_Msk (0x3UL << QSPI_CORE_SPICTRLR0_RSVDSPICTRLR02223_Pos) /*!< Bit mask of
                                                                            RSVDSPICTRLR02223 field.*/                            

/* SPIDMEN @Bit 24 : SPI data mask enable bit. */
  #define QSPI_CORE_SPICTRLR0_SPIDMEN_Pos (24UL)     /*!< Position of SPIDMEN field.                                           */
  #define QSPI_CORE_SPICTRLR0_SPIDMEN_Msk (0x1UL << QSPI_CORE_SPICTRLR0_SPIDMEN_Pos) /*!< Bit mask of SPIDMEN field.           */

/* SPIRXDSSIGEN @Bit 25 : Enable rxds signaling during address and command phase of Hypebus transfer. */
  #define QSPI_CORE_SPICTRLR0_SPIRXDSSIGEN_Pos (25UL) /*!< Position of SPIRXDSSIGEN field.                                     */
  #define QSPI_CORE_SPICTRLR0_SPIRXDSSIGEN_Msk (0x1UL << QSPI_CORE_SPICTRLR0_SPIRXDSSIGEN_Pos) /*!< Bit mask of SPIRXDSSIGEN
                                                                            field.*/                                              

/* XIPMBL @Bits 26..27 : XIP Mode bits length. Sets the length of mode bits in XIP mode of operation. These bits are valid only
                         when SPI_CTRLR0.XIP_MD_BIT_EN is set to 1. */                                                            
                                                                                                                                  
  #define QSPI_CORE_SPICTRLR0_XIPMBL_Pos (26UL)      /*!< Position of XIPMBL field.                                            */
  #define QSPI_CORE_SPICTRLR0_XIPMBL_Msk (0x3UL << QSPI_CORE_SPICTRLR0_XIPMBL_Pos) /*!< Bit mask of XIPMBL field.              */
  #define QSPI_CORE_SPICTRLR0_XIPMBL_Min (0x0UL)     /*!< Min enumerator value of XIPMBL field.                                */
  #define QSPI_CORE_SPICTRLR0_XIPMBL_Max (0x3UL)     /*!< Max enumerator value of XIPMBL field.                                */
  #define QSPI_CORE_SPICTRLR0_XIPMBL_MBL_2 (0x0UL)   /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_XIPMBL_MBL_4 (0x1UL)   /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_XIPMBL_MBL_8 (0x2UL)   /*!< (unspecified)                                                        */
  #define QSPI_CORE_SPICTRLR0_XIPMBL_MBL_16 (0x3UL)  /*!< (unspecified)                                                        */

/* RSVDSPICTRLR028 @Bit 28 : Reserved bits - read as zero */
  #define QSPI_CORE_SPICTRLR0_RSVDSPICTRLR028_Pos (28UL) /*!< Position of RSVDSPICTRLR028 field.                               */
  #define QSPI_CORE_SPICTRLR0_RSVDSPICTRLR028_Msk (0x1UL << QSPI_CORE_SPICTRLR0_RSVDSPICTRLR028_Pos) /*!< Bit mask of
                                                                            RSVDSPICTRLR028 field.*/                              

/* XIPPREFETCHEN @Bit 29 : Enables XIP pre-fetch functionality in DWC_ssi. */
  #define QSPI_CORE_SPICTRLR0_XIPPREFETCHEN_Pos (29UL) /*!< Position of XIPPREFETCHEN field.                                   */
  #define QSPI_CORE_SPICTRLR0_XIPPREFETCHEN_Msk (0x1UL << QSPI_CORE_SPICTRLR0_XIPPREFETCHEN_Pos) /*!< Bit mask of XIPPREFETCHEN
                                                                            field.*/                                              

/* CLKSTRETCHEN @Bit 30 : Enables clock stretching capability in SPI transfers. */
  #define QSPI_CORE_SPICTRLR0_CLKSTRETCHEN_Pos (30UL) /*!< Position of CLKSTRETCHEN field.                                     */
  #define QSPI_CORE_SPICTRLR0_CLKSTRETCHEN_Msk (0x1UL << QSPI_CORE_SPICTRLR0_CLKSTRETCHEN_Pos) /*!< Bit mask of CLKSTRETCHEN
                                                                            field.*/                                              

/* RSVDSPICTRLR0 @Bit 31 : Reserved bits - read as zero */
  #define QSPI_CORE_SPICTRLR0_RSVDSPICTRLR0_Pos (31UL) /*!< Position of RSVDSPICTRLR0 field.                                   */
  #define QSPI_CORE_SPICTRLR0_RSVDSPICTRLR0_Msk (0x1UL << QSPI_CORE_SPICTRLR0_RSVDSPICTRLR0_Pos) /*!< Bit mask of RSVDSPICTRLR0
                                                                            field.*/                                              


/* QSPI_CORE_SPICTRLR1: SPI Control Register 1 */
  #define QSPI_CORE_SPICTRLR1_ResetValue (0x00000000UL) /*!< Reset value of SPICTRLR1 register.                                */

/* DYNWS @Bits 0..2 : SPI Dynamic Wait states field. */
  #define QSPI_CORE_SPICTRLR1_DYNWS_Pos (0UL)        /*!< Position of DYNWS field.                                             */
  #define QSPI_CORE_SPICTRLR1_DYNWS_Msk (0x7UL << QSPI_CORE_SPICTRLR1_DYNWS_Pos) /*!< Bit mask of DYNWS field.                 */

