adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RSVDSPICTRLR137 @Bits 3..7 : Reserved bits - Read Only */
  #define QSPI_CORE_SPICTRLR1_RSVDSPICTRLR137_Pos (3UL) /*!< Position of RSVDSPICTRLR137 field.                                */
  #define QSPI_CORE_SPICTRLR1_RSVDSPICTRLR137_Msk (0x1FUL << QSPI_CORE_SPICTRLR1_RSVDSPICTRLR137_Pos) /*!< Bit mask of
                                                                            RSVDSPICTRLR137 field.*/                              

/* MAXWS @Bits 8..11 : Maximum wait cycles allowed per transaction. */
  #define QSPI_CORE_SPICTRLR1_MAXWS_Pos (8UL)        /*!< Position of MAXWS field.                                             */
  #define QSPI_CORE_SPICTRLR1_MAXWS_Msk (0xFUL << QSPI_CORE_SPICTRLR1_MAXWS_Pos) /*!< Bit mask of MAXWS field.                 */

/* RSVDSPICTRLR11232 @Bits 12..31 : Reserved bits - Read Only */
  #define QSPI_CORE_SPICTRLR1_RSVDSPICTRLR11232_Pos (12UL) /*!< Position of RSVDSPICTRLR11232 field.                           */
  #define QSPI_CORE_SPICTRLR1_RSVDSPICTRLR11232_Msk (0xFFFFFUL << QSPI_CORE_SPICTRLR1_RSVDSPICTRLR11232_Pos) /*!< Bit mask of
                                                                            RSVDSPICTRLR11232 field.*/                            


/* QSPI_CORE_SPITECR: SPI Transmit Error Interrupt Clear Register */
  #define QSPI_CORE_SPITECR_ResetValue (0x00000000UL) /*!< Reset value of SPITECR register.                                    */

/* SPITECR @Bit 0 : Clear SPI Transmit Error interrupt. */
  #define QSPI_CORE_SPITECR_SPITECR_Pos (0UL)        /*!< Position of SPITECR field.                                           */
  #define QSPI_CORE_SPITECR_SPITECR_Msk (0x1UL << QSPI_CORE_SPITECR_SPITECR_Pos) /*!< Bit mask of SPITECR field.               */

/* RSVDSPITECR @Bits 1..31 : Reserved bits - Read Only */
  #define QSPI_CORE_SPITECR_RSVDSPITECR_Pos (1UL)    /*!< Position of RSVDSPITECR field.                                       */
  #define QSPI_CORE_SPITECR_RSVDSPITECR_Msk (0x7FFFFFFFUL << QSPI_CORE_SPITECR_RSVDSPITECR_Pos) /*!< Bit mask of RSVDSPITECR
                                                                            field.*/                                              



/* ================================================== Struct QSPI_PCGCSLAVE ================================================== */
/**
  * @brief PCGCSLAVE [QSPI_PCGCSLAVE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PENALTY[1];                        /*!< (@ 0x00000000) Penalty level for power/clock pair n                  */
  __IM  uint32_t  RESERVED[31];
  __IOM uint32_t  FORCEOVERRIDE[1];                  /*!< (@ 0x00000080) Force override of power/clock pair n                  */
} NRF_QSPI_PCGCSLAVE_Type;                           /*!< Size = 132 (0x084)                                                   */

/* QSPI_PCGCSLAVE_PENALTY: Penalty level for power/clock pair n */
  #define QSPI_PCGCSLAVE_PENALTY_MaxCount (1UL)      /*!< Max size of PENALTY[1] array.                                        */
  #define QSPI_PCGCSLAVE_PENALTY_ResetValue (0x00000000UL) /*!< Reset value of PENALTY[1] register.                            */

/* PENALTY @Bits 0..7 : Penalty level */
  #define QSPI_PCGCSLAVE_PENALTY_PENALTY_Pos (0UL)   /*!< Position of PENALTY field.                                           */
  #define QSPI_PCGCSLAVE_PENALTY_PENALTY_Msk (0xFFUL << QSPI_PCGCSLAVE_PENALTY_PENALTY_Pos) /*!< Bit mask of PENALTY field.    */


/* QSPI_PCGCSLAVE_FORCEOVERRIDE: Force override of power/clock pair n */
  #define QSPI_PCGCSLAVE_FORCEOVERRIDE_MaxCount (1UL) /*!< Max size of FORCEOVERRIDE[1] array.                                 */
  #define QSPI_PCGCSLAVE_FORCEOVERRIDE_ResetValue (0x00000000UL) /*!< Reset value of FORCEOVERRIDE[1] register.                */

/* CLOCKFORCINGPRE @Bits 0..3 : CLOCKFORCINGPRE */
  #define QSPI_PCGCSLAVE_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos (0UL) /*!< Position of CLOCKFORCINGPRE field.                       */
  #define QSPI_PCGCSLAVE_FORCEOVERRIDE_CLOCKFORCINGPRE_Msk (0xFUL << QSPI_PCGCSLAVE_FORCEOVERRIDE_CLOCKFORCINGPRE_Pos) /*!< Bit
                                                                            mask of CLOCKFORCINGPRE field.*/                      

/* DOFORCECLOCKPRE @Bit 7 : DOFORCECLOCKPRE */
  #define QSPI_PCGCSLAVE_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos (7UL) /*!< Position of DOFORCECLOCKPRE field.                       */
  #define QSPI_PCGCSLAVE_FORCEOVERRIDE_DOFORCECLOCKPRE_Msk (0x1UL << QSPI_PCGCSLAVE_FORCEOVERRIDE_DOFORCECLOCKPRE_Pos) /*!< Bit
                                                                            mask of DOFORCECLOCKPRE field.*/                      

/* POWERFORCINGPRE @Bits 8..9 : POWERFORCINGPRE */
  #define QSPI_PCGCSLAVE_FORCEOVERRIDE_POWERFORCINGPRE_Pos (8UL) /*!< Position of POWERFORCINGPRE field.                       */
  #define QSPI_PCGCSLAVE_FORCEOVERRIDE_POWERFORCINGPRE_Msk (0x3UL << QSPI_PCGCSLAVE_FORCEOVERRIDE_POWERFORCINGPRE_Pos) /*!< Bit
                                                                            mask of POWERFORCINGPRE field.*/                      

/* DOFORCEPOWERPRE @Bit 15 : DOFORCEPOWERPRE */
  #define QSPI_PCGCSLAVE_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos (15UL) /*!< Position of DOFORCEPOWERPRE field.                      */
  #define QSPI_PCGCSLAVE_FORCEOVERRIDE_DOFORCEPOWERPRE_Msk (0x1UL << QSPI_PCGCSLAVE_FORCEOVERRIDE_DOFORCEPOWERPRE_Pos) /*!< Bit
                                                                            mask of DOFORCEPOWERPRE field.*/                      


/* ======================================================= Struct QSPI ======================================================= */
/**
  * @brief Quad serial peripheral interface
  */
  typedef struct {                                   /*!< QSPI Structure                                                       */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start operation.                                      */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop operation.                                       */
    __OM NRF_QSPI_TASKS_DMA_Type TASKS_DMA;          /*!< (@ 0x00000008) Peripheral tasks.                                     */
    __IM uint32_t RESERVED[28];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IOM NRF_QSPI_SUBSCRIBE_DMA_Type SUBSCRIBE_DMA; /*!< (@ 0x00000088) Subscribe configuration for tasks                     */
    __IM uint32_t RESERVED1[28];
    __IOM NRF_QSPI_EVENTS_DMA_Type EVENTS_DMA;       /*!< (@ 0x00000100) Peripheral events.                                    */
    __IM uint32_t RESERVED2[30];
    __IOM NRF_QSPI_PUBLISH_DMA_Type PUBLISH_DMA;     /*!< (@ 0x00000180) Publish configuration for events                      */
    __IM uint32_t RESERVED3[414];
    __IOM NRF_QSPI_CORE_Type CORE;                   /*!< (@ 0x00000800) (unspecified)                                         */
    __IM uint32_t RESERVED4[376];
    __IOM NRF_QSPI_PCGCSLAVE_Type PCGCSLAVE;         /*!< (@ 0x00000F00) (unspecified)                                         */
  } NRF_QSPI_Type;                                   /*!< Size = 3972 (0xF84)                                                  */

/* QSPI_TASKS_START: Start operation. */
  #define QSPI_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                 */

