adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TASKS_START @Bit 0 : Start operation. */
  #define QSPI_TASKS_START_TASKS_START_Pos (0UL)     /*!< Position of TASKS_START field.                                       */
  #define QSPI_TASKS_START_TASKS_START_Msk (0x1UL << QSPI_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.     */
  #define QSPI_TASKS_START_TASKS_START_Min (0x1UL)   /*!< Min enumerator value of TASKS_START field.                           */
  #define QSPI_TASKS_START_TASKS_START_Max (0x1UL)   /*!< Max enumerator value of TASKS_START field.                           */
  #define QSPI_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                       */


/* QSPI_TASKS_STOP: Stop operation. */
  #define QSPI_TASKS_STOP_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop operation. */
  #define QSPI_TASKS_STOP_TASKS_STOP_Pos (0UL)       /*!< Position of TASKS_STOP field.                                        */
  #define QSPI_TASKS_STOP_TASKS_STOP_Msk (0x1UL << QSPI_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.          */
  #define QSPI_TASKS_STOP_TASKS_STOP_Min (0x1UL)     /*!< Min enumerator value of TASKS_STOP field.                            */
  #define QSPI_TASKS_STOP_TASKS_STOP_Max (0x1UL)     /*!< Max enumerator value of TASKS_STOP field.                            */
  #define QSPI_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                         */


/* QSPI_SUBSCRIBE_START: Subscribe configuration for task START */
  #define QSPI_SUBSCRIBE_START_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_START register.                         */

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define QSPI_SUBSCRIBE_START_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define QSPI_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << QSPI_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define QSPI_SUBSCRIBE_START_CHIDX_Min (0x0UL)     /*!< Min value of CHIDX field.                                            */
  #define QSPI_SUBSCRIBE_START_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define QSPI_SUBSCRIBE_START_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define QSPI_SUBSCRIBE_START_EN_Msk (0x1UL << QSPI_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field.                        */
  #define QSPI_SUBSCRIBE_START_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define QSPI_SUBSCRIBE_START_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define QSPI_SUBSCRIBE_START_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define QSPI_SUBSCRIBE_START_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* QSPI_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define QSPI_SUBSCRIBE_STOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOP register.                           */

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define QSPI_SUBSCRIBE_STOP_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define QSPI_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << QSPI_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define QSPI_SUBSCRIBE_STOP_CHIDX_Min (0x0UL)      /*!< Min value of CHIDX field.                                            */
  #define QSPI_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define QSPI_SUBSCRIBE_STOP_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define QSPI_SUBSCRIBE_STOP_EN_Msk (0x1UL << QSPI_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field.                          */
  #define QSPI_SUBSCRIBE_STOP_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define QSPI_SUBSCRIBE_STOP_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define QSPI_SUBSCRIBE_STOP_EN_Disabled (0x0UL)    /*!< Disable subscription                                                 */
  #define QSPI_SUBSCRIBE_STOP_EN_Enabled (0x1UL)     /*!< Enable subscription                                                  */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           RADIO                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct RADIO_ACQINJ =================================================== */
/**
  * @brief ACQINJ [RADIO_ACQINJ] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CNF[2];                            /*!< (@ 0x00000000) Data acquisition capture mode                         */
} NRF_RADIO_ACQINJ_Type;                             /*!< Size = 8 (0x008)                                                     */

/* RADIO_ACQINJ_CNF: Data acquisition capture mode */
  #define RADIO_ACQINJ_CNF_MaxCount (2UL)            /*!< Max size of CNF[2] array.                                            */
  #define RADIO_ACQINJ_CNF_ResetValue (0x00000000UL) /*!< Reset value of CNF[2] register.                                      */

/* ACQMODE @Bits 0..4 : Data acquisition capture mode */
  #define RADIO_ACQINJ_CNF_ACQMODE_Pos (0UL)         /*!< Position of ACQMODE field.                                           */
  #define RADIO_ACQINJ_CNF_ACQMODE_Msk (0x1FUL << RADIO_ACQINJ_CNF_ACQMODE_Pos) /*!< Bit mask of ACQMODE field.                */
  #define RADIO_ACQINJ_CNF_ACQMODE_Min (0x0UL)       /*!< Min enumerator value of ACQMODE field.                               */
  #define RADIO_ACQINJ_CNF_ACQMODE_Max (0x14UL)      /*!< Max enumerator value of ACQMODE field.                               */
  #define RADIO_ACQINJ_CNF_ACQMODE_AdcIQ (0x00UL)    /*!< Logging ADCI and ADCQ                                                */
  #define RADIO_ACQINJ_CNF_ACQMODE_AdcIQAndAgcGain (0x02UL) /*!< Logging ADCI, ADCQ and AGC gain settings                      */
  #define RADIO_ACQINJ_CNF_ACQMODE_AgcGainAndPkd (0x04UL) /*!< Logging AGC gain settings and peak detector outputs             */
  #define RADIO_ACQINJ_CNF_ACQMODE_FeIQ (0x06UL)     /*!< Logging FrontEnd sampleI and sampleQ                                 */
  #define RADIO_ACQINJ_CNF_ACQMODE_BbIQ (0x08UL)     /*!< Logging BaseBand I and Q                                             */
  #define RADIO_ACQINJ_CNF_ACQMODE_BbStdOut (0x0AUL) /*!< Logging BaseBand std demodulator outputs (original ones, not the
                                                          delayed version)*/                                                      
  #define RADIO_ACQINJ_CNF_ACQMODE_BbHypOut (0x0CUL) /*!< Logging BaseBand hyp demodulator outputs                             */
  #define RADIO_ACQINJ_CNF_ACQMODE_BbStdHypMuxOut (0x0EUL) /*!< Logging muxed demodulator outputs and flags                    */
  #define RADIO_ACQINJ_CNF_ACQMODE_FeDecIQ (0x10UL)  /*!< Logging FrontEnd Decimator samples I and Q                           */
  #define RADIO_ACQINJ_CNF_ACQMODE_FeMixIQ (0x12UL)  /*!< Logging FrontEnd Mixer samples I and Q                               */
  #define RADIO_ACQINJ_CNF_ACQMODE_AdPllTrace (0x14UL) /*!< ADPLL tracing                                                      */

/* INJMODE @Bits 8..11 : Data hijack mode (Do not select the same SRC for one than more DMAs. otherwise higher index takes over
                         control.) */                                                                                             
                                                                                                                                  
  #define RADIO_ACQINJ_CNF_INJMODE_Pos (8UL)         /*!< Position of INJMODE field.                                           */
  #define RADIO_ACQINJ_CNF_INJMODE_Msk (0xFUL << RADIO_ACQINJ_CNF_INJMODE_Pos) /*!< Bit mask of INJMODE field.                 */
  #define RADIO_ACQINJ_CNF_INJMODE_Min (0x0UL)       /*!< Min enumerator value of INJMODE field.                               */
  #define RADIO_ACQINJ_CNF_INJMODE_Max (0xAUL)       /*!< Max enumerator value of INJMODE field.                               */
  #define RADIO_ACQINJ_CNF_INJMODE_FeSrc (0x0UL)     /*!< Pick up IQ samples from RAM as FrontEnd input (hijack ADC output)    */
  #define RADIO_ACQINJ_CNF_INJMODE_BbSrc (0x2UL)     /*!< Pick up IQ samples from RAM as Radio BaseBand input                  */
  #define RADIO_ACQINJ_CNF_INJMODE_TxSrc (0x4UL)     /*!< Pick up Tx bits from RAM (skipping packet assembler as modulator
                                                          input*/                                                                 
  #define RADIO_ACQINJ_CNF_INJMODE_FeIirSrc (0x6UL)  /*!< Pick up Front End Source Samples for IIR Channel Filters             */
  #define RADIO_ACQINJ_CNF_INJMODE_FeMixSrc (0x8UL)  /*!< Pick up Front End Source Samples for Mixer                           */
  #define RADIO_ACQINJ_CNF_INJMODE_AdPllModSrc (0xAUL) /*!< Pick up arbitrary wave from RAM to ADPLL                           */

/* CYCLIC @Bit 30 : The END event of DMA automatically triggers the START event so that it continuously will store/read data */
  #define RADIO_ACQINJ_CNF_CYCLIC_Pos (30UL)         /*!< Position of CYCLIC field.                                            */
  #define RADIO_ACQINJ_CNF_CYCLIC_Msk (0x1UL << RADIO_ACQINJ_CNF_CYCLIC_Pos) /*!< Bit mask of CYCLIC field.                    */

/* DIR @Bit 31 : Data acquisition or injection */
  #define RADIO_ACQINJ_CNF_DIR_Pos (31UL)            /*!< Position of DIR field.                                               */
  #define RADIO_ACQINJ_CNF_DIR_Msk (0x1UL << RADIO_ACQINJ_CNF_DIR_Pos) /*!< Bit mask of DIR field.                             */
  #define RADIO_ACQINJ_CNF_DIR_Min (0x0UL)           /*!< Min enumerator value of DIR field.                                   */
  #define RADIO_ACQINJ_CNF_DIR_Max (0x1UL)           /*!< Max enumerator value of DIR field.                                   */
  #define RADIO_ACQINJ_CNF_DIR_Acq (0x0UL)           /*!< Peripheral to memory                                                 */
  #define RADIO_ACQINJ_CNF_DIR_Inj (0x1UL)           /*!< Memory to peripheral                                                 */



