adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ================================================= Struct RADIO_ACQINJDMA ================================================== */
/**
  * @brief ACQINJDMA [RADIO_ACQINJDMA] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ENABLE;                            /*!< (@ 0x00000000) Enable or disable data acquisition                    */
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000004) ACQ DMA pointer                                       */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000008) Maximum number of 32-bit words to transfer            */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x0000000C) Number of 32-bit words transferred in the last
                                                                         transaction*/                                            
} NRF_RADIO_ACQINJDMA_Type;                          /*!< Size = 16 (0x010)                                                    */
  #define RADIO_ACQINJDMA_MaxCount (2UL)             /*!< Max size of ACQINJDMA[2] array.                                      */

/* RADIO_ACQINJDMA_ENABLE: Enable or disable data acquisition */
  #define RADIO_ACQINJDMA_ENABLE_ResetValue (0x00000000UL) /*!< Reset value of ENABLE register.                                */

/* ENABLE @Bit 0 : Enable or disable data acquisition */
  #define RADIO_ACQINJDMA_ENABLE_ENABLE_Pos (0UL)    /*!< Position of ENABLE field.                                            */
  #define RADIO_ACQINJDMA_ENABLE_ENABLE_Msk (0x1UL << RADIO_ACQINJDMA_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.        */
  #define RADIO_ACQINJDMA_ENABLE_ENABLE_Min (0x0UL)  /*!< Min enumerator value of ENABLE field.                                */
  #define RADIO_ACQINJDMA_ENABLE_ENABLE_Max (0x1UL)  /*!< Max enumerator value of ENABLE field.                                */
  #define RADIO_ACQINJDMA_ENABLE_ENABLE_Disabled (0x0UL) /*!< Data acquisition is disabled                                     */
  #define RADIO_ACQINJDMA_ENABLE_ENABLE_Enabled (0x1UL) /*!< Data acquisition is enabled                                       */


/* RADIO_ACQINJDMA_PTR: ACQ DMA pointer */
  #define RADIO_ACQINJDMA_PTR_ResetValue (0x00000000UL) /*!< Reset value of PTR register.                                      */

/* OFFSET @Bits 0..15 : (unspecified) */
  #define RADIO_ACQINJDMA_PTR_OFFSET_Pos (0UL)       /*!< Position of OFFSET field.                                            */
  #define RADIO_ACQINJDMA_PTR_OFFSET_Msk (0xFFFFUL << RADIO_ACQINJDMA_PTR_OFFSET_Pos) /*!< Bit mask of OFFSET field.           */

/* BASE @Bit 29 : (unspecified) */
  #define RADIO_ACQINJDMA_PTR_BASE_Pos (29UL)        /*!< Position of BASE field.                                              */
  #define RADIO_ACQINJDMA_PTR_BASE_Msk (0x1UL << RADIO_ACQINJDMA_PTR_BASE_Pos) /*!< Bit mask of BASE field.                    */


/* RADIO_ACQINJDMA_MAXCNT: Maximum number of 32-bit words to transfer */
  #define RADIO_ACQINJDMA_MAXCNT_ResetValue (0x00000040UL) /*!< Reset value of MAXCNT register.                                */

/* MAXCNT @Bits 0..13 : Maximum number of 32-bit words to transfer */
  #define RADIO_ACQINJDMA_MAXCNT_MAXCNT_Pos (0UL)    /*!< Position of MAXCNT field.                                            */
  #define RADIO_ACQINJDMA_MAXCNT_MAXCNT_Msk (0x3FFFUL << RADIO_ACQINJDMA_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.     */


/* RADIO_ACQINJDMA_AMOUNT: Number of 32-bit words transferred in the last transaction */
  #define RADIO_ACQINJDMA_AMOUNT_ResetValue (0x00000000UL) /*!< Reset value of AMOUNT register.                                */

/* AMOUNT @Bits 0..13 : Number of 32-bit words transferred in the last transaction */
  #define RADIO_ACQINJDMA_AMOUNT_AMOUNT_Pos (0UL)    /*!< Position of AMOUNT field.                                            */
  #define RADIO_ACQINJDMA_AMOUNT_AMOUNT_Msk (0x3FFFUL << RADIO_ACQINJDMA_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.     */



/* ========================================== Struct RADIO_TESTINTERFACE_DEBUGPSEL =========================================== */
/**
  * @brief DEBUGPSEL [RADIO_TESTINTERFACE_DEBUGPSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  IRQ;                               /*!< (@ 0x00000000) Pin select for RADIO irq                              */
  __IOM uint32_t  RXCLK;                             /*!< (@ 0x00000004) Pin select for RXCLK                                  */
  __IOM uint32_t  RXDATA;                            /*!< (@ 0x00000008) Pin select for RXDATA                                 */
  __IOM uint32_t  TXCLK;                             /*!< (@ 0x0000000C) Pin select for RADIO clock (direct mode, base band
                                                                         debug. txCk and ckDataIn signals)*/                      
  __IOM uint32_t  TXDATA;                            /*!< (@ 0x00000010) Pin select for RADIO data (direct mode, base band
                                                                         debug. txRadioData and dataIn signals)*/                 
} NRF_RADIO_TESTINTERFACE_DEBUGPSEL_Type;            /*!< Size = 20 (0x014)                                                    */

/* RADIO_TESTINTERFACE_DEBUGPSEL_IRQ: Pin select for RADIO irq */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_IRQ_ResetValue (0xFFFFFFFFUL) /*!< Reset value of IRQ register.                        */

/* PIN @Bits 0..4 : Pin number */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_IRQ_PIN_Pos (0UL) /*!< Position of PIN field.                                          */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_IRQ_PIN_Msk (0x1FUL << RADIO_TESTINTERFACE_DEBUGPSEL_IRQ_PIN_Pos) /*!< Bit mask of PIN
                                                                            field.*/                                              
  #define RADIO_TESTINTERFACE_DEBUGPSEL_IRQ_PIN_Min (0x0UL) /*!< Min value of PIN field.                                       */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_IRQ_PIN_Max (0x1FUL) /*!< Max size of PIN field.                                       */

/* PORT @Bits 5..8 : Port number */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_IRQ_PORT_Pos (5UL) /*!< Position of PORT field.                                        */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_IRQ_PORT_Msk (0xFUL << RADIO_TESTINTERFACE_DEBUGPSEL_IRQ_PORT_Pos) /*!< Bit mask of PORT
                                                                            field.*/                                              
  #define RADIO_TESTINTERFACE_DEBUGPSEL_IRQ_PORT_Min (0x0UL) /*!< Min value of PORT field.                                     */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_IRQ_PORT_Max (0x0UL) /*!< Max size of PORT field.                                      */

/* CONNECT @Bit 31 : Connection */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_IRQ_CONNECT_Pos (31UL) /*!< Position of CONNECT field.                                 */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_IRQ_CONNECT_Msk (0x1UL << RADIO_TESTINTERFACE_DEBUGPSEL_IRQ_CONNECT_Pos) /*!< Bit mask
                                                                            of CONNECT field.*/                                   
  #define RADIO_TESTINTERFACE_DEBUGPSEL_IRQ_CONNECT_Min (0x0UL) /*!< Min enumerator value of CONNECT field.                    */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_IRQ_CONNECT_Max (0x1UL) /*!< Max enumerator value of CONNECT field.                    */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_IRQ_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                       */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_IRQ_CONNECT_Connected (0x0UL) /*!< Connect                                             */


/* RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK: Pin select for RXCLK */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RXCLK register.                    */

/* PIN @Bits 0..4 : Pin number */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK_PIN_Pos (0UL) /*!< Position of PIN field.                                        */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK_PIN_Msk (0x1FUL << RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK_PIN_Pos) /*!< Bit mask of
                                                                            PIN field.*/                                          
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK_PIN_Min (0x0UL) /*!< Min value of PIN field.                                     */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK_PIN_Max (0x1FUL) /*!< Max size of PIN field.                                     */

/* PORT @Bits 5..8 : Port number */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK_PORT_Pos (5UL) /*!< Position of PORT field.                                      */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK_PORT_Msk (0xFUL << RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK_PORT_Pos) /*!< Bit mask of
                                                                            PORT field.*/                                         
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK_PORT_Min (0x0UL) /*!< Min value of PORT field.                                   */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK_PORT_Max (0x0UL) /*!< Max size of PORT field.                                    */

/* CONNECT @Bit 31 : Connection */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK_CONNECT_Pos (31UL) /*!< Position of CONNECT field.                               */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK_CONNECT_Msk (0x1UL << RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK_CONNECT_Pos) /*!< Bit
                                                                            mask of CONNECT field.*/                              
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK_CONNECT_Min (0x0UL) /*!< Min enumerator value of CONNECT field.                  */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK_CONNECT_Max (0x1UL) /*!< Max enumerator value of CONNECT field.                  */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                     */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXCLK_CONNECT_Connected (0x0UL) /*!< Connect                                           */


/* RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA: Pin select for RXDATA */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RXDATA register.                  */

/* PIN @Bits 0..4 : Pin number */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA_PIN_Pos (0UL) /*!< Position of PIN field.                                       */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA_PIN_Msk (0x1FUL << RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA_PIN_Pos) /*!< Bit mask of
                                                                            PIN field.*/                                          
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA_PIN_Min (0x0UL) /*!< Min value of PIN field.                                    */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA_PIN_Max (0x1FUL) /*!< Max size of PIN field.                                    */

/* PORT @Bits 5..8 : Port number */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA_PORT_Pos (5UL) /*!< Position of PORT field.                                     */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA_PORT_Msk (0xFUL << RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA_PORT_Pos) /*!< Bit mask
                                                                            of PORT field.*/                                      
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA_PORT_Min (0x0UL) /*!< Min value of PORT field.                                  */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA_PORT_Max (0x0UL) /*!< Max size of PORT field.                                   */

/* CONNECT @Bit 31 : Connection */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA_CONNECT_Pos (31UL) /*!< Position of CONNECT field.                              */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA_CONNECT_Msk (0x1UL << RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA_CONNECT_Pos) /*!< Bit
                                                                            mask of CONNECT field.*/                              
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA_CONNECT_Min (0x0UL) /*!< Min enumerator value of CONNECT field.                 */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA_CONNECT_Max (0x1UL) /*!< Max enumerator value of CONNECT field.                 */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                    */
  #define RADIO_TESTINTERFACE_DEBUGPSEL_RXDATA_CONNECT_Connected (0x0UL) /*!< Connect                                          */


