adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_TESTINTERFACE_LOCK: Security LOCK for test interface */
  #define RADIO_TESTINTERFACE_LOCK_ResetValue (0x00000001UL) /*!< Reset value of LOCK register.                                */

/* LOCK @Bit 0 : Write once to permanently lock or unlock. */
  #define RADIO_TESTINTERFACE_LOCK_LOCK_Pos (0UL)    /*!< Position of LOCK field.                                              */
  #define RADIO_TESTINTERFACE_LOCK_LOCK_Msk (0x1UL << RADIO_TESTINTERFACE_LOCK_LOCK_Pos) /*!< Bit mask of LOCK field.          */
  #define RADIO_TESTINTERFACE_LOCK_LOCK_Min (0x0UL)  /*!< Min enumerator value of LOCK field.                                  */
  #define RADIO_TESTINTERFACE_LOCK_LOCK_Max (0x1UL)  /*!< Max enumerator value of LOCK field.                                  */
  #define RADIO_TESTINTERFACE_LOCK_LOCK_Lock (0x1UL) /*!< Interface is locked and cannot be enabled.                           */
  #define RADIO_TESTINTERFACE_LOCK_LOCK_Unlock (0x0UL) /*!< Interface is unlocked and can be enabled.                          */

/* WRITTEN @Bit 8 : Status bit indicating if write once register has been written to since last reset */
  #define RADIO_TESTINTERFACE_LOCK_WRITTEN_Pos (8UL) /*!< Position of WRITTEN field.                                           */
  #define RADIO_TESTINTERFACE_LOCK_WRITTEN_Msk (0x1UL << RADIO_TESTINTERFACE_LOCK_WRITTEN_Pos) /*!< Bit mask of WRITTEN field. */
  #define RADIO_TESTINTERFACE_LOCK_WRITTEN_Min (0x0UL) /*!< Min enumerator value of WRITTEN field.                             */
  #define RADIO_TESTINTERFACE_LOCK_WRITTEN_Max (0x1UL) /*!< Max enumerator value of WRITTEN field.                             */
  #define RADIO_TESTINTERFACE_LOCK_WRITTEN_Written (0x1UL) /*!< Write once register has been written to and cannot be
                                                                overwritten unless reset.*/                                       
  #define RADIO_TESTINTERFACE_LOCK_WRITTEN_Unwritten (0x0UL) /*!< Write once register has not been written to and can be
                                                                  overwritten.*/                                                  


/* RADIO_TESTINTERFACE_CONF: CONFIG for PSEL test interface */
  #define RADIO_TESTINTERFACE_CONF_ResetValue (0x00000000UL) /*!< Reset value of CONF register.                                */

/* RXDATASOURCE @Bits 0..1 : Source select for Rx data GPIO output and Rx clock output. Can optionally output Tx data that is
                             transmitted and TX clock */                                                                          
                                                                                                                                  
  #define RADIO_TESTINTERFACE_CONF_RXDATASOURCE_Pos (0UL) /*!< Position of RXDATASOURCE field.                                 */
  #define RADIO_TESTINTERFACE_CONF_RXDATASOURCE_Msk (0x3UL << RADIO_TESTINTERFACE_CONF_RXDATASOURCE_Pos) /*!< Bit mask of
                                                                            RXDATASOURCE field.*/                                 
  #define RADIO_TESTINTERFACE_CONF_RXDATASOURCE_Min (0x0UL) /*!< Min enumerator value of RXDATASOURCE field.                   */
  #define RADIO_TESTINTERFACE_CONF_RXDATASOURCE_Max (0x3UL) /*!< Max enumerator value of RXDATASOURCE field.                   */
  #define RADIO_TESTINTERFACE_CONF_RXDATASOURCE_Standard (0x0UL) /*!< Data and clock source is from standard demodulator       */
  #define RADIO_TESTINTERFACE_CONF_RXDATASOURCE_Hyper (0x1UL) /*!< Data and clock source is from hyper demodulator             */
  #define RADIO_TESTINTERFACE_CONF_RXDATASOURCE_FelisTx (0x2UL) /*!< Data source is Tx data to SphynxSupport.                  */
  #define RADIO_TESTINTERFACE_CONF_RXDATASOURCE_MacTx (0x3UL) /*!< Data source is Tx data to FelisTx.                          */

/* TXDATASINK @Bit 8 : Sink select for Tx Data input. TX clock source is always SphynxSupport */
  #define RADIO_TESTINTERFACE_CONF_TXDATASINK_Pos (8UL) /*!< Position of TXDATASINK field.                                     */
  #define RADIO_TESTINTERFACE_CONF_TXDATASINK_Msk (0x1UL << RADIO_TESTINTERFACE_CONF_TXDATASINK_Pos) /*!< Bit mask of TXDATASINK
                                                                            field.*/                                              
  #define RADIO_TESTINTERFACE_CONF_TXDATASINK_Min (0x0UL) /*!< Min enumerator value of TXDATASINK field.                       */
  #define RADIO_TESTINTERFACE_CONF_TXDATASINK_Max (0x1UL) /*!< Max enumerator value of TXDATASINK field.                       */
  #define RADIO_TESTINTERFACE_CONF_TXDATASINK_FelisTx (0x0UL) /*!< TX data sink is FelisTx                                     */
  #define RADIO_TESTINTERFACE_CONF_TXDATASINK_SphynxSupport (0x1UL) /*!< TX data sink is SphynxSupport                         */



/* ================================================= Struct RADIO_INTERCEPT ================================================== */
/**
  * @brief INTERCEPT [RADIO_INTERCEPT] Write 1 to a bit to arm the task/event at that index for a single intercept. Write 0 to a
            bit to disarm. After arming, the bit will be read out as 1 until the task/event has been intercepted or disarmed,
            after which it will be read out as 0. Both PPI-triggered and APB-triggered tasks will be intercepted. Only
            core-triggered events will be intercepted, not APB-triggered events.                                                  
                                                                                                                                  
  */
typedef struct {
  __IOM uint32_t  TASKS[2];                          /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM uint32_t  EVENTS[2];                         /*!< (@ 0x00000008) (unspecified)                                         */
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000010) (unspecified)                                         */
} NRF_RADIO_INTERCEPT_Type;                          /*!< Size = 20 (0x014)                                                    */

