adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_INTERCEPT_TASKS: (unspecified) */
  #define RADIO_INTERCEPT_TASKS_MaxCount (2UL)       /*!< Max size of TASKS[2] array.                                          */
  #define RADIO_INTERCEPT_TASKS_ResetValue (0x00000000UL) /*!< Reset value of TASKS[2] register.                               */

/* ONEBITPERTASK @Bits 0..31 : (unspecified) */
  #define RADIO_INTERCEPT_TASKS_ONEBITPERTASK_Pos (0UL) /*!< Position of ONEBITPERTASK field.                                  */
  #define RADIO_INTERCEPT_TASKS_ONEBITPERTASK_Msk (0xFFFFFFFFUL << RADIO_INTERCEPT_TASKS_ONEBITPERTASK_Pos) /*!< Bit mask of
                                                                            ONEBITPERTASK field.*/                                


/* RADIO_INTERCEPT_EVENTS: (unspecified) */
  #define RADIO_INTERCEPT_EVENTS_MaxCount (2UL)      /*!< Max size of EVENTS[2] array.                                         */
  #define RADIO_INTERCEPT_EVENTS_ResetValue (0x00000000UL) /*!< Reset value of EVENTS[2] register.                             */

/* ONEBITPEREVENT @Bits 0..31 : (unspecified) */
  #define RADIO_INTERCEPT_EVENTS_ONEBITPEREVENT_Pos (0UL) /*!< Position of ONEBITPEREVENT field.                               */
  #define RADIO_INTERCEPT_EVENTS_ONEBITPEREVENT_Msk (0xFFFFFFFFUL << RADIO_INTERCEPT_EVENTS_ONEBITPEREVENT_Pos) /*!< Bit mask of
                                                                            ONEBITPEREVENT field.*/                               


/* RADIO_INTERCEPT_CONFIG: (unspecified) */
  #define RADIO_INTERCEPT_CONFIG_ResetValue (0x00000003UL) /*!< Reset value of CONFIG register.                                */

/* STOPTASKS @Bit 0 : (unspecified) */
  #define RADIO_INTERCEPT_CONFIG_STOPTASKS_Pos (0UL) /*!< Position of STOPTASKS field.                                         */
  #define RADIO_INTERCEPT_CONFIG_STOPTASKS_Msk (0x1UL << RADIO_INTERCEPT_CONFIG_STOPTASKS_Pos) /*!< Bit mask of STOPTASKS
                                                                            field.*/                                              

/* STOPEVENTS @Bit 1 : (unspecified) */
  #define RADIO_INTERCEPT_CONFIG_STOPEVENTS_Pos (1UL) /*!< Position of STOPEVENTS field.                                       */
  #define RADIO_INTERCEPT_CONFIG_STOPEVENTS_Msk (0x1UL << RADIO_INTERCEPT_CONFIG_STOPEVENTS_Pos) /*!< Bit mask of STOPEVENTS
                                                                            field.*/                                              



/* ================================================= Struct RADIO_AHBMASTERS ================================================= */
/**
  * @brief AHBMASTERS [RADIO_AHBMASTERS] For setting priorities among RADIO/CRYPTO AHB masters if interfaced with Nordic's AMBA
            Interconnect IP                                                                                                       
                                                                                                                                  
  */
typedef struct {
  __IOM uint32_t  PRIORITY;                          /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_RADIO_AHBMASTERS_Type;                         /*!< Size = 4 (0x004)                                                     */

/* RADIO_AHBMASTERS_PRIORITY: (unspecified) */
  #define RADIO_AHBMASTERS_PRIORITY_ResetValue (0x00000000UL) /*!< Reset value of PRIORITY register.                           */

/* RADIO @Bit 0 : Priority level for AHB master RADIO */
  #define RADIO_AHBMASTERS_PRIORITY_RADIO_Pos (0UL)  /*!< Position of RADIO field.                                             */
  #define RADIO_AHBMASTERS_PRIORITY_RADIO_Msk (0x1UL << RADIO_AHBMASTERS_PRIORITY_RADIO_Pos) /*!< Bit mask of RADIO field.     */
  #define RADIO_AHBMASTERS_PRIORITY_RADIO_Min (0x0UL) /*!< Min enumerator value of RADIO field.                                */
  #define RADIO_AHBMASTERS_PRIORITY_RADIO_Max (0x1UL) /*!< Max enumerator value of RADIO field.                                */
  #define RADIO_AHBMASTERS_PRIORITY_RADIO_LOW (0x0UL) /*!< Lowest Priority Level                                               */
  #define RADIO_AHBMASTERS_PRIORITY_RADIO_HIGH (0x1UL) /*!< Highest Priority Level                                             */

/* RADIODFE @Bit 1 : Priority level for AHB master RADIODFE */
  #define RADIO_AHBMASTERS_PRIORITY_RADIODFE_Pos (1UL) /*!< Position of RADIODFE field.                                        */
  #define RADIO_AHBMASTERS_PRIORITY_RADIODFE_Msk (0x1UL << RADIO_AHBMASTERS_PRIORITY_RADIODFE_Pos) /*!< Bit mask of RADIODFE
                                                                            field.*/                                              
  #define RADIO_AHBMASTERS_PRIORITY_RADIODFE_Min (0x0UL) /*!< Min enumerator value of RADIODFE field.                          */
  #define RADIO_AHBMASTERS_PRIORITY_RADIODFE_Max (0x1UL) /*!< Max enumerator value of RADIODFE field.                          */
  #define RADIO_AHBMASTERS_PRIORITY_RADIODFE_LOW (0x0UL) /*!< Lowest Priority Level                                            */
  #define RADIO_AHBMASTERS_PRIORITY_RADIODFE_HIGH (0x1UL) /*!< Highest Priority Level                                          */

/* RADIOACQINJ0 @Bit 2 : Priority level for AHB master RADIOACQINJ0 */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ0_Pos (2UL) /*!< Position of RADIOACQINJ0 field.                                */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ0_Msk (0x1UL << RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ0_Pos) /*!< Bit mask of
                                                                            RADIOACQINJ0 field.*/                                 
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ0_Min (0x0UL) /*!< Min enumerator value of RADIOACQINJ0 field.                  */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ0_Max (0x1UL) /*!< Max enumerator value of RADIOACQINJ0 field.                  */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ0_LOW (0x0UL) /*!< Lowest Priority Level                                        */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ0_HIGH (0x1UL) /*!< Highest Priority Level                                      */

