adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIOACQINJ1 @Bit 3 : Priority level for AHB master RADIOACQINJ1 */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ1_Pos (3UL) /*!< Position of RADIOACQINJ1 field.                                */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ1_Msk (0x1UL << RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ1_Pos) /*!< Bit mask of
                                                                            RADIOACQINJ1 field.*/                                 
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ1_Min (0x0UL) /*!< Min enumerator value of RADIOACQINJ1 field.                  */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ1_Max (0x1UL) /*!< Max enumerator value of RADIOACQINJ1 field.                  */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ1_LOW (0x0UL) /*!< Lowest Priority Level                                        */
  #define RADIO_AHBMASTERS_PRIORITY_RADIOACQINJ1_HIGH (0x1UL) /*!< Highest Priority Level                                      */

/* CRYPTOGATHER @Bit 4 : Priority level for AHB master CRYPTOGATHER */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOGATHER_Pos (4UL) /*!< Position of CRYPTOGATHER field.                                */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOGATHER_Msk (0x1UL << RADIO_AHBMASTERS_PRIORITY_CRYPTOGATHER_Pos) /*!< Bit mask of
                                                                            CRYPTOGATHER field.*/                                 
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOGATHER_Min (0x0UL) /*!< Min enumerator value of CRYPTOGATHER field.                  */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOGATHER_Max (0x1UL) /*!< Max enumerator value of CRYPTOGATHER field.                  */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOGATHER_LOW (0x0UL) /*!< Lowest Priority Level                                        */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOGATHER_HIGH (0x1UL) /*!< Highest Priority Level                                      */

/* CRYPTOSCATTER @Bit 5 : Priority level for AHB master CRYPTOSCATTER */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOSCATTER_Pos (5UL) /*!< Position of CRYPTOSCATTER field.                              */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOSCATTER_Msk (0x1UL << RADIO_AHBMASTERS_PRIORITY_CRYPTOSCATTER_Pos) /*!< Bit mask of
                                                                            CRYPTOSCATTER field.*/                                
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOSCATTER_Min (0x0UL) /*!< Min enumerator value of CRYPTOSCATTER field.                */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOSCATTER_Max (0x1UL) /*!< Max enumerator value of CRYPTOSCATTER field.                */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOSCATTER_LOW (0x0UL) /*!< Lowest Priority Level                                       */
  #define RADIO_AHBMASTERS_PRIORITY_CRYPTOSCATTER_HIGH (0x1UL) /*!< Highest Priority Level                                     */



/* ================================================ Struct RADIO_CALIBRATION ================================================= */
/**
  * @brief CALIBRATION [RADIO_CALIBRATION] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TARGET;                            /*!< (@ 0x00000000) Select target for calibration                         */
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000004) Configuration of manual calibration                   */
  __IM  uint32_t  RESULT;                            /*!< (@ 0x00000008) Calibration result                                    */
} NRF_RADIO_CALIBRATION_Type;                        /*!< Size = 12 (0x00C)                                                    */

/* RADIO_CALIBRATION_TARGET: Select target for calibration */
  #define RADIO_CALIBRATION_TARGET_ResetValue (0x00000000UL) /*!< Reset value of TARGET register.                              */

/* CALTARGET @Bits 0..2 : Calibration target selection for calibration engine, 0: DC_CAL, 1: RC_CAL */
  #define RADIO_CALIBRATION_TARGET_CALTARGET_Pos (0UL) /*!< Position of CALTARGET field.                                       */
  #define RADIO_CALIBRATION_TARGET_CALTARGET_Msk (0x7UL << RADIO_CALIBRATION_TARGET_CALTARGET_Pos) /*!< Bit mask of CALTARGET
                                                                            field.*/                                              


/* RADIO_CALIBRATION_CONFIG: Configuration of manual calibration */
  #define RADIO_CALIBRATION_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                              */

/* CALTSTART @Bits 0..7 : Startup wait time */
  #define RADIO_CALIBRATION_CONFIG_CALTSTART_Pos (0UL) /*!< Position of CALTSTART field.                                       */
  #define RADIO_CALIBRATION_CONFIG_CALTSTART_Msk (0xFFUL << RADIO_CALIBRATION_CONFIG_CALTSTART_Pos) /*!< Bit mask of CALTSTART
                                                                            field.*/                                              

/* CALTSETTLE @Bits 8..15 : Settle wait time */
  #define RADIO_CALIBRATION_CONFIG_CALTSETTLE_Pos (8UL) /*!< Position of CALTSETTLE field.                                     */
  #define RADIO_CALIBRATION_CONFIG_CALTSETTLE_Msk (0xFFUL << RADIO_CALIBRATION_CONFIG_CALTSETTLE_Pos) /*!< Bit mask of
                                                                            CALTSETTLE field.*/                                   

/* CALTCOMPARE @Bits 16..23 : Compare wait time */
  #define RADIO_CALIBRATION_CONFIG_CALTCOMPARE_Pos (16UL) /*!< Position of CALTCOMPARE field.                                  */
  #define RADIO_CALIBRATION_CONFIG_CALTCOMPARE_Msk (0xFFUL << RADIO_CALIBRATION_CONFIG_CALTCOMPARE_Pos) /*!< Bit mask of
                                                                            CALTCOMPARE field.*/                                  

/* CALBITS @Bits 24..26 : Number of valid bits to be calibrated */
  #define RADIO_CALIBRATION_CONFIG_CALBITS_Pos (24UL) /*!< Position of CALBITS field.                                          */
  #define RADIO_CALIBRATION_CONFIG_CALBITS_Msk (0x7UL << RADIO_CALIBRATION_CONFIG_CALBITS_Pos) /*!< Bit mask of CALBITS field. */

