adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CALINVERTCMP1 @Bit 28 : 1: invert calCmp1 before it goes into calibration engine #1 */
  #define RADIO_CALIBRATION_CONFIG_CALINVERTCMP1_Pos (28UL) /*!< Position of CALINVERTCMP1 field.                              */
  #define RADIO_CALIBRATION_CONFIG_CALINVERTCMP1_Msk (0x1UL << RADIO_CALIBRATION_CONFIG_CALINVERTCMP1_Pos) /*!< Bit mask of
                                                                            CALINVERTCMP1 field.*/                                

/* CALINVERTCMP2 @Bit 29 : 1: invert calCmp2 before it goes into calibration engine #2 */
  #define RADIO_CALIBRATION_CONFIG_CALINVERTCMP2_Pos (29UL) /*!< Position of CALINVERTCMP2 field.                              */
  #define RADIO_CALIBRATION_CONFIG_CALINVERTCMP2_Msk (0x1UL << RADIO_CALIBRATION_CONFIG_CALINVERTCMP2_Pos) /*!< Bit mask of
                                                                            CALINVERTCMP2 field.*/                                

/* CALMANUAL @Bit 31 : 0: use hard-coded calibration timing, 1: use manual calibration timing above */
  #define RADIO_CALIBRATION_CONFIG_CALMANUAL_Pos (31UL) /*!< Position of CALMANUAL field.                                      */
  #define RADIO_CALIBRATION_CONFIG_CALMANUAL_Msk (0x1UL << RADIO_CALIBRATION_CONFIG_CALMANUAL_Pos) /*!< Bit mask of CALMANUAL
                                                                            field.*/                                              


/* RADIO_CALIBRATION_RESULT: Calibration result */
  #define RADIO_CALIBRATION_RESULT_ResetValue (0x00000000UL) /*!< Reset value of RESULT register.                              */

/* RCCALCODE @Bits 0..3 : Calibration result from RC calibration */
  #define RADIO_CALIBRATION_RESULT_RCCALCODE_Pos (0UL) /*!< Position of RCCALCODE field.                                       */
  #define RADIO_CALIBRATION_RESULT_RCCALCODE_Msk (0xFUL << RADIO_CALIBRATION_RESULT_RCCALCODE_Pos) /*!< Bit mask of RCCALCODE
                                                                            field.*/                                              

/* RFMIXDCCALI @Bits 8..15 : Calibration result from DC offset calibration on channel I */
  #define RADIO_CALIBRATION_RESULT_RFMIXDCCALI_Pos (8UL) /*!< Position of RFMIXDCCALI field.                                   */
  #define RADIO_CALIBRATION_RESULT_RFMIXDCCALI_Msk (0xFFUL << RADIO_CALIBRATION_RESULT_RFMIXDCCALI_Pos) /*!< Bit mask of
                                                                            RFMIXDCCALI field.*/                                  

/* RFMIXDCCALQ @Bits 16..23 : Calibration result from DC offset calibration on channel Q */
  #define RADIO_CALIBRATION_RESULT_RFMIXDCCALQ_Pos (16UL) /*!< Position of RFMIXDCCALQ field.                                  */
  #define RADIO_CALIBRATION_RESULT_RFMIXDCCALQ_Msk (0xFFUL << RADIO_CALIBRATION_RESULT_RFMIXDCCALQ_Pos) /*!< Bit mask of
                                                                            RFMIXDCCALQ field.*/                                  



/* ================================================= Struct RADIO_SPHYNXANA ================================================== */
/**
  * @brief SPHYNXANA [RADIO_SPHYNXANA] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TEST;                              /*!< (@ 0x00000000) Control of analog and digital test bus output from
                                                                         Sphynx*/                                                 
  __IOM uint32_t  FSCTRL0;                           /*!< (@ 0x00000004) Control to frequency synthesizer of Sphynx            */
  __IOM uint32_t  FSCTRL1;                           /*!< (@ 0x00000008) Control to frequency synthesizer of Sphynx            */
  __IOM uint32_t  FSCTRL2;                           /*!< (@ 0x0000000C) Control to frequency synthesizer of Sphynx            */
  __IOM uint32_t  RXCTRL;                            /*!< (@ 0x00000010) Control to receiver of Sphynx                         */
  __IOM uint32_t  TXCTRL;                            /*!< (@ 0x00000014) Control to transmitter of Sphynx                      */
  __IOM uint32_t  MODEDEPENDENT;                     /*!< (@ 0x00000018) Mode dependent register of Sphynx                     */
  __IOM uint32_t  OVRRXTRIMCODE;                     /*!< (@ 0x0000001C) Override trim codes to the receiver of Sphynx         */
  __IM  uint32_t  STATUS;                            /*!< (@ 0x00000020) Readout raw status of signals output from Sphynx      */
  __IOM uint32_t  OVRRXGAIN;                         /*!< (@ 0x00000024) Analog rx gain override                               */
  __IOM uint32_t  CLOCKSOURCE;                       /*!< (@ 0x00000028) Choose between two clock sources                      */
} NRF_RADIO_SPHYNXANA_Type;                          /*!< Size = 44 (0x02C)                                                    */

/* RADIO_SPHYNXANA_TEST: Control of analog and digital test bus output from Sphynx */
  #define RADIO_SPHYNXANA_TEST_ResetValue (0x00000000UL) /*!< Reset value of TEST register.                                    */

/* SPHYNXATEBIASFS @Bits 0..3 : Analog test enable for BIAS_FS */
  #define RADIO_SPHYNXANA_TEST_SPHYNXATEBIASFS_Pos (0UL) /*!< Position of SPHYNXATEBIASFS field.                               */
  #define RADIO_SPHYNXANA_TEST_SPHYNXATEBIASFS_Msk (0xFUL << RADIO_SPHYNXANA_TEST_SPHYNXATEBIASFS_Pos) /*!< Bit mask of
                                                                            SPHYNXATEBIASFS field.*/                              

/* SPHYNXATEFS @Bits 4..10 : Analog test enable for FS */
  #define RADIO_SPHYNXANA_TEST_SPHYNXATEFS_Pos (4UL) /*!< Position of SPHYNXATEFS field.                                       */
  #define RADIO_SPHYNXANA_TEST_SPHYNXATEFS_Msk (0x7FUL << RADIO_SPHYNXANA_TEST_SPHYNXATEFS_Pos) /*!< Bit mask of SPHYNXATEFS
                                                                            field.*/                                              

