adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SPHYNXATERXMIX @Bits 11..12 : Analog test enable for RX MIX */
  #define RADIO_SPHYNXANA_TEST_SPHYNXATERXMIX_Pos (11UL) /*!< Position of SPHYNXATERXMIX field.                                */
  #define RADIO_SPHYNXANA_TEST_SPHYNXATERXMIX_Msk (0x3UL << RADIO_SPHYNXANA_TEST_SPHYNXATERXMIX_Pos) /*!< Bit mask of
                                                                            SPHYNXATERXMIX field.*/                               

/* SPHYNXATERXAAF @Bits 13..18 : Analog test enable for RX AAF */
  #define RADIO_SPHYNXANA_TEST_SPHYNXATERXAAF_Pos (13UL) /*!< Position of SPHYNXATERXAAF field.                                */
  #define RADIO_SPHYNXANA_TEST_SPHYNXATERXAAF_Msk (0x3FUL << RADIO_SPHYNXANA_TEST_SPHYNXATERXAAF_Pos) /*!< Bit mask of
                                                                            SPHYNXATERXAAF field.*/                               

/* SPHYNXATERXTX @Bits 19..22 : Analog test enable for RX TX */
  #define RADIO_SPHYNXANA_TEST_SPHYNXATERXTX_Pos (19UL) /*!< Position of SPHYNXATERXTX field.                                  */
  #define RADIO_SPHYNXANA_TEST_SPHYNXATERXTX_Msk (0xFUL << RADIO_SPHYNXANA_TEST_SPHYNXATERXTX_Pos) /*!< Bit mask of
                                                                            SPHYNXATERXTX field.*/                                

/* SPHYNXATETXPWRCTRL @Bits 24..25 : Analog test enable for TX PWRCTRL */
  #define RADIO_SPHYNXANA_TEST_SPHYNXATETXPWRCTRL_Pos (24UL) /*!< Position of SPHYNXATETXPWRCTRL field.                        */
  #define RADIO_SPHYNXANA_TEST_SPHYNXATETXPWRCTRL_Msk (0x3UL << RADIO_SPHYNXANA_TEST_SPHYNXATETXPWRCTRL_Pos) /*!< Bit mask of
                                                                            SPHYNXATETXPWRCTRL field.*/                           

/* SPHYNXDTEFS @Bits 26..28 : Digital test enable for digital logic in analog macro */
  #define RADIO_SPHYNXANA_TEST_SPHYNXDTEFS_Pos (26UL) /*!< Position of SPHYNXDTEFS field.                                      */
  #define RADIO_SPHYNXANA_TEST_SPHYNXDTEFS_Msk (0x7UL << RADIO_SPHYNXANA_TEST_SPHYNXDTEFS_Pos) /*!< Bit mask of SPHYNXDTEFS
                                                                            field.*/                                              


/* RADIO_SPHYNXANA_FSCTRL0: Control to frequency synthesizer of Sphynx */
  #define RADIO_SPHYNXANA_FSCTRL0_ResetValue (0xA0C58400UL) /*!< Reset value of FSCTRL0 register.                              */

/* SPHYNXFSLDOBYPASS @Bits 0..5 : Bypass FS LDOs */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSLDOBYPASS_Pos (0UL) /*!< Position of SPHYNXFSLDOBYPASS field.                        */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSLDOBYPASS_Msk (0x3FUL << RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSLDOBYPASS_Pos) /*!< Bit mask
                                                                            of SPHYNXFSLDOBYPASS field.*/                         

/* SPHYNXFSVCOCTRL @Bits 6..9 : Spare, not used */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSVCOCTRL_Pos (6UL) /*!< Position of SPHYNXFSVCOCTRL field.                            */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSVCOCTRL_Msk (0xFUL << RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSVCOCTRL_Pos) /*!< Bit mask of
                                                                            SPHYNXFSVCOCTRL field.*/                              

/* SPHYNXFSVCOSWREF @Bits 10..12 : FS swing calibration */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSVCOSWREF_Pos (10UL) /*!< Position of SPHYNXFSVCOSWREF field.                         */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSVCOSWREF_Msk (0x7UL << RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSVCOSWREF_Pos) /*!< Bit mask of
                                                                            SPHYNXFSVCOSWREF field.*/                             

/* SPHYNXFSDIV2CM @Bits 15..18 : Set common mode for DIV2 */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDIV2CM_Pos (15UL) /*!< Position of SPHYNXFSDIV2CM field.                             */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDIV2CM_Msk (0xFUL << RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDIV2CM_Pos) /*!< Bit mask of
                                                                            SPHYNXFSDIV2CM field.*/                               

/* SPHYNXFSDIV2CTRL @Bits 19..21 : Spare, not used */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDIV2CTRL_Pos (19UL) /*!< Position of SPHYNXFSDIV2CTRL field.                         */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDIV2CTRL_Msk (0x7UL << RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDIV2CTRL_Pos) /*!< Bit mask of
                                                                            SPHYNXFSDIV2CTRL field.*/                             

/* SPHYNXFSDIV2OSC @Bits 22..26 : Change back bias of NMOS in ROSC inside DIV2 */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDIV2OSC_Pos (22UL) /*!< Position of SPHYNXFSDIV2OSC field.                           */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDIV2OSC_Msk (0x1FUL << RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDIV2OSC_Pos) /*!< Bit mask of
                                                                            SPHYNXFSDIV2OSC field.*/                              

/* SPHYNXFSDTCCTRL @Bits 27..30 : 0: controls bleed current from supply, 1: bypasses DTC to send XO out directly */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDTCCTRL_Pos (27UL) /*!< Position of SPHYNXFSDTCCTRL field.                           */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDTCCTRL_Msk (0xFUL << RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDTCCTRL_Pos) /*!< Bit mask of
                                                                            SPHYNXFSDTCCTRL field.*/                              

/* SPHYNXFSDTCEDGEALIGN @Bit 31 : Resync at flip flop inside DTC */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDTCEDGEALIGN_Pos (31UL) /*!< Position of SPHYNXFSDTCEDGEALIGN field.                 */
  #define RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDTCEDGEALIGN_Msk (0x1UL << RADIO_SPHYNXANA_FSCTRL0_SPHYNXFSDTCEDGEALIGN_Pos) /*!< Bit
                                                                            mask of SPHYNXFSDTCEDGEALIGN field.*/                 


/* RADIO_SPHYNXANA_FSCTRL1: Control to frequency synthesizer of Sphynx */
  #define RADIO_SPHYNXANA_FSCTRL1_ResetValue (0x00010060UL) /*!< Reset value of FSCTRL1 register.                              */

/* SPHYNXFSREFIPPTRIM @Bits 0..3 : For current calibration */
  #define RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSREFIPPTRIM_Pos (0UL) /*!< Position of SPHYNXFSREFIPPTRIM field.                      */
  #define RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSREFIPPTRIM_Msk (0xFUL << RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSREFIPPTRIM_Pos) /*!< Bit mask
                                                                            of SPHYNXFSREFIPPTRIM field.*/                        

/* SPHYNXFSREFVTTRIM @Bits 5..6 : For voltage tuning of reference */
  #define RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSREFVTTRIM_Pos (5UL) /*!< Position of SPHYNXFSREFVTTRIM field.                        */
  #define RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSREFVTTRIM_Msk (0x3UL << RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSREFVTTRIM_Pos) /*!< Bit mask
                                                                            of SPHYNXFSREFVTTRIM field.*/                         

