adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SPHYNXFSDIV2ISW @Bits 14..17 : Adjust voltage for back bias of injection switch */
  #define RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSDIV2ISW_Pos (14UL) /*!< Position of SPHYNXFSDIV2ISW field.                           */
  #define RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSDIV2ISW_Msk (0xFUL << RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSDIV2ISW_Pos) /*!< Bit mask of
                                                                            SPHYNXFSDIV2ISW field.*/                              

/* SPHYNXFSTDCCTRL @Bits 18..20 : Spare, not used */
  #define RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSTDCCTRL_Pos (18UL) /*!< Position of SPHYNXFSTDCCTRL field.                           */
  #define RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSTDCCTRL_Msk (0x7UL << RADIO_SPHYNXANA_FSCTRL1_SPHYNXFSTDCCTRL_Pos) /*!< Bit mask of
                                                                            SPHYNXFSTDCCTRL field.*/                              


/* RADIO_SPHYNXANA_FSCTRL2: Control to frequency synthesizer of Sphynx */
  #define RADIO_SPHYNXANA_FSCTRL2_ResetValue (0x00000000UL) /*!< Reset value of FSCTRL2 register.                              */

/* SPHYNXBIASTXVREFCFG @Bits 0..3 : BIAS_RXTX_CFG[3:0]: Used for changing TX_PA_GF22N supply. BIAS_TX_VREF_CFG_1V8[3:0] bus in
                                    BIAS_TX_VREF_CFG. */                                                                          
                                                                                                                                  
  #define RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASTXVREFCFG_Pos (0UL) /*!< Position of SPHYNXBIASTXVREFCFG field.                    */
  #define RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASTXVREFCFG_Msk (0xFUL << RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASTXVREFCFG_Pos) /*!< Bit
                                                                            mask of SPHYNXBIASTXVREFCFG field.*/                  

/* SPHYNXBIASRESPROCESS @Bits 4..5 : BIAS_RXTX_CFG[5:4]: RES_PROCESS_1V8[1:0] bus in BIAS_SWAT_IBP_BJT_SPHYNX_WRAP */
  #define RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASRESPROCESS_Pos (4UL) /*!< Position of SPHYNXBIASRESPROCESS field.                  */
  #define RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASRESPROCESS_Msk (0x3UL << RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASRESPROCESS_Pos) /*!< Bit
                                                                            mask of SPHYNXBIASRESPROCESS field.*/                 

/* SPHYNXBIASVREFTRIM @Bits 6..9 : BIAS_RXTX_CFG[9:6]: 2's complement trimming code for VREF_SWAT and IBPSR_4U.
                                   VREF_TRIM_1V8[3:0] bus in BIAS_SWAT_IBP_BJT_SPHYNX_WRAP. */                                    
                                                                                                                                  
  #define RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASVREFTRIM_Pos (6UL) /*!< Position of SPHYNXBIASVREFTRIM field.                      */
  #define RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASVREFTRIM_Msk (0xFUL << RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASVREFTRIM_Pos) /*!< Bit mask
                                                                            of SPHYNXBIASVREFTRIM field.*/                        

/* SPHYNXBIASIBPPTRIM @Bits 10..13 : BIAS_RXTX_CFG[13:10]: 2's complement trimming code for IBPP_4U. IBPP_TRIM_1V8[3:0] bus in
                                     BIAS_SWAT_IBP_BJT_SPHYNX_WRAP. */                                                            
                                                                                                                                  
  #define RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASIBPPTRIM_Pos (10UL) /*!< Position of SPHYNXBIASIBPPTRIM field.                     */
  #define RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASIBPPTRIM_Msk (0xFUL << RADIO_SPHYNXANA_FSCTRL2_SPHYNXBIASIBPPTRIM_Pos) /*!< Bit mask
                                                                            of SPHYNXBIASIBPPTRIM field.*/                        


/* RADIO_SPHYNXANA_RXCTRL: Control to receiver of Sphynx */
  #define RADIO_SPHYNXANA_RXCTRL_ResetValue (0x00000000UL) /*!< Reset value of RXCTRL register.                                */

/* SPHYNXBYPASSLDORX @Bits 0..2 : Bypass Rx LDOs */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXBYPASSLDORX_Pos (0UL) /*!< Position of SPHYNXBYPASSLDORX field.                         */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXBYPASSLDORX_Msk (0x7UL << RADIO_SPHYNXANA_RXCTRL_SPHYNXBYPASSLDORX_Pos) /*!< Bit mask of
                                                                            SPHYNXBYPASSLDORX field.*/                            

/* SPHYNXRXMIXQLEADSI @Bit 3 : 1: output from MIX_AMP is Q leading I, 0 output from MIX_AMP is I leading Q */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXRXMIXQLEADSI_Pos (3UL) /*!< Position of SPHYNXRXMIXQLEADSI field.                       */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXRXMIXQLEADSI_Msk (0x1UL << RADIO_SPHYNXANA_RXCTRL_SPHYNXRXMIXQLEADSI_Pos) /*!< Bit mask
                                                                            of SPHYNXRXMIXQLEADSI field.*/                        

/* SPHYNXRXAAFRCTRIMM @Bits 4..7 : RC trim values for RX_AAF generated by RC_CAL */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXRXAAFRCTRIMM_Pos (4UL) /*!< Position of SPHYNXRXAAFRCTRIMM field.                       */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXRXAAFRCTRIMM_Msk (0xFUL << RADIO_SPHYNXANA_RXCTRL_SPHYNXRXAAFRCTRIMM_Pos) /*!< Bit mask
                                                                            of SPHYNXRXAAFRCTRIMM field.*/                        

/* SPHYNXRXAAFVCMTRIM @Bits 8..10 : VCM trim values for RX_AAF */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXRXAAFVCMTRIM_Pos (8UL) /*!< Position of SPHYNXRXAAFVCMTRIM field.                       */
  #define RADIO_SPHYNXANA_RXCTRL_SPHYNXRXAAFVCMTRIM_Msk (0x7UL << RADIO_SPHYNXANA_RXCTRL_SPHYNXRXAAFVCMTRIM_Pos) /*!< Bit mask
                                                                            of SPHYNXRXAAFVCMTRIM field.*/                        

