adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* OVRENRFMIXDCCALI @Bit 25 : For RXMIX_DCCAL_I_0V8, 0: controlled by CalibrationEngine, 1: overridden by register */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRENRFMIXDCCALI_Pos (25UL) /*!< Position of OVRENRFMIXDCCALI field.                   */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRENRFMIXDCCALI_Msk (0x1UL << RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRENRFMIXDCCALI_Pos) /*!<
                                                                            Bit mask of OVRENRFMIXDCCALI field.*/                 

/* OVRENRFMIXDCCALQ @Bit 26 : For RXMIX_DCCAL_Q_0V8, 0: controlled by CalibrationEngine, 1: overridden by register */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRENRFMIXDCCALQ_Pos (26UL) /*!< Position of OVRENRFMIXDCCALQ field.                   */
  #define RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRENRFMIXDCCALQ_Msk (0x1UL << RADIO_SPHYNXANA_OVRRXTRIMCODE_OVRENRFMIXDCCALQ_Pos) /*!<
                                                                            Bit mask of OVRENRFMIXDCCALQ field.*/                 


/* RADIO_SPHYNXANA_STATUS: Readout raw status of signals output from Sphynx */
  #define RADIO_SPHYNXANA_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                                */

/* SPHYNXADCBIAO @Bits 0..10 : Raw ADC I channel output from RX_SAR2 */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXADCBIAO_Pos (0UL) /*!< Position of SPHYNXADCBIAO field.                                 */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXADCBIAO_Msk (0x7FFUL << RADIO_SPHYNXANA_STATUS_SPHYNXADCBIAO_Pos) /*!< Bit mask of
                                                                            SPHYNXADCBIAO field.*/                                

/* SPHYNXADCBQAO @Bits 11..21 : Raw ADC Q channel output from RX_SAR2 */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXADCBQAO_Pos (11UL) /*!< Position of SPHYNXADCBQAO field.                                */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXADCBQAO_Msk (0x7FFUL << RADIO_SPHYNXANA_STATUS_SPHYNXADCBQAO_Pos) /*!< Bit mask of
                                                                            SPHYNXADCBQAO field.*/                                

/* SPHYNXCALCMPRCCALAO @Bit 22 : Raw comparator output of RC calibration from RC_CAL */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXCALCMPRCCALAO_Pos (22UL) /*!< Position of SPHYNXCALCMPRCCALAO field.                    */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXCALCMPRCCALAO_Msk (0x1UL << RADIO_SPHYNXANA_STATUS_SPHYNXCALCMPRCCALAO_Pos) /*!< Bit mask
                                                                            of SPHYNXCALCMPRCCALAO field.*/                       

/* SPHYNXAAFDCCALIAO @Bit 23 : Raw comparator output of DC calibration from RX_AAF I channel */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXAAFDCCALIAO_Pos (23UL) /*!< Position of SPHYNXAAFDCCALIAO field.                        */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXAAFDCCALIAO_Msk (0x1UL << RADIO_SPHYNXANA_STATUS_SPHYNXAAFDCCALIAO_Pos) /*!< Bit mask of
                                                                            SPHYNXAAFDCCALIAO field.*/                            

/* SPHYNXAAFDCCALQAO @Bit 24 : Raw comparator output of DC calibration from RX_AAF Q channel */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXAAFDCCALQAO_Pos (24UL) /*!< Position of SPHYNXAAFDCCALQAO field.                        */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXAAFDCCALQAO_Msk (0x1UL << RADIO_SPHYNXANA_STATUS_SPHYNXAAFDCCALQAO_Pos) /*!< Bit mask of
                                                                            SPHYNXAAFDCCALQAO field.*/                            

/* SPHYNXRXPKDETAO @Bits 25..26 : Raw peak detector output from RX_PKDET */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXRXPKDETAO_Pos (25UL) /*!< Position of SPHYNXRXPKDETAO field.                            */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXRXPKDETAO_Msk (0x3UL << RADIO_SPHYNXANA_STATUS_SPHYNXRXPKDETAO_Pos) /*!< Bit mask of
                                                                            SPHYNXRXPKDETAO field.*/                              

/* SPHYNXFSSCANOUTAO @Bit 31 : DFT Scan-out from AdPll */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXFSSCANOUTAO_Pos (31UL) /*!< Position of SPHYNXFSSCANOUTAO field.                        */
  #define RADIO_SPHYNXANA_STATUS_SPHYNXFSSCANOUTAO_Msk (0x1UL << RADIO_SPHYNXANA_STATUS_SPHYNXFSSCANOUTAO_Pos) /*!< Bit mask of
                                                                            SPHYNXFSSCANOUTAO field.*/                            


/* RADIO_SPHYNXANA_OVRRXGAIN: Analog rx gain override */
  #define RADIO_SPHYNXANA_OVRRXGAIN_ResetValue (0x00000000UL) /*!< Reset value of OVRRXGAIN register.                          */

/* SPHYNXLNAGAINOVREN @Bits 0..2 : Override enable for LNA_GAIN_0V8, each bit can be overriden individually */
  #define RADIO_SPHYNXANA_OVRRXGAIN_SPHYNXLNAGAINOVREN_Pos (0UL) /*!< Position of SPHYNXLNAGAINOVREN field.                    */
  #define RADIO_SPHYNXANA_OVRRXGAIN_SPHYNXLNAGAINOVREN_Msk (0x7UL << RADIO_SPHYNXANA_OVRRXGAIN_SPHYNXLNAGAINOVREN_Pos) /*!< Bit
                                                                            mask of SPHYNXLNAGAINOVREN field.*/                   

/* SPHYNXLNAGAINOVRVAL @Bits 8..10 : Override value for LNA_GAIN_0V8, each bit can be overriden individually */
  #define RADIO_SPHYNXANA_OVRRXGAIN_SPHYNXLNAGAINOVRVAL_Pos (8UL) /*!< Position of SPHYNXLNAGAINOVRVAL field.                  */
  #define RADIO_SPHYNXANA_OVRRXGAIN_SPHYNXLNAGAINOVRVAL_Msk (0x7UL << RADIO_SPHYNXANA_OVRRXGAIN_SPHYNXLNAGAINOVRVAL_Pos) /*!<
                                                                            Bit mask of SPHYNXLNAGAINOVRVAL field.*/              

/* SPHYNXRXMIXGAINOVREN @Bits 16..23 : Override enable for RXMIX_GAIN_0V8, each bit can be overriden individually */
  #define RADIO_SPHYNXANA_OVRRXGAIN_SPHYNXRXMIXGAINOVREN_Pos (16UL) /*!< Position of SPHYNXRXMIXGAINOVREN field.               */
  #define RADIO_SPHYNXANA_OVRRXGAIN_SPHYNXRXMIXGAINOVREN_Msk (0xFFUL << RADIO_SPHYNXANA_OVRRXGAIN_SPHYNXRXMIXGAINOVREN_Pos) /*!<
                                                                            Bit mask of SPHYNXRXMIXGAINOVREN field.*/             

/* SPHYNXRXMIXGAINOVRVAL @Bits 24..31 : Override value for RXMIX_GAIN_0V8, each bit can be overriden individually */
  #define RADIO_SPHYNXANA_OVRRXGAIN_SPHYNXRXMIXGAINOVRVAL_Pos (24UL) /*!< Position of SPHYNXRXMIXGAINOVRVAL field.             */
  #define RADIO_SPHYNXANA_OVRRXGAIN_SPHYNXRXMIXGAINOVRVAL_Msk (0xFFUL << RADIO_SPHYNXANA_OVRRXGAIN_SPHYNXRXMIXGAINOVRVAL_Pos)
                                                                            /*!< Bit mask of SPHYNXRXMIXGAINOVRVAL field.*/       


/* RADIO_SPHYNXANA_CLOCKSOURCE: Choose between two clock sources */
  #define RADIO_SPHYNXANA_CLOCKSOURCE_ResetValue (0x00000000UL) /*!< Reset value of CLOCKSOURCE register.                      */

/* ENCK64MBUFSIN @Bit 0 : Enable clock buffer from 64MHz input */
  #define RADIO_SPHYNXANA_CLOCKSOURCE_ENCK64MBUFSIN_Pos (0UL) /*!< Position of ENCK64MBUFSIN field.                            */
  #define RADIO_SPHYNXANA_CLOCKSOURCE_ENCK64MBUFSIN_Msk (0x1UL << RADIO_SPHYNXANA_CLOCKSOURCE_ENCK64MBUFSIN_Pos) /*!< Bit mask
                                                                            of ENCK64MBUFSIN field.*/                             
  #define RADIO_SPHYNXANA_CLOCKSOURCE_ENCK64MBUFSIN_Min (0x0UL) /*!< Min enumerator value of ENCK64MBUFSIN field.              */
  #define RADIO_SPHYNXANA_CLOCKSOURCE_ENCK64MBUFSIN_Max (0x1UL) /*!< Max enumerator value of ENCK64MBUFSIN field.              */
  #define RADIO_SPHYNXANA_CLOCKSOURCE_ENCK64MBUFSIN_32MHz (0x0UL) /*!< Use clock from 32MHz XOSC (Lilium)                      */
  #define RADIO_SPHYNXANA_CLOCKSOURCE_ENCK64MBUFSIN_64MHz (0x1UL) /*!< Use clock from 64MHz XOSC (Halti)                       */



/* ================================================ Struct RADIO_TIMINGENGINE ================================================ */
/**
  * @brief TIMINGENGINE [RADIO_TIMINGENGINE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TIMINGALL0;                        /*!< (@ 0x00000000) Timing parameters for signals activated in both Rx and
                                                                         Tx mode*/                                                
  __IOM uint32_t  TIMINGALL1;                        /*!< (@ 0x00000004) Timing parameters for signals activated in both Rx and
                                                                         Tx mode*/                                                
  __IOM uint32_t  TIMINGALL2;                        /*!< (@ 0x00000008) Timing parameters for signals activated in both Rx and
                                                                         Tx mode*/                                                
  __IOM uint32_t  TIMINGALL3;                        /*!< (@ 0x0000000C) Timing parameters for signals activated in both Rx and
                                                                         Tx mode*/                                                
  __IOM uint32_t  TIMINGALL4;                        /*!< (@ 0x00000010) Timing parameters for signals activated in both Rx and
                                                                         Tx mode*/                                                
  __IOM uint32_t  TIMINGALL5;                        /*!< (@ 0x00000014) Timing parameters for signals activated in both Rx and
                                                                         Tx mode*/                                                
  __IOM uint32_t  TIMINGALL6;                        /*!< (@ 0x00000018) Timing parameters for signals activated in both Rx and
                                                                         Tx mode*/                                                
  __IOM uint32_t  TIMINGALL7;                        /*!< (@ 0x0000001C) Timing parameters for signals activated in both Rx and
                                                                         Tx mode*/                                                
  __IOM uint32_t  TIMINGALL8;                        /*!< (@ 0x00000020) Timing parameters for signals activated in both Rx and
                                                                         Tx mode*/                                                
  __IOM uint32_t  MODEDEPENDENT;                     /*!< (@ 0x00000024) Mode dependent timing parameters                      */
  __IOM uint32_t  TIMINGRX0;                         /*!< (@ 0x00000028) Timing parameters for signals activated in Rx mode    */
  __IOM uint32_t  TIMINGRX1;                         /*!< (@ 0x0000002C) Timing parameters for signals activated in Rx mode    */
  __IOM uint32_t  TIMINGRX2;                         /*!< (@ 0x00000030) Timing parameters for signals activated in Rx mode    */
  __IOM uint32_t  TIMINGRX3;                         /*!< (@ 0x00000034) Timing parameters for signals activated in Rx mode    */
  __IOM uint32_t  TIMINGRX4;                         /*!< (@ 0x00000038) Timing parameters for signals activated in Rx mode    */
  __IOM uint32_t  TIMINGTX0;                         /*!< (@ 0x0000003C) Timing parameters for signals activated in Tx mode    */
  __IOM uint32_t  TIMINGTX1;                         /*!< (@ 0x00000040) Timing parameters for signals activated in Tx mode    */
  __IOM uint32_t  TIMINGTX2;                         /*!< (@ 0x00000044) Timing parameters for signals activated in Tx mode    */
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000048) Configuration of timing control                       */
  __IOM uint32_t  OVRENALL;                          /*!< (@ 0x0000004C) Enable or disable override of signals                 */
  __IOM uint32_t  OVRENRXTX;                         /*!< (@ 0x00000050) Enable or disable override of signals                 */
  __IOM uint32_t  OVRVALALL;                         /*!< (@ 0x00000054) Set override values on signals                        */
  __IOM uint32_t  OVRVALRXTX;                        /*!< (@ 0x00000058) Set override values on signals                        */
  __IOM uint32_t  MODEDEPENDENT2;                    /*!< (@ 0x0000005C) Mode dependent timing controls                        */
} NRF_RADIO_TIMINGENGINE_Type;                       /*!< Size = 96 (0x060)                                                    */

