adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_TIMINGENGINE_TIMINGALL0: Timing parameters for signals activated in both Rx and Tx mode */
  #define RADIO_TIMINGENGINE_TIMINGALL0_ResetValue (0x010000A0UL) /*!< Reset value of TIMINGALL0 register.                     */

/* TPLLSETTLED @Bits 0..7 : Timing control of pllSettled (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL0_TPLLSETTLED_Pos (0UL) /*!< Position of TPLLSETTLED field.                              */
  #define RADIO_TIMINGENGINE_TIMINGALL0_TPLLSETTLED_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL0_TPLLSETTLED_Pos) /*!< Bit mask
                                                                            of TPLLSETTLED field.*/                               

/* TRETAINRADIO @Bits 8..15 : Timing control of retainRadio (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL0_TRETAINRADIO_Pos (8UL) /*!< Position of TRETAINRADIO field.                            */
  #define RADIO_TIMINGENGINE_TIMINGALL0_TRETAINRADIO_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL0_TRETAINRADIO_Pos) /*!< Bit
                                                                            mask of TRETAINRADIO field.*/                         

/* TPWRUPRADIOBIT0 @Bits 16..23 : Timing control of pwrupRadio[0] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL0_TPWRUPRADIOBIT0_Pos (16UL) /*!< Position of TPWRUPRADIOBIT0 field.                     */
  #define RADIO_TIMINGENGINE_TIMINGALL0_TPWRUPRADIOBIT0_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL0_TPWRUPRADIOBIT0_Pos) /*!<
                                                                            Bit mask of TPWRUPRADIOBIT0 field.*/                  

/* TPWRUPRADIOBIT1 @Bits 24..31 : Timing control of pwrupRadio[1] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL0_TPWRUPRADIOBIT1_Pos (24UL) /*!< Position of TPWRUPRADIOBIT1 field.                     */
  #define RADIO_TIMINGENGINE_TIMINGALL0_TPWRUPRADIOBIT1_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL0_TPWRUPRADIOBIT1_Pos) /*!<
                                                                            Bit mask of TPWRUPRADIOBIT1 field.*/                  


/* RADIO_TIMINGENGINE_TIMINGALL1: Timing parameters for signals activated in both Rx and Tx mode */
  #define RADIO_TIMINGENGINE_TIMINGALL1_ResetValue (0x00150301UL) /*!< Reset value of TIMINGALL1 register.                     */

/* TPWRUPFSREFBIT0 @Bits 0..7 : Timing control of PwrupFsRef[0] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL1_TPWRUPFSREFBIT0_Pos (0UL) /*!< Position of TPWRUPFSREFBIT0 field.                      */
  #define RADIO_TIMINGENGINE_TIMINGALL1_TPWRUPFSREFBIT0_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL1_TPWRUPFSREFBIT0_Pos) /*!<
                                                                            Bit mask of TPWRUPFSREFBIT0 field.*/                  

/* TPWRUPFSREFBIT1 @Bits 8..15 : Timing control of PwrupFsRef[1] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL1_TPWRUPFSREFBIT1_Pos (8UL) /*!< Position of TPWRUPFSREFBIT1 field.                      */
  #define RADIO_TIMINGENGINE_TIMINGALL1_TPWRUPFSREFBIT1_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL1_TPWRUPFSREFBIT1_Pos) /*!<
                                                                            Bit mask of TPWRUPFSREFBIT1 field.*/                  

/* TPWRUPFSREFBIT2 @Bits 16..23 : Timing control of PwrupFsRef[2] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL1_TPWRUPFSREFBIT2_Pos (16UL) /*!< Position of TPWRUPFSREFBIT2 field.                     */
  #define RADIO_TIMINGENGINE_TIMINGALL1_TPWRUPFSREFBIT2_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL1_TPWRUPFSREFBIT2_Pos) /*!<
                                                                            Bit mask of TPWRUPFSREFBIT2 field.*/                  


/* RADIO_TIMINGENGINE_TIMINGALL2: Timing parameters for signals activated in both Rx and Tx mode */
  #define RADIO_TIMINGENGINE_TIMINGALL2_ResetValue (0x38182120UL) /*!< Reset value of TIMINGALL2 register.                     */

/* TRSTFSLSBIT0 @Bits 0..7 : Timing control of RstFsLs[0] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL2_TRSTFSLSBIT0_Pos (0UL) /*!< Position of TRSTFSLSBIT0 field.                            */
  #define RADIO_TIMINGENGINE_TIMINGALL2_TRSTFSLSBIT0_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL2_TRSTFSLSBIT0_Pos) /*!< Bit
                                                                            mask of TRSTFSLSBIT0 field.*/                         

/* TRSTFSLSBIT1 @Bits 8..15 : Timing control of RstFsLs[1] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL2_TRSTFSLSBIT1_Pos (8UL) /*!< Position of TRSTFSLSBIT1 field.                            */
  #define RADIO_TIMINGENGINE_TIMINGALL2_TRSTFSLSBIT1_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL2_TRSTFSLSBIT1_Pos) /*!< Bit
                                                                            mask of TRSTFSLSBIT1 field.*/                         

/* TPWRUPFSLDOVCOBIT0 @Bits 16..23 : Timing control of PwrupFsLdoVco[0] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL2_TPWRUPFSLDOVCOBIT0_Pos (16UL) /*!< Position of TPWRUPFSLDOVCOBIT0 field.               */
  #define RADIO_TIMINGENGINE_TIMINGALL2_TPWRUPFSLDOVCOBIT0_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL2_TPWRUPFSLDOVCOBIT0_Pos)
                                                                            /*!< Bit mask of TPWRUPFSLDOVCOBIT0 field.*/          

/* TPWRUPFSLDOVCOBIT1 @Bits 24..31 : Timing control of PwrupFsLdoVco[1] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL2_TPWRUPFSLDOVCOBIT1_Pos (24UL) /*!< Position of TPWRUPFSLDOVCOBIT1 field.               */
  #define RADIO_TIMINGENGINE_TIMINGALL2_TPWRUPFSLDOVCOBIT1_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL2_TPWRUPFSLDOVCOBIT1_Pos)
                                                                            /*!< Bit mask of TPWRUPFSLDOVCOBIT1 field.*/          


/* RADIO_TIMINGENGINE_TIMINGALL3: Timing parameters for signals activated in both Rx and Tx mode */
  #define RADIO_TIMINGENGINE_TIMINGALL3_ResetValue (0x30181C18UL) /*!< Reset value of TIMINGALL3 register.                     */

/* TPWRUPFSLDODTCBIT0 @Bits 0..7 : Timing control of PwrupFsLdoDtc[0] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL3_TPWRUPFSLDODTCBIT0_Pos (0UL) /*!< Position of TPWRUPFSLDODTCBIT0 field.                */
  #define RADIO_TIMINGENGINE_TIMINGALL3_TPWRUPFSLDODTCBIT0_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL3_TPWRUPFSLDODTCBIT0_Pos)
                                                                            /*!< Bit mask of TPWRUPFSLDODTCBIT0 field.*/          

/* TPWRUPFSLDODTCBIT1 @Bits 8..15 : Timing control of PwrupFsLdoDtc[1] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL3_TPWRUPFSLDODTCBIT1_Pos (8UL) /*!< Position of TPWRUPFSLDODTCBIT1 field.                */
  #define RADIO_TIMINGENGINE_TIMINGALL3_TPWRUPFSLDODTCBIT1_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL3_TPWRUPFSLDODTCBIT1_Pos)
                                                                            /*!< Bit mask of TPWRUPFSLDODTCBIT1 field.*/          

/* TPWRUPFSLDODIGBIT0 @Bits 16..23 : Timing control of PwrupFsLdoDig[0] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL3_TPWRUPFSLDODIGBIT0_Pos (16UL) /*!< Position of TPWRUPFSLDODIGBIT0 field.               */
  #define RADIO_TIMINGENGINE_TIMINGALL3_TPWRUPFSLDODIGBIT0_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL3_TPWRUPFSLDODIGBIT0_Pos)
                                                                            /*!< Bit mask of TPWRUPFSLDODIGBIT0 field.*/          

