adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TPWRUPFSLDODIGBIT1 @Bits 24..31 : Timing control of PwrupFsLdoDig[1] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL3_TPWRUPFSLDODIGBIT1_Pos (24UL) /*!< Position of TPWRUPFSLDODIGBIT1 field.               */
  #define RADIO_TIMINGENGINE_TIMINGALL3_TPWRUPFSLDODIGBIT1_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL3_TPWRUPFSLDODIGBIT1_Pos)
                                                                            /*!< Bit mask of TPWRUPFSLDODIGBIT1 field.*/          


/* RADIO_TIMINGENGINE_TIMINGALL4: Timing parameters for signals activated in both Rx and Tx mode */
  #define RADIO_TIMINGENGINE_TIMINGALL4_ResetValue (0x2420201CUL) /*!< Reset value of TIMINGALL4 register.                     */

/* TPWRUPFSLDODIVBIT0 @Bits 0..7 : Timing control of PwrupFsLdoDiv[0] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL4_TPWRUPFSLDODIVBIT0_Pos (0UL) /*!< Position of TPWRUPFSLDODIVBIT0 field.                */
  #define RADIO_TIMINGENGINE_TIMINGALL4_TPWRUPFSLDODIVBIT0_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL4_TPWRUPFSLDODIVBIT0_Pos)
                                                                            /*!< Bit mask of TPWRUPFSLDODIVBIT0 field.*/          

/* TPWRUPFSLDODIVBIT1 @Bits 8..15 : Timing control of PwrupFsLdoDiv[1] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL4_TPWRUPFSLDODIVBIT1_Pos (8UL) /*!< Position of TPWRUPFSLDODIVBIT1 field.                */
  #define RADIO_TIMINGENGINE_TIMINGALL4_TPWRUPFSLDODIVBIT1_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL4_TPWRUPFSLDODIVBIT1_Pos)
                                                                            /*!< Bit mask of TPWRUPFSLDODIVBIT1 field.*/          

/* TPWRUPFSLDOCNTBIT0 @Bits 16..23 : Timing control of PwrupFsLdoCnt[0] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL4_TPWRUPFSLDOCNTBIT0_Pos (16UL) /*!< Position of TPWRUPFSLDOCNTBIT0 field.               */
  #define RADIO_TIMINGENGINE_TIMINGALL4_TPWRUPFSLDOCNTBIT0_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL4_TPWRUPFSLDOCNTBIT0_Pos)
                                                                            /*!< Bit mask of TPWRUPFSLDOCNTBIT0 field.*/          

/* TPWRUPFSLDOCNTBIT1 @Bits 24..31 : Timing control of PwrupFsLdoCnt[1] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL4_TPWRUPFSLDOCNTBIT1_Pos (24UL) /*!< Position of TPWRUPFSLDOCNTBIT1 field.               */
  #define RADIO_TIMINGENGINE_TIMINGALL4_TPWRUPFSLDOCNTBIT1_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL4_TPWRUPFSLDOCNTBIT1_Pos)
                                                                            /*!< Bit mask of TPWRUPFSLDOCNTBIT1 field.*/          


/* RADIO_TIMINGENGINE_TIMINGALL5: Timing parameters for signals activated in both Rx and Tx mode */
  #define RADIO_TIMINGENGINE_TIMINGALL5_ResetValue (0x30242420UL) /*!< Reset value of TIMINGALL5 register.                     */

/* TPWRUPFSLDOTDCBIT0 @Bits 0..7 : Timing control of PwrupFsLdoTdc[0] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL5_TPWRUPFSLDOTDCBIT0_Pos (0UL) /*!< Position of TPWRUPFSLDOTDCBIT0 field.                */
  #define RADIO_TIMINGENGINE_TIMINGALL5_TPWRUPFSLDOTDCBIT0_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL5_TPWRUPFSLDOTDCBIT0_Pos)
                                                                            /*!< Bit mask of TPWRUPFSLDOTDCBIT0 field.*/          

/* TPWRUPFSLDOTDCBIT1 @Bits 8..15 : Timing control of PwrupFsLdoTdc[1] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL5_TPWRUPFSLDOTDCBIT1_Pos (8UL) /*!< Position of TPWRUPFSLDOTDCBIT1 field.                */
  #define RADIO_TIMINGENGINE_TIMINGALL5_TPWRUPFSLDOTDCBIT1_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL5_TPWRUPFSLDOTDCBIT1_Pos)
                                                                            /*!< Bit mask of TPWRUPFSLDOTDCBIT1 field.*/          

/* TARSTFS @Bits 16..23 : Timing control of ArstFs (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL5_TARSTFS_Pos (16UL) /*!< Position of TARSTFS field.                                     */
  #define RADIO_TIMINGENGINE_TIMINGALL5_TARSTFS_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL5_TARSTFS_Pos) /*!< Bit mask of
                                                                            TARSTFS field.*/                                      

/* TFSSTART @Bits 24..31 : Timing control of FsStart (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL5_TFSSTART_Pos (24UL) /*!< Position of TFSSTART field.                                   */
  #define RADIO_TIMINGENGINE_TIMINGALL5_TFSSTART_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL5_TFSSTART_Pos) /*!< Bit mask of
                                                                            TFSSTART field.*/                                     


/* RADIO_TIMINGENGINE_TIMINGALL6: Timing parameters for signals activated in both Rx and Tx mode */
  #define RADIO_TIMINGENGINE_TIMINGALL6_ResetValue (0x1E1A221AUL) /*!< Reset value of TIMINGALL6 register.                     */

/* TPWRUPFSDTC @Bits 0..7 : Timing control of PwrupFsDtc (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL6_TPWRUPFSDTC_Pos (0UL) /*!< Position of TPWRUPFSDTC field.                              */
  #define RADIO_TIMINGENGINE_TIMINGALL6_TPWRUPFSDTC_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL6_TPWRUPFSDTC_Pos) /*!< Bit mask
                                                                            of TPWRUPFSDTC field.*/                               

/* TPWRUPFSTDC @Bits 8..15 : Timing control of PwrupFsTdc (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL6_TPWRUPFSTDC_Pos (8UL) /*!< Position of TPWRUPFSTDC field.                              */
  #define RADIO_TIMINGENGINE_TIMINGALL6_TPWRUPFSTDC_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL6_TPWRUPFSTDC_Pos) /*!< Bit mask
                                                                            of TPWRUPFSTDC field.*/                               

/* TPWRUPFSVCO @Bits 16..23 : Timing control of PwrupFsVco (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL6_TPWRUPFSVCO_Pos (16UL) /*!< Position of TPWRUPFSVCO field.                             */
  #define RADIO_TIMINGENGINE_TIMINGALL6_TPWRUPFSVCO_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL6_TPWRUPFSVCO_Pos) /*!< Bit mask
                                                                            of TPWRUPFSVCO field.*/                               

