adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TPWRUPFSDIV2 @Bits 24..31 : Timing control of PwrupFsDiv2 (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL6_TPWRUPFSDIV2_Pos (24UL) /*!< Position of TPWRUPFSDIV2 field.                           */
  #define RADIO_TIMINGENGINE_TIMINGALL6_TPWRUPFSDIV2_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL6_TPWRUPFSDIV2_Pos) /*!< Bit
                                                                            mask of TPWRUPFSDIV2 field.*/                         


/* RADIO_TIMINGENGINE_TIMINGALL7: Timing parameters for signals activated in both Rx and Tx mode */
  #define RADIO_TIMINGENGINE_TIMINGALL7_ResetValue (0x2D210120UL) /*!< Reset value of TIMINGALL7 register.                     */

/* TPWRUPFSDIV2G4COUNTER @Bits 0..7 : Timing control of PwrupFsDiv2g4Counter (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL7_TPWRUPFSDIV2G4COUNTER_Pos (0UL) /*!< Position of TPWRUPFSDIV2G4COUNTER field.          */
  #define RADIO_TIMINGENGINE_TIMINGALL7_TPWRUPFSDIV2G4COUNTER_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL7_TPWRUPFSDIV2G4COUNTER_Pos)
                                                                            /*!< Bit mask of TPWRUPFSDIV2G4COUNTER field.*/       

/* TPWRUPRXTXREFBIT0 @Bits 8..15 : Timing control of PwrupRxTxRef[0] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL7_TPWRUPRXTXREFBIT0_Pos (8UL) /*!< Position of TPWRUPRXTXREFBIT0 field.                  */
  #define RADIO_TIMINGENGINE_TIMINGALL7_TPWRUPRXTXREFBIT0_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL7_TPWRUPRXTXREFBIT0_Pos)
                                                                            /*!< Bit mask of TPWRUPRXTXREFBIT0 field.*/           

/* TPWRUPRXTXREFBIT1 @Bits 16..23 : Timing control of PwrupRxTxRef[1] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL7_TPWRUPRXTXREFBIT1_Pos (16UL) /*!< Position of TPWRUPRXTXREFBIT1 field.                 */
  #define RADIO_TIMINGENGINE_TIMINGALL7_TPWRUPRXTXREFBIT1_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL7_TPWRUPRXTXREFBIT1_Pos)
                                                                            /*!< Bit mask of TPWRUPRXTXREFBIT1 field.*/           

/* TPWRUPRXTXREFBIT2 @Bits 24..31 : Timing control of PwrupRxTxRef[2] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL7_TPWRUPRXTXREFBIT2_Pos (24UL) /*!< Position of TPWRUPRXTXREFBIT2 field.                 */
  #define RADIO_TIMINGENGINE_TIMINGALL7_TPWRUPRXTXREFBIT2_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL7_TPWRUPRXTXREFBIT2_Pos)
                                                                            /*!< Bit mask of TPWRUPRXTXREFBIT2 field.*/           


/* RADIO_TIMINGENGINE_TIMINGALL8: Timing parameters for signals activated in both Rx and Tx mode */
  #define RADIO_TIMINGENGINE_TIMINGALL8_ResetValue (0x00000028UL) /*!< Reset value of TIMINGALL8 register.                     */

/* TRSTFSLSBIT2 @Bits 0..7 : Timing control of RstFsLs[2] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGALL8_TRSTFSLSBIT2_Pos (0UL) /*!< Position of TRSTFSLSBIT2 field.                            */
  #define RADIO_TIMINGENGINE_TIMINGALL8_TRSTFSLSBIT2_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGALL8_TRSTFSLSBIT2_Pos) /*!< Bit
                                                                            mask of TRSTFSLSBIT2 field.*/                         


/* RADIO_TIMINGENGINE_MODEDEPENDENT: Mode dependent timing parameters */
  #define RADIO_TIMINGENGINE_MODEDEPENDENT_ResetValue (0x18100010UL) /*!< Reset value of MODEDEPENDENT register.               */

/* TIFSDELTA @Bits 0..7 : Timing control of IfsDelta (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_MODEDEPENDENT_TIFSDELTA_Pos (0UL) /*!< Position of TIFSDELTA field.                               */
  #define RADIO_TIMINGENGINE_MODEDEPENDENT_TIFSDELTA_Msk (0xFFUL << RADIO_TIMINGENGINE_MODEDEPENDENT_TIFSDELTA_Pos) /*!< Bit
                                                                            mask of TIFSDELTA field.*/                            

/* TIFSDELTAPLUS @Bits 8..12 : Timing control of IfsDeltaPlus (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_MODEDEPENDENT_TIFSDELTAPLUS_Pos (8UL) /*!< Position of TIFSDELTAPLUS field.                       */
  #define RADIO_TIMINGENGINE_MODEDEPENDENT_TIFSDELTAPLUS_Msk (0x1FUL << RADIO_TIMINGENGINE_MODEDEPENDENT_TIFSDELTAPLUS_Pos) /*!<
                                                                            Bit mask of TIFSDELTAPLUS field.*/                    

/* TDELTAPIPE @Bits 16..23 : Timing control of DeltaPipe (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_MODEDEPENDENT_TDELTAPIPE_Pos (16UL) /*!< Position of TDELTAPIPE field.                            */
  #define RADIO_TIMINGENGINE_MODEDEPENDENT_TDELTAPIPE_Msk (0xFFUL << RADIO_TIMINGENGINE_MODEDEPENDENT_TDELTAPIPE_Pos) /*!< Bit
                                                                            mask of TDELTAPIPE field.*/                           

/* TDELTAPWRDNPA @Bits 24..31 : Timing control of DeltaPwrdnPa (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_MODEDEPENDENT_TDELTAPWRDNPA_Pos (24UL) /*!< Position of TDELTAPWRDNPA field.                      */
  #define RADIO_TIMINGENGINE_MODEDEPENDENT_TDELTAPWRDNPA_Msk (0xFFUL << RADIO_TIMINGENGINE_MODEDEPENDENT_TDELTAPWRDNPA_Pos) /*!<
                                                                            Bit mask of TDELTAPWRDNPA field.*/                    


/* RADIO_TIMINGENGINE_TIMINGRX0: Timing parameters for signals activated in Rx mode */
  #define RADIO_TIMINGENGINE_TIMINGRX0_ResetValue (0x6C646D6CUL) /*!< Reset value of TIMINGRX0 register.                       */

/* TRSTRXLSBIT0 @Bits 0..7 : Timing control of RstRxLs[0] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGRX0_TRSTRXLSBIT0_Pos (0UL) /*!< Position of TRSTRXLSBIT0 field.                             */
  #define RADIO_TIMINGENGINE_TIMINGRX0_TRSTRXLSBIT0_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX0_TRSTRXLSBIT0_Pos) /*!< Bit mask
                                                                            of TRSTRXLSBIT0 field.*/                              

/* TRSTRXLSBIT1 @Bits 8..15 : Timing control of RstRxLs[1] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGRX0_TRSTRXLSBIT1_Pos (8UL) /*!< Position of TRSTRXLSBIT1 field.                             */
  #define RADIO_TIMINGENGINE_TIMINGRX0_TRSTRXLSBIT1_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX0_TRSTRXLSBIT1_Pos) /*!< Bit mask
                                                                            of TRSTRXLSBIT1 field.*/                              

/* TPWRUPRXLDOBIT0 @Bits 16..23 : Timing control of PwrupRxLdo[0] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGRX0_TPWRUPRXLDOBIT0_Pos (16UL) /*!< Position of TPWRUPRXLDOBIT0 field.                      */
  #define RADIO_TIMINGENGINE_TIMINGRX0_TPWRUPRXLDOBIT0_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX0_TPWRUPRXLDOBIT0_Pos) /*!< Bit
                                                                            mask of TPWRUPRXLDOBIT0 field.*/                      

/* TPWRUPRXLDOBIT1 @Bits 24..31 : Timing control of PwrupRxLdo[1] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGRX0_TPWRUPRXLDOBIT1_Pos (24UL) /*!< Position of TPWRUPRXLDOBIT1 field.                      */
  #define RADIO_TIMINGENGINE_TIMINGRX0_TPWRUPRXLDOBIT1_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX0_TPWRUPRXLDOBIT1_Pos) /*!< Bit
                                                                            mask of TPWRUPRXLDOBIT1 field.*/                      


/* RADIO_TIMINGENGINE_TIMINGRX1: Timing parameters for signals activated in Rx mode */
  #define RADIO_TIMINGENGINE_TIMINGRX1_ResetValue (0x6C646C64UL) /*!< Reset value of TIMINGRX1 register.                       */

/* TPWRUPRXLDOBIT2 @Bits 0..7 : Timing control of PwrupRxLdo[2] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGRX1_TPWRUPRXLDOBIT2_Pos (0UL) /*!< Position of TPWRUPRXLDOBIT2 field.                       */
  #define RADIO_TIMINGENGINE_TIMINGRX1_TPWRUPRXLDOBIT2_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX1_TPWRUPRXLDOBIT2_Pos) /*!< Bit
                                                                            mask of TPWRUPRXLDOBIT2 field.*/                      

/* TPWRUPRXLDOBIT3 @Bits 8..15 : Timing control of PwrupRxLdo[3] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGRX1_TPWRUPRXLDOBIT3_Pos (8UL) /*!< Position of TPWRUPRXLDOBIT3 field.                       */
  #define RADIO_TIMINGENGINE_TIMINGRX1_TPWRUPRXLDOBIT3_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX1_TPWRUPRXLDOBIT3_Pos) /*!< Bit
                                                                            mask of TPWRUPRXLDOBIT3 field.*/                      

/* TPWRUPRXLDOBIT4 @Bits 16..23 : Timing control of PwrupRxLdo[4] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGRX1_TPWRUPRXLDOBIT4_Pos (16UL) /*!< Position of TPWRUPRXLDOBIT4 field.                      */
  #define RADIO_TIMINGENGINE_TIMINGRX1_TPWRUPRXLDOBIT4_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX1_TPWRUPRXLDOBIT4_Pos) /*!< Bit
                                                                            mask of TPWRUPRXLDOBIT4 field.*/                      

/* TPWRUPRXLDOBIT5 @Bits 24..31 : Timing control of PwrupRxLdo[5] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGRX1_TPWRUPRXLDOBIT5_Pos (24UL) /*!< Position of TPWRUPRXLDOBIT5 field.                      */
  #define RADIO_TIMINGENGINE_TIMINGRX1_TPWRUPRXLDOBIT5_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX1_TPWRUPRXLDOBIT5_Pos) /*!< Bit
                                                                            mask of TPWRUPRXLDOBIT5 field.*/                      


