adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_TIMINGENGINE_TIMINGRX2: Timing parameters for signals activated in Rx mode */
  #define RADIO_TIMINGENGINE_TIMINGRX2_ResetValue (0x68686868UL) /*!< Reset value of TIMINGRX2 register.                       */

/* TPWRUPRXLNA @Bits 0..7 : Timing control of PwrupRxLna (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGRX2_TPWRUPRXLNA_Pos (0UL) /*!< Position of TPWRUPRXLNA field.                               */
  #define RADIO_TIMINGENGINE_TIMINGRX2_TPWRUPRXLNA_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX2_TPWRUPRXLNA_Pos) /*!< Bit mask of
                                                                            TPWRUPRXLNA field.*/                                  

/* TPWRUPRXMIX @Bits 8..15 : Timing control of PwrupRxMix (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGRX2_TPWRUPRXMIX_Pos (8UL) /*!< Position of TPWRUPRXMIX field.                               */
  #define RADIO_TIMINGENGINE_TIMINGRX2_TPWRUPRXMIX_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX2_TPWRUPRXMIX_Pos) /*!< Bit mask of
                                                                            TPWRUPRXMIX field.*/                                  

/* TPWRUPRX @Bits 16..23 : Timing control of PwrupRx (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGRX2_TPWRUPRX_Pos (16UL) /*!< Position of TPWRUPRX field.                                    */
  #define RADIO_TIMINGENGINE_TIMINGRX2_TPWRUPRX_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX2_TPWRUPRX_Pos) /*!< Bit mask of
                                                                            TPWRUPRX field.*/                                     

/* TPWRUPRXAAF @Bits 24..31 : Timing control of PwrupRxAaf (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGRX2_TPWRUPRXAAF_Pos (24UL) /*!< Position of TPWRUPRXAAF field.                              */
  #define RADIO_TIMINGENGINE_TIMINGRX2_TPWRUPRXAAF_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX2_TPWRUPRXAAF_Pos) /*!< Bit mask of
                                                                            TPWRUPRXAAF field.*/                                  


/* RADIO_TIMINGENGINE_TIMINGRX3: Timing parameters for signals activated in Rx mode */
  #define RADIO_TIMINGENGINE_TIMINGRX3_ResetValue (0x00786868UL) /*!< Reset value of TIMINGRX3 register.                       */

/* TPWRUPRXSARBIT0 @Bits 0..7 : Timing control of PwrupRxSar[0] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGRX3_TPWRUPRXSARBIT0_Pos (0UL) /*!< Position of TPWRUPRXSARBIT0 field.                       */
  #define RADIO_TIMINGENGINE_TIMINGRX3_TPWRUPRXSARBIT0_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX3_TPWRUPRXSARBIT0_Pos) /*!< Bit
                                                                            mask of TPWRUPRXSARBIT0 field.*/                      

/* TPWRUPRXSARBIT1 @Bits 8..15 : Timing control of PwrupRxSar[1] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGRX3_TPWRUPRXSARBIT1_Pos (8UL) /*!< Position of TPWRUPRXSARBIT1 field.                       */
  #define RADIO_TIMINGENGINE_TIMINGRX3_TPWRUPRXSARBIT1_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX3_TPWRUPRXSARBIT1_Pos) /*!< Bit
                                                                            mask of TPWRUPRXSARBIT1 field.*/                      

/* TPWRUPRXPKD @Bits 16..23 : Spare register. Power up peak detector is now tied with power up mixer. */
  #define RADIO_TIMINGENGINE_TIMINGRX3_TPWRUPRXPKD_Pos (16UL) /*!< Position of TPWRUPRXPKD field.                              */
  #define RADIO_TIMINGENGINE_TIMINGRX3_TPWRUPRXPKD_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX3_TPWRUPRXPKD_Pos) /*!< Bit mask of
                                                                            TPWRUPRXPKD field.*/                                  


/* RADIO_TIMINGENGINE_TIMINGRX4: Timing parameters for signals activated in Rx mode */
  #define RADIO_TIMINGENGINE_TIMINGRX4_ResetValue (0x78787468UL) /*!< Reset value of TIMINGRX4 register.                       */

/* TARSTADC @Bits 0..7 : Timing control of ArstAdc (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGRX4_TARSTADC_Pos (0UL) /*!< Position of TARSTADC field.                                     */
  #define RADIO_TIMINGENGINE_TIMINGRX4_TARSTADC_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX4_TARSTADC_Pos) /*!< Bit mask of
                                                                            TARSTADC field.*/                                     

/* TARSTADCEND @Bits 8..15 : Timing control of ArstAdcEnd (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGRX4_TARSTADCEND_Pos (8UL) /*!< Position of TARSTADCEND field.                               */
  #define RADIO_TIMINGENGINE_TIMINGRX4_TARSTADCEND_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX4_TARSTADCEND_Pos) /*!< Bit mask of
                                                                            TARSTADCEND field.*/                                  

/* TRXAGCEN @Bits 16..23 : Timing control of RxAgcEn (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGRX4_TRXAGCEN_Pos (16UL) /*!< Position of TRXAGCEN field.                                    */
  #define RADIO_TIMINGENGINE_TIMINGRX4_TRXAGCEN_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX4_TRXAGCEN_Pos) /*!< Bit mask of
                                                                            TRXAGCEN field.*/                                     

/* TRXDIGEN @Bits 24..31 : Timing control of RxDigEn (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGRX4_TRXDIGEN_Pos (24UL) /*!< Position of TRXDIGEN field.                                    */
  #define RADIO_TIMINGENGINE_TIMINGRX4_TRXDIGEN_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGRX4_TRXDIGEN_Pos) /*!< Bit mask of
                                                                            TRXDIGEN field.*/                                     


/* RADIO_TIMINGENGINE_TIMINGTX0: Timing parameters for signals activated in Tx mode */
  #define RADIO_TIMINGENGINE_TIMINGTX0_ResetValue (0x806C7C74UL) /*!< Reset value of TIMINGTX0 register.                       */

/* TPWRUPTXLDOBIT0 @Bits 0..7 : Timing control of PwrupTxLdo[0] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGTX0_TPWRUPTXLDOBIT0_Pos (0UL) /*!< Position of TPWRUPTXLDOBIT0 field.                       */
  #define RADIO_TIMINGENGINE_TIMINGTX0_TPWRUPTXLDOBIT0_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGTX0_TPWRUPTXLDOBIT0_Pos) /*!< Bit
                                                                            mask of TPWRUPTXLDOBIT0 field.*/                      

/* TPWRUPTXLDOBIT1 @Bits 8..15 : Timing control of PwrupTxLdo[1] (unit: 0.25us) */
  #define RADIO_TIMINGENGINE_TIMINGTX0_TPWRUPTXLDOBIT1_Pos (8UL) /*!< Position of TPWRUPTXLDOBIT1 field.                       */
  #define RADIO_TIMINGENGINE_TIMINGTX0_TPWRUPTXLDOBIT1_Msk (0xFFUL << RADIO_TIMINGENGINE_TIMINGTX0_TPWRUPTXLDOBIT1_Pos) /*!< Bit
                                                                            mask of TPWRUPTXLDOBIT1 field.*/                      

