adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* OVRENPWRUPFSLDOVCO @Bits 9..10 : Override enable of PwrupFsLdoVco */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSLDOVCO_Pos (9UL) /*!< Position of OVRENPWRUPFSLDOVCO field.                  */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSLDOVCO_Msk (0x3UL << RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSLDOVCO_Pos) /*!<
                                                                            Bit mask of OVRENPWRUPFSLDOVCO field.*/               

/* OVRENPWRUPFSLDODTC @Bits 11..12 : Override enable of PwrupFsLdoDtc */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSLDODTC_Pos (11UL) /*!< Position of OVRENPWRUPFSLDODTC field.                 */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSLDODTC_Msk (0x3UL << RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSLDODTC_Pos) /*!<
                                                                            Bit mask of OVRENPWRUPFSLDODTC field.*/               

/* OVRENPWRUPFSLDODIG @Bits 13..14 : Override enable of PwrupFsLdoDig */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSLDODIG_Pos (13UL) /*!< Position of OVRENPWRUPFSLDODIG field.                 */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSLDODIG_Msk (0x3UL << RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSLDODIG_Pos) /*!<
                                                                            Bit mask of OVRENPWRUPFSLDODIG field.*/               

/* OVRENPWRUPFSLDODIV @Bits 15..16 : Override enable of PwrupFsLdoDiv */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSLDODIV_Pos (15UL) /*!< Position of OVRENPWRUPFSLDODIV field.                 */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSLDODIV_Msk (0x3UL << RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSLDODIV_Pos) /*!<
                                                                            Bit mask of OVRENPWRUPFSLDODIV field.*/               

/* OVRENPWRUPFSLDOCNT @Bits 17..18 : Override enable of PwrupFsLdoCnt */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSLDOCNT_Pos (17UL) /*!< Position of OVRENPWRUPFSLDOCNT field.                 */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSLDOCNT_Msk (0x3UL << RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSLDOCNT_Pos) /*!<
                                                                            Bit mask of OVRENPWRUPFSLDOCNT field.*/               

/* OVRENPWRUPFSLDOTDC @Bits 19..20 : Override enable of PwrupFsLdoTdc */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSLDOTDC_Pos (19UL) /*!< Position of OVRENPWRUPFSLDOTDC field.                 */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSLDOTDC_Msk (0x3UL << RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSLDOTDC_Pos) /*!<
                                                                            Bit mask of OVRENPWRUPFSLDOTDC field.*/               

/* OVRENPWRUPFSDTC @Bit 21 : Override enable of PwrupFsDtc */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSDTC_Pos (21UL) /*!< Position of OVRENPWRUPFSDTC field.                       */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSDTC_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSDTC_Pos) /*!< Bit
                                                                            mask of OVRENPWRUPFSDTC field.*/                      

/* OVRENPWRUPFSTDC @Bit 22 : Override enable of PwrupFsTdc */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSTDC_Pos (22UL) /*!< Position of OVRENPWRUPFSTDC field.                       */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSTDC_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSTDC_Pos) /*!< Bit
                                                                            mask of OVRENPWRUPFSTDC field.*/                      

/* OVRENPWRUPFSVCO @Bit 23 : Override enable of PwrupFsVco */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSVCO_Pos (23UL) /*!< Position of OVRENPWRUPFSVCO field.                       */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSVCO_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSVCO_Pos) /*!< Bit
                                                                            mask of OVRENPWRUPFSVCO field.*/                      

/* OVRENPWRUPFSDIV2 @Bit 24 : Override enable of PwrupFsDiv2 */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSDIV2_Pos (24UL) /*!< Position of OVRENPWRUPFSDIV2 field.                     */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSDIV2_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSDIV2_Pos) /*!< Bit
                                                                            mask of OVRENPWRUPFSDIV2 field.*/                     

/* OVRENPWRUPFSDIV2G4COUNTER @Bit 25 : Override enable of PwrupFsDiv2g4Counter */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSDIV2G4COUNTER_Pos (25UL) /*!< Position of OVRENPWRUPFSDIV2G4COUNTER field.   */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSDIV2G4COUNTER_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPFSDIV2G4COUNTER_Pos)
                                                                            /*!< Bit mask of OVRENPWRUPFSDIV2G4COUNTER field.*/   

/* OVRENARSTFS @Bit 26 : Override enable of ArstFs */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENARSTFS_Pos (26UL) /*!< Position of OVRENARSTFS field.                               */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENARSTFS_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENALL_OVRENARSTFS_Pos) /*!< Bit mask of
                                                                            OVRENARSTFS field.*/                                  

/* OVRENFSSTART @Bit 27 : Override enable of FsStart */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENFSSTART_Pos (27UL) /*!< Position of OVRENFSSTART field.                             */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENFSSTART_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENALL_OVRENFSSTART_Pos) /*!< Bit mask of
                                                                            OVRENFSSTART field.*/                                 

/* OVRENPWRUPRXTXREF @Bits 28..30 : Override enable of PwrupRxTxRef */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPRXTXREF_Pos (28UL) /*!< Position of OVRENPWRUPRXTXREF field.                   */
  #define RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPRXTXREF_Msk (0x7UL << RADIO_TIMINGENGINE_OVRENALL_OVRENPWRUPRXTXREF_Pos) /*!<
                                                                            Bit mask of OVRENPWRUPRXTXREF field.*/                


/* RADIO_TIMINGENGINE_OVRENRXTX: Enable or disable override of signals */
  #define RADIO_TIMINGENGINE_OVRENRXTX_ResetValue (0x00000000UL) /*!< Reset value of OVRENRXTX register.                       */

/* OVRENRSTRXLS @Bits 0..1 : Override enable of RstRxLs */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENRSTRXLS_Pos (0UL) /*!< Position of OVRENRSTRXLS field.                             */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENRSTRXLS_Msk (0x3UL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENRSTRXLS_Pos) /*!< Bit mask
                                                                            of OVRENRSTRXLS field.*/                              

/* OVRENPWRUPRXLDO @Bits 2..7 : Override enable of PwrupRxLdo */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXLDO_Pos (2UL) /*!< Position of OVRENPWRUPRXLDO field.                       */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXLDO_Msk (0x3FUL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXLDO_Pos) /*!< Bit
                                                                            mask of OVRENPWRUPRXLDO field.*/                      

/* OVRENPWRUPRXLNA @Bit 8 : Override enable of PwrupRxLna */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXLNA_Pos (8UL) /*!< Position of OVRENPWRUPRXLNA field.                       */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXLNA_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXLNA_Pos) /*!< Bit
                                                                            mask of OVRENPWRUPRXLNA field.*/                      

/* OVRENPWRUPRXMIX @Bit 9 : Override enable of PwrupRxMix */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXMIX_Pos (9UL) /*!< Position of OVRENPWRUPRXMIX field.                       */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXMIX_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXMIX_Pos) /*!< Bit
                                                                            mask of OVRENPWRUPRXMIX field.*/                      

/* OVRENPWRUPRX @Bit 10 : Override enable of PwrupRx */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRX_Pos (10UL) /*!< Position of OVRENPWRUPRX field.                            */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRX_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRX_Pos) /*!< Bit mask
                                                                            of OVRENPWRUPRX field.*/                              

