adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* OVRENPWRUPRXAAF @Bit 11 : Override enable of PwrupRxAaf */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXAAF_Pos (11UL) /*!< Position of OVRENPWRUPRXAAF field.                      */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXAAF_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXAAF_Pos) /*!< Bit
                                                                            mask of OVRENPWRUPRXAAF field.*/                      

/* OVRENPWRUPRXSAR @Bits 12..13 : Override enable of PwrupRxSar */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXSAR_Pos (12UL) /*!< Position of OVRENPWRUPRXSAR field.                      */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXSAR_Msk (0x3UL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXSAR_Pos) /*!< Bit
                                                                            mask of OVRENPWRUPRXSAR field.*/                      

/* OVRENPWRUPRXPKD @Bit 14 : Override enable of PwrupRxPkd */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXPKD_Pos (14UL) /*!< Position of OVRENPWRUPRXPKD field.                      */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXPKD_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXPKD_Pos) /*!< Bit
                                                                            mask of OVRENPWRUPRXPKD field.*/                      

/* OVRENARSTADC @Bit 15 : Override enable of ArstAdc */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENARSTADC_Pos (15UL) /*!< Position of OVRENARSTADC field.                            */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENARSTADC_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENARSTADC_Pos) /*!< Bit mask
                                                                            of OVRENARSTADC field.*/                              

/* OVRENPWRUPTXLDO @Bits 16..21 : Override enable of PwrupTxLdo */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPTXLDO_Pos (16UL) /*!< Position of OVRENPWRUPTXLDO field.                      */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPTXLDO_Msk (0x3FUL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPTXLDO_Pos) /*!< Bit
                                                                            mask of OVRENPWRUPTXLDO field.*/                      

/* OVRENPWRUPTX @Bit 22 : Override enable of PwrupTx */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPTX_Pos (22UL) /*!< Position of OVRENPWRUPTX field.                            */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPTX_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPTX_Pos) /*!< Bit mask
                                                                            of OVRENPWRUPTX field.*/                              

/* OVRENPWRUPTXPWRCTRL @Bit 23 : Override enable of PwrupTxPwrCtrl */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPTXPWRCTRL_Pos (23UL) /*!< Position of OVRENPWRUPTXPWRCTRL field.              */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPTXPWRCTRL_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPTXPWRCTRL_Pos)
                                                                            /*!< Bit mask of OVRENPWRUPTXPWRCTRL field.*/         

/* OVRENPWRUPTXPA @Bit 24 : Override enable of PwrupTxPa */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPTXPA_Pos (24UL) /*!< Position of OVRENPWRUPTXPA field.                        */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPTXPA_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPTXPA_Pos) /*!< Bit
                                                                            mask of OVRENPWRUPTXPA field.*/                       

/* OVRENPWRUPEXTLNA @Bit 25 : Override enable of PwrupExtLna */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPEXTLNA_Pos (25UL) /*!< Position of OVRENPWRUPEXTLNA field.                    */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPEXTLNA_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPEXTLNA_Pos) /*!<
                                                                            Bit mask of OVRENPWRUPEXTLNA field.*/                 

/* OVRENPWRUPEXTPA @Bit 26 : Override enable of PwrupExtPa */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPEXTPA_Pos (26UL) /*!< Position of OVRENPWRUPEXTPA field.                      */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPEXTPA_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPEXTPA_Pos) /*!< Bit
                                                                            mask of OVRENPWRUPEXTPA field.*/                      

/* OVRENSETRXIF @Bit 27 : Override enable of setRxIf */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENSETRXIF_Pos (27UL) /*!< Position of OVRENSETRXIF field.                            */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENSETRXIF_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENSETRXIF_Pos) /*!< Bit mask
                                                                            of OVRENSETRXIF field.*/                              

/* OVRENRXAGCEN @Bit 28 : Override enable of rxAgcEn */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENRXAGCEN_Pos (28UL) /*!< Position of OVRENRXAGCEN field.                            */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENRXAGCEN_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENRXAGCEN_Pos) /*!< Bit mask
                                                                            of OVRENRXAGCEN field.*/                              

/* OVRENRXDIGEN @Bit 29 : Override enable of rxDigEn */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENRXDIGEN_Pos (29UL) /*!< Position of OVRENRXDIGEN field.                            */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENRXDIGEN_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENRXDIGEN_Pos) /*!< Bit mask
                                                                            of OVRENRXDIGEN field.*/                              

/* OVRENPWRUPRXLNAPDET @Bit 30 : Override enable of PwrupRxLnaPdet */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXLNAPDET_Pos (30UL) /*!< Position of OVRENPWRUPRXLNAPDET field.              */
  #define RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXLNAPDET_Msk (0x1UL << RADIO_TIMINGENGINE_OVRENRXTX_OVRENPWRUPRXLNAPDET_Pos)
                                                                            /*!< Bit mask of OVRENPWRUPRXLNAPDET field.*/         


/* RADIO_TIMINGENGINE_OVRVALALL: Set override values on signals */
  #define RADIO_TIMINGENGINE_OVRVALALL_ResetValue (0x00000000UL) /*!< Reset value of OVRVALALL register.                       */

/* OVRVALRETAINRADIO @Bit 0 : Override value of RetainRadio */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALRETAINRADIO_Pos (0UL) /*!< Position of OVRVALRETAINRADIO field.                   */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALRETAINRADIO_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALALL_OVRVALRETAINRADIO_Pos) /*!<
                                                                            Bit mask of OVRVALRETAINRADIO field.*/                

/* OVRVALPWRUPRADIO @Bits 1..2 : Override value of PwrupRadio */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPRADIO_Pos (1UL) /*!< Position of OVRVALPWRUPRADIO field.                     */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPRADIO_Msk (0x3UL << RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPRADIO_Pos) /*!<
                                                                            Bit mask of OVRVALPWRUPRADIO field.*/                 

