adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* OVRVALFSSTART @Bit 27 : Override value of FsStart */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALFSSTART_Pos (27UL) /*!< Position of OVRVALFSSTART field.                          */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALFSSTART_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALALL_OVRVALFSSTART_Pos) /*!< Bit mask
                                                                            of OVRVALFSSTART field.*/                             

/* OVRVALPWRUPRXTXREF @Bits 28..30 : Override value of PwrupRxTxRef */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPRXTXREF_Pos (28UL) /*!< Position of OVRVALPWRUPRXTXREF field.                */
  #define RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPRXTXREF_Msk (0x7UL << RADIO_TIMINGENGINE_OVRVALALL_OVRVALPWRUPRXTXREF_Pos)
                                                                            /*!< Bit mask of OVRVALPWRUPRXTXREF field.*/          


/* RADIO_TIMINGENGINE_OVRVALRXTX: Set override values on signals */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_ResetValue (0x00000000UL) /*!< Reset value of OVRVALRXTX register.                     */

/* OVRVALRSTRXLS @Bits 0..1 : Override value of RstRxLs */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALRSTRXLS_Pos (0UL) /*!< Position of OVRVALRSTRXLS field.                          */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALRSTRXLS_Msk (0x3UL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALRSTRXLS_Pos) /*!< Bit
                                                                            mask of OVRVALRSTRXLS field.*/                        

/* OVRVALPWRUPRXLDO @Bits 2..7 : Override value of PwrupRxLdo */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXLDO_Pos (2UL) /*!< Position of OVRVALPWRUPRXLDO field.                    */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXLDO_Msk (0x3FUL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXLDO_Pos) /*!<
                                                                            Bit mask of OVRVALPWRUPRXLDO field.*/                 

/* OVRVALPWRUPRXLNA @Bit 8 : Override value of PwrupRxLna */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXLNA_Pos (8UL) /*!< Position of OVRVALPWRUPRXLNA field.                    */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXLNA_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXLNA_Pos) /*!<
                                                                            Bit mask of OVRVALPWRUPRXLNA field.*/                 

/* OVRVALPWRUPRXMIX @Bit 9 : Override value of PwrupRxMix */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXMIX_Pos (9UL) /*!< Position of OVRVALPWRUPRXMIX field.                    */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXMIX_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXMIX_Pos) /*!<
                                                                            Bit mask of OVRVALPWRUPRXMIX field.*/                 

/* OVRVALPWRUPRX @Bit 10 : Override value of PwrupRx */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRX_Pos (10UL) /*!< Position of OVRVALPWRUPRX field.                         */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRX_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRX_Pos) /*!< Bit
                                                                            mask of OVRVALPWRUPRX field.*/                        

/* OVRVALPWRUPRXAAF @Bit 11 : Override value of PwrupRxAaf */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXAAF_Pos (11UL) /*!< Position of OVRVALPWRUPRXAAF field.                   */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXAAF_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXAAF_Pos) /*!<
                                                                            Bit mask of OVRVALPWRUPRXAAF field.*/                 

/* OVRVALPWRUPRXSAR @Bits 12..13 : Override value of PwrupRxSar */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXSAR_Pos (12UL) /*!< Position of OVRVALPWRUPRXSAR field.                   */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXSAR_Msk (0x3UL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXSAR_Pos) /*!<
                                                                            Bit mask of OVRVALPWRUPRXSAR field.*/                 

/* OVRVALPWRUPRXPKD @Bit 14 : Override value of PwrupRxPkd */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXPKD_Pos (14UL) /*!< Position of OVRVALPWRUPRXPKD field.                   */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXPKD_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPRXPKD_Pos) /*!<
                                                                            Bit mask of OVRVALPWRUPRXPKD field.*/                 

/* OVRVALARSTADC @Bit 15 : Override value of ArstAdc */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALARSTADC_Pos (15UL) /*!< Position of OVRVALARSTADC field.                         */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALARSTADC_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALARSTADC_Pos) /*!< Bit
                                                                            mask of OVRVALARSTADC field.*/                        

/* OVRVALPWRUPTXLDO @Bits 16..21 : Override value of PwrupTxLdo */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPTXLDO_Pos (16UL) /*!< Position of OVRVALPWRUPTXLDO field.                   */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPTXLDO_Msk (0x3FUL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPTXLDO_Pos) /*!<
                                                                            Bit mask of OVRVALPWRUPTXLDO field.*/                 

/* OVRVALPWRUPTX @Bit 22 : Override value of PwrupTx */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPTX_Pos (22UL) /*!< Position of OVRVALPWRUPTX field.                         */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPTX_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPTX_Pos) /*!< Bit
                                                                            mask of OVRVALPWRUPTX field.*/                        

/* OVRVALPWRUPTXPWRCTRL @Bit 23 : Override value of PwrupTxPwrCtrl */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPTXPWRCTRL_Pos (23UL) /*!< Position of OVRVALPWRUPTXPWRCTRL field.           */
  #define RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPTXPWRCTRL_Msk (0x1UL << RADIO_TIMINGENGINE_OVRVALRXTX_OVRVALPWRUPTXPWRCTRL_Pos)
                                                                            /*!< Bit mask of OVRVALPWRUPTXPWRCTRL field.*/        

