adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* COEFF1 @Bits 0..5 : Signed filter coefficient 1 */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS1_COEFF1_Pos (0UL) /*!< Position of COEFF1 field.                                     */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS1_COEFF1_Msk (0x3FUL << RADIO_DECFILTERS_DECFIR1_COEFFS1_COEFF1_Pos) /*!< Bit mask of
                                                                            COEFF1 field.*/                                       


/* RADIO_DECFILTERS_DECFIR1_COEFFS2: Coefficient register 2 for the PUnit decFIR1 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS2_ResetValue (0x00000018UL) /*!< Reset value of COEFFS2 register.                     */

/* COEFF2 @Bits 0..5 : Signed filter coefficient 2 */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS2_COEFF2_Pos (0UL) /*!< Position of COEFF2 field.                                     */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS2_COEFF2_Msk (0x3FUL << RADIO_DECFILTERS_DECFIR1_COEFFS2_COEFF2_Pos) /*!< Bit mask of
                                                                            COEFF2 field.*/                                       


/* RADIO_DECFILTERS_DECFIR1_COEFFS3: Coefficient register 3 for the PUnit decFIR1 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS3_ResetValue (0x00000010UL) /*!< Reset value of COEFFS3 register.                     */

/* COEFF3 @Bits 0..5 : Signed filter coefficient 3 */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS3_COEFF3_Pos (0UL) /*!< Position of COEFF3 field.                                     */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS3_COEFF3_Msk (0x3FUL << RADIO_DECFILTERS_DECFIR1_COEFFS3_COEFF3_Pos) /*!< Bit mask of
                                                                            COEFF3 field.*/                                       


/* RADIO_DECFILTERS_DECFIR1_COEFFS4: Coefficient register 4 for the PUnit decFIR1 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS4_ResetValue (0x00000000UL) /*!< Reset value of COEFFS4 register.                     */

/* COEFF4 @Bits 0..5 : Signed filter coefficient 4 */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS4_COEFF4_Pos (0UL) /*!< Position of COEFF4 field.                                     */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS4_COEFF4_Msk (0x3FUL << RADIO_DECFILTERS_DECFIR1_COEFFS4_COEFF4_Pos) /*!< Bit mask of
                                                                            COEFF4 field.*/                                       


/* RADIO_DECFILTERS_DECFIR1_COEFFS5: Coefficient register 5 for the PUnit decFIR1 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS5_ResetValue (0x00000000UL) /*!< Reset value of COEFFS5 register.                     */

/* COEFF5 @Bits 0..5 : Signed filter coefficient 5 */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS5_COEFF5_Pos (0UL) /*!< Position of COEFF5 field.                                     */
  #define RADIO_DECFILTERS_DECFIR1_COEFFS5_COEFF5_Msk (0x3FUL << RADIO_DECFILTERS_DECFIR1_COEFFS5_COEFF5_Pos) /*!< Bit mask of
                                                                            COEFF5 field.*/                                       



/* ============================================= Struct RADIO_DECFILTERS_DECFIR2 ============================================= */
/**
  * @brief DECFIR2 [RADIO_DECFILTERS_DECFIR2] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CKSEL;                             /*!< (@ 0x00000000) Clock select register for the PUnit decFIR2 of type
                                                                         IP_FIR*/                                                 
  __IOM uint32_t  CONTROL;                           /*!< (@ 0x00000004) Control register for the PUnit decFIR2 of type IP_FIR */
  __IOM uint32_t  COEFFS0;                           /*!< (@ 0x00000008) Coefficient register 0 for the PUnit decFIR2 of type
                                                                         IP_FIR*/                                                 
  __IOM uint32_t  COEFFS1;                           /*!< (@ 0x0000000C) Coefficient register 1 for the PUnit decFIR2 of type
                                                                         IP_FIR*/                                                 
  __IOM uint32_t  COEFFS2;                           /*!< (@ 0x00000010) Coefficient register 2 for the PUnit decFIR2 of type
                                                                         IP_FIR*/                                                 
  __IOM uint32_t  COEFFS3;                           /*!< (@ 0x00000014) Coefficient register 3 for the PUnit decFIR2 of type
                                                                         IP_FIR*/                                                 
  __IOM uint32_t  COEFFS4;                           /*!< (@ 0x00000018) Coefficient register 4 for the PUnit decFIR2 of type
                                                                         IP_FIR*/                                                 
  __IOM uint32_t  COEFFS5;                           /*!< (@ 0x0000001C) Coefficient register 5 for the PUnit decFIR2 of type
                                                                         IP_FIR*/                                                 
} NRF_RADIO_DECFILTERS_DECFIR2_Type;                 /*!< Size = 32 (0x020)                                                    */

/* RADIO_DECFILTERS_DECFIR2_CKSEL: Clock select register for the PUnit decFIR2 of type IP_FIR */
  #define RADIO_DECFILTERS_DECFIR2_CKSEL_ResetValue (0x00000001UL) /*!< Reset value of CKSEL register.                         */

/* CKSEL @Bits 0..2 : Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is
                      disabled and data out is assigned directly from data in. */                                                 
                                                                                                                                  
