adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* =========================================== Struct RADIO_CHANNELFILTERS_OUTMAIN =========================================== */
/**
  * @brief OUTMAIN [RADIO_CHANNELFILTERS_OUTMAIN] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CKSEL;                             /*!< (@ 0x00000000) Clock select register for the output outMain          */
  __IOM uint32_t  SOURCE;                            /*!< (@ 0x00000004) Source select register for the output outMain         */
} NRF_RADIO_CHANNELFILTERS_OUTMAIN_Type;             /*!< Size = 8 (0x008)                                                     */

/* RADIO_CHANNELFILTERS_OUTMAIN_CKSEL: Clock select register for the output outMain */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_ResetValue (0x00000002UL) /*!< Reset value of CKSEL register.                     */

/* CKSEL @Bits 0..2 : Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is
                      disabled and data out is assigned directly from data in. */                                                 
                                                                                                                                  
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_Pos (0UL) /*!< Position of CKSEL field.                                     */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_Msk (0x7UL << RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_Pos) /*!< Bit mask of
                                                                            CKSEL field.*/                                        
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_Min (0x0UL) /*!< Min enumerator value of CKSEL field.                       */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_Max (0x7UL) /*!< Max enumerator value of CKSEL field.                       */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel32M (0x0UL) /*!< CKSEL_32M                                            */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel16M (0x1UL) /*!< CKSEL_16M                                            */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel8M (0x2UL) /*!< CKSEL_8M                                              */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel4M (0x3UL) /*!< CKSEL_4M                                              */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel2M (0x4UL) /*!< CKSEL_2M                                              */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel1M (0x5UL) /*!< CKSEL_1M                                              */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSel500K (0x6UL) /*!< CKSEL_500K                                          */
  #define RADIO_CHANNELFILTERS_OUTMAIN_CKSEL_CKSEL_ClkSelBypass (0x7UL) /*!< CKSEL_BYPASS                                      */


/* RADIO_CHANNELFILTERS_OUTMAIN_SOURCE: Source select register for the output outMain */
  #define RADIO_CHANNELFILTERS_OUTMAIN_SOURCE_ResetValue (0x00000004UL) /*!< Reset value of SOURCE register.                   */

/* SOURCE @Bits 0..3 : Data source select */
  #define RADIO_CHANNELFILTERS_OUTMAIN_SOURCE_SOURCE_Pos (0UL) /*!< Position of SOURCE field.                                  */
  #define RADIO_CHANNELFILTERS_OUTMAIN_SOURCE_SOURCE_Msk (0xFUL << RADIO_CHANNELFILTERS_OUTMAIN_SOURCE_SOURCE_Pos) /*!< Bit mask
                                                                            of SOURCE field.*/                                    
  #define RADIO_CHANNELFILTERS_OUTMAIN_SOURCE_SOURCE_Min (0x0UL) /*!< Min enumerator value of SOURCE field.                    */
  #define RADIO_CHANNELFILTERS_OUTMAIN_SOURCE_SOURCE_Max (0xFUL) /*!< Max enumerator value of SOURCE field.                    */
  #define RADIO_CHANNELFILTERS_OUTMAIN_SOURCE_SOURCE_SrcInMain (0xFUL) /*!< SRC_INMAIN (NOT LEGAL)                             */
  #define RADIO_CHANNELFILTERS_OUTMAIN_SOURCE_SOURCE_SrcIIR0 (0x0UL) /*!< SRC_IIR0 (NOT LEGAL)                                 */
  #define RADIO_CHANNELFILTERS_OUTMAIN_SOURCE_SOURCE_SrcIIR1 (0x1UL) /*!< SRC_IIR1 (NOT LEGAL)                                 */
  #define RADIO_CHANNELFILTERS_OUTMAIN_SOURCE_SOURCE_SrcNotchIIR0 (0x2UL) /*!< SRC_NOTCHIIR0 (NOT LEGAL)                       */
  #define RADIO_CHANNELFILTERS_OUTMAIN_SOURCE_SOURCE_SrcNotchIIR1 (0x3UL) /*!< SRC_NOTCHIIR1                                   */
  #define RADIO_CHANNELFILTERS_OUTMAIN_SOURCE_SOURCE_SrcDecFIR (0x4UL) /*!< SRC_DECFIR                                         */



/* ========================================= Struct RADIO_CHANNELFILTERS_OUTPEAKDET ========================================== */
/**
  * @brief OUTPEAKDET [RADIO_CHANNELFILTERS_OUTPEAKDET] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CKSEL;                             /*!< (@ 0x00000000) Clock select register for the output outPeakDet       */
  __IOM uint32_t  SOURCE;                            /*!< (@ 0x00000004) Source select register for the output outPeakDet      */
} NRF_RADIO_CHANNELFILTERS_OUTPEAKDET_Type;          /*!< Size = 8 (0x008)                                                     */

/* RADIO_CHANNELFILTERS_OUTPEAKDET_CKSEL: Clock select register for the output outPeakDet */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_CKSEL_ResetValue (0x00000002UL) /*!< Reset value of CKSEL register.                  */

/* CKSEL @Bits 0..2 : Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is
                      disabled and data out is assigned directly from data in. */                                                 
                                                                                                                                  
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_CKSEL_CKSEL_Pos (0UL) /*!< Position of CKSEL field.                                  */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_CKSEL_CKSEL_Msk (0x7UL << RADIO_CHANNELFILTERS_OUTPEAKDET_CKSEL_CKSEL_Pos) /*!< Bit
                                                                            mask of CKSEL field.*/                                
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_CKSEL_CKSEL_Min (0x0UL) /*!< Min enumerator value of CKSEL field.                    */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_CKSEL_CKSEL_Max (0x7UL) /*!< Max enumerator value of CKSEL field.                    */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_CKSEL_CKSEL_ClkSel32M (0x0UL) /*!< CKSEL_32M                                         */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_CKSEL_CKSEL_ClkSel16M (0x1UL) /*!< CKSEL_16M                                         */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_CKSEL_CKSEL_ClkSel8M (0x2UL) /*!< CKSEL_8M                                           */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_CKSEL_CKSEL_ClkSel4M (0x3UL) /*!< CKSEL_4M                                           */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_CKSEL_CKSEL_ClkSel2M (0x4UL) /*!< CKSEL_2M                                           */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_CKSEL_CKSEL_ClkSel1M (0x5UL) /*!< CKSEL_1M                                           */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_CKSEL_CKSEL_ClkSel500K (0x6UL) /*!< CKSEL_500K                                       */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_CKSEL_CKSEL_ClkSelBypass (0x7UL) /*!< CKSEL_BYPASS                                   */


/* RADIO_CHANNELFILTERS_OUTPEAKDET_SOURCE: Source select register for the output outPeakDet */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_SOURCE_ResetValue (0x00000003UL) /*!< Reset value of SOURCE register.                */

/* SOURCE @Bits 0..3 : Data source select */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_SOURCE_SOURCE_Pos (0UL) /*!< Position of SOURCE field.                               */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_SOURCE_SOURCE_Msk (0xFUL << RADIO_CHANNELFILTERS_OUTPEAKDET_SOURCE_SOURCE_Pos) /*!<
                                                                            Bit mask of SOURCE field.*/                           
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_SOURCE_SOURCE_Min (0x0UL) /*!< Min enumerator value of SOURCE field.                 */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_SOURCE_SOURCE_Max (0xFUL) /*!< Max enumerator value of SOURCE field.                 */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_SOURCE_SOURCE_SrcInMain (0xFUL) /*!< SRC_INMAIN (NOT LEGAL)                          */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_SOURCE_SOURCE_SrcIIR0 (0x0UL) /*!< SRC_IIR0 (NOT LEGAL)                              */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_SOURCE_SOURCE_SrcIIR1 (0x1UL) /*!< SRC_IIR1 (NOT LEGAL)                              */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_SOURCE_SOURCE_SrcNotchIIR0 (0x2UL) /*!< SRC_NOTCHIIR0 (NOT LEGAL)                    */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_SOURCE_SOURCE_SrcNotchIIR1 (0x3UL) /*!< SRC_NOTCHIIR1                                */
  #define RADIO_CHANNELFILTERS_OUTPEAKDET_SOURCE_SOURCE_SrcDecFIR (0x4UL) /*!< SRC_DECFIR                                      */



/* ============================================ Struct RADIO_CHANNELFILTERS_IIR0 ============================================= */
/**
  * @brief IIR0 [RADIO_CHANNELFILTERS_IIR0] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CKSEL;                             /*!< (@ 0x00000000) Clock select register for the PUnit IIR0 of type
                                                                         IP_IIR2*/                                                
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000004) Status register for the PUnit IIR0 of type IP_IIR2    */
  __IOM uint32_t  COEFFSB0;                          /*!< (@ 0x00000008) Coefficient register B0 for the PUnit IIR0 of type
                                                                         IP_IIR2*/                                                
  __IOM uint32_t  COEFFSB1;                          /*!< (@ 0x0000000C) Coefficient register B1 for the PUnit IIR0 of type
                                                                         IP_IIR2*/                                                
  __IOM uint32_t  COEFFSB2;                          /*!< (@ 0x00000010) Coefficient register B2 for the PUnit IIR0 of type
                                                                         IP_IIR2*/                                                
  __IOM uint32_t  COEFFSA1;                          /*!< (@ 0x00000014) Coefficient register A1 for the PUnit IIR0 of type
                                                                         IP_IIR2*/                                                
  __IOM uint32_t  COEFFSA2;                          /*!< (@ 0x00000018) Coefficient register A2 for the PUnit IIR0 of type
                                                                         IP_IIR2*/                                                
} NRF_RADIO_CHANNELFILTERS_IIR0_Type;                /*!< Size = 28 (0x01C)                                                    */

