adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_CHANNELFILTERS_DECFIR_COEFFS0: Coefficient register 0 for the PUnit decFIR of type IP_FIR */
  #define RADIO_CHANNELFILTERS_DECFIR_COEFFS0_ResetValue (0x00000008UL) /*!< Reset value of COEFFS0 register.                  */

/* COEFF0 @Bits 0..5 : Signed filter coefficient 0 */
  #define RADIO_CHANNELFILTERS_DECFIR_COEFFS0_COEFF0_Pos (0UL) /*!< Position of COEFF0 field.                                  */
  #define RADIO_CHANNELFILTERS_DECFIR_COEFFS0_COEFF0_Msk (0x3FUL << RADIO_CHANNELFILTERS_DECFIR_COEFFS0_COEFF0_Pos) /*!< Bit
                                                                            mask of COEFF0 field.*/                               


/* RADIO_CHANNELFILTERS_DECFIR_COEFFS1: Coefficient register 1 for the PUnit decFIR of type IP_FIR */
  #define RADIO_CHANNELFILTERS_DECFIR_COEFFS1_ResetValue (0x00000010UL) /*!< Reset value of COEFFS1 register.                  */

/* COEFF1 @Bits 0..5 : Signed filter coefficient 1 */
  #define RADIO_CHANNELFILTERS_DECFIR_COEFFS1_COEFF1_Pos (0UL) /*!< Position of COEFF1 field.                                  */
  #define RADIO_CHANNELFILTERS_DECFIR_COEFFS1_COEFF1_Msk (0x3FUL << RADIO_CHANNELFILTERS_DECFIR_COEFFS1_COEFF1_Pos) /*!< Bit
                                                                            mask of COEFF1 field.*/                               


/* RADIO_CHANNELFILTERS_DECFIR_COEFFS2: Coefficient register 2 for the PUnit decFIR of type IP_FIR */
  #define RADIO_CHANNELFILTERS_DECFIR_COEFFS2_ResetValue (0x00000018UL) /*!< Reset value of COEFFS2 register.                  */

/* COEFF2 @Bits 0..5 : Signed filter coefficient 2 */
  #define RADIO_CHANNELFILTERS_DECFIR_COEFFS2_COEFF2_Pos (0UL) /*!< Position of COEFF2 field.                                  */
  #define RADIO_CHANNELFILTERS_DECFIR_COEFFS2_COEFF2_Msk (0x3FUL << RADIO_CHANNELFILTERS_DECFIR_COEFFS2_COEFF2_Pos) /*!< Bit
                                                                            mask of COEFF2 field.*/                               


/* RADIO_CHANNELFILTERS_DECFIR_COEFFS3: Coefficient register 3 for the PUnit decFIR of type IP_FIR */
  #define RADIO_CHANNELFILTERS_DECFIR_COEFFS3_ResetValue (0x00000010UL) /*!< Reset value of COEFFS3 register.                  */

/* COEFF3 @Bits 0..5 : Signed filter coefficient 3 */
  #define RADIO_CHANNELFILTERS_DECFIR_COEFFS3_COEFF3_Pos (0UL) /*!< Position of COEFF3 field.                                  */
  #define RADIO_CHANNELFILTERS_DECFIR_COEFFS3_COEFF3_Msk (0x3FUL << RADIO_CHANNELFILTERS_DECFIR_COEFFS3_COEFF3_Pos) /*!< Bit
                                                                            mask of COEFF3 field.*/                               


/* RADIO_CHANNELFILTERS_DECFIR_COEFFS4: Coefficient register 4 for the PUnit decFIR of type IP_FIR */
  #define RADIO_CHANNELFILTERS_DECFIR_COEFFS4_ResetValue (0x00000000UL) /*!< Reset value of COEFFS4 register.                  */

/* COEFF4 @Bits 0..5 : Signed filter coefficient 4 */
  #define RADIO_CHANNELFILTERS_DECFIR_COEFFS4_COEFF4_Pos (0UL) /*!< Position of COEFF4 field.                                  */
  #define RADIO_CHANNELFILTERS_DECFIR_COEFFS4_COEFF4_Msk (0x3FUL << RADIO_CHANNELFILTERS_DECFIR_COEFFS4_COEFF4_Pos) /*!< Bit
                                                                            mask of COEFF4 field.*/                               


/* RADIO_CHANNELFILTERS_DECFIR_COEFFS5: Coefficient register 5 for the PUnit decFIR of type IP_FIR */
  #define RADIO_CHANNELFILTERS_DECFIR_COEFFS5_ResetValue (0x00000000UL) /*!< Reset value of COEFFS5 register.                  */

/* COEFF5 @Bits 0..5 : Signed filter coefficient 5 */
  #define RADIO_CHANNELFILTERS_DECFIR_COEFFS5_COEFF5_Pos (0UL) /*!< Position of COEFF5 field.                                  */
  #define RADIO_CHANNELFILTERS_DECFIR_COEFFS5_COEFF5_Msk (0x3FUL << RADIO_CHANNELFILTERS_DECFIR_COEFFS5_COEFF5_Pos) /*!< Bit
                                                                            mask of COEFF5 field.*/                               



/* =============================================== Struct RADIO_CHANNELFILTERS =============================================== */
/**
  * @brief CHANNELFILTERS [RADIO_CHANNELFILTERS] (unspecified)
  */
typedef struct {
  __IOM NRF_RADIO_CHANNELFILTERS_OUTMAIN_Type OUTMAIN; /*!< (@ 0x00000000) (unspecified)                                       */
  __IOM NRF_RADIO_CHANNELFILTERS_OUTPEAKDET_Type OUTPEAKDET; /*!< (@ 0x00000008) (unspecified)                                 */
  __IOM NRF_RADIO_CHANNELFILTERS_IIR0_Type IIR0;     /*!< (@ 0x00000010) (unspecified)                                         */
  __IOM NRF_RADIO_CHANNELFILTERS_IIR1_Type IIR1;     /*!< (@ 0x0000002C) (unspecified)                                         */
  __IOM NRF_RADIO_CHANNELFILTERS_NOTCHIIR0_Type NOTCHIIR0; /*!< (@ 0x00000048) (unspecified)                                   */
  __IOM NRF_RADIO_CHANNELFILTERS_NOTCHIIR1_Type NOTCHIIR1; /*!< (@ 0x00000068) (unspecified)                                   */
  __IOM NRF_RADIO_CHANNELFILTERS_DECFIR_Type DECFIR; /*!< (@ 0x00000084) (unspecified)                                         */
} NRF_RADIO_CHANNELFILTERS_Type;                     /*!< Size = 168 (0x0A8)                                                   */


/* ==================================================== Struct RADIO_PSEL ==================================================== */
/**
  * @brief PSEL [RADIO_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DFEGPIO[8];                        /*!< (@ 0x00000000) Pin select for DFE pin n                              */
} NRF_RADIO_PSEL_Type;                               /*!< Size = 32 (0x020)                                                    */

/* RADIO_PSEL_DFEGPIO: Pin select for DFE pin n */
  #define RADIO_PSEL_DFEGPIO_MaxCount (8UL)          /*!< Max size of DFEGPIO[8] array.                                        */
  #define RADIO_PSEL_DFEGPIO_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DFEGPIO[8] register.                                */

/* PIN @Bits 0..4 : Pin number */
  #define RADIO_PSEL_DFEGPIO_PIN_Pos (0UL)           /*!< Position of PIN field.                                               */
  #define RADIO_PSEL_DFEGPIO_PIN_Msk (0x1FUL << RADIO_PSEL_DFEGPIO_PIN_Pos) /*!< Bit mask of PIN field.                        */
  #define RADIO_PSEL_DFEGPIO_PIN_Min (0x0UL)         /*!< Min value of PIN field.                                              */
  #define RADIO_PSEL_DFEGPIO_PIN_Max (0x1FUL)        /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define RADIO_PSEL_DFEGPIO_PORT_Pos (5UL)          /*!< Position of PORT field.                                              */
  #define RADIO_PSEL_DFEGPIO_PORT_Msk (0xFUL << RADIO_PSEL_DFEGPIO_PORT_Pos) /*!< Bit mask of PORT field.                      */
  #define RADIO_PSEL_DFEGPIO_PORT_Min (0x0UL)        /*!< Min value of PORT field.                                             */
  #define RADIO_PSEL_DFEGPIO_PORT_Max (0x1UL)        /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define RADIO_PSEL_DFEGPIO_CONNECT_Pos (31UL)      /*!< Position of CONNECT field.                                           */
  #define RADIO_PSEL_DFEGPIO_CONNECT_Msk (0x1UL << RADIO_PSEL_DFEGPIO_CONNECT_Pos) /*!< Bit mask of CONNECT field.             */
  #define RADIO_PSEL_DFEGPIO_CONNECT_Min (0x0UL)     /*!< Min enumerator value of CONNECT field.                               */
  #define RADIO_PSEL_DFEGPIO_CONNECT_Max (0x1UL)     /*!< Max enumerator value of CONNECT field.                               */
  #define RADIO_PSEL_DFEGPIO_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                      */
  #define RADIO_PSEL_DFEGPIO_CONNECT_Connected (0x0UL) /*!< Connect                                                            */



/* ================================================= Struct RADIO_DFEPACKET ================================================== */
/**
  * @brief DFEPACKET [RADIO_DFEPACKET] DFE packet EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Data pointer                                          */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000004) Maximum number of bytes to transfer                   */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x00000008) Number of bytes transferred in the last transaction   */
  __IOM uint32_t  ENABLE;                            /*!< (@ 0x0000000C) (unspecified)                                         */
} NRF_RADIO_DFEPACKET_Type;                          /*!< Size = 16 (0x010)                                                    */

/* RADIO_DFEPACKET_PTR: Data pointer */
  #define RADIO_DFEPACKET_PTR_ResetValue (0x01000000UL) /*!< Reset value of PTR register.                                      */

/* OFFSET @Bits 0..15 : Data pointer */
  #define RADIO_DFEPACKET_PTR_OFFSET_Pos (0UL)       /*!< Position of OFFSET field.                                            */
  #define RADIO_DFEPACKET_PTR_OFFSET_Msk (0xFFFFUL << RADIO_DFEPACKET_PTR_OFFSET_Pos) /*!< Bit mask of OFFSET field.           */

/* BASE @Bit 29 : (unspecified) */
  #define RADIO_DFEPACKET_PTR_BASE_Pos (29UL)        /*!< Position of BASE field.                                              */
  #define RADIO_DFEPACKET_PTR_BASE_Msk (0x1UL << RADIO_DFEPACKET_PTR_BASE_Pos) /*!< Bit mask of BASE field.                    */


/* RADIO_DFEPACKET_MAXCNT: Maximum number of bytes to transfer */
  #define RADIO_DFEPACKET_MAXCNT_ResetValue (0x00004000UL) /*!< Reset value of MAXCNT register.                                */

/* MAXCNT @Bits 0..15 : Maximum number of bytes to transfer */
  #define RADIO_DFEPACKET_MAXCNT_MAXCNT_Pos (0UL)    /*!< Position of MAXCNT field.                                            */
  #define RADIO_DFEPACKET_MAXCNT_MAXCNT_Msk (0xFFFFUL << RADIO_DFEPACKET_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.     */


/* RADIO_DFEPACKET_AMOUNT: Number of bytes transferred in the last transaction */
  #define RADIO_DFEPACKET_AMOUNT_ResetValue (0x00000000UL) /*!< Reset value of AMOUNT register.                                */

/* AMOUNT @Bits 0..15 : Number of bytes transferred in the last transaction */
  #define RADIO_DFEPACKET_AMOUNT_AMOUNT_Pos (0UL)    /*!< Position of AMOUNT field.                                            */
  #define RADIO_DFEPACKET_AMOUNT_AMOUNT_Msk (0xFFFFUL << RADIO_DFEPACKET_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.     */


/* RADIO_DFEPACKET_ENABLE: (unspecified) */
  #define RADIO_DFEPACKET_ENABLE_ResetValue (0x00000000UL) /*!< Reset value of ENABLE register.                                */

/* ENABLE @Bit 0 : (unspecified) */
  #define RADIO_DFEPACKET_ENABLE_ENABLE_Pos (0UL)    /*!< Position of ENABLE field.                                            */
  #define RADIO_DFEPACKET_ENABLE_ENABLE_Msk (0x1UL << RADIO_DFEPACKET_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.        */
  #define RADIO_DFEPACKET_ENABLE_ENABLE_Min (0x0UL)  /*!< Min enumerator value of ENABLE field.                                */
  #define RADIO_DFEPACKET_ENABLE_ENABLE_Max (0x1UL)  /*!< Max enumerator value of ENABLE field.                                */
  #define RADIO_DFEPACKET_ENABLE_ENABLE_Disabled (0x1UL) /*!< Disable                                                          */
  #define RADIO_DFEPACKET_ENABLE_ENABLE_Enabled (0x0UL) /*!< Enable                                                            */



