adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* =================================================== Struct RADIO_LBMAC ==================================================== */
/**
  * @brief LBMAC [RADIO_LBMAC] (unspecified)
  */
typedef struct {
  __OM  uint32_t  CNTPSTART;                         /*!< (@ 0x00000000) Start packet counter                                  */
  __OM  uint32_t  CNTPSTOP;                          /*!< (@ 0x00000004) Stop packet counter                                   */
  __OM  uint32_t  CNTPCLEAR;                         /*!< (@ 0x00000008) Clear packet counter                                  */
  __IM  uint32_t  CRCSTATUS;                         /*!< (@ 0x0000000C) CRC status                                            */
  __IM  uint32_t  RXMATCH;                           /*!< (@ 0x00000010) Received address                                      */
  __IM  uint32_t  RXCRC;                             /*!< (@ 0x00000014) CRC field of previously received packet               */
  __IM  uint32_t  DAI;                               /*!< (@ 0x00000018) Device address match index                            */
  __IM  uint32_t  PDUSTAT;                           /*!< (@ 0x0000001C) Payload status                                        */
  __IOM uint32_t  PCNF0;                             /*!< (@ 0x00000020) Packet configuration register 0                       */
  __IOM uint32_t  PCNF0SEC;                          /*!< (@ 0x00000024) Packet configuration register 0 in concurrent receive
                                                                         mode in BLE LR*/                                         
  __IOM uint32_t  PCNF1;                             /*!< (@ 0x00000028) Packet configuration register 1                       */
  __IOM uint32_t  BASE0;                             /*!< (@ 0x0000002C) Base address 0                                        */
  __IOM uint32_t  BASE1;                             /*!< (@ 0x00000030) Base address 1                                        */
  __IOM uint32_t  PREFIX0;                           /*!< (@ 0x00000034) Prefixes bytes for logical addresses 0-3              */
  __IOM uint32_t  PREFIX1;                           /*!< (@ 0x00000038) Prefixes bytes for logical addresses 4-7              */
  __IOM uint32_t  TXADDRESS;                         /*!< (@ 0x0000003C) Transmit address select                               */
  __IOM uint32_t  RXADDRESSES;                       /*!< (@ 0x00000040) Receive address select                                */
  __IOM uint32_t  CRCCNF;                            /*!< (@ 0x00000044) CRC configuration                                     */
  __IOM uint32_t  CRCPOLY;                           /*!< (@ 0x00000048) CRC polynomial                                        */
  __IOM uint32_t  CRCINIT;                           /*!< (@ 0x0000004C) CRC initial value                                     */
  __IOM uint32_t  DAB[8];                            /*!< (@ 0x00000050) Device address base segment n                         */
  __IOM uint32_t  DAP[8];                            /*!< (@ 0x00000070) Device address prefix n                               */
  __IOM uint32_t  DACNF;                             /*!< (@ 0x00000090) Device address match configuration                    */
  __IOM uint32_t  BCC;                               /*!< (@ 0x00000094) Bit counter compare                                   */
  __IOM uint32_t  AACHKOVERRIDE;                     /*!< (@ 0x00000098) Address Check Override                                */
  __IM  uint32_t  PACKETCNTR1;                       /*!< (@ 0x0000009C) (unspecified)                                         */
  __IM  uint32_t  PACKETCNTR2;                       /*!< (@ 0x000000A0) (unspecified)                                         */
  __IM  uint32_t  CTESTATUS;                         /*!< (@ 0x000000A4) CTEInfo parsed from received packet                   */
  __IM  uint32_t  HYPSTDCHECKSTAT;                   /*!< (@ 0x000000A8) Address Check Override                                */
  __IM  uint32_t  HYPSTDAADIFFVEC;                   /*!< (@ 0x000000AC) Address Diff Vector                                   */
  __IOM uint32_t  ADDRWINSIZE;                       /*!< (@ 0x000000B0) Address match safe window size (the number of bits
                                                                         after detect is asserted, before starting to look for
                                                                         address match). Only valid when
                                                                         OVERRIDE22.DISABLEADDRWINDOW is '0'.*/                   
  __IOM uint32_t  MHRMATCHCONF;                      /*!< (@ 0x000000B4) Search pattern configuration                          */
  __IOM uint32_t  MHRMATCHMASK;                      /*!< (@ 0x000000B8) Pattern mask                                          */
  __IOM uint32_t  SFD;                               /*!< (@ 0x000000BC) IEEE 802.15.4 start of frame delimiter                */
  __IOM uint32_t  CTEINLINECONF;                     /*!< (@ 0x000000C0) Configuration for CTE inline mode                     */
  __OM  uint32_t  DMASTART;                          /*!< (@ 0x000000C4) (unspecified)                                         */
  __OM  uint32_t  DMASTOP;                           /*!< (@ 0x000000C8) (unspecified)                                         */
  __IOM uint32_t  DMAENABLE;                         /*!< (@ 0x000000CC) (unspecified)                                         */
  __IOM uint32_t  PACKETPTR;                         /*!< (@ 0x000000D0) (unspecified)                                         */
  __IM  uint32_t  DMAAMOUNT;                         /*!< (@ 0x000000D4) (unspecified)                                         */
  __IOM uint32_t  DMAMAXCNT;                         /*!< (@ 0x000000D8) (unspecified)                                         */
} NRF_RADIO_LBMAC_Type;                              /*!< Size = 220 (0x0DC)                                                   */

/* RADIO_LBMAC_CNTPSTART: Start packet counter */
  #define RADIO_LBMAC_CNTPSTART_ResetValue (0x00000000UL) /*!< Reset value of CNTPSTART register.                              */

