adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* S0INCL @Bits 12..13 : Include or exclude S0 field in RAM */
  #define RADIO_LBMAC_PCNF0_S0INCL_Pos (12UL)        /*!< Position of S0INCL field.                                            */
  #define RADIO_LBMAC_PCNF0_S0INCL_Msk (0x3UL << RADIO_LBMAC_PCNF0_S0INCL_Pos) /*!< Bit mask of S0INCL field.                  */
  #define RADIO_LBMAC_PCNF0_S0INCL_Min (0x0UL)       /*!< Min enumerator value of S0INCL field.                                */
  #define RADIO_LBMAC_PCNF0_S0INCL_Max (0x0UL)       /*!< Max enumerator value of S0INCL field.                                */
  #define RADIO_LBMAC_PCNF0_S0INCL_Automatic (0x0UL) /*!< Include S0 field only if S0LEN > 0                                   */

/* S1LEN @Bits 16..19 : Length on air of S1 field in number of bits. */
  #define RADIO_LBMAC_PCNF0_S1LEN_Pos (16UL)         /*!< Position of S1LEN field.                                             */
  #define RADIO_LBMAC_PCNF0_S1LEN_Msk (0xFUL << RADIO_LBMAC_PCNF0_S1LEN_Pos) /*!< Bit mask of S1LEN field.                     */

/* S1INCL @Bits 20..21 : Include or exclude S1 field in RAM */
  #define RADIO_LBMAC_PCNF0_S1INCL_Pos (20UL)        /*!< Position of S1INCL field.                                            */
  #define RADIO_LBMAC_PCNF0_S1INCL_Msk (0x3UL << RADIO_LBMAC_PCNF0_S1INCL_Pos) /*!< Bit mask of S1INCL field.                  */
  #define RADIO_LBMAC_PCNF0_S1INCL_Min (0x0UL)       /*!< Min enumerator value of S1INCL field.                                */
  #define RADIO_LBMAC_PCNF0_S1INCL_Max (0x1UL)       /*!< Max enumerator value of S1INCL field.                                */
  #define RADIO_LBMAC_PCNF0_S1INCL_Automatic (0x0UL) /*!< Include S1 field in RAM only if S1LEN > 0                            */
  #define RADIO_LBMAC_PCNF0_S1INCL_Include (0x1UL)   /*!< Always include S1 field in RAM independent of S1LEN                  */

/* CILEN @Bits 22..23 : Length of code indicator - long range */
  #define RADIO_LBMAC_PCNF0_CILEN_Pos (22UL)         /*!< Position of CILEN field.                                             */
  #define RADIO_LBMAC_PCNF0_CILEN_Msk (0x3UL << RADIO_LBMAC_PCNF0_CILEN_Pos) /*!< Bit mask of CILEN field.                     */

/* PLEN @Bits 24..25 : Length of preamble on air. Decision point: TASKS_START task */
  #define RADIO_LBMAC_PCNF0_PLEN_Pos (24UL)          /*!< Position of PLEN field.                                              */
  #define RADIO_LBMAC_PCNF0_PLEN_Msk (0x3UL << RADIO_LBMAC_PCNF0_PLEN_Pos) /*!< Bit mask of PLEN field.                        */
  #define RADIO_LBMAC_PCNF0_PLEN_Min (0x0UL)         /*!< Min enumerator value of PLEN field.                                  */
  #define RADIO_LBMAC_PCNF0_PLEN_Max (0x3UL)         /*!< Max enumerator value of PLEN field.                                  */
  #define RADIO_LBMAC_PCNF0_PLEN_8bit (0x0UL)        /*!< 8-bit preamble                                                       */
  #define RADIO_LBMAC_PCNF0_PLEN_16bit (0x1UL)       /*!< 16-bit preamble                                                      */
  #define RADIO_LBMAC_PCNF0_PLEN_32bitZero (0x2UL)   /*!< 32-bit zero preamble - used for IEEE 802.15.4                        */
  #define RADIO_LBMAC_PCNF0_PLEN_LongRange (0x3UL)   /*!< Preamble - used for BLE long range                                   */

/* CRCINC @Bit 26 : Indicates if LENGTH field contains CRC or not */
  #define RADIO_LBMAC_PCNF0_CRCINC_Pos (26UL)        /*!< Position of CRCINC field.                                            */
  #define RADIO_LBMAC_PCNF0_CRCINC_Msk (0x1UL << RADIO_LBMAC_PCNF0_CRCINC_Pos) /*!< Bit mask of CRCINC field.                  */
  #define RADIO_LBMAC_PCNF0_CRCINC_Min (0x0UL)       /*!< Min enumerator value of CRCINC field.                                */
  #define RADIO_LBMAC_PCNF0_CRCINC_Max (0x1UL)       /*!< Max enumerator value of CRCINC field.                                */
  #define RADIO_LBMAC_PCNF0_CRCINC_Exclude (0x0UL)   /*!< LENGTH does not contain CRC                                          */
  #define RADIO_LBMAC_PCNF0_CRCINC_Include (0x1UL)   /*!< LENGTH includes CRC                                                  */

/* PREAMPTRN @Bit 28 : Preamble pattern */
  #define RADIO_LBMAC_PCNF0_PREAMPTRN_Pos (28UL)     /*!< Position of PREAMPTRN field.                                         */
  #define RADIO_LBMAC_PCNF0_PREAMPTRN_Msk (0x1UL << RADIO_LBMAC_PCNF0_PREAMPTRN_Pos) /*!< Bit mask of PREAMPTRN field.         */

/* TERMLEN @Bits 29..30 : Length of TERM field in Long Range operation */
  #define RADIO_LBMAC_PCNF0_TERMLEN_Pos (29UL)       /*!< Position of TERMLEN field.                                           */
  #define RADIO_LBMAC_PCNF0_TERMLEN_Msk (0x3UL << RADIO_LBMAC_PCNF0_TERMLEN_Pos) /*!< Bit mask of TERMLEN field.               */


/* RADIO_LBMAC_PCNF0SEC: Packet configuration register 0 in concurrent receive mode in BLE LR */
  #define RADIO_LBMAC_PCNF0SEC_ResetValue (0x00000000UL) /*!< Reset value of PCNF0SEC register.                                */

/* LFLEN @Bits 0..3 : Length on air of LENGTH field in number of bits. */
  #define RADIO_LBMAC_PCNF0SEC_LFLEN_Pos (0UL)       /*!< Position of LFLEN field.                                             */
  #define RADIO_LBMAC_PCNF0SEC_LFLEN_Msk (0xFUL << RADIO_LBMAC_PCNF0SEC_LFLEN_Pos) /*!< Bit mask of LFLEN field.               */

/* S0LEN @Bit 8 : Length on air of S0 field in number of bytes. */
  #define RADIO_LBMAC_PCNF0SEC_S0LEN_Pos (8UL)       /*!< Position of S0LEN field.                                             */
  #define RADIO_LBMAC_PCNF0SEC_S0LEN_Msk (0x1UL << RADIO_LBMAC_PCNF0SEC_S0LEN_Pos) /*!< Bit mask of S0LEN field.               */

/* S1LEN @Bits 16..19 : Length on air of S1 field in number of bits. */
  #define RADIO_LBMAC_PCNF0SEC_S1LEN_Pos (16UL)      /*!< Position of S1LEN field.                                             */
  #define RADIO_LBMAC_PCNF0SEC_S1LEN_Msk (0xFUL << RADIO_LBMAC_PCNF0SEC_S1LEN_Pos) /*!< Bit mask of S1LEN field.               */

