adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ENDCOUNTHYPSTD @Bits 0..9 : Defines maximum number of PDU bits to compare between Hyper and Std demodulator */
  #define RADIO_LBMAC_AACHKOVERRIDE_ENDCOUNTHYPSTD_Pos (0UL) /*!< Position of ENDCOUNTHYPSTD field.                            */
  #define RADIO_LBMAC_AACHKOVERRIDE_ENDCOUNTHYPSTD_Msk (0x3FFUL << RADIO_LBMAC_AACHKOVERRIDE_ENDCOUNTHYPSTD_Pos) /*!< Bit mask
                                                                            of ENDCOUNTHYPSTD field.*/                            

/* ENABLE @Bits 16..17 : Enable AA bit 15 check */
  #define RADIO_LBMAC_AACHKOVERRIDE_ENABLE_Pos (16UL) /*!< Position of ENABLE field.                                           */
  #define RADIO_LBMAC_AACHKOVERRIDE_ENABLE_Msk (0x3UL << RADIO_LBMAC_AACHKOVERRIDE_ENABLE_Pos) /*!< Bit mask of ENABLE field.  */
  #define RADIO_LBMAC_AACHKOVERRIDE_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                              */
  #define RADIO_LBMAC_AACHKOVERRIDE_ENABLE_Max (0x3UL) /*!< Max enumerator value of ENABLE field.                              */
  #define RADIO_LBMAC_AACHKOVERRIDE_ENABLE_AA16to31 (0x0UL) /*!< Enable AA16..31                                               */
  #define RADIO_LBMAC_AACHKOVERRIDE_ENABLE_AA15to31 (0x2UL) /*!< Enable AA15..31                                               */
  #define RADIO_LBMAC_AACHKOVERRIDE_ENABLE_AA14to31 (0x1UL) /*!< Enable AA14..31                                               */
  #define RADIO_LBMAC_AACHKOVERRIDE_ENABLE_AA13to31 (0x3UL) /*!< Enable AA13..31                                               */

/* DISABLE @Bit 19 : Disable std AA checker */
  #define RADIO_LBMAC_AACHKOVERRIDE_DISABLE_Pos (19UL) /*!< Position of DISABLE field.                                         */
  #define RADIO_LBMAC_AACHKOVERRIDE_DISABLE_Msk (0x1UL << RADIO_LBMAC_AACHKOVERRIDE_DISABLE_Pos) /*!< Bit mask of DISABLE
                                                                            field.*/                                              
  #define RADIO_LBMAC_AACHKOVERRIDE_DISABLE_Min (0x0UL) /*!< Min enumerator value of DISABLE field.                            */
  #define RADIO_LBMAC_AACHKOVERRIDE_DISABLE_Max (0x1UL) /*!< Max enumerator value of DISABLE field.                            */
  #define RADIO_LBMAC_AACHKOVERRIDE_DISABLE_Enabled (0x0UL) /*!< Enable std AA checker                                         */
  #define RADIO_LBMAC_AACHKOVERRIDE_DISABLE_Disabled (0x1UL) /*!< Disable std AA checker                                       */

/* ALLOWADDRMATCHEARLY @Bit 20 : Enable ignore std AA checker before shift register filled */
  #define RADIO_LBMAC_AACHKOVERRIDE_ALLOWADDRMATCHEARLY_Pos (20UL) /*!< Position of ALLOWADDRMATCHEARLY field.                 */
  #define RADIO_LBMAC_AACHKOVERRIDE_ALLOWADDRMATCHEARLY_Msk (0x1UL << RADIO_LBMAC_AACHKOVERRIDE_ALLOWADDRMATCHEARLY_Pos) /*!<
                                                                            Bit mask of ALLOWADDRMATCHEARLY field.*/              
  #define RADIO_LBMAC_AACHKOVERRIDE_ALLOWADDRMATCHEARLY_Min (0x0UL) /*!< Min enumerator value of ALLOWADDRMATCHEARLY field.    */
  #define RADIO_LBMAC_AACHKOVERRIDE_ALLOWADDRMATCHEARLY_Max (0x1UL) /*!< Max enumerator value of ALLOWADDRMATCHEARLY field.    */
  #define RADIO_LBMAC_AACHKOVERRIDE_ALLOWADDRMATCHEARLY_Enabled (0x0UL) /*!< Enable                                            */
  #define RADIO_LBMAC_AACHKOVERRIDE_ALLOWADDRMATCHEARLY_Disabled (0x1UL) /*!< Disable                                          */

/* PERFECTADDRWINDOW @Bit 21 : Enable timing accurate address match window in demodulator */
  #define RADIO_LBMAC_AACHKOVERRIDE_PERFECTADDRWINDOW_Pos (21UL) /*!< Position of PERFECTADDRWINDOW field.                     */
  #define RADIO_LBMAC_AACHKOVERRIDE_PERFECTADDRWINDOW_Msk (0x1UL << RADIO_LBMAC_AACHKOVERRIDE_PERFECTADDRWINDOW_Pos) /*!< Bit
                                                                            mask of PERFECTADDRWINDOW field.*/                    
  #define RADIO_LBMAC_AACHKOVERRIDE_PERFECTADDRWINDOW_Min (0x0UL) /*!< Min enumerator value of PERFECTADDRWINDOW field.        */
  #define RADIO_LBMAC_AACHKOVERRIDE_PERFECTADDRWINDOW_Max (0x1UL) /*!< Max enumerator value of PERFECTADDRWINDOW field.        */
  #define RADIO_LBMAC_AACHKOVERRIDE_PERFECTADDRWINDOW_Disabled (0x0UL) /*!< The address window has some margin                 */
  #define RADIO_LBMAC_AACHKOVERRIDE_PERFECTADDRWINDOW_Enabled (0x1UL) /*!< The address window spans only one bit               */

/* SFDMATCHENABLE @Bit 22 : Enable every 4 bits SFD match for IEEE 802.15.4 */
  #define RADIO_LBMAC_AACHKOVERRIDE_SFDMATCHENABLE_Pos (22UL) /*!< Position of SFDMATCHENABLE field.                           */
  #define RADIO_LBMAC_AACHKOVERRIDE_SFDMATCHENABLE_Msk (0x1UL << RADIO_LBMAC_AACHKOVERRIDE_SFDMATCHENABLE_Pos) /*!< Bit mask of
                                                                            SFDMATCHENABLE field.*/                               
  #define RADIO_LBMAC_AACHKOVERRIDE_SFDMATCHENABLE_Min (0x0UL) /*!< Min enumerator value of SFDMATCHENABLE field.              */
  #define RADIO_LBMAC_AACHKOVERRIDE_SFDMATCHENABLE_Max (0x1UL) /*!< Max enumerator value of SFDMATCHENABLE field.              */
  #define RADIO_LBMAC_AACHKOVERRIDE_SFDMATCHENABLE_Disabled (0x0UL) /*!< Disable                                               */
  #define RADIO_LBMAC_AACHKOVERRIDE_SFDMATCHENABLE_Enabled (0x1UL) /*!< Enable                                                 */

/* SYMSBEFORESFD @Bits 24..26 : Number of preamble symbols before SFD to match, by default 2 symbols. */
  #define RADIO_LBMAC_AACHKOVERRIDE_SYMSBEFORESFD_Pos (24UL) /*!< Position of SYMSBEFORESFD field.                             */
  #define RADIO_LBMAC_AACHKOVERRIDE_SYMSBEFORESFD_Msk (0x7UL << RADIO_LBMAC_AACHKOVERRIDE_SYMSBEFORESFD_Pos) /*!< Bit mask of
                                                                            SYMSBEFORESFD field.*/                                


/* RADIO_LBMAC_PACKETCNTR1: (unspecified) */
  #define RADIO_LBMAC_PACKETCNTR1_ResetValue (0x00000000UL) /*!< Reset value of PACKETCNTR1 register.                          */

