adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* COUNTER @Bits 0..15 : Packet counter value */
  #define RADIO_LBMAC_PACKETCNTR1_COUNTER_Pos (0UL)  /*!< Position of COUNTER field.                                           */
  #define RADIO_LBMAC_PACKETCNTR1_COUNTER_Msk (0xFFFFUL << RADIO_LBMAC_PACKETCNTR1_COUNTER_Pos) /*!< Bit mask of COUNTER field.*/


/* RADIO_LBMAC_PACKETCNTR2: (unspecified) */
  #define RADIO_LBMAC_PACKETCNTR2_ResetValue (0x00000000UL) /*!< Reset value of PACKETCNTR2 register.                          */

/* HYPER @Bits 0..15 : Number of detected correlator syncs */
  #define RADIO_LBMAC_PACKETCNTR2_HYPER_Pos (0UL)    /*!< Position of HYPER field.                                             */
  #define RADIO_LBMAC_PACKETCNTR2_HYPER_Msk (0xFFFFUL << RADIO_LBMAC_PACKETCNTR2_HYPER_Pos) /*!< Bit mask of HYPER field.      */

/* NORMAL @Bits 16..31 : Packet counter value (number of packets with addressmatch ok) */
  #define RADIO_LBMAC_PACKETCNTR2_NORMAL_Pos (16UL)  /*!< Position of NORMAL field.                                            */
  #define RADIO_LBMAC_PACKETCNTR2_NORMAL_Msk (0xFFFFUL << RADIO_LBMAC_PACKETCNTR2_NORMAL_Pos) /*!< Bit mask of NORMAL field.   */


/* RADIO_LBMAC_CTESTATUS: CTEInfo parsed from received packet */
  #define RADIO_LBMAC_CTESTATUS_ResetValue (0x00000000UL) /*!< Reset value of CTESTATUS register.                              */

/* CTETIME @Bits 0..4 : CTETime parsed from packet */
  #define RADIO_LBMAC_CTESTATUS_CTETIME_Pos (0UL)    /*!< Position of CTETIME field.                                           */
  #define RADIO_LBMAC_CTESTATUS_CTETIME_Msk (0x1FUL << RADIO_LBMAC_CTESTATUS_CTETIME_Pos) /*!< Bit mask of CTETIME field.      */

/* RFU @Bit 5 : RFU parsed from packet */
  #define RADIO_LBMAC_CTESTATUS_RFU_Pos (5UL)        /*!< Position of RFU field.                                               */
  #define RADIO_LBMAC_CTESTATUS_RFU_Msk (0x1UL << RADIO_LBMAC_CTESTATUS_RFU_Pos) /*!< Bit mask of RFU field.                   */

/* CTETYPE @Bits 6..7 : CTEType parsed from packet */
  #define RADIO_LBMAC_CTESTATUS_CTETYPE_Pos (6UL)    /*!< Position of CTETYPE field.                                           */
  #define RADIO_LBMAC_CTESTATUS_CTETYPE_Msk (0x3UL << RADIO_LBMAC_CTESTATUS_CTETYPE_Pos) /*!< Bit mask of CTETYPE field.       */


/* RADIO_LBMAC_HYPSTDCHECKSTAT: Address Check Override */
  #define RADIO_LBMAC_HYPSTDCHECKSTAT_ResetValue (0x00000000UL) /*!< Reset value of HYPSTDCHECKSTAT register.                  */

/* PDUCHECK0 @Bits 0..3 : Number of bits where Std and Hyper demodulator disagrees for minimum latency. */
  #define RADIO_LBMAC_HYPSTDCHECKSTAT_PDUCHECK0_Pos (0UL) /*!< Position of PDUCHECK0 field.                                    */
  #define RADIO_LBMAC_HYPSTDCHECKSTAT_PDUCHECK0_Msk (0xFUL << RADIO_LBMAC_HYPSTDCHECKSTAT_PDUCHECK0_Pos) /*!< Bit mask of
                                                                            PDUCHECK0 field.*/                                    

/* PDUCHECK1 @Bits 4..7 : Number of bits where Std and Hyper demodulator disagrees for medium latency. */
  #define RADIO_LBMAC_HYPSTDCHECKSTAT_PDUCHECK1_Pos (4UL) /*!< Position of PDUCHECK1 field.                                    */
  #define RADIO_LBMAC_HYPSTDCHECKSTAT_PDUCHECK1_Msk (0xFUL << RADIO_LBMAC_HYPSTDCHECKSTAT_PDUCHECK1_Pos) /*!< Bit mask of
                                                                            PDUCHECK1 field.*/                                    

/* PDUCHECK2 @Bits 8..11 : Number of bits where Std and Hyper demodulator disagrees for maximum latency. */
  #define RADIO_LBMAC_HYPSTDCHECKSTAT_PDUCHECK2_Pos (8UL) /*!< Position of PDUCHECK2 field.                                    */
  #define RADIO_LBMAC_HYPSTDCHECKSTAT_PDUCHECK2_Msk (0xFUL << RADIO_LBMAC_HYPSTDCHECKSTAT_PDUCHECK2_Pos) /*!< Bit mask of
                                                                            PDUCHECK2 field.*/                                    

/* HAM @Bits 16..20 : Hamming distance between std demod AA15:0 and expected AA15:0. */
  #define RADIO_LBMAC_HYPSTDCHECKSTAT_HAM_Pos (16UL) /*!< Position of HAM field.                                               */
  #define RADIO_LBMAC_HYPSTDCHECKSTAT_HAM_Msk (0x1FUL << RADIO_LBMAC_HYPSTDCHECKSTAT_HAM_Pos) /*!< Bit mask of HAM field.      */

/* SPAM @Bits 21..23 : Time distance #bit clock cycles from AAmatchHyp. */
  #define RADIO_LBMAC_HYPSTDCHECKSTAT_SPAM_Pos (21UL) /*!< Position of SPAM field.                                             */
  #define RADIO_LBMAC_HYPSTDCHECKSTAT_SPAM_Msk (0x7UL << RADIO_LBMAC_HYPSTDCHECKSTAT_SPAM_Pos) /*!< Bit mask of SPAM field.    */

/* VALID @Bit 24 : Valid flag bit */
  #define RADIO_LBMAC_HYPSTDCHECKSTAT_VALID_Pos (24UL) /*!< Position of VALID field.                                           */
  #define RADIO_LBMAC_HYPSTDCHECKSTAT_VALID_Msk (0x1UL << RADIO_LBMAC_HYPSTDCHECKSTAT_VALID_Pos) /*!< Bit mask of VALID field. */


/* RADIO_LBMAC_HYPSTDAADIFFVEC: Address Diff Vector */
  #define RADIO_LBMAC_HYPSTDAADIFFVEC_ResetValue (0x00000000UL) /*!< Reset value of HYPSTDAADIFFVEC register.                  */

/* DIFF @Bits 0..15 : Hyper AA15:0 and Std AA15:0 differs */
  #define RADIO_LBMAC_HYPSTDAADIFFVEC_DIFF_Pos (0UL) /*!< Position of DIFF field.                                              */
  #define RADIO_LBMAC_HYPSTDAADIFFVEC_DIFF_Msk (0xFFFFUL << RADIO_LBMAC_HYPSTDAADIFFVEC_DIFF_Pos) /*!< Bit mask of DIFF field. */


/* RADIO_LBMAC_ADDRWINSIZE: Address match safe window size (the number of bits after detect is asserted, before starting to look
                             for address match). Only valid when OVERRIDE22.DISABLEADDRWINDOW is '0'. */                          
                                                                                                                                  
  #define RADIO_LBMAC_ADDRWINSIZE_ResetValue (0x1D111518UL) /*!< Reset value of ADDRWINSIZE register.                          */

/* IEEE802154 @Bits 0..4 : Number of bits after detect to start search address/SFD in IEEE 802.15.4 mode */
  #define RADIO_LBMAC_ADDRWINSIZE_IEEE802154_Pos (0UL) /*!< Position of IEEE802154 field.                                      */
  #define RADIO_LBMAC_ADDRWINSIZE_IEEE802154_Msk (0x1FUL << RADIO_LBMAC_ADDRWINSIZE_IEEE802154_Pos) /*!< Bit mask of IEEE802154
                                                                            field.*/                                              

/* BLE @Bits 8..12 : Number of bits after detect to start search address/SFD in BLE mode */
  #define RADIO_LBMAC_ADDRWINSIZE_BLE_Pos (8UL)      /*!< Position of BLE field.                                               */
  #define RADIO_LBMAC_ADDRWINSIZE_BLE_Msk (0x1FUL << RADIO_LBMAC_ADDRWINSIZE_BLE_Pos) /*!< Bit mask of BLE field.              */

/* LR @Bits 16..20 : Number of bits after detect to start search address/SFD in BLE_LR_125k/BLE_LR_500k mode */
  #define RADIO_LBMAC_ADDRWINSIZE_LR_Pos (16UL)      /*!< Position of LR field.                                                */
  #define RADIO_LBMAC_ADDRWINSIZE_LR_Msk (0x1FUL << RADIO_LBMAC_ADDRWINSIZE_LR_Pos) /*!< Bit mask of LR field.                 */

