adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ESB @Bits 24..28 : Number of bits after detect to start search address/SFD in ESB mode */
  #define RADIO_LBMAC_ADDRWINSIZE_ESB_Pos (24UL)     /*!< Position of ESB field.                                               */
  #define RADIO_LBMAC_ADDRWINSIZE_ESB_Msk (0x1FUL << RADIO_LBMAC_ADDRWINSIZE_ESB_Pos) /*!< Bit mask of ESB field.              */


/* RADIO_LBMAC_MHRMATCHCONF: Search pattern configuration */
  #define RADIO_LBMAC_MHRMATCHCONF_ResetValue (0x00000000UL) /*!< Reset value of MHRMATCHCONF register.                        */

/* MHRMATCHCONF @Bits 0..31 : Search pattern configuration */
  #define RADIO_LBMAC_MHRMATCHCONF_MHRMATCHCONF_Pos (0UL) /*!< Position of MHRMATCHCONF field.                                 */
  #define RADIO_LBMAC_MHRMATCHCONF_MHRMATCHCONF_Msk (0xFFFFFFFFUL << RADIO_LBMAC_MHRMATCHCONF_MHRMATCHCONF_Pos) /*!< Bit mask of
                                                                            MHRMATCHCONF field.*/                                 


/* RADIO_LBMAC_MHRMATCHMASK: Pattern mask */
  #define RADIO_LBMAC_MHRMATCHMASK_ResetValue (0x00000000UL) /*!< Reset value of MHRMATCHMASK register.                        */

/* MHRMATCHMASK @Bits 0..31 : Pattern mask */
  #define RADIO_LBMAC_MHRMATCHMASK_MHRMATCHMASK_Pos (0UL) /*!< Position of MHRMATCHMASK field.                                 */
  #define RADIO_LBMAC_MHRMATCHMASK_MHRMATCHMASK_Msk (0xFFFFFFFFUL << RADIO_LBMAC_MHRMATCHMASK_MHRMATCHMASK_Pos) /*!< Bit mask of
                                                                            MHRMATCHMASK field.*/                                 


/* RADIO_LBMAC_SFD: IEEE 802.15.4 start of frame delimiter */
  #define RADIO_LBMAC_SFD_ResetValue (0x000000A7UL)  /*!< Reset value of SFD register.                                         */

/* SFD @Bits 0..7 : IEEE 802.15.4 start of frame delimiter */
  #define RADIO_LBMAC_SFD_SFD_Pos (0UL)              /*!< Position of SFD field.                                               */
  #define RADIO_LBMAC_SFD_SFD_Msk (0xFFUL << RADIO_LBMAC_SFD_SFD_Pos) /*!< Bit mask of SFD field.                              */


/* RADIO_LBMAC_CTEINLINECONF: Configuration for CTE inline mode */
  #define RADIO_LBMAC_CTEINLINECONF_ResetValue (0x00002800UL) /*!< Reset value of CTEINLINECONF register.                      */

/* CTEINLINECTRLEN @Bit 0 : Enable parsing of CTEInfo from received packet in BLE modes */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINECTRLEN_Pos (0UL) /*!< Position of CTEINLINECTRLEN field.                          */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINECTRLEN_Msk (0x1UL << RADIO_LBMAC_CTEINLINECONF_CTEINLINECTRLEN_Pos) /*!< Bit mask
                                                                            of CTEINLINECTRLEN field.*/                           
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINECTRLEN_Min (0x0UL) /*!< Min enumerator value of CTEINLINECTRLEN field.            */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINECTRLEN_Max (0x1UL) /*!< Max enumerator value of CTEINLINECTRLEN field.            */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINECTRLEN_Enabled (0x1UL) /*!< Parsing of CTEInfo is enabled                         */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINECTRLEN_Disabled (0x0UL) /*!< Parsing of CTEInfo is disabled                       */

/* CTEINFOINS1 @Bit 3 : CTEInfo is S1 byte or not */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINFOINS1_Pos (3UL) /*!< Position of CTEINFOINS1 field.                                  */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINFOINS1_Msk (0x1UL << RADIO_LBMAC_CTEINLINECONF_CTEINFOINS1_Pos) /*!< Bit mask of
                                                                            CTEINFOINS1 field.*/                                  
  #define RADIO_LBMAC_CTEINLINECONF_CTEINFOINS1_Min (0x0UL) /*!< Min enumerator value of CTEINFOINS1 field.                    */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINFOINS1_Max (0x1UL) /*!< Max enumerator value of CTEINFOINS1 field.                    */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINFOINS1_InS1 (0x1UL) /*!< CTEInfo is in S1 byte (data PDU)                             */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINFOINS1_NotInS1 (0x0UL) /*!< CTEInfo is NOT in S1 byte (advertising PDU)               */

/* CTEERRORHANDLING @Bit 4 : Sampling/switching if CRC is not OK */
  #define RADIO_LBMAC_CTEINLINECONF_CTEERRORHANDLING_Pos (4UL) /*!< Position of CTEERRORHANDLING field.                        */
  #define RADIO_LBMAC_CTEINLINECONF_CTEERRORHANDLING_Msk (0x1UL << RADIO_LBMAC_CTEINLINECONF_CTEERRORHANDLING_Pos) /*!< Bit mask
                                                                            of CTEERRORHANDLING field.*/                          
  #define RADIO_LBMAC_CTEINLINECONF_CTEERRORHANDLING_Min (0x0UL) /*!< Min enumerator value of CTEERRORHANDLING field.          */
  #define RADIO_LBMAC_CTEINLINECONF_CTEERRORHANDLING_Max (0x1UL) /*!< Max enumerator value of CTEERRORHANDLING field.          */
  #define RADIO_LBMAC_CTEINLINECONF_CTEERRORHANDLING_Yes (0x1UL) /*!< Sampling and antenna switching also when CRC is not OK   */
  #define RADIO_LBMAC_CTEINLINECONF_CTEERRORHANDLING_No (0x0UL) /*!< No sampling and antenna switching when CRC is not OK      */

/* CTEFORCEON @Bit 5 : CTE is continuously output after CRC and only stopped by triggering TASKS_STOP. This is typically used
                       together with the DFEEND to STOP short. AoA/AoD procedure duration is still controlled by
                       DFECTRL1.NUMBEROF8S / CTETIME */                                                                           
                                                                                                                                  
  #define RADIO_LBMAC_CTEINLINECONF_CTEFORCEON_Pos (5UL) /*!< Position of CTEFORCEON field.                                    */
  #define RADIO_LBMAC_CTEINLINECONF_CTEFORCEON_Msk (0x1UL << RADIO_LBMAC_CTEINLINECONF_CTEFORCEON_Pos) /*!< Bit mask of
                                                                            CTEFORCEON field.*/                                   
  #define RADIO_LBMAC_CTEINLINECONF_CTEFORCEON_Min (0x0UL) /*!< Min enumerator value of CTEFORCEON field.                      */
  #define RADIO_LBMAC_CTEINLINECONF_CTEFORCEON_Max (0x1UL) /*!< Max enumerator value of CTEFORCEON field.                      */
  #define RADIO_LBMAC_CTEINLINECONF_CTEFORCEON_Yes (0x1UL) /*!< CTE is continuously transmitted after CRC until TASKS_STOP     */
  #define RADIO_LBMAC_CTEINLINECONF_CTEFORCEON_No (0x0UL) /*!< CTE duration is automatically determined by DFECTRL1.NUMBEROF8US
                                                               / CTETIME (only correct for 1Mbps and 2Mbps modes)*/               

/* CTETIMEVALIDRANGE @Bits 6..7 : Max range of CTETime */
  #define RADIO_LBMAC_CTEINLINECONF_CTETIMEVALIDRANGE_Pos (6UL) /*!< Position of CTETIMEVALIDRANGE field.                      */
  #define RADIO_LBMAC_CTEINLINECONF_CTETIMEVALIDRANGE_Msk (0x3UL << RADIO_LBMAC_CTEINLINECONF_CTETIMEVALIDRANGE_Pos) /*!< Bit
                                                                            mask of CTETIMEVALIDRANGE field.*/                    
  #define RADIO_LBMAC_CTEINLINECONF_CTETIMEVALIDRANGE_Min (0x0UL) /*!< Min enumerator value of CTETIMEVALIDRANGE field.        */
  #define RADIO_LBMAC_CTEINLINECONF_CTETIMEVALIDRANGE_Max (0x2UL) /*!< Max enumerator value of CTETIMEVALIDRANGE field.        */
  #define RADIO_LBMAC_CTEINLINECONF_CTETIMEVALIDRANGE_20 (0x0UL) /*!< 20 in 8us unit (default) Set to 20 if parsed CTETime is
                                                                      larger han 20*/                                             
  #define RADIO_LBMAC_CTEINLINECONF_CTETIMEVALIDRANGE_31 (0x1UL) /*!< 31 in 8us unit                                           */
  #define RADIO_LBMAC_CTEINLINECONF_CTETIMEVALIDRANGE_63 (0x2UL) /*!< 63 in 8us unit                                           */

/* CTEINLINERXMODE1US @Bits 10..12 : Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE1US_Pos (10UL) /*!< Position of CTEINLINERXMODE1US field.                   */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE1US_Msk (0x7UL << RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE1US_Pos) /*!< Bit
                                                                            mask of CTEINLINERXMODE1US field.*/                   
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE1US_Min (0x0UL) /*!< Min enumerator value of CTEINLINERXMODE1US field.      */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE1US_Max (0x6UL) /*!< Max enumerator value of CTEINLINERXMODE1US field.      */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE1US_8us (0x0UL) /*!< 8us                                                    */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE1US_4us (0x1UL) /*!< 4us                                                    */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE1US_2us (0x2UL) /*!< 2us                                                    */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE1US_1us (0x3UL) /*!< 1us                                                    */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE1US_500ns (0x4UL) /*!< 0.5us                                                */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE1US_250ns (0x5UL) /*!< 0.25us                                               */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE1US_125ns (0x6UL) /*!< 0.125us                                              */

