adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CTEINLINERXMODE2US @Bits 13..15 : Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_Pos (13UL) /*!< Position of CTEINLINERXMODE2US field.                   */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_Msk (0x7UL << RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_Pos) /*!< Bit
                                                                            mask of CTEINLINERXMODE2US field.*/                   
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_Min (0x0UL) /*!< Min enumerator value of CTEINLINERXMODE2US field.      */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_Max (0x6UL) /*!< Max enumerator value of CTEINLINERXMODE2US field.      */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_8us (0x0UL) /*!< 8us                                                    */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_4us (0x1UL) /*!< 4us                                                    */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_2us (0x2UL) /*!< 2us                                                    */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_1us (0x3UL) /*!< 1us                                                    */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_500ns (0x4UL) /*!< 0.5us                                                */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_250ns (0x5UL) /*!< 0.25us                                               */
  #define RADIO_LBMAC_CTEINLINECONF_CTEINLINERXMODE2US_125ns (0x6UL) /*!< 0.125us                                              */

/* S0CONF @Bits 16..23 : S0 bit pattern to match */
  #define RADIO_LBMAC_CTEINLINECONF_S0CONF_Pos (16UL) /*!< Position of S0CONF field.                                           */
  #define RADIO_LBMAC_CTEINLINECONF_S0CONF_Msk (0xFFUL << RADIO_LBMAC_CTEINLINECONF_S0CONF_Pos) /*!< Bit mask of S0CONF field. */

/* S0MASK @Bits 24..31 : S0 bit mask to set which bit to match */
  #define RADIO_LBMAC_CTEINLINECONF_S0MASK_Pos (24UL) /*!< Position of S0MASK field.                                           */
  #define RADIO_LBMAC_CTEINLINECONF_S0MASK_Msk (0xFFUL << RADIO_LBMAC_CTEINLINECONF_S0MASK_Pos) /*!< Bit mask of S0MASK field. */


/* RADIO_LBMAC_DMASTART: (unspecified) */
  #define RADIO_LBMAC_DMASTART_ResetValue (0x00000000UL) /*!< Reset value of DMASTART register.                                */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_LBMAC_DMASTART_TRIG_Pos (0UL)        /*!< Position of TRIG field.                                              */
  #define RADIO_LBMAC_DMASTART_TRIG_Msk (0x1UL << RADIO_LBMAC_DMASTART_TRIG_Pos) /*!< Bit mask of TRIG field.                  */


/* RADIO_LBMAC_DMASTOP: (unspecified) */
  #define RADIO_LBMAC_DMASTOP_ResetValue (0x00000000UL) /*!< Reset value of DMASTOP register.                                  */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_LBMAC_DMASTOP_TRIG_Pos (0UL)         /*!< Position of TRIG field.                                              */
  #define RADIO_LBMAC_DMASTOP_TRIG_Msk (0x1UL << RADIO_LBMAC_DMASTOP_TRIG_Pos) /*!< Bit mask of TRIG field.                    */


/* RADIO_LBMAC_DMAENABLE: (unspecified) */
  #define RADIO_LBMAC_DMAENABLE_ResetValue (0x00000000UL) /*!< Reset value of DMAENABLE register.                              */

/* ENABLE @Bit 0 : (unspecified) */
  #define RADIO_LBMAC_DMAENABLE_ENABLE_Pos (0UL)     /*!< Position of ENABLE field.                                            */
  #define RADIO_LBMAC_DMAENABLE_ENABLE_Msk (0x1UL << RADIO_LBMAC_DMAENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.          */


/* RADIO_LBMAC_PACKETPTR: (unspecified) */
  #define RADIO_LBMAC_PACKETPTR_ResetValue (0x00000000UL) /*!< Reset value of PACKETPTR register.                              */

/* OFFSET @Bits 0..15 : (unspecified) */
  #define RADIO_LBMAC_PACKETPTR_OFFSET_Pos (0UL)     /*!< Position of OFFSET field.                                            */
  #define RADIO_LBMAC_PACKETPTR_OFFSET_Msk (0xFFFFUL << RADIO_LBMAC_PACKETPTR_OFFSET_Pos) /*!< Bit mask of OFFSET field.       */

/* BASE @Bit 29 : (unspecified) */
  #define RADIO_LBMAC_PACKETPTR_BASE_Pos (29UL)      /*!< Position of BASE field.                                              */
  #define RADIO_LBMAC_PACKETPTR_BASE_Msk (0x1UL << RADIO_LBMAC_PACKETPTR_BASE_Pos) /*!< Bit mask of BASE field.                */


/* RADIO_LBMAC_DMAAMOUNT: (unspecified) */
  #define RADIO_LBMAC_DMAAMOUNT_ResetValue (0x00000000UL) /*!< Reset value of DMAAMOUNT register.                              */

/* AMOUNT @Bits 0..8 : (unspecified) */
  #define RADIO_LBMAC_DMAAMOUNT_AMOUNT_Pos (0UL)     /*!< Position of AMOUNT field.                                            */
  #define RADIO_LBMAC_DMAAMOUNT_AMOUNT_Msk (0x1FFUL << RADIO_LBMAC_DMAAMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.        */


/* RADIO_LBMAC_DMAMAXCNT: (unspecified) */
  #define RADIO_LBMAC_DMAMAXCNT_ResetValue (0x00000103UL) /*!< Reset value of DMAMAXCNT register.                              */

/* MAXCNT @Bits 0..8 : (unspecified) */
  #define RADIO_LBMAC_DMAMAXCNT_MAXCNT_Pos (0UL)     /*!< Position of MAXCNT field.                                            */
  #define RADIO_LBMAC_DMAMAXCNT_MAXCNT_Msk (0x1FFUL << RADIO_LBMAC_DMAMAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.        */



/* ==================================================== Struct RADIO_DFT ===================================================== */
/**
  * @brief DFT [RADIO_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000000) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000004) Digital Test Bus 1 (DTB1) configuration               */
  __IOM uint32_t  DTB2CONFIG;                        /*!< (@ 0x00000008) Digital Test Bus 2 (DTB2) configuration               */
  __IOM uint32_t  DTB3CONFIG;                        /*!< (@ 0x0000000C) Digital Test Bus 3 (DTB3) configuration               */
} NRF_RADIO_DFT_Type;                                /*!< Size = 16 (0x010)                                                    */

/* RADIO_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define RADIO_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                              */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB0 */
  #define RADIO_DFT_DTB0CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define RADIO_DFT_DTB0CONFIG_SELMUX_Msk (0x3UL << RADIO_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define RADIO_DFT_DTB0CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define RADIO_DFT_DTB0CONFIG_SELMUX_Max (0x3UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define RADIO_DFT_DTB0CONFIG_SELMUX_AnaDtb00 (0x0UL) /*!< SPHYNX_DTB0_AO_0V8[0]                                              */
  #define RADIO_DFT_DTB0CONFIG_SELMUX_AafDcCalI (0x1UL) /*!< SPHYNX_AAF_DCCAL_I_AO_0V8                                         */
  #define RADIO_DFT_DTB0CONFIG_SELMUX_RxPkDet0 (0x2UL) /*!< SPHYNX_RX_PKDET_AO_0V8[0]                                          */
  #define RADIO_DFT_DTB0CONFIG_SELMUX_Spare (0x3UL)  /*!< None selected, logic 0                                               */

