adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EN @Bit 31 : Enable the digital test bus */
  #define RADIO_DFT_DTB0CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define RADIO_DFT_DTB0CONFIG_EN_Msk (0x1UL << RADIO_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define RADIO_DFT_DTB0CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define RADIO_DFT_DTB0CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define RADIO_DFT_DTB0CONFIG_EN_Disabled (0x0UL)   /*!< Digital test bus is disabled                                         */
  #define RADIO_DFT_DTB0CONFIG_EN_Enabled (0x1UL)    /*!< Digital test bus is enabled                                          */


/* RADIO_DFT_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define RADIO_DFT_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                              */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB1 */
  #define RADIO_DFT_DTB1CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define RADIO_DFT_DTB1CONFIG_SELMUX_Msk (0x3UL << RADIO_DFT_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define RADIO_DFT_DTB1CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define RADIO_DFT_DTB1CONFIG_SELMUX_Max (0x3UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define RADIO_DFT_DTB1CONFIG_SELMUX_AnaDtb01 (0x0UL) /*!< SPHYNX_DTB0_AO_0V8[1]                                              */
  #define RADIO_DFT_DTB1CONFIG_SELMUX_AafDcCalQ (0x1UL) /*!< SPHYNX_AAF_DCCAL_Q_AO_0V8                                         */
  #define RADIO_DFT_DTB1CONFIG_SELMUX_RfPkDet1 (0x2UL) /*!< SPHYNX_RX_PKDET_AO_0V8[1]                                          */
  #define RADIO_DFT_DTB1CONFIG_SELMUX_Spare (0x3UL)  /*!< None selected, logic 0                                               */

/* EN @Bit 31 : Enable the digital test bus */
  #define RADIO_DFT_DTB1CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define RADIO_DFT_DTB1CONFIG_EN_Msk (0x1UL << RADIO_DFT_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define RADIO_DFT_DTB1CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define RADIO_DFT_DTB1CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define RADIO_DFT_DTB1CONFIG_EN_Disabled (0x0UL)   /*!< Digital test bus is disabled                                         */
  #define RADIO_DFT_DTB1CONFIG_EN_Enabled (0x1UL)    /*!< Digital test bus is enabled                                          */


/* RADIO_DFT_DTB2CONFIG: Digital Test Bus 2 (DTB2) configuration */
  #define RADIO_DFT_DTB2CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB2CONFIG register.                              */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB2 */
  #define RADIO_DFT_DTB2CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define RADIO_DFT_DTB2CONFIG_SELMUX_Msk (0x3UL << RADIO_DFT_DTB2CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define RADIO_DFT_DTB2CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define RADIO_DFT_DTB2CONFIG_SELMUX_Max (0x3UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define RADIO_DFT_DTB2CONFIG_SELMUX_AnaDtb02 (0x0UL) /*!< SPHYNX_DTB0_AO_0V8[2]                                              */
  #define RADIO_DFT_DTB2CONFIG_SELMUX_PllSettled (0x1UL) /*!< pllSettled                                                       */
  #define RADIO_DFT_DTB2CONFIG_SELMUX_FsSpareOutputs0 (0x2UL) /*!< SPHYNX_FS_SPARE_OUTPUTS_AO_0V8[0]                           */
  #define RADIO_DFT_DTB2CONFIG_SELMUX_Spare (0x3UL)  /*!< None selected, logic 0                                               */

/* EN @Bit 31 : Enable the digital test bus */
  #define RADIO_DFT_DTB2CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define RADIO_DFT_DTB2CONFIG_EN_Msk (0x1UL << RADIO_DFT_DTB2CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define RADIO_DFT_DTB2CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define RADIO_DFT_DTB2CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define RADIO_DFT_DTB2CONFIG_EN_Disabled (0x0UL)   /*!< Digital test bus is disabled                                         */
  #define RADIO_DFT_DTB2CONFIG_EN_Enabled (0x1UL)    /*!< Digital test bus is enabled                                          */


/* RADIO_DFT_DTB3CONFIG: Digital Test Bus 3 (DTB3) configuration */
  #define RADIO_DFT_DTB3CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB3CONFIG register.                              */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB3 */
  #define RADIO_DFT_DTB3CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define RADIO_DFT_DTB3CONFIG_SELMUX_Msk (0x3UL << RADIO_DFT_DTB3CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define RADIO_DFT_DTB3CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define RADIO_DFT_DTB3CONFIG_SELMUX_Max (0x3UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define RADIO_DFT_DTB3CONFIG_SELMUX_AnaDtb03 (0x0UL) /*!< SPHYNX_DTB0_AO_0V8[3]                                              */
  #define RADIO_DFT_DTB3CONFIG_SELMUX_FsTxDataReq (0x1UL) /*!< SPHYNX_FS_TXDATAREQ_AO_0V8                                      */
  #define RADIO_DFT_DTB3CONFIG_SELMUX_CalCmpRcCal (0x2UL) /*!< SPHYNX_CAL_CMP_RCCAL_AO_0V8                                     */
  #define RADIO_DFT_DTB3CONFIG_SELMUX_Spare (0x3UL)  /*!< None selected, logic 0                                               */

