adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_PENALTYTRIGPCP1_ZERO_TRIG_Pos (0UL)  /*!< Position of TRIG field.                                              */
  #define RADIO_PENALTYTRIGPCP1_ZERO_TRIG_Msk (0x1UL << RADIO_PENALTYTRIGPCP1_ZERO_TRIG_Pos) /*!< Bit mask of TRIG field.      */


/* RADIO_PENALTYTRIGPCP1_FULL: (unspecified) */
  #define RADIO_PENALTYTRIGPCP1_FULL_ResetValue (0x00000000UL) /*!< Reset value of FULL register.                              */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_PENALTYTRIGPCP1_FULL_TRIG_Pos (0UL)  /*!< Position of TRIG field.                                              */
  #define RADIO_PENALTYTRIGPCP1_FULL_TRIG_Msk (0x1UL << RADIO_PENALTYTRIGPCP1_FULL_TRIG_Pos) /*!< Bit mask of TRIG field.      */



/* ============================================== Struct RADIO_PENALTYTRIGPCP0 =============================================== */
/**
  * @brief PENALTYTRIGPCP0 [RADIO_PENALTYTRIGPCP0] (unspecified)
  */
typedef struct {
  __OM  uint32_t  ZERO;                              /*!< (@ 0x00000000) (unspecified)                                         */
  __OM  uint32_t  FULL;                              /*!< (@ 0x00000004) (unspecified)                                         */
} NRF_RADIO_PENALTYTRIGPCP0_Type;                    /*!< Size = 8 (0x008)                                                     */

/* RADIO_PENALTYTRIGPCP0_ZERO: (unspecified) */
  #define RADIO_PENALTYTRIGPCP0_ZERO_ResetValue (0x00000000UL) /*!< Reset value of ZERO register.                              */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_PENALTYTRIGPCP0_ZERO_TRIG_Pos (0UL)  /*!< Position of TRIG field.                                              */
  #define RADIO_PENALTYTRIGPCP0_ZERO_TRIG_Msk (0x1UL << RADIO_PENALTYTRIGPCP0_ZERO_TRIG_Pos) /*!< Bit mask of TRIG field.      */


/* RADIO_PENALTYTRIGPCP0_FULL: (unspecified) */
  #define RADIO_PENALTYTRIGPCP0_FULL_ResetValue (0x00000000UL) /*!< Reset value of FULL register.                              */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_PENALTYTRIGPCP0_FULL_TRIG_Pos (0UL)  /*!< Position of TRIG field.                                              */
  #define RADIO_PENALTYTRIGPCP0_FULL_TRIG_Msk (0x1UL << RADIO_PENALTYTRIGPCP0_FULL_TRIG_Pos) /*!< Bit mask of TRIG field.      */



/* ================================================= Struct RADIO_PENALTYREG ================================================= */
/**
  * @brief PENALTYREG [RADIO_PENALTYREG] (unspecified)
  */
typedef struct {
  #if defined(_GNUC_)
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
  #endif
  union {
    __OM uint32_t PCP0;                              /*!< (@ 0x00000000) (unspecified)                                         */
    __OM uint32_t PCP[4];                            /*!< (@ 0x00000000) (unspecified)                                         */
  };
  #if defined(_GNUC_)
    #pragma GCC diagnostic pop
  #endif
} NRF_RADIO_PENALTYREG_Type;                         /*!< Size = 20 (0x014)                                                    */

/* RADIO_PENALTYREG_PCP0: (unspecified) */
  #define RADIO_PENALTYREG_PCP0_ResetValue (0x00000000UL) /*!< Reset value of PCP0 register.                                   */

/* VALUE @Bits 0..31 : (unspecified) */
  #define RADIO_PENALTYREG_PCP0_VALUE_Pos (0UL)      /*!< Position of VALUE field.                                             */
  #define RADIO_PENALTYREG_PCP0_VALUE_Msk (0xFFFFFFFFUL << RADIO_PENALTYREG_PCP0_VALUE_Pos) /*!< Bit mask of VALUE field.      */


/* RADIO_PENALTYREG_PCP: (unspecified) */
  #define RADIO_PENALTYREG_PCP_MaxCount (4UL)        /*!< Max size of PCP[4] array.                                            */
  #define RADIO_PENALTYREG_PCP_ResetValue (0xFFFFFFFCUL) /*!< Reset value of PCP[4] register.                                  */

/* VALUE @Bits 0..31 : (unspecified) */
  #define RADIO_PENALTYREG_PCP_VALUE_Pos (0UL)       /*!< Position of VALUE field.                                             */
  #define RADIO_PENALTYREG_PCP_VALUE_Msk (0xFFFFFFFFUL << RADIO_PENALTYREG_PCP_VALUE_Pos) /*!< Bit mask of VALUE field.        */



/* =============================================== Struct RADIO_FORCEOVERRIDE ================================================ */
/**
  * @brief FORCEOVERRIDE [RADIO_FORCEOVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PCP[5];                            /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_RADIO_FORCEOVERRIDE_Type;                      /*!< Size = 20 (0x014)                                                    */

/* RADIO_FORCEOVERRIDE_PCP: (unspecified) */
  #define RADIO_FORCEOVERRIDE_PCP_MaxCount (5UL)     /*!< Max size of PCP[5] array.                                            */
  #define RADIO_FORCEOVERRIDE_PCP_ResetValue (0x00000000UL) /*!< Reset value of PCP[5] register.                               */

/* CLOCKFORCING @Bit 1 : (unspecified) */
  #define RADIO_FORCEOVERRIDE_PCP_CLOCKFORCING_Pos (1UL) /*!< Position of CLOCKFORCING field.                                  */
  #define RADIO_FORCEOVERRIDE_PCP_CLOCKFORCING_Msk (0x1UL << RADIO_FORCEOVERRIDE_PCP_CLOCKFORCING_Pos) /*!< Bit mask of
                                                                            CLOCKFORCING field.*/                                 

/* DOFORCECLOCK @Bit 7 : (unspecified) */
  #define RADIO_FORCEOVERRIDE_PCP_DOFORCECLOCK_Pos (7UL) /*!< Position of DOFORCECLOCK field.                                  */
  #define RADIO_FORCEOVERRIDE_PCP_DOFORCECLOCK_Msk (0x1UL << RADIO_FORCEOVERRIDE_PCP_DOFORCECLOCK_Pos) /*!< Bit mask of
                                                                            DOFORCECLOCK field.*/                                 


/* ====================================================== Struct RADIO ======================================================= */
/**
  * @brief 2.4 GHz radio
  */
  typedef struct {                                   /*!< RADIO Structure                                                      */
    __OM uint32_t TASKS_TXEN;                        /*!< (@ 0x00000000) Enable RADIO in TX mode                               */
    __OM uint32_t TASKS_RXEN;                        /*!< (@ 0x00000004) Enable RADIO in RX mode                               */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000008) Start RADIO                                           */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x0000000C) Stop RADIO                                            */
    __OM uint32_t TASKS_DISABLE;                     /*!< (@ 0x00000010) Disable RADIO                                         */
    __OM uint32_t TASKS_RSSISTART;                   /*!< (@ 0x00000014) Start the RSSI and take one single sample of the
                                                                         receive signal strength*/                                
    __OM uint32_t TASKS_BCSTART;                     /*!< (@ 0x00000018) Start the bit counter                                 */
    __OM uint32_t TASKS_BCSTOP;                      /*!< (@ 0x0000001C) Stop the bit counter                                  */
    __OM uint32_t TASKS_EDSTART;                     /*!< (@ 0x00000020) Start the energy detect measurement used in IEEE
                                                                         802.15.4 mode*/                                          
    __OM uint32_t TASKS_EDSTOP;                      /*!< (@ 0x00000024) Stop the energy detect measurement                    */
    __OM uint32_t TASKS_CCASTART;                    /*!< (@ 0x00000028) Start the clear channel assessment used in IEEE
                                                                         802.15.4 mode*/                                          
    __OM uint32_t TASKS_CCASTOP;                     /*!< (@ 0x0000002C) Stop the clear channel assessment                     */
    __OM uint32_t TASKS_DFESTART;                    /*!< (@ 0x00000030) Start DFE operation                                   */
    __OM uint32_t TASKS_DFESTOP;                     /*!< (@ 0x00000034) Stop DFE operation                                    */
    __OM uint32_t TASKS_ACQINJ0DMASTART;             /*!< (@ 0x00000038) Start DMA transaction                                 */
    __OM uint32_t TASKS_ACQINJ0DMASTOP;              /*!< (@ 0x0000003C) Stop ongoing DMA transaction                          */
    __OM uint32_t TASKS_ACQINJ1DMASTART;             /*!< (@ 0x00000040) Start DMA transaction                                 */
    __OM uint32_t TASKS_ACQINJ1DMASTOP;              /*!< (@ 0x00000044) Stop ongoing DMA transaction                          */
    __OM uint32_t TASKS_CNTPSTART;                   /*!< (@ 0x00000048) Start packet counter                                  */
    __OM uint32_t TASKS_CNTPSTOP;                    /*!< (@ 0x0000004C) Stop packet counter                                   */
    __OM uint32_t TASKS_CNTPCLEAR;                   /*!< (@ 0x00000050) Clear packet counter                                  */
    __OM uint32_t TASKS_LOOPBACKEN;                  /*!< (@ 0x00000054) Enable RADIO in LOOPBACK mode                         */
    __OM uint32_t TASKS_CALSTART;                    /*!< (@ 0x00000058) Start calibration                                     */
    __OM uint32_t TASKS_CALSTOP;                     /*!< (@ 0x0000005C) Stop calibration                                      */
    __OM uint32_t TASKS_PATESTSTART;                 /*!< (@ 0x00000060) Start PA test                                         */
    __OM uint32_t TASKS_PATESTSTOP;                  /*!< (@ 0x00000064) Stop PA test                                          */
    __OM uint32_t TASKS_CHNOINCR;                    /*!< (@ 0x00000068) Update RADIO channel based on the current channel and
                                                                         increment it according to chNoIncrStep*/                 
    __OM uint32_t TASKS_DMASTART;                    /*!< (@ 0x0000006C) Start RADIO DMA transaction                           */
    __OM uint32_t TASKS_DMASTOP;                     /*!< (@ 0x00000070) Stop ongoing RADIO DMA transaction                    */
    __OM uint32_t TASKS_DFEDMASTART;                 /*!< (@ 0x00000074) Start DFE DMA transaction                             */
    __OM uint32_t TASKS_DFEDMASTOP;                  /*!< (@ 0x00000078) Stop ongoing DFE DMA transaction                      */
    __OM uint32_t TASKS_RELOADFREQ;                  /*!< (@ 0x0000007C) Reload new frequency while radio PLL is active        */
    __OM uint32_t TASKS_GETNEXTDETECT;               /*!< (@ 0x00000080) Pull the last item out of the detect FIFO             */
    __OM uint32_t TASKS_CLEARDETECTFIFO;             /*!< (@ 0x00000084) Clear the detect FIFO                                 */
    __OM uint32_t TASKS_RESETDEMODCTRL;              /*!< (@ 0x00000088) Sets all things back to original state in RxDemodCtrl */
    __OM uint32_t TASKS_DEMODCTRLSTARTTIMER;         /*!< (@ 0x0000008C) Start the built-in custom timer (when starting the
                                                                         timer, it always starts from 0)*/                        
    __OM uint32_t TASKS_DEMODCTRLSTOPTIMER;          /*!< (@ 0x00000090) Stop the built-in custom timer (when stopping the
                                                                         timer, it is always cleared afterwards)*/                
    __OM uint32_t TASKS_DEMODCTRLCONDEN0;            /*!< (@ 0x00000094) Enable condition 0 (after this task has been triggered,
                                                                         the condition will trigger exactly once)*/               
    __OM uint32_t TASKS_DEMODCTRLCONDEN1;            /*!< (@ 0x00000098) Enable condition 1 (after this task has been triggered,
                                                                         the condition will trigger exactly once)*/               
    __OM uint32_t TASKS_DEMODCTRLCONDEN2;            /*!< (@ 0x0000009C) Enable condition 2 (after this task has been triggered,
                                                                         the condition will trigger exactly once)*/               
    __IM uint32_t RESERVED[24];
    __IOM uint32_t SUBSCRIBE_TXEN;                   /*!< (@ 0x00000100) Subscribe configuration for task TXEN                 */
    __IOM uint32_t SUBSCRIBE_RXEN;                   /*!< (@ 0x00000104) Subscribe configuration for task RXEN                 */
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000108) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x0000010C) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_DISABLE;                /*!< (@ 0x00000110) Subscribe configuration for task DISABLE              */
    __IOM uint32_t SUBSCRIBE_RSSISTART;              /*!< (@ 0x00000114) Subscribe configuration for task RSSISTART            */
    __IOM uint32_t SUBSCRIBE_BCSTART;                /*!< (@ 0x00000118) Subscribe configuration for task BCSTART              */
    __IOM uint32_t SUBSCRIBE_BCSTOP;                 /*!< (@ 0x0000011C) Subscribe configuration for task BCSTOP               */
    __IOM uint32_t SUBSCRIBE_EDSTART;                /*!< (@ 0x00000120) Subscribe configuration for task EDSTART              */
    __IOM uint32_t SUBSCRIBE_EDSTOP;                 /*!< (@ 0x00000124) Subscribe configuration for task EDSTOP               */
    __IOM uint32_t SUBSCRIBE_CCASTART;               /*!< (@ 0x00000128) Subscribe configuration for task CCASTART             */
    __IOM uint32_t SUBSCRIBE_CCASTOP;                /*!< (@ 0x0000012C) Subscribe configuration for task CCASTOP              */
    __IOM uint32_t SUBSCRIBE_DFESTART;               /*!< (@ 0x00000130) Subscribe configuration for task DFESTART             */
    __IOM uint32_t SUBSCRIBE_DFESTOP;                /*!< (@ 0x00000134) Subscribe configuration for task DFESTOP              */
    __IOM uint32_t SUBSCRIBE_ACQINJ0DMASTART;        /*!< (@ 0x00000138) Subscribe configuration for task ACQINJ0DMASTART      */
    __IOM uint32_t SUBSCRIBE_ACQINJ0DMASTOP;         /*!< (@ 0x0000013C) Subscribe configuration for task ACQINJ0DMASTOP       */
    __IOM uint32_t SUBSCRIBE_ACQINJ1DMASTART;        /*!< (@ 0x00000140) Subscribe configuration for task ACQINJ1DMASTART      */
    __IOM uint32_t SUBSCRIBE_ACQINJ1DMASTOP;         /*!< (@ 0x00000144) Subscribe configuration for task ACQINJ1DMASTOP       */
    __IOM uint32_t SUBSCRIBE_CNTPSTART;              /*!< (@ 0x00000148) Subscribe configuration for task CNTPSTART            */
    __IOM uint32_t SUBSCRIBE_CNTPSTOP;               /*!< (@ 0x0000014C) Subscribe configuration for task CNTPSTOP             */
    __IOM uint32_t SUBSCRIBE_CNTPCLEAR;              /*!< (@ 0x00000150) Subscribe configuration for task CNTPCLEAR            */
    __IOM uint32_t SUBSCRIBE_LOOPBACKEN;             /*!< (@ 0x00000154) Subscribe configuration for task LOOPBACKEN           */
    __IOM uint32_t SUBSCRIBE_CALSTART;               /*!< (@ 0x00000158) Subscribe configuration for task CALSTART             */
    __IOM uint32_t SUBSCRIBE_CALSTOP;                /*!< (@ 0x0000015C) Subscribe configuration for task CALSTOP              */
    __IOM uint32_t SUBSCRIBE_PATESTSTART;            /*!< (@ 0x00000160) Subscribe configuration for task PATESTSTART          */
    __IOM uint32_t SUBSCRIBE_PATESTSTOP;             /*!< (@ 0x00000164) Subscribe configuration for task PATESTSTOP           */
    __IOM uint32_t SUBSCRIBE_CHNOINCR;               /*!< (@ 0x00000168) Subscribe configuration for task CHNOINCR             */
    __IOM uint32_t SUBSCRIBE_DMASTART;               /*!< (@ 0x0000016C) Subscribe configuration for task DMASTART             */
    __IOM uint32_t SUBSCRIBE_DMASTOP;                /*!< (@ 0x00000170) Subscribe configuration for task DMASTOP              */
    __IOM uint32_t SUBSCRIBE_DFEDMASTART;            /*!< (@ 0x00000174) Subscribe configuration for task DFEDMASTART          */
    __IOM uint32_t SUBSCRIBE_DFEDMASTOP;             /*!< (@ 0x00000178) Subscribe configuration for task DFEDMASTOP           */
    __IOM uint32_t SUBSCRIBE_RELOADFREQ;             /*!< (@ 0x0000017C) Subscribe configuration for task RELOADFREQ           */
    __IOM uint32_t SUBSCRIBE_GETNEXTDETECT;          /*!< (@ 0x00000180) Subscribe configuration for task GETNEXTDETECT        */
    __IOM uint32_t SUBSCRIBE_CLEARDETECTFIFO;        /*!< (@ 0x00000184) Subscribe configuration for task CLEARDETECTFIFO      */
    __IOM uint32_t SUBSCRIBE_RESETDEMODCTRL;         /*!< (@ 0x00000188) Subscribe configuration for task RESETDEMODCTRL       */
    __IOM uint32_t SUBSCRIBE_DEMODCTRLSTARTTIMER;    /*!< (@ 0x0000018C) Subscribe configuration for task DEMODCTRLSTARTTIMER  */
    __IOM uint32_t SUBSCRIBE_DEMODCTRLSTOPTIMER;     /*!< (@ 0x00000190) Subscribe configuration for task DEMODCTRLSTOPTIMER   */
    __IOM uint32_t SUBSCRIBE_DEMODCTRLCONDEN0;       /*!< (@ 0x00000194) Subscribe configuration for task DEMODCTRLCONDEN0     */
    __IOM uint32_t SUBSCRIBE_DEMODCTRLCONDEN1;       /*!< (@ 0x00000198) Subscribe configuration for task DEMODCTRLCONDEN1     */
    __IOM uint32_t SUBSCRIBE_DEMODCTRLCONDEN2;       /*!< (@ 0x0000019C) Subscribe configuration for task DEMODCTRLCONDEN2     */
    __IM uint32_t RESERVED1[24];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000200) RADIO has ramped up and is ready to be started        */
    __IOM uint32_t EVENTS_TXREADY;                   /*!< (@ 0x00000204) RADIO has ramped up and is ready to be started TX path*/
    __IOM uint32_t EVENTS_RXREADY;                   /*!< (@ 0x00000208) RADIO has ramped up and is ready to be started RX path*/
    __IOM uint32_t EVENTS_ADDRESS;                   /*!< (@ 0x0000020C) Address sent or received                              */
    __IOM uint32_t EVENTS_FRAMESTART;                /*!< (@ 0x00000210) IEEE 802.15.4 length field received                   */
    __IOM uint32_t EVENTS_PAYLOAD;                   /*!< (@ 0x00000214) Packet payload sent or received                       */
    __IOM uint32_t EVENTS_END;                       /*!< (@ 0x00000218) Packet sent or received                               */
    __IOM uint32_t EVENTS_PHYEND;                    /*!< (@ 0x0000021C) The last bit is sent on air or last bit is received   */
    __IOM uint32_t EVENTS_DISABLED;                  /*!< (@ 0x00000220) RADIO has been disabled                               */
    __IOM uint32_t EVENTS_DEVMATCH;                  /*!< (@ 0x00000224) A device address match occurred on the last received
                                                                         packet*/                                                 
    __IOM uint32_t EVENTS_DEVMISS;                   /*!< (@ 0x00000228) No device address match occurred on the last received
                                                                         packet*/                                                 
    __IOM uint32_t EVENTS_CRCOK;                     /*!< (@ 0x0000022C) Packet received with CRC ok                           */
    __IOM uint32_t EVENTS_CRCERROR;                  /*!< (@ 0x00000230) Packet received with CRC error                        */
    __IM uint32_t RESERVED2;
    __IOM uint32_t EVENTS_BCMATCH;                   /*!< (@ 0x00000238) Bit counter reached bit count value                   */
    __IOM uint32_t EVENTS_EDEND;                     /*!< (@ 0x0000023C) Sampling of energy detection complete (a new ED sample
                                                                         is ready for readout from the RADIO.EDSAMPLE register)*/ 
    __IOM uint32_t EVENTS_EDSTOPPED;                 /*!< (@ 0x00000240) The sampling of energy detection has stopped          */
    __IOM uint32_t EVENTS_CCAIDLE;                   /*!< (@ 0x00000244) Wireless medium in idle - clear to send               */
    __IOM uint32_t EVENTS_CCABUSY;                   /*!< (@ 0x00000248) Wireless medium busy - do not send                    */
    __IOM uint32_t EVENTS_CCASTOPPED;                /*!< (@ 0x0000024C) The CCA has stopped                                   */
    __IOM uint32_t EVENTS_RATEBOOST;                 /*!< (@ 0x00000250) Ble_LR CI field received, receive mode is changed from
                                                                         Ble_LR125Kbit to Ble_LR500Kbit*/                         
    __IOM uint32_t EVENTS_MHRMATCH;                  /*!< (@ 0x00000254) MAC header match found                                */
    __IOM uint32_t EVENTS_SYNC;                      /*!< (@ 0x00000258) Initial sync detected                                 */
    __IOM uint32_t EVENTS_CTEPRESENT;                /*!< (@ 0x0000025C) CTEInfo byte is received                              */
    __IOM uint32_t EVENTS_CTEWARNING;                /*!< (@ 0x00000260) CTEInfo byte received, but contain illegal CTETime or
                                                                         CTEType*/                                                
    __IOM uint32_t EVENTS_DFEEND;                    /*!< (@ 0x00000264) DFE operation has ended                               */
    __IOM uint32_t EVENTS_MODEWRITTEN;               /*!< (@ 0x00000268) Generated on write access to MODE register            */
    __IOM uint32_t EVENTS_MODEREADY;                 /*!< (@ 0x0000026C) Generated immediately on write access to MODE register
                                                                         when MODEPROGENABLE==0, otherwise only manually
                                                                         triggered (SELECT_EVENTS_TRIGGERS=1)*/                   
    __IOM uint32_t EVENTS_CTEEND;                    /*!< (@ 0x00000270) CTE end                                               */
    __IOM uint32_t EVENTS_LBREADY;                   /*!< (@ 0x00000274) RADIO is ready in loopback mode and is able to transmit
                                                                         and receive data*/                                       
    __IOM uint32_t EVENTS_CALDONE;                   /*!< (@ 0x00000278) RADIO calibration is done                             */
    __IOM uint32_t EVENTS_CHNOUPDATED;               /*!< (@ 0x0000027C) RADIO channel no. is updated                          */
    __IOM uint32_t EVENTS_DBCTIMEOUT;                /*!< (@ 0x00000280) DBC timeout to be able to resync                      */
    __IOM uint32_t EVENTS_TXTIMERMATCH;              /*!< (@ 0x00000284) Tx timer match                                        */
    __IOM uint32_t EVENTS_RXTIMERMATCH;              /*!< (@ 0x00000288) Rx timer match                                        */
    __IOM uint32_t EVENTS_BESPOKEACK;                /*!< (@ 0x0000028C) Bespoke ACK for UPSCALE                               */
    __IOM uint32_t EVENTS_RXDIGEN;                   /*!< (@ 0x00000290) RXDIGEN-signal was set high from the HW timing engine */
    __IOM uint32_t EVENTS_RAWDETECT;                 /*!< (@ 0x00000294) The double correlator detected one peak               */
    __IOM uint32_t EVENTS_DETECTFIFOFULL;            /*!< (@ 0x00000298) The detect FIFO is full (this should not happen if the
                                                                         FIFO is sized well enough)*/                             
    __IOM uint32_t EVENTS_TIMERWRAPS;                /*!< (@ 0x0000029C) Event triggering when the timer wraps around (this is
