adamkondraciuk/nrfx/mdk/nrf7140_types.h
                                                                         useful if one wants to count longer than the HW timer
                                                                         allows)*/                                                
    __IOM uint32_t EVENTS_STROBETIMETRACKUPDATED;    /*!< (@ 0x000002A0) New information from the symbol time tracker (see
                                                                         STROBETIMESTATUS)*/                                      
    __IOM uint32_t EVENTS_DEMODCTRLCONDTRIGGERED0;   /*!< (@ 0x000002A4) Condition 0 triggered and actions done                */
    __IOM uint32_t EVENTS_DEMODCTRLCONDTRIGGERED1;   /*!< (@ 0x000002A8) Condition 1 triggered and actions done                */
    __IOM uint32_t EVENTS_DEMODCTRLCONDTRIGGERED2;   /*!< (@ 0x000002AC) Condition 2 triggered and actions done                */
    __IOM uint32_t EVENTS_INTERCEPTEDTASK;           /*!< (@ 0x000002B0) A task has been intercepted (this event is
                                                                         non-interceptable)*/                                     
    __IOM uint32_t EVENTS_INTERCEPTEDEVENT;          /*!< (@ 0x000002B4) An event has been intercepted (this event is
                                                                         non-interceptable)*/                                     
    __IOM uint32_t EVENTS_TXADDRESS;                 /*!< (@ 0x000002B8) Address sent                                          */
    __IOM uint32_t EVENTS_RXADDRESS;                 /*!< (@ 0x000002BC) Address received                                      */
    __IOM uint32_t EVENTS_ACQINJ0DMAEND;             /*!< (@ 0x000002C0) ACQINJ0 DMA end                                       */
    __IOM uint32_t EVENTS_ACQINJ1DMAEND;             /*!< (@ 0x000002C4) ACQINJ1 DMA end                                       */
    __IM uint32_t RESERVED3[14];
    __IOM uint32_t PUBLISH_READY;                    /*!< (@ 0x00000300) Publish configuration for event READY                 */
    __IOM uint32_t PUBLISH_TXREADY;                  /*!< (@ 0x00000304) Publish configuration for event TXREADY               */
    __IOM uint32_t PUBLISH_RXREADY;                  /*!< (@ 0x00000308) Publish configuration for event RXREADY               */
    __IOM uint32_t PUBLISH_ADDRESS;                  /*!< (@ 0x0000030C) Publish configuration for event ADDRESS               */
    __IOM uint32_t PUBLISH_FRAMESTART;               /*!< (@ 0x00000310) Publish configuration for event FRAMESTART            */
    __IOM uint32_t PUBLISH_PAYLOAD;                  /*!< (@ 0x00000314) Publish configuration for event PAYLOAD               */
    __IOM uint32_t PUBLISH_END;                      /*!< (@ 0x00000318) Publish configuration for event END                   */
    __IOM uint32_t PUBLISH_PHYEND;                   /*!< (@ 0x0000031C) Publish configuration for event PHYEND                */
    __IOM uint32_t PUBLISH_DISABLED;                 /*!< (@ 0x00000320) Publish configuration for event DISABLED              */
    __IOM uint32_t PUBLISH_DEVMATCH;                 /*!< (@ 0x00000324) Publish configuration for event DEVMATCH              */
    __IOM uint32_t PUBLISH_DEVMISS;                  /*!< (@ 0x00000328) Publish configuration for event DEVMISS               */
    __IOM uint32_t PUBLISH_CRCOK;                    /*!< (@ 0x0000032C) Publish configuration for event CRCOK                 */
    __IOM uint32_t PUBLISH_CRCERROR;                 /*!< (@ 0x00000330) Publish configuration for event CRCERROR              */
    __IM uint32_t RESERVED4;
    __IOM uint32_t PUBLISH_BCMATCH;                  /*!< (@ 0x00000338) Publish configuration for event BCMATCH               */
    __IOM uint32_t PUBLISH_EDEND;                    /*!< (@ 0x0000033C) Publish configuration for event EDEND                 */
    __IOM uint32_t PUBLISH_EDSTOPPED;                /*!< (@ 0x00000340) Publish configuration for event EDSTOPPED             */
    __IOM uint32_t PUBLISH_CCAIDLE;                  /*!< (@ 0x00000344) Publish configuration for event CCAIDLE               */
    __IOM uint32_t PUBLISH_CCABUSY;                  /*!< (@ 0x00000348) Publish configuration for event CCABUSY               */
    __IOM uint32_t PUBLISH_CCASTOPPED;               /*!< (@ 0x0000034C) Publish configuration for event CCASTOPPED            */
    __IOM uint32_t PUBLISH_RATEBOOST;                /*!< (@ 0x00000350) Publish configuration for event RATEBOOST             */
    __IOM uint32_t PUBLISH_MHRMATCH;                 /*!< (@ 0x00000354) Publish configuration for event MHRMATCH              */
    __IOM uint32_t PUBLISH_SYNC;                     /*!< (@ 0x00000358) Publish configuration for event SYNC                  */
    __IOM uint32_t PUBLISH_CTEPRESENT;               /*!< (@ 0x0000035C) Publish configuration for event CTEPRESENT            */
    __IOM uint32_t PUBLISH_CTEWARNING;               /*!< (@ 0x00000360) Publish configuration for event CTEWARNING            */
    __IOM uint32_t PUBLISH_DFEEND;                   /*!< (@ 0x00000364) Publish configuration for event DFEEND                */
    __IOM uint32_t PUBLISH_MODEWRITTEN;              /*!< (@ 0x00000368) Publish configuration for event MODEWRITTEN           */
    __IOM uint32_t PUBLISH_MODEREADY;                /*!< (@ 0x0000036C) Publish configuration for event MODEREADY             */
    __IOM uint32_t PUBLISH_CTEEND;                   /*!< (@ 0x00000370) Publish configuration for event CTEEND                */
    __IOM uint32_t PUBLISH_LBREADY;                  /*!< (@ 0x00000374) Publish configuration for event LBREADY               */
    __IOM uint32_t PUBLISH_CALDONE;                  /*!< (@ 0x00000378) Publish configuration for event CALDONE               */
    __IOM uint32_t PUBLISH_CHNOUPDATED;              /*!< (@ 0x0000037C) Publish configuration for event CHNOUPDATED           */
    __IOM uint32_t PUBLISH_DBCTIMEOUT;               /*!< (@ 0x00000380) Publish configuration for event DBCTIMEOUT            */
    __IOM uint32_t PUBLISH_TXTIMERMATCH;             /*!< (@ 0x00000384) Publish configuration for event TXTIMERMATCH          */
    __IOM uint32_t PUBLISH_RXTIMERMATCH;             /*!< (@ 0x00000388) Publish configuration for event RXTIMERMATCH          */
    __IOM uint32_t PUBLISH_BESPOKEACK;               /*!< (@ 0x0000038C) Publish configuration for event BESPOKEACK            */
    __IOM uint32_t PUBLISH_RXDIGEN;                  /*!< (@ 0x00000390) Publish configuration for event RXDIGEN               */
    __IOM uint32_t PUBLISH_RAWDETECT;                /*!< (@ 0x00000394) Publish configuration for event RAWDETECT             */
    __IOM uint32_t PUBLISH_DETECTFIFOFULL;           /*!< (@ 0x00000398) Publish configuration for event DETECTFIFOFULL        */
    __IOM uint32_t PUBLISH_TIMERWRAPS;               /*!< (@ 0x0000039C) Publish configuration for event TIMERWRAPS            */
    __IOM uint32_t PUBLISH_STROBETIMETRACKUPDATED;   /*!< (@ 0x000003A0) Publish configuration for event STROBETIMETRACKUPDATED*/
    __IOM uint32_t PUBLISH_DEMODCTRLCONDTRIGGERED0;  /*!< (@ 0x000003A4) Publish configuration for event
                                                                         DEMODCTRLCONDTRIGGERED0*/                                
    __IOM uint32_t PUBLISH_DEMODCTRLCONDTRIGGERED1;  /*!< (@ 0x000003A8) Publish configuration for event
                                                                         DEMODCTRLCONDTRIGGERED1*/                                
    __IOM uint32_t PUBLISH_DEMODCTRLCONDTRIGGERED2;  /*!< (@ 0x000003AC) Publish configuration for event
                                                                         DEMODCTRLCONDTRIGGERED2*/                                
    __IOM uint32_t PUBLISH_INTERCEPTEDTASK;          /*!< (@ 0x000003B0) Publish configuration for event INTERCEPTEDTASK       */
    __IOM uint32_t PUBLISH_INTERCEPTEDEVENT;         /*!< (@ 0x000003B4) Publish configuration for event INTERCEPTEDEVENT      */
    __IOM uint32_t PUBLISH_TXADDRESS;                /*!< (@ 0x000003B8) Publish configuration for event TXADDRESS             */
    __IOM uint32_t PUBLISH_RXADDRESS;                /*!< (@ 0x000003BC) Publish configuration for event RXADDRESS             */
    __IOM uint32_t PUBLISH_ACQINJ0DMAEND;            /*!< (@ 0x000003C0) Publish configuration for event ACQINJ0DMAEND         */
    __IOM uint32_t PUBLISH_ACQINJ1DMAEND;            /*!< (@ 0x000003C4) Publish configuration for event ACQINJ1DMAEND         */
    __IM uint32_t RESERVED5[14];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000400) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED6[31];
    __IOM uint32_t INTEN00;                          /*!< (@ 0x00000480) Enable or disable interrupt                           */
    __IOM uint32_t INTEN01;                          /*!< (@ 0x00000484) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET00;                       /*!< (@ 0x00000488) Enable interrupt                                      */
    __IOM uint32_t INTENSET01;                       /*!< (@ 0x0000048C) Enable interrupt                                      */
    __IOM uint32_t INTENCLR00;                       /*!< (@ 0x00000490) Disable interrupt                                     */
    __IOM uint32_t INTENCLR01;                       /*!< (@ 0x00000494) Disable interrupt                                     */
    __IM uint32_t INTPEND00;                         /*!< (@ 0x00000498) Pending interrupts                                    */
    __IM uint32_t INTPEND01;                         /*!< (@ 0x0000049C) Pending interrupts                                    */
    __IOM uint32_t INTEN10;                          /*!< (@ 0x000004A0) Enable or disable interrupt                           */
    __IOM uint32_t INTEN11;                          /*!< (@ 0x000004A4) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET10;                       /*!< (@ 0x000004A8) Enable interrupt                                      */
    __IOM uint32_t INTENSET11;                       /*!< (@ 0x000004AC) Enable interrupt                                      */
    __IOM uint32_t INTENCLR10;                       /*!< (@ 0x000004B0) Disable interrupt                                     */
    __IOM uint32_t INTENCLR11;                       /*!< (@ 0x000004B4) Disable interrupt                                     */
    __IM uint32_t INTPEND10;                         /*!< (@ 0x000004B8) Pending interrupts                                    */
    __IM uint32_t INTPEND11;                         /*!< (@ 0x000004BC) Pending interrupts                                    */
    __IM uint32_t RESERVED7[16];
    __IOM uint32_t MODE;                             /*!< (@ 0x00000500) Data rate and modulation                              */
    __IOM uint32_t MODEINTERNAL;                     /*!< (@ 0x00000504) Internal mode setting, active only when
                                                                         MODEPROGENABLE==1*/                                      
    __IOM uint32_t MODEPROGENABLE;                   /*!< (@ 0x00000508) Switch that enables programmable modes                */
    __IOM uint32_t MODEDEPENDENTXPBTEST;             /*!< (@ 0x0000050C) Mode dependent XPB test register                      */
    __IOM uint32_t MODECNF;                          /*!< (@ 0x00000510) Radio mode configuration register                     */
    __IOM uint32_t MISC;                             /*!< (@ 0x00000514) Misc configuration collection (to be renamed when more
                                                                         bits are defined)*/                                      
    __IM uint32_t RESERVED8[2];
    __IM uint32_t STATE;                             /*!< (@ 0x00000520) Current radio state                                   */
    __IM uint32_t RESERVED9[3];
    __IOM uint32_t EDCTRL;                           /*!< (@ 0x00000530) IEEE 802.15.4 energy detect control TODO: review and
                                                                         maybe rename in IPS*/                                    
    __IM uint32_t EDSAMPLE;                          /*!< (@ 0x00000534) IEEE 802.15.4 energy detect level                     */
    __IOM uint32_t CCACTRL;                          /*!< (@ 0x00000538) IEEE 802.15.4 clear channel assessment control        */
    __IM uint32_t RESERVED10;
    __IOM uint32_t DATAWHITEIV;                      /*!< (@ 0x00000540) Data whitening initial value TODO:move to FelisMAC    */
    __IM uint32_t RESERVED11;
    __IOM NRF_RADIO_ACQINJ_Type ACQINJ;              /*!< (@ 0x00000548) (unspecified)                                         */
    __IOM NRF_RADIO_ACQINJDMA_Type ACQINJDMA[2];     /*!< (@ 0x00000550) (unspecified)                                         */
    __IOM NRF_RADIO_TESTINTERFACE_Type TESTINTERFACE; /*!< (@ 0x00000570) 2.4 GHz radio direct test interface                  */
    __IM uint32_t RESERVED12[5];
    __IM uint32_t GAINOUT;                           /*!< (@ 0x000005A0) Gain readout (LNA_OUT_SPI for nrf52/53)               */
    __IM uint32_t RESERVED13[3];
    __IOM NRF_RADIO_INTERCEPT_Type INTERCEPT;        /*!< (@ 0x000005B0) Write 1 to a bit to arm the task/event at that index
                                                                         for a single intercept. Write 0 to a bit to disarm.
                                                                         After arming, the bit will be read out as 1 until the
                                                                         task/event has been intercepted or disarmed, after
                                                                         which it will be read out as 0. Both PPI-triggered and
                                                                         APB-triggered tasks will be intercepted. Only
                                                                         core-triggered events will be intercepted, not
                                                                         APB-triggered events.*/                                  
    __IM uint32_t RESERVED14[11];
    __IOM NRF_RADIO_AHBMASTERS_Type AHBMASTERS;      /*!< (@ 0x000005F0) For setting priorities among RADIO/CRYPTO AHB masters
                                                                         if interfaced with Nordic's AMBA Interconnect IP*/       
    __IM uint32_t RESERVED15[67];
    __IOM uint32_t SHORTCUTANA;                      /*!< (@ 0x00000700) Internal shortcuts for RADIO PHY                      */
    __IOM uint32_t TIMING;                           /*!< (@ 0x00000704) Timing                                                */
    __IOM uint32_t FREQUENCY;                        /*!< (@ 0x00000708) Frequency                                             */
    __IOM uint32_t FREQUENCYCONFIG;                  /*!< (@ 0x0000070C) Configuration of frequency control                    */
    __IOM uint32_t TXPOWER;                          /*!< (@ 0x00000710) Output power                                          */
    __IOM uint32_t TIFS;                             /*!< (@ 0x00000714) Interframe spacing in us                              */
    __IM uint32_t RSSISAMPLE;                        /*!< (@ 0x00000718) RSSI sample                                           */
    __IOM uint32_t EVENTCONFIG;                      /*!< (@ 0x0000071C) Event configuration                                   */
    __IOM NRF_RADIO_CALIBRATION_Type CALIBRATION;    /*!< (@ 0x00000720) (unspecified)                                         */
    __IM uint32_t RESERVED16;
    __IOM NRF_RADIO_SPHYNXANA_Type SPHYNXANA;        /*!< (@ 0x00000730) (unspecified)                                         */
    __IM uint32_t RESERVED17[4];
    __IOM uint32_t TEXTAMP;                          /*!< (@ 0x0000076C) Timing control of external RADIO amplifier (LNA/PA)   */
    __IOM NRF_RADIO_TIMINGENGINE_Type TIMINGENGINE;  /*!< (@ 0x00000770) (unspecified)                                         */
    __IOM NRF_RADIO_RXAGC_Type RXAGC;                /*!< (@ 0x000007D0) (unspecified)                                         */
    __IM uint32_t RESERVED18;
    __IOM NRF_RADIO_RXIF_Type RXIF;                  /*!< (@ 0x000007E4) (unspecified)                                         */
    __IOM uint32_t BITCONVERTER;                     /*!< (@ 0x000007E8) Configuration of ADC output to digital front-end      */
    __IM uint32_t RESERVED19;
    __IOM uint32_t DATAACQVIADMA;                    /*!< (@ 0x000007F0) Data acquisition settings. Only available when
                                                                         INCLUDE_DMA is set to 1*/                                
    __IOM uint32_t MODESTANDALONE;                   /*!< (@ 0x000007F4) Data rate and modulation when SPHYNX in standalone
                                                                         mode*/                                                   
    __IM uint32_t RESERVED20;
    __IOM uint32_t DEBUGRADIOPHY;                    /*!< (@ 0x000007FC) Debug for radio PHY                                   */
    __IOM uint32_t ADPLLCOMMAND;                     /*!< (@ 0x00000800) Send or receive command directly to the AdPll digital
                                                                         island. Only write to this register when FSASYNCBUSBUSY
                                                                         returns 0*/                                              
    __IOM uint32_t FSFREQFINETUNE;                   /*!< (@ 0x00000804) Allows fine-tuning the RF frequency with a very fine
                                                                         resolution*/                                             
    __IOM uint32_t DEVIATION;                        /*!< (@ 0x00000808) Frequency deviation for modulation                    */
    __IOM uint32_t MODRATE;                          /*!< (@ 0x0000080C) Select modulation rate                                */
    __IOM uint32_t MODFILTERING;                     /*!< (@ 0x00000810) Select gaussian filtering mode                        */
    __IOM uint32_t CUSTOMMODULATION;                 /*!< (@ 0x00000814) Enable reading from memory and passing data over to
                                                                         AdPll*/                                                  
    __IOM uint32_t FSCLOCKSELECT;                    /*!< (@ 0x00000818) Set the clock source for the AdPll digital island     */
    __IM uint32_t FSUNITRIGCALVAL;                   /*!< (@ 0x0000081C) Read the calibrated value for the universal trigger   */
    __IOM uint32_t FSUNITRIGMANUAL;                  /*!< (@ 0x00000820) Manual control of the uni trigger signals. Note that
                                                                         fsUniTriggerCalWord is controlled by writing to the
                                                                         separate register FSUNITRIGCALVAL*/                      
    __IM uint32_t FSUNITRIGCALOUT;                   /*!< (@ 0x00000824) Read the signal directly from fsUniTriggerCalOut      */
    __IOM uint32_t FSASYNCBUSCONF;                   /*!< (@ 0x00000828) Some special settings for the asynchronous bus
                                                                         configuration*/                                          
    __IM uint32_t FSASYNCBUSBUSY;                    /*!< (@ 0x0000082C) Status bit indicating whether the bus is currently busy
                                                                         or not*/                                                 
    __IOM uint32_t ADPLLCOMPANIONBACKDOORS;          /*!< (@ 0x00000830) This value is written to the AdPll when powering up the
                                                                         digital island*/                                         
    __IM uint32_t RESERVED21[3];
    __IOM uint32_t EXPECTEDPVTTOTRATIO;              /*!< (@ 0x00000840) This value is written to the AdPll when powering up the
                                                                         digital island*/                                         
    __IOM uint32_t ESTKDTCVAL;                       /*!< (@ 0x00000844) This value is written to the AdPll when powering up the
                                                                         digital island*/                                         
    __IOM uint32_t TXINTERFACEHFGAIN;                /*!< (@ 0x00000848) This value is written to the AdPll when powering up the
                                                                         digital island*/                                         
    __IOM uint32_t TRACING;                          /*!< (@ 0x0000084C) Enable tracing from AdPll                             */
    __IOM uint32_t IFFREQ;                           /*!< (@ 0x00000850) Select between two different IF frequencies           */
    __IM uint32_t ADPLLCOMPANIONSTATE;               /*!< (@ 0x00000854) State in the AdPllCompanion state machines            */
    __IM uint32_t RESERVED22[6];
    __IOM uint32_t RELOADFREQINTERNAL;               /*!< (@ 0x00000870) Non-official task: AdPll will reread the frequency
                                                                         input signal*/                                           
    __IOM uint32_t UNITRIGCALSTART;                  /*!< (@ 0x00000874) Non-official task: Start automatic universal trigger
                                                                         calibration*/                                            
    __IOM uint32_t FSSENDSETTINGS;                   /*!< (@ 0x00000878) Non-official task: Send the auto-settings to AdPll
                                                                         again. This also happens at every startup*/              
    __IOM uint32_t CHANGEPHASEINTERNAL;              /*!< (@ 0x0000087C) Non-official task: AdPll will change the phase as given
                                                                         by the internal AdPll register PHASE_CHANGE*/            
    __IOM uint32_t UNITRIGCALDONE;                   /*!< (@ 0x00000880) Non-official event: Start automatic universal trigger
                                                                         calibration*/                                            
    __IOM uint32_t REJECTEDTRANS;                    /*!< (@ 0x00000884) Non-official event: The command written to AdPll was
                                                                         rejected because of an ongoing transaction*/             
    __IOM uint32_t COMPLETETRANS;                    /*!< (@ 0x00000888) Non-official event: Completed a transaction to AdPll
                                                                         successfully (only when CHECKSTATUS is set)*/            
    __IOM uint32_t FAILEDTRANS;                      /*!< (@ 0x0000088C) Non-official event: Did not successfully complete a
                                                                         transaction to AdPll. (only when CHECKSTATUS is set)*/   
    __IM uint32_t RESERVED23[4];
    __IOM uint32_t ADPLLSTARTUPCOMMAND0;             /*!< (@ 0x000008A0) This value is written to the AdPll when powering up the
                                                                         digital island*/                                         
