adamkondraciuk/nrfx/mdk/nrf7140_types.h
    __IOM uint32_t ADPLLSTARTUPCOMMAND1;             /*!< (@ 0x000008A4) This value is written to the AdPll when powering up the
                                                                         digital island*/                                         
    __IOM uint32_t ADPLLSTARTUPCOMMAND2;             /*!< (@ 0x000008A8) This value is written to the AdPll when powering up the
                                                                         digital island*/                                         
    __IOM uint32_t ADPLLSTARTUPCOMMAND3;             /*!< (@ 0x000008AC) This value is written to the AdPll when powering up the
                                                                         digital island*/                                         
    __IOM uint32_t ADPLLSTARTUPCOMMAND4;             /*!< (@ 0x000008B0) This value is written to the AdPll when powering up the
                                                                         digital island*/                                         
    __IOM uint32_t ADPLLSTARTUPCOMMAND5;             /*!< (@ 0x000008B4) This value is written to the AdPll when powering up the
                                                                         digital island*/                                         
    __IOM uint32_t ADPLLSTARTUPCOMMAND6;             /*!< (@ 0x000008B8) This value is written to the AdPll when powering up the
                                                                         digital island*/                                         
    __IOM uint32_t ADPLLSTARTUPCOMMAND7;             /*!< (@ 0x000008BC) This value is written to the AdPll when powering up the
                                                                         digital island*/                                         
    __IM uint32_t RESERVED24[4];
    __IOM uint32_t ADPLLCOMPANIONINTEN;              /*!< (@ 0x000008D0) (unspecified)                                         */
    __IOM uint32_t ADPLLCOMPANIONINTENSET;           /*!< (@ 0x000008D4) (unspecified)                                         */
    __IOM uint32_t ADPLLCOMPANIONINTENCLR;           /*!< (@ 0x000008D8) (unspecified)                                         */
    __IM uint32_t ADPLLCOMPANIONINTPEND;             /*!< (@ 0x000008DC) (unspecified)                                         */
    __IM uint32_t RESERVED25[8];
    __IOM uint32_t MODECONF;                         /*!< (@ 0x00000900) Mode specific configuration regiser                   */
    __IM uint32_t FESTATUS;                          /*!< (@ 0x00000904) Frontend readout register                             */
    __IOM uint32_t FECONFIG;                         /*!< (@ 0x00000908) Config register                                       */
    __IOM uint32_t IQCALCONF;                        /*!< (@ 0x0000090C) Gain and phase mismatch calibration control for I and
                                                                         Q*/                                                      
    __IOM uint32_t BBPKDETCONF;                      /*!< (@ 0x00000910) Configuration for baseband peak detector              */
    __IOM NRF_RADIO_DECFILTERS_Type DECFILTERS;      /*!< (@ 0x00000914) (unspecified)                                         */
    __IOM NRF_RADIO_CHANNELFILTERS_Type CHANNELFILTERS; /*!< (@ 0x00000970) (unspecified)                                      */
    __IM uint32_t RESERVED26[58];
    __IM uint32_t CFO_STAT;                          /*!< (@ 0x00000B00) Carrier freq. offset estimate                         */
    __IOM uint32_t PBTEST;                           /*!< (@ 0x00000B04) Test: PB calibration                                  */
    __IOM uint32_t DBCCOEFFS;                        /*!< (@ 0x00000B08) Test and Debug: DBC coefficients override             */
    __IOM uint32_t QOVERRIDE4;                       /*!< (@ 0x00000B0C) Trim value override register 4 for nRF52              */
    __IOM uint32_t QOVERRIDE5;                       /*!< (@ 0x00000B10) Trim value override register 5 for nRF52              */
    __IOM uint32_t QOVERRIDE6;                       /*!< (@ 0x00000B14) Trim value override register 6 for nRF52              */
    __IOM uint32_t QOVERRIDE9;                       /*!< (@ 0x00000B18) Trim value override register 9 for nRF52              */
    __IM uint32_t RESERVED27[2];
    __IOM uint32_t QOVERRIDE12;                      /*!< (@ 0x00000B24) Trim value override register 12 for nRF52             */
    __IOM uint32_t QOVERRIDE23;                      /*!< (@ 0x00000B28) Trim value override register 23 for nRF52             */
    __IOM uint32_t LELRMISC;                         /*!< (@ 0x00000B2C) Miscellaneous Controls for Long Range                 */
    __IOM uint32_t QOVERRIDE25;                      /*!< (@ 0x00000B30) TODO                                                  */
    __IOM uint32_t DBCPEAKDETTHR;                    /*!< (@ 0x00000B34) Thresholds for each peak detector instance            */
    __IM uint32_t BITSLICERSTAT;                     /*!< (@ 0x00000B38) Payload status                                        */
    __IOM uint32_t BBCTRL;                           /*!< (@ 0x00000B3C) Miscellaneous mode bits                               */
    __IOM uint32_t DBCCORR;                          /*!< (@ 0x00000B40) Thresholds for the double correlator                  */
    __IOM uint32_t BSCONFIG;                         /*!< (@ 0x00000B44) Bitslicer configuration                               */
    __IOM uint32_t MFB;                              /*!< (@ 0x00000B48) Matched Filter Bank (MFB) configuration               */
    __IOM uint32_t CN;                               /*!< (@ 0x00000B4C) Configuration for the CNRIPPLEWARN functionality used
                                                                         for BLE LR. Configuration is only enabled when
                                                                         OVRENCNRIPPLEWARNCFG in OVERRIDE23 is set*/              
    __IOM uint32_t PEAK;                             /*!< (@ 0x00000B50) Peak detector configuration                           */
    __IOM uint32_t BBCKSEL;                          /*!< (@ 0x00000B54) Clock rates                                           */
    __IOM uint32_t DBCORRADAP;                       /*!< (@ 0x00000B58) Adaptive thresholds for double correlator.            */
    __IM uint32_t MNSTORED;                          /*!< (@ 0x00000B5C) Stored value of Cn and Pn from the double correlator at
                                                                         the last detect*/                                        
    __IM uint32_t CNEARLYLATE;                       /*!< (@ 0x00000B60) The Cn value associated with the clock cycle before and
                                                                         after the actually double correlator peak was found
                                                                         (detect)*/                                               
    __IM uint32_t RESERVED28[3];
    __IOM uint32_t STTCNFG_LR;                       /*!< (@ 0x00000B70) Strobe time tracking configuration in long range mode */
    __IOM uint32_t STTCNFG;                          /*!< (@ 0x00000B74) Strobe time tracking Configuration (Symbol Timing)    */
    __IOM uint32_t DRIFTLR;                          /*!< (@ 0x00000B78) Drift Controls in Long Range                          */
    __IOM uint32_t DRIFT1;                           /*!< (@ 0x00000B7C) Drift Estimator configuration                         */
    __IOM uint32_t DRIFT2;                           /*!< (@ 0x00000B80) Drift Estimator configuration                         */
    __IOM uint32_t DSSS;                             /*!< (@ 0x00000B84) DSSS synchronizer trim values                         */
    __IOM uint32_t AUTOCORR;                         /*!< (@ 0x00000B88) Autocorrelator configuration                          */
    __IOM uint32_t LRSYNC;                           /*!< (@ 0x00000B8C) LrSyncEngine configuration                            */
    __IOM uint32_t QOVERRIDE26;                      /*!< (@ 0x00000B90) Override for selecting whether to use LrSyncEngine or
                                                                         the classic demodulator.*/                               
    __IOM uint32_t QOVERRIDE27;                      /*!< (@ 0x00000B94) Override for selecting whether to use enhanced IEEE
                                                                         802.15.4 or the classic IEEE 802.15.4 demodulator.*/     
    __IOM uint32_t RXSYNC;                           /*!< (@ 0x00000B98) RxSyncEngine configuration                            */
    __IM uint32_t RESERVED29[25];
    __IOM uint32_t TXCONFIG;                         /*!< (@ 0x00000C00) Tx configuration                                      */
    __IM uint32_t RESERVED30[63];
    __IOM uint32_t DFEMODE;                          /*!< (@ 0x00000D00) Whether to use Angle-of-Arrival (AOA) or
                                                                         Angle-of-Departure (AOD)*/                               
    __IM uint32_t DFESTATUS;                         /*!< (@ 0x00000D04) DFE status information                                */
    __IM uint32_t RESERVED31[2];
    __IOM uint32_t DFECTRL1;                         /*!< (@ 0x00000D10) Various configuration for Direction finding           */
    __IOM uint32_t DFECTRL2;                         /*!< (@ 0x00000D14) Start offset for Direction finding                    */
    __IOM uint32_t DFECTRL3;                         /*!< (@ 0x00000D18) Various hacker/tuning configuration for Direction
                                                                         finding*/                                                
    __IOM uint32_t DFECTRL4;                         /*!< (@ 0x00000D1C) Various hacker/tuning configuration for Direction
                                                                         finding*/                                                
    __IOM uint32_t DFECTRL5;                         /*!< (@ 0x00000D20) Various hacker/tuning configuration for Direction
                                                                         finding*/                                                
    __IM uint32_t RESERVED32;
    __IOM uint32_t SWITCHPATTERN;                    /*!< (@ 0x00000D28) GPIO patterns to be used for each antenna             */
    __OM uint32_t CLEARPATTERN;                      /*!< (@ 0x00000D2C) Clear the GPIO pattern array for antenna control      */
    __IOM NRF_RADIO_PSEL_Type PSEL;                  /*!< (@ 0x00000D30) (unspecified)                                         */
    __IOM NRF_RADIO_DFEPACKET_Type DFEPACKET;        /*!< (@ 0x00000D50) DFE packet EasyDMA channel                            */
    __IM uint32_t RESERVED33;
    __IOM uint32_t DFEDMASTART;                      /*!< (@ 0x00000D64) Manually start DmaChannelPeripheral for DFE           */
    __IOM uint32_t DFEDMASTOP;                       /*!< (@ 0x00000D68) Force stop DmaChannelPeripheral for DFE               */
    __IM uint32_t DFEDMAAHBERROR;                    /*!< (@ 0x00000D6C) Points to where the AHB error occured                 */
    __IM uint32_t RESERVED34[36];
    __OM uint32_t CNTPSTART;                         /*!< (@ 0x00000E00) Start packet counter                                  */
    __OM uint32_t CNTPSTOP;                          /*!< (@ 0x00000E04) Stop packet counter                                   */
    __OM uint32_t CNTPCLEAR;                         /*!< (@ 0x00000E08) Clear packet counter                                  */
    __IM uint32_t CRCSTATUS;                         /*!< (@ 0x00000E0C) CRC status                                            */
    __IM uint32_t RXMATCH;                           /*!< (@ 0x00000E10) Received address                                      */
    __IM uint32_t RXCRC;                             /*!< (@ 0x00000E14) CRC field of previously received packet               */
    __IM uint32_t DAI;                               /*!< (@ 0x00000E18) Device address match index                            */
    __IM uint32_t PDUSTAT;                           /*!< (@ 0x00000E1C) Payload status                                        */
    __IOM uint32_t PCNF0;                            /*!< (@ 0x00000E20) Packet configuration register 0                       */
    __IOM uint32_t PCNF0SEC;                         /*!< (@ 0x00000E24) Packet configuration register 0 in concurrent receive
                                                                         mode in BLE LR*/                                         
    __IOM uint32_t PCNF1;                            /*!< (@ 0x00000E28) Packet configuration register 1                       */
    __IOM uint32_t BASE0;                            /*!< (@ 0x00000E2C) Base address 0                                        */
    __IOM uint32_t BASE1;                            /*!< (@ 0x00000E30) Base address 1                                        */
    __IOM uint32_t PREFIX0;                          /*!< (@ 0x00000E34) Prefixes bytes for logical addresses 0-3              */
    __IOM uint32_t PREFIX1;                          /*!< (@ 0x00000E38) Prefixes bytes for logical addresses 4-7              */
    __IOM uint32_t TXADDRESS;                        /*!< (@ 0x00000E3C) Transmit address select                               */
    __IOM uint32_t RXADDRESSES;                      /*!< (@ 0x00000E40) Receive address select                                */
    __IOM uint32_t CRCCNF;                           /*!< (@ 0x00000E44) CRC configuration                                     */
    __IOM uint32_t CRCPOLY;                          /*!< (@ 0x00000E48) CRC polynomial                                        */
    __IOM uint32_t CRCINIT;                          /*!< (@ 0x00000E4C) CRC initial value                                     */
    __IOM uint32_t DAB[8];                           /*!< (@ 0x00000E50) Device address base segment n                         */
    __IOM uint32_t DAP[8];                           /*!< (@ 0x00000E70) Device address prefix n                               */
    __IOM uint32_t DACNF;                            /*!< (@ 0x00000E90) Device address match configuration                    */
    __IOM uint32_t BCC;                              /*!< (@ 0x00000E94) Bit counter compare                                   */
    __IOM uint32_t AACHKOVERRIDE;                    /*!< (@ 0x00000E98) Address Check Override                                */
    __IM uint32_t PACKETCNTR1;                       /*!< (@ 0x00000E9C) (unspecified)                                         */
    __IM uint32_t PACKETCNTR2;                       /*!< (@ 0x00000EA0) (unspecified)                                         */
    __IM uint32_t CTESTATUS;                         /*!< (@ 0x00000EA4) CTEInfo parsed from received packet                   */
    __IM uint32_t HYPSTDCHECKSTAT;                   /*!< (@ 0x00000EA8) Address Check Override                                */
    __IM uint32_t HYPSTDAADIFFVEC;                   /*!< (@ 0x00000EAC) Address Diff Vector                                   */
    __IOM uint32_t ADDRWINSIZE;                      /*!< (@ 0x00000EB0) Address match safe window size (the number of bits
                                                                         after detect is asserted, before starting to look for
                                                                         address match). Only valid when
                                                                         OVERRIDE22.DISABLEADDRWINDOW is '0'.*/                   
    __IOM uint32_t MHRMATCHCONF;                     /*!< (@ 0x00000EB4) Search pattern configuration                          */
    __IOM uint32_t MHRMATCHMASK;                     /*!< (@ 0x00000EB8) Pattern mask                                          */
    __IOM uint32_t SFD;                              /*!< (@ 0x00000EBC) IEEE 802.15.4 start of frame delimiter                */
    __IOM uint32_t CTEINLINECONF;                    /*!< (@ 0x00000EC0) Configuration for CTE inline mode                     */
    __OM uint32_t DMASTART;                          /*!< (@ 0x00000EC4) (unspecified)                                         */
    __OM uint32_t DMASTOP;                           /*!< (@ 0x00000EC8) (unspecified)                                         */
    __IOM uint32_t DMAENABLE;                        /*!< (@ 0x00000ECC) (unspecified)                                         */
    __IOM uint32_t PACKETPTR;                        /*!< (@ 0x00000ED0) (unspecified)                                         */
    __IM uint32_t DMAAMOUNT;                         /*!< (@ 0x00000ED4) (unspecified)                                         */
    __IOM uint32_t DMAMAXCNT;                        /*!< (@ 0x00000ED8) (unspecified)                                         */
    __IM uint32_t RESERVED35[9];
    __IOM NRF_RADIO_LBMAC_Type LBMAC;                /*!< (@ 0x00000F00) (unspecified)                                         */
    __IM uint32_t RESERVED36[841];
    __IOM NRF_RADIO_DFT_Type DFT;                    /*!< (@ 0x00001D00) (unspecified)                                         */
    __IM uint32_t RESERVED37[124];
    __IOM NRF_RADIO_PENALTYTRIGPCP4_Type PENALTYTRIGPCP4; /*!< (@ 0x00001F00) (unspecified)                                    */
    __IOM NRF_RADIO_PENALTYTRIGPCP3_Type PENALTYTRIGPCP3; /*!< (@ 0x00001F08) (unspecified)                                    */
    __IOM NRF_RADIO_PENALTYTRIGPCP2_Type PENALTYTRIGPCP2; /*!< (@ 0x00001F10) (unspecified)                                    */
    __IOM NRF_RADIO_PENALTYTRIGPCP1_Type PENALTYTRIGPCP1; /*!< (@ 0x00001F18) (unspecified)                                    */
    __IOM NRF_RADIO_PENALTYTRIGPCP0_Type PENALTYTRIGPCP0; /*!< (@ 0x00001F20) (unspecified)                                    */
    __IOM NRF_RADIO_PENALTYREG_Type PENALTYREG;      /*!< (@ 0x00001F28) (unspecified)                                         */
    __IM uint32_t AUTOCLOCKSOURCEREQ;                /*!< (@ 0x00001F3C) (unspecified)                                         */
    __IOM NRF_RADIO_FORCEOVERRIDE_Type FORCEOVERRIDE; /*!< (@ 0x00001F40) (unspecified)                                        */
  } NRF_RADIO_Type;                                  /*!< Size = 8020 (0x1F54)                                                 */

/* RADIO_TASKS_TXEN: Enable RADIO in TX mode */
  #define RADIO_TASKS_TXEN_ResetValue (0x00000000UL) /*!< Reset value of TASKS_TXEN register.                                  */

