adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_TASKS_BCSTOP: Stop the bit counter */
  #define RADIO_TASKS_BCSTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_BCSTOP register.                              */

/* TASKS_BCSTOP @Bit 0 : Stop the bit counter */
  #define RADIO_TASKS_BCSTOP_TASKS_BCSTOP_Pos (0UL)  /*!< Position of TASKS_BCSTOP field.                                      */
  #define RADIO_TASKS_BCSTOP_TASKS_BCSTOP_Msk (0x1UL << RADIO_TASKS_BCSTOP_TASKS_BCSTOP_Pos) /*!< Bit mask of TASKS_BCSTOP
                                                                            field.*/                                              
  #define RADIO_TASKS_BCSTOP_TASKS_BCSTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_BCSTOP field.                         */
  #define RADIO_TASKS_BCSTOP_TASKS_BCSTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_BCSTOP field.                         */
  #define RADIO_TASKS_BCSTOP_TASKS_BCSTOP_Trigger (0x1UL) /*!< Trigger task                                                    */


/* RADIO_TASKS_EDSTART: Start the energy detect measurement used in IEEE 802.15.4 mode */
  #define RADIO_TASKS_EDSTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_EDSTART register.                            */

/* TASKS_EDSTART @Bit 0 : Start the energy detect measurement used in IEEE 802.15.4 mode */
  #define RADIO_TASKS_EDSTART_TASKS_EDSTART_Pos (0UL) /*!< Position of TASKS_EDSTART field.                                    */
  #define RADIO_TASKS_EDSTART_TASKS_EDSTART_Msk (0x1UL << RADIO_TASKS_EDSTART_TASKS_EDSTART_Pos) /*!< Bit mask of TASKS_EDSTART
                                                                            field.*/                                              
  #define RADIO_TASKS_EDSTART_TASKS_EDSTART_Min (0x1UL) /*!< Min enumerator value of TASKS_EDSTART field.                      */
  #define RADIO_TASKS_EDSTART_TASKS_EDSTART_Max (0x1UL) /*!< Max enumerator value of TASKS_EDSTART field.                      */
  #define RADIO_TASKS_EDSTART_TASKS_EDSTART_Trigger (0x1UL) /*!< Trigger task                                                  */


/* RADIO_TASKS_EDSTOP: Stop the energy detect measurement */
  #define RADIO_TASKS_EDSTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_EDSTOP register.                              */

/* TASKS_EDSTOP @Bit 0 : Stop the energy detect measurement */
  #define RADIO_TASKS_EDSTOP_TASKS_EDSTOP_Pos (0UL)  /*!< Position of TASKS_EDSTOP field.                                      */
  #define RADIO_TASKS_EDSTOP_TASKS_EDSTOP_Msk (0x1UL << RADIO_TASKS_EDSTOP_TASKS_EDSTOP_Pos) /*!< Bit mask of TASKS_EDSTOP
                                                                            field.*/                                              
  #define RADIO_TASKS_EDSTOP_TASKS_EDSTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_EDSTOP field.                         */
  #define RADIO_TASKS_EDSTOP_TASKS_EDSTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_EDSTOP field.                         */
  #define RADIO_TASKS_EDSTOP_TASKS_EDSTOP_Trigger (0x1UL) /*!< Trigger task                                                    */


/* RADIO_TASKS_CCASTART: Start the clear channel assessment used in IEEE 802.15.4 mode */
  #define RADIO_TASKS_CCASTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CCASTART register.                          */

/* TASKS_CCASTART @Bit 0 : Start the clear channel assessment used in IEEE 802.15.4 mode */
  #define RADIO_TASKS_CCASTART_TASKS_CCASTART_Pos (0UL) /*!< Position of TASKS_CCASTART field.                                 */
  #define RADIO_TASKS_CCASTART_TASKS_CCASTART_Msk (0x1UL << RADIO_TASKS_CCASTART_TASKS_CCASTART_Pos) /*!< Bit mask of
                                                                            TASKS_CCASTART field.*/                               
  #define RADIO_TASKS_CCASTART_TASKS_CCASTART_Min (0x1UL) /*!< Min enumerator value of TASKS_CCASTART field.                   */
  #define RADIO_TASKS_CCASTART_TASKS_CCASTART_Max (0x1UL) /*!< Max enumerator value of TASKS_CCASTART field.                   */
  #define RADIO_TASKS_CCASTART_TASKS_CCASTART_Trigger (0x1UL) /*!< Trigger task                                                */


/* RADIO_TASKS_CCASTOP: Stop the clear channel assessment */
  #define RADIO_TASKS_CCASTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CCASTOP register.                            */

/* TASKS_CCASTOP @Bit 0 : Stop the clear channel assessment */
  #define RADIO_TASKS_CCASTOP_TASKS_CCASTOP_Pos (0UL) /*!< Position of TASKS_CCASTOP field.                                    */
  #define RADIO_TASKS_CCASTOP_TASKS_CCASTOP_Msk (0x1UL << RADIO_TASKS_CCASTOP_TASKS_CCASTOP_Pos) /*!< Bit mask of TASKS_CCASTOP
                                                                            field.*/                                              
  #define RADIO_TASKS_CCASTOP_TASKS_CCASTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_CCASTOP field.                      */
  #define RADIO_TASKS_CCASTOP_TASKS_CCASTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_CCASTOP field.                      */
  #define RADIO_TASKS_CCASTOP_TASKS_CCASTOP_Trigger (0x1UL) /*!< Trigger task                                                  */


/* RADIO_TASKS_DFESTART: Start DFE operation */
  #define RADIO_TASKS_DFESTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DFESTART register.                          */

/* TASKS_DFESTART @Bit 0 : Start DFE operation */
  #define RADIO_TASKS_DFESTART_TASKS_DFESTART_Pos (0UL) /*!< Position of TASKS_DFESTART field.                                 */
  #define RADIO_TASKS_DFESTART_TASKS_DFESTART_Msk (0x1UL << RADIO_TASKS_DFESTART_TASKS_DFESTART_Pos) /*!< Bit mask of
                                                                            TASKS_DFESTART field.*/                               
  #define RADIO_TASKS_DFESTART_TASKS_DFESTART_Min (0x1UL) /*!< Min enumerator value of TASKS_DFESTART field.                   */
  #define RADIO_TASKS_DFESTART_TASKS_DFESTART_Max (0x1UL) /*!< Max enumerator value of TASKS_DFESTART field.                   */
  #define RADIO_TASKS_DFESTART_TASKS_DFESTART_Trigger (0x1UL) /*!< Trigger task                                                */


/* RADIO_TASKS_DFESTOP: Stop DFE operation */
  #define RADIO_TASKS_DFESTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DFESTOP register.                            */

/* TASKS_DFESTOP @Bit 0 : Stop DFE operation */
  #define RADIO_TASKS_DFESTOP_TASKS_DFESTOP_Pos (0UL) /*!< Position of TASKS_DFESTOP field.                                    */
  #define RADIO_TASKS_DFESTOP_TASKS_DFESTOP_Msk (0x1UL << RADIO_TASKS_DFESTOP_TASKS_DFESTOP_Pos) /*!< Bit mask of TASKS_DFESTOP
                                                                            field.*/                                              
  #define RADIO_TASKS_DFESTOP_TASKS_DFESTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_DFESTOP field.                      */
  #define RADIO_TASKS_DFESTOP_TASKS_DFESTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_DFESTOP field.                      */
  #define RADIO_TASKS_DFESTOP_TASKS_DFESTOP_Trigger (0x1UL) /*!< Trigger task                                                  */


/* RADIO_TASKS_ACQINJ0DMASTART: Start DMA transaction */
  #define RADIO_TASKS_ACQINJ0DMASTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_ACQINJ0DMASTART register.            */

/* TASKS_ACQINJ0DMASTART @Bit 0 : Start DMA transaction */
  #define RADIO_TASKS_ACQINJ0DMASTART_TASKS_ACQINJ0DMASTART_Pos (0UL) /*!< Position of TASKS_ACQINJ0DMASTART field.            */
  #define RADIO_TASKS_ACQINJ0DMASTART_TASKS_ACQINJ0DMASTART_Msk (0x1UL << RADIO_TASKS_ACQINJ0DMASTART_TASKS_ACQINJ0DMASTART_Pos)
                                                                            /*!< Bit mask of TASKS_ACQINJ0DMASTART field.*/       
  #define RADIO_TASKS_ACQINJ0DMASTART_TASKS_ACQINJ0DMASTART_Min (0x1UL) /*!< Min enumerator value of TASKS_ACQINJ0DMASTART
                                                                            field.*/                                              
  #define RADIO_TASKS_ACQINJ0DMASTART_TASKS_ACQINJ0DMASTART_Max (0x1UL) /*!< Max enumerator value of TASKS_ACQINJ0DMASTART
                                                                            field.*/                                              
  #define RADIO_TASKS_ACQINJ0DMASTART_TASKS_ACQINJ0DMASTART_Trigger (0x1UL) /*!< Trigger task                                  */


/* RADIO_TASKS_ACQINJ0DMASTOP: Stop ongoing DMA transaction */
  #define RADIO_TASKS_ACQINJ0DMASTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_ACQINJ0DMASTOP register.              */

/* TASKS_ACQINJ0DMASTOP @Bit 0 : Stop ongoing DMA transaction */
  #define RADIO_TASKS_ACQINJ0DMASTOP_TASKS_ACQINJ0DMASTOP_Pos (0UL) /*!< Position of TASKS_ACQINJ0DMASTOP field.               */
  #define RADIO_TASKS_ACQINJ0DMASTOP_TASKS_ACQINJ0DMASTOP_Msk (0x1UL << RADIO_TASKS_ACQINJ0DMASTOP_TASKS_ACQINJ0DMASTOP_Pos)
                                                                            /*!< Bit mask of TASKS_ACQINJ0DMASTOP field.*/        
  #define RADIO_TASKS_ACQINJ0DMASTOP_TASKS_ACQINJ0DMASTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_ACQINJ0DMASTOP field. */
  #define RADIO_TASKS_ACQINJ0DMASTOP_TASKS_ACQINJ0DMASTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_ACQINJ0DMASTOP field. */
  #define RADIO_TASKS_ACQINJ0DMASTOP_TASKS_ACQINJ0DMASTOP_Trigger (0x1UL) /*!< Trigger task                                    */


/* RADIO_TASKS_ACQINJ1DMASTART: Start DMA transaction */
  #define RADIO_TASKS_ACQINJ1DMASTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_ACQINJ1DMASTART register.            */

/* TASKS_ACQINJ1DMASTART @Bit 0 : Start DMA transaction */
  #define RADIO_TASKS_ACQINJ1DMASTART_TASKS_ACQINJ1DMASTART_Pos (0UL) /*!< Position of TASKS_ACQINJ1DMASTART field.            */
  #define RADIO_TASKS_ACQINJ1DMASTART_TASKS_ACQINJ1DMASTART_Msk (0x1UL << RADIO_TASKS_ACQINJ1DMASTART_TASKS_ACQINJ1DMASTART_Pos)
                                                                            /*!< Bit mask of TASKS_ACQINJ1DMASTART field.*/       
  #define RADIO_TASKS_ACQINJ1DMASTART_TASKS_ACQINJ1DMASTART_Min (0x1UL) /*!< Min enumerator value of TASKS_ACQINJ1DMASTART
                                                                            field.*/                                              
  #define RADIO_TASKS_ACQINJ1DMASTART_TASKS_ACQINJ1DMASTART_Max (0x1UL) /*!< Max enumerator value of TASKS_ACQINJ1DMASTART
                                                                            field.*/                                              
  #define RADIO_TASKS_ACQINJ1DMASTART_TASKS_ACQINJ1DMASTART_Trigger (0x1UL) /*!< Trigger task                                  */


/* RADIO_TASKS_ACQINJ1DMASTOP: Stop ongoing DMA transaction */
  #define RADIO_TASKS_ACQINJ1DMASTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_ACQINJ1DMASTOP register.              */

/* TASKS_ACQINJ1DMASTOP @Bit 0 : Stop ongoing DMA transaction */
  #define RADIO_TASKS_ACQINJ1DMASTOP_TASKS_ACQINJ1DMASTOP_Pos (0UL) /*!< Position of TASKS_ACQINJ1DMASTOP field.               */
  #define RADIO_TASKS_ACQINJ1DMASTOP_TASKS_ACQINJ1DMASTOP_Msk (0x1UL << RADIO_TASKS_ACQINJ1DMASTOP_TASKS_ACQINJ1DMASTOP_Pos)
                                                                            /*!< Bit mask of TASKS_ACQINJ1DMASTOP field.*/        
  #define RADIO_TASKS_ACQINJ1DMASTOP_TASKS_ACQINJ1DMASTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_ACQINJ1DMASTOP field. */
  #define RADIO_TASKS_ACQINJ1DMASTOP_TASKS_ACQINJ1DMASTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_ACQINJ1DMASTOP field. */
  #define RADIO_TASKS_ACQINJ1DMASTOP_TASKS_ACQINJ1DMASTOP_Trigger (0x1UL) /*!< Trigger task                                    */


/* RADIO_TASKS_CNTPSTART: Start packet counter */
  #define RADIO_TASKS_CNTPSTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CNTPSTART register.                        */

/* TASKS_CNTPSTART @Bit 0 : Start packet counter */
  #define RADIO_TASKS_CNTPSTART_TASKS_CNTPSTART_Pos (0UL) /*!< Position of TASKS_CNTPSTART field.                              */
  #define RADIO_TASKS_CNTPSTART_TASKS_CNTPSTART_Msk (0x1UL << RADIO_TASKS_CNTPSTART_TASKS_CNTPSTART_Pos) /*!< Bit mask of
                                                                            TASKS_CNTPSTART field.*/                              
  #define RADIO_TASKS_CNTPSTART_TASKS_CNTPSTART_Min (0x1UL) /*!< Min enumerator value of TASKS_CNTPSTART field.                */
  #define RADIO_TASKS_CNTPSTART_TASKS_CNTPSTART_Max (0x1UL) /*!< Max enumerator value of TASKS_CNTPSTART field.                */
  #define RADIO_TASKS_CNTPSTART_TASKS_CNTPSTART_Trigger (0x1UL) /*!< Trigger task                                              */


