adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_TASKS_CNTPSTOP: Stop packet counter */
  #define RADIO_TASKS_CNTPSTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CNTPSTOP register.                          */

/* TASKS_CNTPSTOP @Bit 0 : Stop packet counter */
  #define RADIO_TASKS_CNTPSTOP_TASKS_CNTPSTOP_Pos (0UL) /*!< Position of TASKS_CNTPSTOP field.                                 */
  #define RADIO_TASKS_CNTPSTOP_TASKS_CNTPSTOP_Msk (0x1UL << RADIO_TASKS_CNTPSTOP_TASKS_CNTPSTOP_Pos) /*!< Bit mask of
                                                                            TASKS_CNTPSTOP field.*/                               
  #define RADIO_TASKS_CNTPSTOP_TASKS_CNTPSTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_CNTPSTOP field.                   */
  #define RADIO_TASKS_CNTPSTOP_TASKS_CNTPSTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_CNTPSTOP field.                   */
  #define RADIO_TASKS_CNTPSTOP_TASKS_CNTPSTOP_Trigger (0x1UL) /*!< Trigger task                                                */


/* RADIO_TASKS_CNTPCLEAR: Clear packet counter */
  #define RADIO_TASKS_CNTPCLEAR_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CNTPCLEAR register.                        */

/* TASKS_CNTPCLEAR @Bit 0 : Clear packet counter */
  #define RADIO_TASKS_CNTPCLEAR_TASKS_CNTPCLEAR_Pos (0UL) /*!< Position of TASKS_CNTPCLEAR field.                              */
  #define RADIO_TASKS_CNTPCLEAR_TASKS_CNTPCLEAR_Msk (0x1UL << RADIO_TASKS_CNTPCLEAR_TASKS_CNTPCLEAR_Pos) /*!< Bit mask of
                                                                            TASKS_CNTPCLEAR field.*/                              
  #define RADIO_TASKS_CNTPCLEAR_TASKS_CNTPCLEAR_Min (0x1UL) /*!< Min enumerator value of TASKS_CNTPCLEAR field.                */
  #define RADIO_TASKS_CNTPCLEAR_TASKS_CNTPCLEAR_Max (0x1UL) /*!< Max enumerator value of TASKS_CNTPCLEAR field.                */
  #define RADIO_TASKS_CNTPCLEAR_TASKS_CNTPCLEAR_Trigger (0x1UL) /*!< Trigger task                                              */


/* RADIO_TASKS_LOOPBACKEN: Enable RADIO in LOOPBACK mode */
  #define RADIO_TASKS_LOOPBACKEN_ResetValue (0x00000000UL) /*!< Reset value of TASKS_LOOPBACKEN register.                      */

/* TASKS_LOOPBACKEN @Bit 0 : Enable RADIO in LOOPBACK mode */
  #define RADIO_TASKS_LOOPBACKEN_TASKS_LOOPBACKEN_Pos (0UL) /*!< Position of TASKS_LOOPBACKEN field.                           */
  #define RADIO_TASKS_LOOPBACKEN_TASKS_LOOPBACKEN_Msk (0x1UL << RADIO_TASKS_LOOPBACKEN_TASKS_LOOPBACKEN_Pos) /*!< Bit mask of
                                                                            TASKS_LOOPBACKEN field.*/                             
  #define RADIO_TASKS_LOOPBACKEN_TASKS_LOOPBACKEN_Min (0x1UL) /*!< Min enumerator value of TASKS_LOOPBACKEN field.             */
  #define RADIO_TASKS_LOOPBACKEN_TASKS_LOOPBACKEN_Max (0x1UL) /*!< Max enumerator value of TASKS_LOOPBACKEN field.             */
  #define RADIO_TASKS_LOOPBACKEN_TASKS_LOOPBACKEN_Trigger (0x1UL) /*!< Trigger task                                            */


/* RADIO_TASKS_CALSTART: Start calibration */
  #define RADIO_TASKS_CALSTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CALSTART register.                          */

/* TASKS_CALSTART @Bit 0 : Start calibration */
  #define RADIO_TASKS_CALSTART_TASKS_CALSTART_Pos (0UL) /*!< Position of TASKS_CALSTART field.                                 */
  #define RADIO_TASKS_CALSTART_TASKS_CALSTART_Msk (0x1UL << RADIO_TASKS_CALSTART_TASKS_CALSTART_Pos) /*!< Bit mask of
                                                                            TASKS_CALSTART field.*/                               
  #define RADIO_TASKS_CALSTART_TASKS_CALSTART_Min (0x1UL) /*!< Min enumerator value of TASKS_CALSTART field.                   */
  #define RADIO_TASKS_CALSTART_TASKS_CALSTART_Max (0x1UL) /*!< Max enumerator value of TASKS_CALSTART field.                   */
  #define RADIO_TASKS_CALSTART_TASKS_CALSTART_Trigger (0x1UL) /*!< Trigger task                                                */


/* RADIO_TASKS_CALSTOP: Stop calibration */
  #define RADIO_TASKS_CALSTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CALSTOP register.                            */

/* TASKS_CALSTOP @Bit 0 : Stop calibration */
  #define RADIO_TASKS_CALSTOP_TASKS_CALSTOP_Pos (0UL) /*!< Position of TASKS_CALSTOP field.                                    */
  #define RADIO_TASKS_CALSTOP_TASKS_CALSTOP_Msk (0x1UL << RADIO_TASKS_CALSTOP_TASKS_CALSTOP_Pos) /*!< Bit mask of TASKS_CALSTOP
                                                                            field.*/                                              
  #define RADIO_TASKS_CALSTOP_TASKS_CALSTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_CALSTOP field.                      */
  #define RADIO_TASKS_CALSTOP_TASKS_CALSTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_CALSTOP field.                      */
  #define RADIO_TASKS_CALSTOP_TASKS_CALSTOP_Trigger (0x1UL) /*!< Trigger task                                                  */


/* RADIO_TASKS_PATESTSTART: Start PA test */
  #define RADIO_TASKS_PATESTSTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PATESTSTART register.                    */

/* TASKS_PATESTSTART @Bit 0 : Start PA test */
  #define RADIO_TASKS_PATESTSTART_TASKS_PATESTSTART_Pos (0UL) /*!< Position of TASKS_PATESTSTART field.                        */
  #define RADIO_TASKS_PATESTSTART_TASKS_PATESTSTART_Msk (0x1UL << RADIO_TASKS_PATESTSTART_TASKS_PATESTSTART_Pos) /*!< Bit mask
                                                                            of TASKS_PATESTSTART field.*/                         
  #define RADIO_TASKS_PATESTSTART_TASKS_PATESTSTART_Min (0x1UL) /*!< Min enumerator value of TASKS_PATESTSTART field.          */
  #define RADIO_TASKS_PATESTSTART_TASKS_PATESTSTART_Max (0x1UL) /*!< Max enumerator value of TASKS_PATESTSTART field.          */
  #define RADIO_TASKS_PATESTSTART_TASKS_PATESTSTART_Trigger (0x1UL) /*!< Trigger task                                          */


/* RADIO_TASKS_PATESTSTOP: Stop PA test */
  #define RADIO_TASKS_PATESTSTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PATESTSTOP register.                      */

/* TASKS_PATESTSTOP @Bit 0 : Stop PA test */
  #define RADIO_TASKS_PATESTSTOP_TASKS_PATESTSTOP_Pos (0UL) /*!< Position of TASKS_PATESTSTOP field.                           */
  #define RADIO_TASKS_PATESTSTOP_TASKS_PATESTSTOP_Msk (0x1UL << RADIO_TASKS_PATESTSTOP_TASKS_PATESTSTOP_Pos) /*!< Bit mask of
                                                                            TASKS_PATESTSTOP field.*/                             
  #define RADIO_TASKS_PATESTSTOP_TASKS_PATESTSTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_PATESTSTOP field.             */
  #define RADIO_TASKS_PATESTSTOP_TASKS_PATESTSTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_PATESTSTOP field.             */
  #define RADIO_TASKS_PATESTSTOP_TASKS_PATESTSTOP_Trigger (0x1UL) /*!< Trigger task                                            */


