adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_TASKS_CHNOINCR: Update RADIO channel based on the current channel and increment it according to chNoIncrStep */
  #define RADIO_TASKS_CHNOINCR_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CHNOINCR register.                          */

/* TASKS_CHNOINCR @Bit 0 : Update RADIO channel based on the current channel and increment it according to chNoIncrStep */
  #define RADIO_TASKS_CHNOINCR_TASKS_CHNOINCR_Pos (0UL) /*!< Position of TASKS_CHNOINCR field.                                 */
  #define RADIO_TASKS_CHNOINCR_TASKS_CHNOINCR_Msk (0x1UL << RADIO_TASKS_CHNOINCR_TASKS_CHNOINCR_Pos) /*!< Bit mask of
                                                                            TASKS_CHNOINCR field.*/                               
  #define RADIO_TASKS_CHNOINCR_TASKS_CHNOINCR_Min (0x1UL) /*!< Min enumerator value of TASKS_CHNOINCR field.                   */
  #define RADIO_TASKS_CHNOINCR_TASKS_CHNOINCR_Max (0x1UL) /*!< Max enumerator value of TASKS_CHNOINCR field.                   */
  #define RADIO_TASKS_CHNOINCR_TASKS_CHNOINCR_Trigger (0x1UL) /*!< Trigger task                                                */


/* RADIO_TASKS_DMASTART: Start RADIO DMA transaction */
  #define RADIO_TASKS_DMASTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DMASTART register.                          */

/* TASKS_DMASTART @Bit 0 : Start RADIO DMA transaction */
  #define RADIO_TASKS_DMASTART_TASKS_DMASTART_Pos (0UL) /*!< Position of TASKS_DMASTART field.                                 */
  #define RADIO_TASKS_DMASTART_TASKS_DMASTART_Msk (0x1UL << RADIO_TASKS_DMASTART_TASKS_DMASTART_Pos) /*!< Bit mask of
                                                                            TASKS_DMASTART field.*/                               
  #define RADIO_TASKS_DMASTART_TASKS_DMASTART_Min (0x1UL) /*!< Min enumerator value of TASKS_DMASTART field.                   */
  #define RADIO_TASKS_DMASTART_TASKS_DMASTART_Max (0x1UL) /*!< Max enumerator value of TASKS_DMASTART field.                   */
  #define RADIO_TASKS_DMASTART_TASKS_DMASTART_Trigger (0x1UL) /*!< Trigger task                                                */


/* RADIO_TASKS_DMASTOP: Stop ongoing RADIO DMA transaction */
  #define RADIO_TASKS_DMASTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DMASTOP register.                            */

/* TASKS_DMASTOP @Bit 0 : Stop ongoing RADIO DMA transaction */
  #define RADIO_TASKS_DMASTOP_TASKS_DMASTOP_Pos (0UL) /*!< Position of TASKS_DMASTOP field.                                    */
  #define RADIO_TASKS_DMASTOP_TASKS_DMASTOP_Msk (0x1UL << RADIO_TASKS_DMASTOP_TASKS_DMASTOP_Pos) /*!< Bit mask of TASKS_DMASTOP
                                                                            field.*/                                              
  #define RADIO_TASKS_DMASTOP_TASKS_DMASTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_DMASTOP field.                      */
  #define RADIO_TASKS_DMASTOP_TASKS_DMASTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_DMASTOP field.                      */
  #define RADIO_TASKS_DMASTOP_TASKS_DMASTOP_Trigger (0x1UL) /*!< Trigger task                                                  */


/* RADIO_TASKS_DFEDMASTART: Start DFE DMA transaction */
  #define RADIO_TASKS_DFEDMASTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DFEDMASTART register.                    */

/* TASKS_DFEDMASTART @Bit 0 : Start DFE DMA transaction */
  #define RADIO_TASKS_DFEDMASTART_TASKS_DFEDMASTART_Pos (0UL) /*!< Position of TASKS_DFEDMASTART field.                        */
  #define RADIO_TASKS_DFEDMASTART_TASKS_DFEDMASTART_Msk (0x1UL << RADIO_TASKS_DFEDMASTART_TASKS_DFEDMASTART_Pos) /*!< Bit mask
                                                                            of TASKS_DFEDMASTART field.*/                         
  #define RADIO_TASKS_DFEDMASTART_TASKS_DFEDMASTART_Min (0x1UL) /*!< Min enumerator value of TASKS_DFEDMASTART field.          */
  #define RADIO_TASKS_DFEDMASTART_TASKS_DFEDMASTART_Max (0x1UL) /*!< Max enumerator value of TASKS_DFEDMASTART field.          */
  #define RADIO_TASKS_DFEDMASTART_TASKS_DFEDMASTART_Trigger (0x1UL) /*!< Trigger task                                          */


/* RADIO_TASKS_DFEDMASTOP: Stop ongoing DFE DMA transaction */
  #define RADIO_TASKS_DFEDMASTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DFEDMASTOP register.                      */

/* TASKS_DFEDMASTOP @Bit 0 : Stop ongoing DFE DMA transaction */
  #define RADIO_TASKS_DFEDMASTOP_TASKS_DFEDMASTOP_Pos (0UL) /*!< Position of TASKS_DFEDMASTOP field.                           */
  #define RADIO_TASKS_DFEDMASTOP_TASKS_DFEDMASTOP_Msk (0x1UL << RADIO_TASKS_DFEDMASTOP_TASKS_DFEDMASTOP_Pos) /*!< Bit mask of
                                                                            TASKS_DFEDMASTOP field.*/                             
  #define RADIO_TASKS_DFEDMASTOP_TASKS_DFEDMASTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_DFEDMASTOP field.             */
  #define RADIO_TASKS_DFEDMASTOP_TASKS_DFEDMASTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_DFEDMASTOP field.             */
  #define RADIO_TASKS_DFEDMASTOP_TASKS_DFEDMASTOP_Trigger (0x1UL) /*!< Trigger task                                            */


/* RADIO_TASKS_RELOADFREQ: Reload new frequency while radio PLL is active */
  #define RADIO_TASKS_RELOADFREQ_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RELOADFREQ register.                      */

/* TASKS_RELOADFREQ @Bit 0 : Reload new frequency while radio PLL is active */
  #define RADIO_TASKS_RELOADFREQ_TASKS_RELOADFREQ_Pos (0UL) /*!< Position of TASKS_RELOADFREQ field.                           */
  #define RADIO_TASKS_RELOADFREQ_TASKS_RELOADFREQ_Msk (0x1UL << RADIO_TASKS_RELOADFREQ_TASKS_RELOADFREQ_Pos) /*!< Bit mask of
                                                                            TASKS_RELOADFREQ field.*/                             
  #define RADIO_TASKS_RELOADFREQ_TASKS_RELOADFREQ_Min (0x1UL) /*!< Min enumerator value of TASKS_RELOADFREQ field.             */
  #define RADIO_TASKS_RELOADFREQ_TASKS_RELOADFREQ_Max (0x1UL) /*!< Max enumerator value of TASKS_RELOADFREQ field.             */
  #define RADIO_TASKS_RELOADFREQ_TASKS_RELOADFREQ_Trigger (0x1UL) /*!< Trigger task                                            */


/* RADIO_TASKS_GETNEXTDETECT: Pull the last item out of the detect FIFO */
  #define RADIO_TASKS_GETNEXTDETECT_ResetValue (0x00000000UL) /*!< Reset value of TASKS_GETNEXTDETECT register.                */

/* TASKS_GETNEXTDETECT @Bit 0 : Pull the last item out of the detect FIFO */
  #define RADIO_TASKS_GETNEXTDETECT_TASKS_GETNEXTDETECT_Pos (0UL) /*!< Position of TASKS_GETNEXTDETECT field.                  */
  #define RADIO_TASKS_GETNEXTDETECT_TASKS_GETNEXTDETECT_Msk (0x1UL << RADIO_TASKS_GETNEXTDETECT_TASKS_GETNEXTDETECT_Pos) /*!<
                                                                            Bit mask of TASKS_GETNEXTDETECT field.*/              
  #define RADIO_TASKS_GETNEXTDETECT_TASKS_GETNEXTDETECT_Min (0x1UL) /*!< Min enumerator value of TASKS_GETNEXTDETECT field.    */
  #define RADIO_TASKS_GETNEXTDETECT_TASKS_GETNEXTDETECT_Max (0x1UL) /*!< Max enumerator value of TASKS_GETNEXTDETECT field.    */
  #define RADIO_TASKS_GETNEXTDETECT_TASKS_GETNEXTDETECT_Trigger (0x1UL) /*!< Trigger task                                      */


