adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_TASKS_CLEARDETECTFIFO: Clear the detect FIFO */
  #define RADIO_TASKS_CLEARDETECTFIFO_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CLEARDETECTFIFO register.            */

/* TASKS_CLEARDETECTFIFO @Bit 0 : Clear the detect FIFO */
  #define RADIO_TASKS_CLEARDETECTFIFO_TASKS_CLEARDETECTFIFO_Pos (0UL) /*!< Position of TASKS_CLEARDETECTFIFO field.            */
  #define RADIO_TASKS_CLEARDETECTFIFO_TASKS_CLEARDETECTFIFO_Msk (0x1UL << RADIO_TASKS_CLEARDETECTFIFO_TASKS_CLEARDETECTFIFO_Pos)
                                                                            /*!< Bit mask of TASKS_CLEARDETECTFIFO field.*/       
  #define RADIO_TASKS_CLEARDETECTFIFO_TASKS_CLEARDETECTFIFO_Min (0x1UL) /*!< Min enumerator value of TASKS_CLEARDETECTFIFO
                                                                            field.*/                                              
  #define RADIO_TASKS_CLEARDETECTFIFO_TASKS_CLEARDETECTFIFO_Max (0x1UL) /*!< Max enumerator value of TASKS_CLEARDETECTFIFO
                                                                            field.*/                                              
  #define RADIO_TASKS_CLEARDETECTFIFO_TASKS_CLEARDETECTFIFO_Trigger (0x1UL) /*!< Trigger task                                  */


/* RADIO_TASKS_RESETDEMODCTRL: Sets all things back to original state in RxDemodCtrl */
  #define RADIO_TASKS_RESETDEMODCTRL_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RESETDEMODCTRL register.              */

/* TASKS_RESETDEMODCTRL @Bit 0 : Sets all things back to original state in RxDemodCtrl */
  #define RADIO_TASKS_RESETDEMODCTRL_TASKS_RESETDEMODCTRL_Pos (0UL) /*!< Position of TASKS_RESETDEMODCTRL field.               */
  #define RADIO_TASKS_RESETDEMODCTRL_TASKS_RESETDEMODCTRL_Msk (0x1UL << RADIO_TASKS_RESETDEMODCTRL_TASKS_RESETDEMODCTRL_Pos)
                                                                            /*!< Bit mask of TASKS_RESETDEMODCTRL field.*/        
  #define RADIO_TASKS_RESETDEMODCTRL_TASKS_RESETDEMODCTRL_Min (0x1UL) /*!< Min enumerator value of TASKS_RESETDEMODCTRL field. */
  #define RADIO_TASKS_RESETDEMODCTRL_TASKS_RESETDEMODCTRL_Max (0x1UL) /*!< Max enumerator value of TASKS_RESETDEMODCTRL field. */
  #define RADIO_TASKS_RESETDEMODCTRL_TASKS_RESETDEMODCTRL_Trigger (0x1UL) /*!< Trigger task                                    */


/* RADIO_TASKS_DEMODCTRLSTARTTIMER: Start the built-in custom timer (when starting the timer, it always starts from 0) */
  #define RADIO_TASKS_DEMODCTRLSTARTTIMER_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DEMODCTRLSTARTTIMER register.    */

/* TASKS_DEMODCTRLSTARTTIMER @Bit 0 : Start the built-in custom timer (when starting the timer, it always starts from 0) */
  #define RADIO_TASKS_DEMODCTRLSTARTTIMER_TASKS_DEMODCTRLSTARTTIMER_Pos (0UL) /*!< Position of TASKS_DEMODCTRLSTARTTIMER field.*/
  #define RADIO_TASKS_DEMODCTRLSTARTTIMER_TASKS_DEMODCTRLSTARTTIMER_Msk (0x1UL << RADIO_TASKS_DEMODCTRLSTARTTIMER_TASKS_DEMODCTRLSTARTTIMER_Pos)
                                                                            /*!< Bit mask of TASKS_DEMODCTRLSTARTTIMER field.*/   
  #define RADIO_TASKS_DEMODCTRLSTARTTIMER_TASKS_DEMODCTRLSTARTTIMER_Min (0x1UL) /*!< Min enumerator value of
                                                                            TASKS_DEMODCTRLSTARTTIMER field.*/                    
  #define RADIO_TASKS_DEMODCTRLSTARTTIMER_TASKS_DEMODCTRLSTARTTIMER_Max (0x1UL) /*!< Max enumerator value of
                                                                            TASKS_DEMODCTRLSTARTTIMER field.*/                    
  #define RADIO_TASKS_DEMODCTRLSTARTTIMER_TASKS_DEMODCTRLSTARTTIMER_Trigger (0x1UL) /*!< Trigger task                          */


/* RADIO_TASKS_DEMODCTRLSTOPTIMER: Stop the built-in custom timer (when stopping the timer, it is always cleared afterwards) */
  #define RADIO_TASKS_DEMODCTRLSTOPTIMER_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DEMODCTRLSTOPTIMER register.      */

/* TASKS_DEMODCTRLSTOPTIMER @Bit 0 : Stop the built-in custom timer (when stopping the timer, it is always cleared afterwards) */
  #define RADIO_TASKS_DEMODCTRLSTOPTIMER_TASKS_DEMODCTRLSTOPTIMER_Pos (0UL) /*!< Position of TASKS_DEMODCTRLSTOPTIMER field.   */
  #define RADIO_TASKS_DEMODCTRLSTOPTIMER_TASKS_DEMODCTRLSTOPTIMER_Msk (0x1UL << RADIO_TASKS_DEMODCTRLSTOPTIMER_TASKS_DEMODCTRLSTOPTIMER_Pos)
                                                                            /*!< Bit mask of TASKS_DEMODCTRLSTOPTIMER field.*/    
  #define RADIO_TASKS_DEMODCTRLSTOPTIMER_TASKS_DEMODCTRLSTOPTIMER_Min (0x1UL) /*!< Min enumerator value of
                                                                            TASKS_DEMODCTRLSTOPTIMER field.*/                     
  #define RADIO_TASKS_DEMODCTRLSTOPTIMER_TASKS_DEMODCTRLSTOPTIMER_Max (0x1UL) /*!< Max enumerator value of
                                                                            TASKS_DEMODCTRLSTOPTIMER field.*/                     
  #define RADIO_TASKS_DEMODCTRLSTOPTIMER_TASKS_DEMODCTRLSTOPTIMER_Trigger (0x1UL) /*!< Trigger task                            */


/* RADIO_TASKS_DEMODCTRLCONDEN0: Enable condition 0 (after this task has been triggered, the condition will trigger exactly
                                  once) */                                                                                        
                                                                                                                                  
  #define RADIO_TASKS_DEMODCTRLCONDEN0_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DEMODCTRLCONDEN0 register.          */

/* TASKS_DEMODCTRLCONDEN0 @Bit 0 : Enable condition 0 (after this task has been triggered, the condition will trigger exactly
                                   once) */                                                                                       
                                                                                                                                  
  #define RADIO_TASKS_DEMODCTRLCONDEN0_TASKS_DEMODCTRLCONDEN0_Pos (0UL) /*!< Position of TASKS_DEMODCTRLCONDEN0 field.         */
  #define RADIO_TASKS_DEMODCTRLCONDEN0_TASKS_DEMODCTRLCONDEN0_Msk (0x1UL << RADIO_TASKS_DEMODCTRLCONDEN0_TASKS_DEMODCTRLCONDEN0_Pos)
                                                                            /*!< Bit mask of TASKS_DEMODCTRLCONDEN0 field.*/      
  #define RADIO_TASKS_DEMODCTRLCONDEN0_TASKS_DEMODCTRLCONDEN0_Min (0x1UL) /*!< Min enumerator value of TASKS_DEMODCTRLCONDEN0
                                                                            field.*/                                              
  #define RADIO_TASKS_DEMODCTRLCONDEN0_TASKS_DEMODCTRLCONDEN0_Max (0x1UL) /*!< Max enumerator value of TASKS_DEMODCTRLCONDEN0
                                                                            field.*/                                              
  #define RADIO_TASKS_DEMODCTRLCONDEN0_TASKS_DEMODCTRLCONDEN0_Trigger (0x1UL) /*!< Trigger task                                */


/* RADIO_TASKS_DEMODCTRLCONDEN1: Enable condition 1 (after this task has been triggered, the condition will trigger exactly
                                  once) */                                                                                        
                                                                                                                                  
  #define RADIO_TASKS_DEMODCTRLCONDEN1_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DEMODCTRLCONDEN1 register.          */

/* TASKS_DEMODCTRLCONDEN1 @Bit 0 : Enable condition 1 (after this task has been triggered, the condition will trigger exactly
                                   once) */                                                                                       
                                                                                                                                  
  #define RADIO_TASKS_DEMODCTRLCONDEN1_TASKS_DEMODCTRLCONDEN1_Pos (0UL) /*!< Position of TASKS_DEMODCTRLCONDEN1 field.         */
  #define RADIO_TASKS_DEMODCTRLCONDEN1_TASKS_DEMODCTRLCONDEN1_Msk (0x1UL << RADIO_TASKS_DEMODCTRLCONDEN1_TASKS_DEMODCTRLCONDEN1_Pos)
                                                                            /*!< Bit mask of TASKS_DEMODCTRLCONDEN1 field.*/      
  #define RADIO_TASKS_DEMODCTRLCONDEN1_TASKS_DEMODCTRLCONDEN1_Min (0x1UL) /*!< Min enumerator value of TASKS_DEMODCTRLCONDEN1
                                                                            field.*/                                              
  #define RADIO_TASKS_DEMODCTRLCONDEN1_TASKS_DEMODCTRLCONDEN1_Max (0x1UL) /*!< Max enumerator value of TASKS_DEMODCTRLCONDEN1
                                                                            field.*/                                              
  #define RADIO_TASKS_DEMODCTRLCONDEN1_TASKS_DEMODCTRLCONDEN1_Trigger (0x1UL) /*!< Trigger task                                */


/* RADIO_TASKS_DEMODCTRLCONDEN2: Enable condition 2 (after this task has been triggered, the condition will trigger exactly
                                  once) */                                                                                        
                                                                                                                                  
  #define RADIO_TASKS_DEMODCTRLCONDEN2_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DEMODCTRLCONDEN2 register.          */

/* TASKS_DEMODCTRLCONDEN2 @Bit 0 : Enable condition 2 (after this task has been triggered, the condition will trigger exactly
                                   once) */                                                                                       
                                                                                                                                  
