adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_SUBSCRIBE_ACQINJ0DMASTART: Subscribe configuration for task ACQINJ0DMASTART */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_ACQINJ0DMASTART register.    */

/* CHIDX @Bits 0..7 : DPPI channel that task ACQINJ0DMASTART will subscribe to */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTART_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                        */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_ACQINJ0DMASTART_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTART_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                     */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                     */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTART_EN_Pos (31UL) /*!< Position of EN field.                                             */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_ACQINJ0DMASTART_EN_Pos) /*!< Bit mask of EN field.  */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTART_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTART_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTART_EN_Disabled (0x0UL) /*!< Disable subscription                                        */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTART_EN_Enabled (0x1UL) /*!< Enable subscription                                          */


/* RADIO_SUBSCRIBE_ACQINJ0DMASTOP: Subscribe configuration for task ACQINJ0DMASTOP */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_ACQINJ0DMASTOP register.      */

/* CHIDX @Bits 0..7 : DPPI channel that task ACQINJ0DMASTOP will subscribe to */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                         */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_ACQINJ0DMASTOP_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTOP_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                      */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                      */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTOP_EN_Pos (31UL) /*!< Position of EN field.                                              */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_ACQINJ0DMASTOP_EN_Pos) /*!< Bit mask of EN field.    */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTOP_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                 */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTOP_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                 */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                         */
  #define RADIO_SUBSCRIBE_ACQINJ0DMASTOP_EN_Enabled (0x1UL) /*!< Enable subscription                                           */


/* RADIO_SUBSCRIBE_ACQINJ1DMASTART: Subscribe configuration for task ACQINJ1DMASTART */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_ACQINJ1DMASTART register.    */

/* CHIDX @Bits 0..7 : DPPI channel that task ACQINJ1DMASTART will subscribe to */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTART_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                        */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_ACQINJ1DMASTART_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTART_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                     */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                     */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTART_EN_Pos (31UL) /*!< Position of EN field.                                             */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_ACQINJ1DMASTART_EN_Pos) /*!< Bit mask of EN field.  */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTART_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTART_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTART_EN_Disabled (0x0UL) /*!< Disable subscription                                        */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTART_EN_Enabled (0x1UL) /*!< Enable subscription                                          */


/* RADIO_SUBSCRIBE_ACQINJ1DMASTOP: Subscribe configuration for task ACQINJ1DMASTOP */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_ACQINJ1DMASTOP register.      */

/* CHIDX @Bits 0..7 : DPPI channel that task ACQINJ1DMASTOP will subscribe to */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                         */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_ACQINJ1DMASTOP_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTOP_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                      */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                      */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTOP_EN_Pos (31UL) /*!< Position of EN field.                                              */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_ACQINJ1DMASTOP_EN_Pos) /*!< Bit mask of EN field.    */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTOP_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                 */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTOP_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                 */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                         */
  #define RADIO_SUBSCRIBE_ACQINJ1DMASTOP_EN_Enabled (0x1UL) /*!< Enable subscription                                           */


