adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_SUBSCRIBE_CNTPSTART: Subscribe configuration for task CNTPSTART */
  #define RADIO_SUBSCRIBE_CNTPSTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CNTPSTART register.                */

/* CHIDX @Bits 0..7 : DPPI channel that task CNTPSTART will subscribe to */
  #define RADIO_SUBSCRIBE_CNTPSTART_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_CNTPSTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_CNTPSTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define RADIO_SUBSCRIBE_CNTPSTART_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                           */
  #define RADIO_SUBSCRIBE_CNTPSTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_CNTPSTART_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_CNTPSTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_CNTPSTART_EN_Pos) /*!< Bit mask of EN field.              */
  #define RADIO_SUBSCRIBE_CNTPSTART_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_CNTPSTART_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_CNTPSTART_EN_Disabled (0x0UL) /*!< Disable subscription                                              */
  #define RADIO_SUBSCRIBE_CNTPSTART_EN_Enabled (0x1UL) /*!< Enable subscription                                                */


/* RADIO_SUBSCRIBE_CNTPSTOP: Subscribe configuration for task CNTPSTOP */
  #define RADIO_SUBSCRIBE_CNTPSTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CNTPSTOP register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that task CNTPSTOP will subscribe to */
  #define RADIO_SUBSCRIBE_CNTPSTOP_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_CNTPSTOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_CNTPSTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define RADIO_SUBSCRIBE_CNTPSTOP_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_CNTPSTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_CNTPSTOP_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_CNTPSTOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_CNTPSTOP_EN_Pos) /*!< Bit mask of EN field.                */
  #define RADIO_SUBSCRIBE_CNTPSTOP_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_CNTPSTOP_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_CNTPSTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                               */
  #define RADIO_SUBSCRIBE_CNTPSTOP_EN_Enabled (0x1UL) /*!< Enable subscription                                                 */


/* RADIO_SUBSCRIBE_CNTPCLEAR: Subscribe configuration for task CNTPCLEAR */
  #define RADIO_SUBSCRIBE_CNTPCLEAR_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CNTPCLEAR register.                */

/* CHIDX @Bits 0..7 : DPPI channel that task CNTPCLEAR will subscribe to */
  #define RADIO_SUBSCRIBE_CNTPCLEAR_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_CNTPCLEAR_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_CNTPCLEAR_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define RADIO_SUBSCRIBE_CNTPCLEAR_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                           */
  #define RADIO_SUBSCRIBE_CNTPCLEAR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_CNTPCLEAR_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_CNTPCLEAR_EN_Msk (0x1UL << RADIO_SUBSCRIBE_CNTPCLEAR_EN_Pos) /*!< Bit mask of EN field.              */
  #define RADIO_SUBSCRIBE_CNTPCLEAR_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_CNTPCLEAR_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_CNTPCLEAR_EN_Disabled (0x0UL) /*!< Disable subscription                                              */
  #define RADIO_SUBSCRIBE_CNTPCLEAR_EN_Enabled (0x1UL) /*!< Enable subscription                                                */


/* RADIO_SUBSCRIBE_LOOPBACKEN: Subscribe configuration for task LOOPBACKEN */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_LOOPBACKEN register.              */

/* CHIDX @Bits 0..7 : DPPI channel that task LOOPBACKEN will subscribe to */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_LOOPBACKEN_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                          */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_EN_Msk (0x1UL << RADIO_SUBSCRIBE_LOOPBACKEN_EN_Pos) /*!< Bit mask of EN field.            */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define RADIO_SUBSCRIBE_LOOPBACKEN_EN_Enabled (0x1UL) /*!< Enable subscription                                               */


