adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_SUBSCRIBE_CALSTART: Subscribe configuration for task CALSTART */
  #define RADIO_SUBSCRIBE_CALSTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CALSTART register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that task CALSTART will subscribe to */
  #define RADIO_SUBSCRIBE_CALSTART_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_CALSTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_CALSTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define RADIO_SUBSCRIBE_CALSTART_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_CALSTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_CALSTART_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_CALSTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_CALSTART_EN_Pos) /*!< Bit mask of EN field.                */
  #define RADIO_SUBSCRIBE_CALSTART_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_CALSTART_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_CALSTART_EN_Disabled (0x0UL) /*!< Disable subscription                                               */
  #define RADIO_SUBSCRIBE_CALSTART_EN_Enabled (0x1UL) /*!< Enable subscription                                                 */


/* RADIO_SUBSCRIBE_CALSTOP: Subscribe configuration for task CALSTOP */
  #define RADIO_SUBSCRIBE_CALSTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CALSTOP register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that task CALSTOP will subscribe to */
  #define RADIO_SUBSCRIBE_CALSTOP_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_CALSTOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_CALSTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define RADIO_SUBSCRIBE_CALSTOP_CHIDX_Min (0x0UL)  /*!< Min value of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_CALSTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_CALSTOP_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_CALSTOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_CALSTOP_EN_Pos) /*!< Bit mask of EN field.                  */
  #define RADIO_SUBSCRIBE_CALSTOP_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_CALSTOP_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_CALSTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                                */
  #define RADIO_SUBSCRIBE_CALSTOP_EN_Enabled (0x1UL) /*!< Enable subscription                                                  */


/* RADIO_SUBSCRIBE_PATESTSTART: Subscribe configuration for task PATESTSTART */
  #define RADIO_SUBSCRIBE_PATESTSTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_PATESTSTART register.            */

/* CHIDX @Bits 0..7 : DPPI channel that task PATESTSTART will subscribe to */
  #define RADIO_SUBSCRIBE_PATESTSTART_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_PATESTSTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_PATESTSTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define RADIO_SUBSCRIBE_PATESTSTART_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                         */
  #define RADIO_SUBSCRIBE_PATESTSTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_PATESTSTART_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_PATESTSTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_PATESTSTART_EN_Pos) /*!< Bit mask of EN field.          */
  #define RADIO_SUBSCRIBE_PATESTSTART_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_PATESTSTART_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_PATESTSTART_EN_Disabled (0x0UL) /*!< Disable subscription                                            */
  #define RADIO_SUBSCRIBE_PATESTSTART_EN_Enabled (0x1UL) /*!< Enable subscription                                              */


/* RADIO_SUBSCRIBE_PATESTSTOP: Subscribe configuration for task PATESTSTOP */
  #define RADIO_SUBSCRIBE_PATESTSTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_PATESTSTOP register.              */

/* CHIDX @Bits 0..7 : DPPI channel that task PATESTSTOP will subscribe to */
  #define RADIO_SUBSCRIBE_PATESTSTOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_PATESTSTOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_PATESTSTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define RADIO_SUBSCRIBE_PATESTSTOP_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                          */
  #define RADIO_SUBSCRIBE_PATESTSTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_PATESTSTOP_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_PATESTSTOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_PATESTSTOP_EN_Pos) /*!< Bit mask of EN field.            */
  #define RADIO_SUBSCRIBE_PATESTSTOP_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_PATESTSTOP_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_PATESTSTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define RADIO_SUBSCRIBE_PATESTSTOP_EN_Enabled (0x1UL) /*!< Enable subscription                                               */


/* RADIO_SUBSCRIBE_CHNOINCR: Subscribe configuration for task CHNOINCR */
  #define RADIO_SUBSCRIBE_CHNOINCR_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CHNOINCR register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that task CHNOINCR will subscribe to */
  #define RADIO_SUBSCRIBE_CHNOINCR_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_CHNOINCR_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_CHNOINCR_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define RADIO_SUBSCRIBE_CHNOINCR_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_CHNOINCR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_CHNOINCR_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_CHNOINCR_EN_Msk (0x1UL << RADIO_SUBSCRIBE_CHNOINCR_EN_Pos) /*!< Bit mask of EN field.                */
  #define RADIO_SUBSCRIBE_CHNOINCR_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_CHNOINCR_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_CHNOINCR_EN_Disabled (0x0UL) /*!< Disable subscription                                               */
  #define RADIO_SUBSCRIBE_CHNOINCR_EN_Enabled (0x1UL) /*!< Enable subscription                                                 */


/* RADIO_SUBSCRIBE_DMASTART: Subscribe configuration for task DMASTART */
  #define RADIO_SUBSCRIBE_DMASTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DMASTART register.                  */

