adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task DMASTART will subscribe to */
  #define RADIO_SUBSCRIBE_DMASTART_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_DMASTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DMASTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define RADIO_SUBSCRIBE_DMASTART_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_DMASTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_DMASTART_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_DMASTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_DMASTART_EN_Pos) /*!< Bit mask of EN field.                */
  #define RADIO_SUBSCRIBE_DMASTART_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_DMASTART_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_DMASTART_EN_Disabled (0x0UL) /*!< Disable subscription                                               */
  #define RADIO_SUBSCRIBE_DMASTART_EN_Enabled (0x1UL) /*!< Enable subscription                                                 */


/* RADIO_SUBSCRIBE_DMASTOP: Subscribe configuration for task DMASTOP */
  #define RADIO_SUBSCRIBE_DMASTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DMASTOP register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that task DMASTOP will subscribe to */
  #define RADIO_SUBSCRIBE_DMASTOP_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_DMASTOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DMASTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define RADIO_SUBSCRIBE_DMASTOP_CHIDX_Min (0x0UL)  /*!< Min value of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_DMASTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_DMASTOP_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_DMASTOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_DMASTOP_EN_Pos) /*!< Bit mask of EN field.                  */
  #define RADIO_SUBSCRIBE_DMASTOP_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_DMASTOP_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_DMASTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                                */
  #define RADIO_SUBSCRIBE_DMASTOP_EN_Enabled (0x1UL) /*!< Enable subscription                                                  */


/* RADIO_SUBSCRIBE_DFEDMASTART: Subscribe configuration for task DFEDMASTART */
  #define RADIO_SUBSCRIBE_DFEDMASTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DFEDMASTART register.            */

/* CHIDX @Bits 0..7 : DPPI channel that task DFEDMASTART will subscribe to */
  #define RADIO_SUBSCRIBE_DFEDMASTART_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_DFEDMASTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DFEDMASTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define RADIO_SUBSCRIBE_DFEDMASTART_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                         */
  #define RADIO_SUBSCRIBE_DFEDMASTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_DFEDMASTART_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_DFEDMASTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_DFEDMASTART_EN_Pos) /*!< Bit mask of EN field.          */
  #define RADIO_SUBSCRIBE_DFEDMASTART_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_DFEDMASTART_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_DFEDMASTART_EN_Disabled (0x0UL) /*!< Disable subscription                                            */
  #define RADIO_SUBSCRIBE_DFEDMASTART_EN_Enabled (0x1UL) /*!< Enable subscription                                              */


/* RADIO_SUBSCRIBE_DFEDMASTOP: Subscribe configuration for task DFEDMASTOP */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DFEDMASTOP register.              */

/* CHIDX @Bits 0..7 : DPPI channel that task DFEDMASTOP will subscribe to */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DFEDMASTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                          */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_DFEDMASTOP_EN_Pos) /*!< Bit mask of EN field.            */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define RADIO_SUBSCRIBE_DFEDMASTOP_EN_Enabled (0x1UL) /*!< Enable subscription                                               */


/* RADIO_SUBSCRIBE_RELOADFREQ: Subscribe configuration for task RELOADFREQ */
  #define RADIO_SUBSCRIBE_RELOADFREQ_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_RELOADFREQ register.              */

/* CHIDX @Bits 0..7 : DPPI channel that task RELOADFREQ will subscribe to */
  #define RADIO_SUBSCRIBE_RELOADFREQ_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_RELOADFREQ_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_RELOADFREQ_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define RADIO_SUBSCRIBE_RELOADFREQ_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                          */
  #define RADIO_SUBSCRIBE_RELOADFREQ_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_RELOADFREQ_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_RELOADFREQ_EN_Msk (0x1UL << RADIO_SUBSCRIBE_RELOADFREQ_EN_Pos) /*!< Bit mask of EN field.            */
  #define RADIO_SUBSCRIBE_RELOADFREQ_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_RELOADFREQ_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_RELOADFREQ_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define RADIO_SUBSCRIBE_RELOADFREQ_EN_Enabled (0x1UL) /*!< Enable subscription                                               */


/* RADIO_SUBSCRIBE_GETNEXTDETECT: Subscribe configuration for task GETNEXTDETECT */
  #define RADIO_SUBSCRIBE_GETNEXTDETECT_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_GETNEXTDETECT register.        */

/* CHIDX @Bits 0..7 : DPPI channel that task GETNEXTDETECT will subscribe to */
  #define RADIO_SUBSCRIBE_GETNEXTDETECT_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                          */
  #define RADIO_SUBSCRIBE_GETNEXTDETECT_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_GETNEXTDETECT_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIO_SUBSCRIBE_GETNEXTDETECT_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                       */
  #define RADIO_SUBSCRIBE_GETNEXTDETECT_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                       */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_GETNEXTDETECT_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define RADIO_SUBSCRIBE_GETNEXTDETECT_EN_Msk (0x1UL << RADIO_SUBSCRIBE_GETNEXTDETECT_EN_Pos) /*!< Bit mask of EN field.      */
  #define RADIO_SUBSCRIBE_GETNEXTDETECT_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define RADIO_SUBSCRIBE_GETNEXTDETECT_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define RADIO_SUBSCRIBE_GETNEXTDETECT_EN_Disabled (0x0UL) /*!< Disable subscription                                          */
  #define RADIO_SUBSCRIBE_GETNEXTDETECT_EN_Enabled (0x1UL) /*!< Enable subscription                                            */


/* RADIO_SUBSCRIBE_CLEARDETECTFIFO: Subscribe configuration for task CLEARDETECTFIFO */
  #define RADIO_SUBSCRIBE_CLEARDETECTFIFO_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CLEARDETECTFIFO register.    */

/* CHIDX @Bits 0..7 : DPPI channel that task CLEARDETECTFIFO will subscribe to */
  #define RADIO_SUBSCRIBE_CLEARDETECTFIFO_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                        */
  #define RADIO_SUBSCRIBE_CLEARDETECTFIFO_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_CLEARDETECTFIFO_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIO_SUBSCRIBE_CLEARDETECTFIFO_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                     */
  #define RADIO_SUBSCRIBE_CLEARDETECTFIFO_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                     */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_CLEARDETECTFIFO_EN_Pos (31UL) /*!< Position of EN field.                                             */
  #define RADIO_SUBSCRIBE_CLEARDETECTFIFO_EN_Msk (0x1UL << RADIO_SUBSCRIBE_CLEARDETECTFIFO_EN_Pos) /*!< Bit mask of EN field.  */
  #define RADIO_SUBSCRIBE_CLEARDETECTFIFO_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                */
  #define RADIO_SUBSCRIBE_CLEARDETECTFIFO_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                */
  #define RADIO_SUBSCRIBE_CLEARDETECTFIFO_EN_Disabled (0x0UL) /*!< Disable subscription                                        */
  #define RADIO_SUBSCRIBE_CLEARDETECTFIFO_EN_Enabled (0x1UL) /*!< Enable subscription                                          */


/* RADIO_SUBSCRIBE_RESETDEMODCTRL: Subscribe configuration for task RESETDEMODCTRL */
  #define RADIO_SUBSCRIBE_RESETDEMODCTRL_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_RESETDEMODCTRL register.      */

/* CHIDX @Bits 0..7 : DPPI channel that task RESETDEMODCTRL will subscribe to */
  #define RADIO_SUBSCRIBE_RESETDEMODCTRL_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                         */
  #define RADIO_SUBSCRIBE_RESETDEMODCTRL_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_RESETDEMODCTRL_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIO_SUBSCRIBE_RESETDEMODCTRL_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                      */
  #define RADIO_SUBSCRIBE_RESETDEMODCTRL_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                      */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_RESETDEMODCTRL_EN_Pos (31UL) /*!< Position of EN field.                                              */
  #define RADIO_SUBSCRIBE_RESETDEMODCTRL_EN_Msk (0x1UL << RADIO_SUBSCRIBE_RESETDEMODCTRL_EN_Pos) /*!< Bit mask of EN field.    */
  #define RADIO_SUBSCRIBE_RESETDEMODCTRL_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                 */
  #define RADIO_SUBSCRIBE_RESETDEMODCTRL_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                 */
  #define RADIO_SUBSCRIBE_RESETDEMODCTRL_EN_Disabled (0x0UL) /*!< Disable subscription                                         */
  #define RADIO_SUBSCRIBE_RESETDEMODCTRL_EN_Enabled (0x1UL) /*!< Enable subscription                                           */


/* RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER: Subscribe configuration for task DEMODCTRLSTARTTIMER */
  #define RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DEMODCTRLSTARTTIMER
                                                                            register.*/                                           

/* CHIDX @Bits 0..7 : DPPI channel that task DEMODCTRLSTARTTIMER will subscribe to */
  #define RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                    */
  #define RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_CHIDX_Pos) /*!< Bit mask
                                                                            of CHIDX field.*/                                     
  #define RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                 */
  #define RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                 */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_EN_Pos (31UL) /*!< Position of EN field.                                         */
  #define RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_EN_Msk (0x1UL << RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_EN_Pos) /*!< Bit mask of EN
                                                                            field.*/                                              
  #define RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                            */
  #define RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                            */
  #define RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_EN_Disabled (0x0UL) /*!< Disable subscription                                    */
  #define RADIO_SUBSCRIBE_DEMODCTRLSTARTTIMER_EN_Enabled (0x1UL) /*!< Enable subscription                                      */


/* RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER: Subscribe configuration for task DEMODCTRLSTOPTIMER */
  #define RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DEMODCTRLSTOPTIMER
                                                                            register.*/                                           

