adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task DEMODCTRLSTOPTIMER will subscribe to */
  #define RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                     */
  #define RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_CHIDX_Pos) /*!< Bit mask of
                                                                            CHIDX field.*/                                        
  #define RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                  */
  #define RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                  */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_EN_Pos (31UL) /*!< Position of EN field.                                          */
  #define RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_EN_Msk (0x1UL << RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_EN_Pos) /*!< Bit mask of EN
                                                                            field.*/                                              
  #define RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                             */
  #define RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                             */
  #define RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_EN_Disabled (0x0UL) /*!< Disable subscription                                     */
  #define RADIO_SUBSCRIBE_DEMODCTRLSTOPTIMER_EN_Enabled (0x1UL) /*!< Enable subscription                                       */


/* RADIO_SUBSCRIBE_DEMODCTRLCONDEN0: Subscribe configuration for task DEMODCTRLCONDEN0 */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DEMODCTRLCONDEN0 register.  */

/* CHIDX @Bits 0..7 : DPPI channel that task DEMODCTRLCONDEN0 will subscribe to */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                       */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_CHIDX_Pos) /*!< Bit mask of
                                                                            CHIDX field.*/                                        
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                    */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                    */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_EN_Pos (31UL) /*!< Position of EN field.                                            */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_EN_Msk (0x1UL << RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_EN_Pos) /*!< Bit mask of EN field.*/
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                               */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                               */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_EN_Disabled (0x0UL) /*!< Disable subscription                                       */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN0_EN_Enabled (0x1UL) /*!< Enable subscription                                         */


/* RADIO_SUBSCRIBE_DEMODCTRLCONDEN1: Subscribe configuration for task DEMODCTRLCONDEN1 */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DEMODCTRLCONDEN1 register.  */

/* CHIDX @Bits 0..7 : DPPI channel that task DEMODCTRLCONDEN1 will subscribe to */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                       */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_CHIDX_Pos) /*!< Bit mask of
                                                                            CHIDX field.*/                                        
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                    */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                    */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_EN_Pos (31UL) /*!< Position of EN field.                                            */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_EN_Msk (0x1UL << RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_EN_Pos) /*!< Bit mask of EN field.*/
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                               */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                               */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_EN_Disabled (0x0UL) /*!< Disable subscription                                       */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN1_EN_Enabled (0x1UL) /*!< Enable subscription                                         */


/* RADIO_SUBSCRIBE_DEMODCTRLCONDEN2: Subscribe configuration for task DEMODCTRLCONDEN2 */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DEMODCTRLCONDEN2 register.  */

/* CHIDX @Bits 0..7 : DPPI channel that task DEMODCTRLCONDEN2 will subscribe to */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                       */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_CHIDX_Pos) /*!< Bit mask of
                                                                            CHIDX field.*/                                        
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                    */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                    */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_EN_Pos (31UL) /*!< Position of EN field.                                            */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_EN_Msk (0x1UL << RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_EN_Pos) /*!< Bit mask of EN field.*/
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                               */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                               */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_EN_Disabled (0x0UL) /*!< Disable subscription                                       */
  #define RADIO_SUBSCRIBE_DEMODCTRLCONDEN2_EN_Enabled (0x1UL) /*!< Enable subscription                                         */


/* RADIO_EVENTS_READY: RADIO has ramped up and is ready to be started */
  #define RADIO_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                              */

