adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_EVENTS_CCABUSY: Wireless medium busy - do not send */
  #define RADIO_EVENTS_CCABUSY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CCABUSY register.                          */

/* EVENTS_CCABUSY @Bit 0 : Wireless medium busy - do not send */
  #define RADIO_EVENTS_CCABUSY_EVENTS_CCABUSY_Pos (0UL) /*!< Position of EVENTS_CCABUSY field.                                 */
  #define RADIO_EVENTS_CCABUSY_EVENTS_CCABUSY_Msk (0x1UL << RADIO_EVENTS_CCABUSY_EVENTS_CCABUSY_Pos) /*!< Bit mask of
                                                                            EVENTS_CCABUSY field.*/                               
  #define RADIO_EVENTS_CCABUSY_EVENTS_CCABUSY_Min (0x0UL) /*!< Min enumerator value of EVENTS_CCABUSY field.                   */
  #define RADIO_EVENTS_CCABUSY_EVENTS_CCABUSY_Max (0x1UL) /*!< Max enumerator value of EVENTS_CCABUSY field.                   */
  #define RADIO_EVENTS_CCABUSY_EVENTS_CCABUSY_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define RADIO_EVENTS_CCABUSY_EVENTS_CCABUSY_Generated (0x1UL) /*!< Event generated                                           */


/* RADIO_EVENTS_CCASTOPPED: The CCA has stopped */
  #define RADIO_EVENTS_CCASTOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CCASTOPPED register.                    */

/* EVENTS_CCASTOPPED @Bit 0 : The CCA has stopped */
  #define RADIO_EVENTS_CCASTOPPED_EVENTS_CCASTOPPED_Pos (0UL) /*!< Position of EVENTS_CCASTOPPED field.                        */
  #define RADIO_EVENTS_CCASTOPPED_EVENTS_CCASTOPPED_Msk (0x1UL << RADIO_EVENTS_CCASTOPPED_EVENTS_CCASTOPPED_Pos) /*!< Bit mask
                                                                            of EVENTS_CCASTOPPED field.*/                         
  #define RADIO_EVENTS_CCASTOPPED_EVENTS_CCASTOPPED_Min (0x0UL) /*!< Min enumerator value of EVENTS_CCASTOPPED field.          */
  #define RADIO_EVENTS_CCASTOPPED_EVENTS_CCASTOPPED_Max (0x1UL) /*!< Max enumerator value of EVENTS_CCASTOPPED field.          */
  #define RADIO_EVENTS_CCASTOPPED_EVENTS_CCASTOPPED_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define RADIO_EVENTS_CCASTOPPED_EVENTS_CCASTOPPED_Generated (0x1UL) /*!< Event generated                                     */


/* RADIO_EVENTS_RATEBOOST: Ble_LR CI field received, receive mode is changed from Ble_LR125Kbit to Ble_LR500Kbit */
  #define RADIO_EVENTS_RATEBOOST_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RATEBOOST register.                      */

/* EVENTS_RATEBOOST @Bit 0 : Ble_LR CI field received, receive mode is changed from Ble_LR125Kbit to Ble_LR500Kbit */
  #define RADIO_EVENTS_RATEBOOST_EVENTS_RATEBOOST_Pos (0UL) /*!< Position of EVENTS_RATEBOOST field.                           */
  #define RADIO_EVENTS_RATEBOOST_EVENTS_RATEBOOST_Msk (0x1UL << RADIO_EVENTS_RATEBOOST_EVENTS_RATEBOOST_Pos) /*!< Bit mask of
                                                                            EVENTS_RATEBOOST field.*/                             
  #define RADIO_EVENTS_RATEBOOST_EVENTS_RATEBOOST_Min (0x0UL) /*!< Min enumerator value of EVENTS_RATEBOOST field.             */
  #define RADIO_EVENTS_RATEBOOST_EVENTS_RATEBOOST_Max (0x1UL) /*!< Max enumerator value of EVENTS_RATEBOOST field.             */
  #define RADIO_EVENTS_RATEBOOST_EVENTS_RATEBOOST_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define RADIO_EVENTS_RATEBOOST_EVENTS_RATEBOOST_Generated (0x1UL) /*!< Event generated                                       */


/* RADIO_EVENTS_MHRMATCH: MAC header match found */
  #define RADIO_EVENTS_MHRMATCH_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_MHRMATCH register.                        */

/* EVENTS_MHRMATCH @Bit 0 : MAC header match found */
  #define RADIO_EVENTS_MHRMATCH_EVENTS_MHRMATCH_Pos (0UL) /*!< Position of EVENTS_MHRMATCH field.                              */
  #define RADIO_EVENTS_MHRMATCH_EVENTS_MHRMATCH_Msk (0x1UL << RADIO_EVENTS_MHRMATCH_EVENTS_MHRMATCH_Pos) /*!< Bit mask of
                                                                            EVENTS_MHRMATCH field.*/                              
  #define RADIO_EVENTS_MHRMATCH_EVENTS_MHRMATCH_Min (0x0UL) /*!< Min enumerator value of EVENTS_MHRMATCH field.                */
  #define RADIO_EVENTS_MHRMATCH_EVENTS_MHRMATCH_Max (0x1UL) /*!< Max enumerator value of EVENTS_MHRMATCH field.                */
  #define RADIO_EVENTS_MHRMATCH_EVENTS_MHRMATCH_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define RADIO_EVENTS_MHRMATCH_EVENTS_MHRMATCH_Generated (0x1UL) /*!< Event generated                                         */


/* RADIO_EVENTS_SYNC: Initial sync detected */
  #define RADIO_EVENTS_SYNC_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SYNC register.                                */

/* EVENTS_SYNC @Bit 0 : Initial sync detected */
  #define RADIO_EVENTS_SYNC_EVENTS_SYNC_Pos (0UL)    /*!< Position of EVENTS_SYNC field.                                       */
  #define RADIO_EVENTS_SYNC_EVENTS_SYNC_Msk (0x1UL << RADIO_EVENTS_SYNC_EVENTS_SYNC_Pos) /*!< Bit mask of EVENTS_SYNC field.   */
  #define RADIO_EVENTS_SYNC_EVENTS_SYNC_Min (0x0UL)  /*!< Min enumerator value of EVENTS_SYNC field.                           */
  #define RADIO_EVENTS_SYNC_EVENTS_SYNC_Max (0x1UL)  /*!< Max enumerator value of EVENTS_SYNC field.                           */
  #define RADIO_EVENTS_SYNC_EVENTS_SYNC_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define RADIO_EVENTS_SYNC_EVENTS_SYNC_Generated (0x1UL) /*!< Event generated                                                 */


/* RADIO_EVENTS_CTEPRESENT: CTEInfo byte is received */
  #define RADIO_EVENTS_CTEPRESENT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CTEPRESENT register.                    */

/* EVENTS_CTEPRESENT @Bit 0 : CTEInfo byte is received */
  #define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Pos (0UL) /*!< Position of EVENTS_CTEPRESENT field.                        */
  #define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Msk (0x1UL << RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Pos) /*!< Bit mask
                                                                            of EVENTS_CTEPRESENT field.*/                         
  #define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Min (0x0UL) /*!< Min enumerator value of EVENTS_CTEPRESENT field.          */
  #define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Max (0x1UL) /*!< Max enumerator value of EVENTS_CTEPRESENT field.          */
  #define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Generated (0x1UL) /*!< Event generated                                     */


/* RADIO_EVENTS_CTEWARNING: CTEInfo byte received, but contain illegal CTETime or CTEType */
  #define RADIO_EVENTS_CTEWARNING_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CTEWARNING register.                    */

/* EVENTS_CTEWARNING @Bit 0 : CTEInfo byte received, but contain illegal CTETime or CTEType */
  #define RADIO_EVENTS_CTEWARNING_EVENTS_CTEWARNING_Pos (0UL) /*!< Position of EVENTS_CTEWARNING field.                        */
  #define RADIO_EVENTS_CTEWARNING_EVENTS_CTEWARNING_Msk (0x1UL << RADIO_EVENTS_CTEWARNING_EVENTS_CTEWARNING_Pos) /*!< Bit mask
                                                                            of EVENTS_CTEWARNING field.*/                         
  #define RADIO_EVENTS_CTEWARNING_EVENTS_CTEWARNING_Min (0x0UL) /*!< Min enumerator value of EVENTS_CTEWARNING field.          */
  #define RADIO_EVENTS_CTEWARNING_EVENTS_CTEWARNING_Max (0x1UL) /*!< Max enumerator value of EVENTS_CTEWARNING field.          */
  #define RADIO_EVENTS_CTEWARNING_EVENTS_CTEWARNING_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define RADIO_EVENTS_CTEWARNING_EVENTS_CTEWARNING_Generated (0x1UL) /*!< Event generated                                     */


/* RADIO_EVENTS_DFEEND: DFE operation has ended */
  #define RADIO_EVENTS_DFEEND_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_DFEEND register.                            */

/* EVENTS_DFEEND @Bit 0 : DFE operation has ended */
  #define RADIO_EVENTS_DFEEND_EVENTS_DFEEND_Pos (0UL) /*!< Position of EVENTS_DFEEND field.                                    */
  #define RADIO_EVENTS_DFEEND_EVENTS_DFEEND_Msk (0x1UL << RADIO_EVENTS_DFEEND_EVENTS_DFEEND_Pos) /*!< Bit mask of EVENTS_DFEEND
                                                                            field.*/                                              
  #define RADIO_EVENTS_DFEEND_EVENTS_DFEEND_Min (0x0UL) /*!< Min enumerator value of EVENTS_DFEEND field.                      */
  #define RADIO_EVENTS_DFEEND_EVENTS_DFEEND_Max (0x1UL) /*!< Max enumerator value of EVENTS_DFEEND field.                      */
  #define RADIO_EVENTS_DFEEND_EVENTS_DFEEND_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define RADIO_EVENTS_DFEEND_EVENTS_DFEEND_Generated (0x1UL) /*!< Event generated                                             */


/* RADIO_EVENTS_MODEWRITTEN: Generated on write access to MODE register */
  #define RADIO_EVENTS_MODEWRITTEN_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_MODEWRITTEN register.                  */

/* EVENTS_MODEWRITTEN @Bit 0 : Generated on write access to MODE register */
  #define RADIO_EVENTS_MODEWRITTEN_EVENTS_MODEWRITTEN_Pos (0UL) /*!< Position of EVENTS_MODEWRITTEN field.                     */
  #define RADIO_EVENTS_MODEWRITTEN_EVENTS_MODEWRITTEN_Msk (0x1UL << RADIO_EVENTS_MODEWRITTEN_EVENTS_MODEWRITTEN_Pos) /*!< Bit
                                                                            mask of EVENTS_MODEWRITTEN field.*/                   
  #define RADIO_EVENTS_MODEWRITTEN_EVENTS_MODEWRITTEN_Min (0x0UL) /*!< Min enumerator value of EVENTS_MODEWRITTEN field.       */
  #define RADIO_EVENTS_MODEWRITTEN_EVENTS_MODEWRITTEN_Max (0x1UL) /*!< Max enumerator value of EVENTS_MODEWRITTEN field.       */
  #define RADIO_EVENTS_MODEWRITTEN_EVENTS_MODEWRITTEN_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define RADIO_EVENTS_MODEWRITTEN_EVENTS_MODEWRITTEN_Generated (0x1UL) /*!< Event generated                                   */


