adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EVENTS_DBCTIMEOUT @Bit 0 : DBC timeout to be able to resync */
  #define RADIO_EVENTS_DBCTIMEOUT_EVENTS_DBCTIMEOUT_Pos (0UL) /*!< Position of EVENTS_DBCTIMEOUT field.                        */
  #define RADIO_EVENTS_DBCTIMEOUT_EVENTS_DBCTIMEOUT_Msk (0x1UL << RADIO_EVENTS_DBCTIMEOUT_EVENTS_DBCTIMEOUT_Pos) /*!< Bit mask
                                                                            of EVENTS_DBCTIMEOUT field.*/                         
  #define RADIO_EVENTS_DBCTIMEOUT_EVENTS_DBCTIMEOUT_Min (0x0UL) /*!< Min enumerator value of EVENTS_DBCTIMEOUT field.          */
  #define RADIO_EVENTS_DBCTIMEOUT_EVENTS_DBCTIMEOUT_Max (0x1UL) /*!< Max enumerator value of EVENTS_DBCTIMEOUT field.          */
  #define RADIO_EVENTS_DBCTIMEOUT_EVENTS_DBCTIMEOUT_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define RADIO_EVENTS_DBCTIMEOUT_EVENTS_DBCTIMEOUT_Generated (0x1UL) /*!< Event generated                                     */


/* RADIO_EVENTS_TXTIMERMATCH: Tx timer match */
  #define RADIO_EVENTS_TXTIMERMATCH_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXTIMERMATCH register.                */

/* EVENTS_TXTIMERMATCH @Bit 0 : Tx timer match */
  #define RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_Pos (0UL) /*!< Position of EVENTS_TXTIMERMATCH field.                  */
  #define RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_Msk (0x1UL << RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_Pos) /*!<
                                                                            Bit mask of EVENTS_TXTIMERMATCH field.*/              
  #define RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXTIMERMATCH field.    */
  #define RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXTIMERMATCH field.    */
  #define RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define RADIO_EVENTS_TXTIMERMATCH_EVENTS_TXTIMERMATCH_Generated (0x1UL) /*!< Event generated                                 */


/* RADIO_EVENTS_RXTIMERMATCH: Rx timer match */
  #define RADIO_EVENTS_RXTIMERMATCH_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXTIMERMATCH register.                */

/* EVENTS_RXTIMERMATCH @Bit 0 : Rx timer match */
  #define RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_Pos (0UL) /*!< Position of EVENTS_RXTIMERMATCH field.                  */
  #define RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_Msk (0x1UL << RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_Pos) /*!<
                                                                            Bit mask of EVENTS_RXTIMERMATCH field.*/              
  #define RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXTIMERMATCH field.    */
  #define RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXTIMERMATCH field.    */
  #define RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define RADIO_EVENTS_RXTIMERMATCH_EVENTS_RXTIMERMATCH_Generated (0x1UL) /*!< Event generated                                 */


/* RADIO_EVENTS_BESPOKEACK: Bespoke ACK for UPSCALE */
  #define RADIO_EVENTS_BESPOKEACK_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_BESPOKEACK register.                    */

/* EVENTS_BESPOKEACK @Bit 0 : Bespoke ACK for UPSCALE */
  #define RADIO_EVENTS_BESPOKEACK_EVENTS_BESPOKEACK_Pos (0UL) /*!< Position of EVENTS_BESPOKEACK field.                        */
  #define RADIO_EVENTS_BESPOKEACK_EVENTS_BESPOKEACK_Msk (0x1UL << RADIO_EVENTS_BESPOKEACK_EVENTS_BESPOKEACK_Pos) /*!< Bit mask
                                                                            of EVENTS_BESPOKEACK field.*/                         
  #define RADIO_EVENTS_BESPOKEACK_EVENTS_BESPOKEACK_Min (0x0UL) /*!< Min enumerator value of EVENTS_BESPOKEACK field.          */
  #define RADIO_EVENTS_BESPOKEACK_EVENTS_BESPOKEACK_Max (0x1UL) /*!< Max enumerator value of EVENTS_BESPOKEACK field.          */
  #define RADIO_EVENTS_BESPOKEACK_EVENTS_BESPOKEACK_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define RADIO_EVENTS_BESPOKEACK_EVENTS_BESPOKEACK_Generated (0x1UL) /*!< Event generated                                     */


/* RADIO_EVENTS_RXDIGEN: RXDIGEN-signal was set high from the HW timing engine */
  #define RADIO_EVENTS_RXDIGEN_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXDIGEN register.                          */

/* EVENTS_RXDIGEN @Bit 0 : RXDIGEN-signal was set high from the HW timing engine */
  #define RADIO_EVENTS_RXDIGEN_EVENTS_RXDIGEN_Pos (0UL) /*!< Position of EVENTS_RXDIGEN field.                                 */
  #define RADIO_EVENTS_RXDIGEN_EVENTS_RXDIGEN_Msk (0x1UL << RADIO_EVENTS_RXDIGEN_EVENTS_RXDIGEN_Pos) /*!< Bit mask of
                                                                            EVENTS_RXDIGEN field.*/                               
  #define RADIO_EVENTS_RXDIGEN_EVENTS_RXDIGEN_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXDIGEN field.                   */
  #define RADIO_EVENTS_RXDIGEN_EVENTS_RXDIGEN_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXDIGEN field.                   */
  #define RADIO_EVENTS_RXDIGEN_EVENTS_RXDIGEN_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define RADIO_EVENTS_RXDIGEN_EVENTS_RXDIGEN_Generated (0x1UL) /*!< Event generated                                           */


/* RADIO_EVENTS_RAWDETECT: The double correlator detected one peak */
  #define RADIO_EVENTS_RAWDETECT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RAWDETECT register.                      */

/* EVENTS_RAWDETECT @Bit 0 : The double correlator detected one peak */
  #define RADIO_EVENTS_RAWDETECT_EVENTS_RAWDETECT_Pos (0UL) /*!< Position of EVENTS_RAWDETECT field.                           */
  #define RADIO_EVENTS_RAWDETECT_EVENTS_RAWDETECT_Msk (0x1UL << RADIO_EVENTS_RAWDETECT_EVENTS_RAWDETECT_Pos) /*!< Bit mask of
                                                                            EVENTS_RAWDETECT field.*/                             
  #define RADIO_EVENTS_RAWDETECT_EVENTS_RAWDETECT_Min (0x0UL) /*!< Min enumerator value of EVENTS_RAWDETECT field.             */
  #define RADIO_EVENTS_RAWDETECT_EVENTS_RAWDETECT_Max (0x1UL) /*!< Max enumerator value of EVENTS_RAWDETECT field.             */
  #define RADIO_EVENTS_RAWDETECT_EVENTS_RAWDETECT_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define RADIO_EVENTS_RAWDETECT_EVENTS_RAWDETECT_Generated (0x1UL) /*!< Event generated                                       */


