adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_EVENTS_DETECTFIFOFULL: The detect FIFO is full (this should not happen if the FIFO is sized well enough) */
  #define RADIO_EVENTS_DETECTFIFOFULL_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_DETECTFIFOFULL register.            */

/* EVENTS_DETECTFIFOFULL @Bit 0 : The detect FIFO is full (this should not happen if the FIFO is sized well enough) */
  #define RADIO_EVENTS_DETECTFIFOFULL_EVENTS_DETECTFIFOFULL_Pos (0UL) /*!< Position of EVENTS_DETECTFIFOFULL field.            */
  #define RADIO_EVENTS_DETECTFIFOFULL_EVENTS_DETECTFIFOFULL_Msk (0x1UL << RADIO_EVENTS_DETECTFIFOFULL_EVENTS_DETECTFIFOFULL_Pos)
                                                                            /*!< Bit mask of EVENTS_DETECTFIFOFULL field.*/       
  #define RADIO_EVENTS_DETECTFIFOFULL_EVENTS_DETECTFIFOFULL_Min (0x0UL) /*!< Min enumerator value of EVENTS_DETECTFIFOFULL
                                                                            field.*/                                              
  #define RADIO_EVENTS_DETECTFIFOFULL_EVENTS_DETECTFIFOFULL_Max (0x1UL) /*!< Max enumerator value of EVENTS_DETECTFIFOFULL
                                                                            field.*/                                              
  #define RADIO_EVENTS_DETECTFIFOFULL_EVENTS_DETECTFIFOFULL_NotGenerated (0x0UL) /*!< Event not generated                      */
  #define RADIO_EVENTS_DETECTFIFOFULL_EVENTS_DETECTFIFOFULL_Generated (0x1UL) /*!< Event generated                             */


/* RADIO_EVENTS_TIMERWRAPS: Event triggering when the timer wraps around (this is useful if one wants to count longer than the
                             HW timer allows) */                                                                                  
                                                                                                                                  
  #define RADIO_EVENTS_TIMERWRAPS_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TIMERWRAPS register.                    */

/* EVENTS_TIMERWRAPS @Bit 0 : Event triggering when the timer wraps around (this is useful if one wants to count longer than the
                              HW timer allows) */                                                                                 
                                                                                                                                  
  #define RADIO_EVENTS_TIMERWRAPS_EVENTS_TIMERWRAPS_Pos (0UL) /*!< Position of EVENTS_TIMERWRAPS field.                        */
  #define RADIO_EVENTS_TIMERWRAPS_EVENTS_TIMERWRAPS_Msk (0x1UL << RADIO_EVENTS_TIMERWRAPS_EVENTS_TIMERWRAPS_Pos) /*!< Bit mask
                                                                            of EVENTS_TIMERWRAPS field.*/                         
  #define RADIO_EVENTS_TIMERWRAPS_EVENTS_TIMERWRAPS_Min (0x0UL) /*!< Min enumerator value of EVENTS_TIMERWRAPS field.          */
  #define RADIO_EVENTS_TIMERWRAPS_EVENTS_TIMERWRAPS_Max (0x1UL) /*!< Max enumerator value of EVENTS_TIMERWRAPS field.          */
  #define RADIO_EVENTS_TIMERWRAPS_EVENTS_TIMERWRAPS_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define RADIO_EVENTS_TIMERWRAPS_EVENTS_TIMERWRAPS_Generated (0x1UL) /*!< Event generated                                     */


/* RADIO_EVENTS_STROBETIMETRACKUPDATED: New information from the symbol time tracker (see STROBETIMESTATUS) */
  #define RADIO_EVENTS_STROBETIMETRACKUPDATED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STROBETIMETRACKUPDATED
                                                                            register.*/                                           

/* EVENTS_STROBETIMETRACKUPDATED @Bit 0 : New information from the symbol time tracker (see STROBETIMESTATUS) */
  #define RADIO_EVENTS_STROBETIMETRACKUPDATED_EVENTS_STROBETIMETRACKUPDATED_Pos (0UL) /*!< Position of
                                                                            EVENTS_STROBETIMETRACKUPDATED field.*/                
  #define RADIO_EVENTS_STROBETIMETRACKUPDATED_EVENTS_STROBETIMETRACKUPDATED_Msk (0x1UL << RADIO_EVENTS_STROBETIMETRACKUPDATED_EVENTS_STROBETIMETRACKUPDATED_Pos)
                                                                            /*!< Bit mask of EVENTS_STROBETIMETRACKUPDATED
                                                                            field.*/                                              
  #define RADIO_EVENTS_STROBETIMETRACKUPDATED_EVENTS_STROBETIMETRACKUPDATED_Min (0x0UL) /*!< Min enumerator value of
                                                                            EVENTS_STROBETIMETRACKUPDATED field.*/                
  #define RADIO_EVENTS_STROBETIMETRACKUPDATED_EVENTS_STROBETIMETRACKUPDATED_Max (0x1UL) /*!< Max enumerator value of
                                                                            EVENTS_STROBETIMETRACKUPDATED field.*/                
  #define RADIO_EVENTS_STROBETIMETRACKUPDATED_EVENTS_STROBETIMETRACKUPDATED_NotGenerated (0x0UL) /*!< Event not generated      */
  #define RADIO_EVENTS_STROBETIMETRACKUPDATED_EVENTS_STROBETIMETRACKUPDATED_Generated (0x1UL) /*!< Event generated             */


/* RADIO_EVENTS_DEMODCTRLCONDTRIGGERED0: Condition 0 triggered and actions done */
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED0_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_DEMODCTRLCONDTRIGGERED0
                                                                            register.*/                                           

/* EVENTS_DEMODCTRLCONDTRIGGERED0 @Bit 0 : Condition 0 triggered and actions done */
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED0_EVENTS_DEMODCTRLCONDTRIGGERED0_Pos (0UL) /*!< Position of
                                                                            EVENTS_DEMODCTRLCONDTRIGGERED0 field.*/               
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED0_EVENTS_DEMODCTRLCONDTRIGGERED0_Msk (0x1UL << RADIO_EVENTS_DEMODCTRLCONDTRIGGERED0_EVENTS_DEMODCTRLCONDTRIGGERED0_Pos)
                                                                            /*!< Bit mask of EVENTS_DEMODCTRLCONDTRIGGERED0
                                                                            field.*/                                              
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED0_EVENTS_DEMODCTRLCONDTRIGGERED0_Min (0x0UL) /*!< Min enumerator value of
                                                                            EVENTS_DEMODCTRLCONDTRIGGERED0 field.*/               
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED0_EVENTS_DEMODCTRLCONDTRIGGERED0_Max (0x1UL) /*!< Max enumerator value of
                                                                            EVENTS_DEMODCTRLCONDTRIGGERED0 field.*/               
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED0_EVENTS_DEMODCTRLCONDTRIGGERED0_NotGenerated (0x0UL) /*!< Event not generated    */
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED0_EVENTS_DEMODCTRLCONDTRIGGERED0_Generated (0x1UL) /*!< Event generated           */


/* RADIO_EVENTS_DEMODCTRLCONDTRIGGERED1: Condition 1 triggered and actions done */
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED1_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_DEMODCTRLCONDTRIGGERED1
                                                                            register.*/                                           

