adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EVENTS_DEMODCTRLCONDTRIGGERED1 @Bit 0 : Condition 1 triggered and actions done */
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED1_EVENTS_DEMODCTRLCONDTRIGGERED1_Pos (0UL) /*!< Position of
                                                                            EVENTS_DEMODCTRLCONDTRIGGERED1 field.*/               
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED1_EVENTS_DEMODCTRLCONDTRIGGERED1_Msk (0x1UL << RADIO_EVENTS_DEMODCTRLCONDTRIGGERED1_EVENTS_DEMODCTRLCONDTRIGGERED1_Pos)
                                                                            /*!< Bit mask of EVENTS_DEMODCTRLCONDTRIGGERED1
                                                                            field.*/                                              
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED1_EVENTS_DEMODCTRLCONDTRIGGERED1_Min (0x0UL) /*!< Min enumerator value of
                                                                            EVENTS_DEMODCTRLCONDTRIGGERED1 field.*/               
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED1_EVENTS_DEMODCTRLCONDTRIGGERED1_Max (0x1UL) /*!< Max enumerator value of
                                                                            EVENTS_DEMODCTRLCONDTRIGGERED1 field.*/               
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED1_EVENTS_DEMODCTRLCONDTRIGGERED1_NotGenerated (0x0UL) /*!< Event not generated    */
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED1_EVENTS_DEMODCTRLCONDTRIGGERED1_Generated (0x1UL) /*!< Event generated           */


/* RADIO_EVENTS_DEMODCTRLCONDTRIGGERED2: Condition 2 triggered and actions done */
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED2_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_DEMODCTRLCONDTRIGGERED2
                                                                            register.*/                                           

/* EVENTS_DEMODCTRLCONDTRIGGERED2 @Bit 0 : Condition 2 triggered and actions done */
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED2_EVENTS_DEMODCTRLCONDTRIGGERED2_Pos (0UL) /*!< Position of
                                                                            EVENTS_DEMODCTRLCONDTRIGGERED2 field.*/               
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED2_EVENTS_DEMODCTRLCONDTRIGGERED2_Msk (0x1UL << RADIO_EVENTS_DEMODCTRLCONDTRIGGERED2_EVENTS_DEMODCTRLCONDTRIGGERED2_Pos)
                                                                            /*!< Bit mask of EVENTS_DEMODCTRLCONDTRIGGERED2
                                                                            field.*/                                              
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED2_EVENTS_DEMODCTRLCONDTRIGGERED2_Min (0x0UL) /*!< Min enumerator value of
                                                                            EVENTS_DEMODCTRLCONDTRIGGERED2 field.*/               
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED2_EVENTS_DEMODCTRLCONDTRIGGERED2_Max (0x1UL) /*!< Max enumerator value of
                                                                            EVENTS_DEMODCTRLCONDTRIGGERED2 field.*/               
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED2_EVENTS_DEMODCTRLCONDTRIGGERED2_NotGenerated (0x0UL) /*!< Event not generated    */
  #define RADIO_EVENTS_DEMODCTRLCONDTRIGGERED2_EVENTS_DEMODCTRLCONDTRIGGERED2_Generated (0x1UL) /*!< Event generated           */


/* RADIO_EVENTS_INTERCEPTEDTASK: A task has been intercepted (this event is non-interceptable) */
  #define RADIO_EVENTS_INTERCEPTEDTASK_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_INTERCEPTEDTASK register.          */

/* EVENTS_INTERCEPTEDTASK @Bit 0 : A task has been intercepted (this event is non-interceptable) */
  #define RADIO_EVENTS_INTERCEPTEDTASK_EVENTS_INTERCEPTEDTASK_Pos (0UL) /*!< Position of EVENTS_INTERCEPTEDTASK field.         */
  #define RADIO_EVENTS_INTERCEPTEDTASK_EVENTS_INTERCEPTEDTASK_Msk (0x1UL << RADIO_EVENTS_INTERCEPTEDTASK_EVENTS_INTERCEPTEDTASK_Pos)
                                                                            /*!< Bit mask of EVENTS_INTERCEPTEDTASK field.*/      
  #define RADIO_EVENTS_INTERCEPTEDTASK_EVENTS_INTERCEPTEDTASK_Min (0x0UL) /*!< Min enumerator value of EVENTS_INTERCEPTEDTASK
                                                                            field.*/                                              
  #define RADIO_EVENTS_INTERCEPTEDTASK_EVENTS_INTERCEPTEDTASK_Max (0x1UL) /*!< Max enumerator value of EVENTS_INTERCEPTEDTASK
                                                                            field.*/                                              
  #define RADIO_EVENTS_INTERCEPTEDTASK_EVENTS_INTERCEPTEDTASK_NotGenerated (0x0UL) /*!< Event not generated                    */
  #define RADIO_EVENTS_INTERCEPTEDTASK_EVENTS_INTERCEPTEDTASK_Generated (0x1UL) /*!< Event generated                           */


/* RADIO_EVENTS_INTERCEPTEDEVENT: An event has been intercepted (this event is non-interceptable) */
  #define RADIO_EVENTS_INTERCEPTEDEVENT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_INTERCEPTEDEVENT register.        */

/* EVENTS_INTERCEPTEDEVENT @Bit 0 : An event has been intercepted (this event is non-interceptable) */
  #define RADIO_EVENTS_INTERCEPTEDEVENT_EVENTS_INTERCEPTEDEVENT_Pos (0UL) /*!< Position of EVENTS_INTERCEPTEDEVENT field.      */
  #define RADIO_EVENTS_INTERCEPTEDEVENT_EVENTS_INTERCEPTEDEVENT_Msk (0x1UL << RADIO_EVENTS_INTERCEPTEDEVENT_EVENTS_INTERCEPTEDEVENT_Pos)
                                                                            /*!< Bit mask of EVENTS_INTERCEPTEDEVENT field.*/     
  #define RADIO_EVENTS_INTERCEPTEDEVENT_EVENTS_INTERCEPTEDEVENT_Min (0x0UL) /*!< Min enumerator value of EVENTS_INTERCEPTEDEVENT
                                                                            field.*/                                              
  #define RADIO_EVENTS_INTERCEPTEDEVENT_EVENTS_INTERCEPTEDEVENT_Max (0x1UL) /*!< Max enumerator value of EVENTS_INTERCEPTEDEVENT
                                                                            field.*/                                              
  #define RADIO_EVENTS_INTERCEPTEDEVENT_EVENTS_INTERCEPTEDEVENT_NotGenerated (0x0UL) /*!< Event not generated                  */
  #define RADIO_EVENTS_INTERCEPTEDEVENT_EVENTS_INTERCEPTEDEVENT_Generated (0x1UL) /*!< Event generated                         */


/* RADIO_EVENTS_TXADDRESS: Address sent */
  #define RADIO_EVENTS_TXADDRESS_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXADDRESS register.                      */

