adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EVENTS_TXADDRESS @Bit 0 : Address sent */
  #define RADIO_EVENTS_TXADDRESS_EVENTS_TXADDRESS_Pos (0UL) /*!< Position of EVENTS_TXADDRESS field.                           */
  #define RADIO_EVENTS_TXADDRESS_EVENTS_TXADDRESS_Msk (0x1UL << RADIO_EVENTS_TXADDRESS_EVENTS_TXADDRESS_Pos) /*!< Bit mask of
                                                                            EVENTS_TXADDRESS field.*/                             
  #define RADIO_EVENTS_TXADDRESS_EVENTS_TXADDRESS_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXADDRESS field.             */
  #define RADIO_EVENTS_TXADDRESS_EVENTS_TXADDRESS_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXADDRESS field.             */
  #define RADIO_EVENTS_TXADDRESS_EVENTS_TXADDRESS_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define RADIO_EVENTS_TXADDRESS_EVENTS_TXADDRESS_Generated (0x1UL) /*!< Event generated                                       */


/* RADIO_EVENTS_RXADDRESS: Address received */
  #define RADIO_EVENTS_RXADDRESS_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXADDRESS register.                      */

/* EVENTS_RXADDRESS @Bit 0 : Address received */
  #define RADIO_EVENTS_RXADDRESS_EVENTS_RXADDRESS_Pos (0UL) /*!< Position of EVENTS_RXADDRESS field.                           */
  #define RADIO_EVENTS_RXADDRESS_EVENTS_RXADDRESS_Msk (0x1UL << RADIO_EVENTS_RXADDRESS_EVENTS_RXADDRESS_Pos) /*!< Bit mask of
                                                                            EVENTS_RXADDRESS field.*/                             
  #define RADIO_EVENTS_RXADDRESS_EVENTS_RXADDRESS_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXADDRESS field.             */
  #define RADIO_EVENTS_RXADDRESS_EVENTS_RXADDRESS_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXADDRESS field.             */
  #define RADIO_EVENTS_RXADDRESS_EVENTS_RXADDRESS_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define RADIO_EVENTS_RXADDRESS_EVENTS_RXADDRESS_Generated (0x1UL) /*!< Event generated                                       */


/* RADIO_EVENTS_ACQINJ0DMAEND: ACQINJ0 DMA end */
  #define RADIO_EVENTS_ACQINJ0DMAEND_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ACQINJ0DMAEND register.              */

/* EVENTS_ACQINJ0DMAEND @Bit 0 : ACQINJ0 DMA end */
  #define RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_Pos (0UL) /*!< Position of EVENTS_ACQINJ0DMAEND field.               */
  #define RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_Msk (0x1UL << RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_Pos)
                                                                            /*!< Bit mask of EVENTS_ACQINJ0DMAEND field.*/        
  #define RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_Min (0x0UL) /*!< Min enumerator value of EVENTS_ACQINJ0DMAEND field. */
  #define RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_Max (0x1UL) /*!< Max enumerator value of EVENTS_ACQINJ0DMAEND field. */
  #define RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_NotGenerated (0x0UL) /*!< Event not generated                        */
  #define RADIO_EVENTS_ACQINJ0DMAEND_EVENTS_ACQINJ0DMAEND_Generated (0x1UL) /*!< Event generated                               */


/* RADIO_EVENTS_ACQINJ1DMAEND: ACQINJ1 DMA end */
  #define RADIO_EVENTS_ACQINJ1DMAEND_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ACQINJ1DMAEND register.              */

/* EVENTS_ACQINJ1DMAEND @Bit 0 : ACQINJ1 DMA end */
  #define RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_Pos (0UL) /*!< Position of EVENTS_ACQINJ1DMAEND field.               */
  #define RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_Msk (0x1UL << RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_Pos)
                                                                            /*!< Bit mask of EVENTS_ACQINJ1DMAEND field.*/        
  #define RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_Min (0x0UL) /*!< Min enumerator value of EVENTS_ACQINJ1DMAEND field. */
  #define RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_Max (0x1UL) /*!< Max enumerator value of EVENTS_ACQINJ1DMAEND field. */
  #define RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_NotGenerated (0x0UL) /*!< Event not generated                        */
  #define RADIO_EVENTS_ACQINJ1DMAEND_EVENTS_ACQINJ1DMAEND_Generated (0x1UL) /*!< Event generated                               */


/* RADIO_PUBLISH_READY: Publish configuration for event READY */
  #define RADIO_PUBLISH_READY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_READY register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define RADIO_PUBLISH_READY_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_READY_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_READY_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define RADIO_PUBLISH_READY_CHIDX_Min (0x0UL)      /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_READY_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_READY_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_READY_EN_Msk (0x1UL << RADIO_PUBLISH_READY_EN_Pos) /*!< Bit mask of EN field.                          */
  #define RADIO_PUBLISH_READY_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_READY_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_READY_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define RADIO_PUBLISH_READY_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_TXREADY: Publish configuration for event TXREADY */
  #define RADIO_PUBLISH_TXREADY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXREADY register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event TXREADY will publish to */
  #define RADIO_PUBLISH_TXREADY_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_TXREADY_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_TXREADY_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define RADIO_PUBLISH_TXREADY_CHIDX_Min (0x0UL)    /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_TXREADY_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_TXREADY_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_TXREADY_EN_Msk (0x1UL << RADIO_PUBLISH_TXREADY_EN_Pos) /*!< Bit mask of EN field.                      */
  #define RADIO_PUBLISH_TXREADY_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_TXREADY_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_TXREADY_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define RADIO_PUBLISH_TXREADY_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


