adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_PUBLISH_MODEWRITTEN: Publish configuration for event MODEWRITTEN */
  #define RADIO_PUBLISH_MODEWRITTEN_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_MODEWRITTEN register.                */

/* CHIDX @Bits 0..7 : DPPI channel that event MODEWRITTEN will publish to */
  #define RADIO_PUBLISH_MODEWRITTEN_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_MODEWRITTEN_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_MODEWRITTEN_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define RADIO_PUBLISH_MODEWRITTEN_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                           */
  #define RADIO_PUBLISH_MODEWRITTEN_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_MODEWRITTEN_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_MODEWRITTEN_EN_Msk (0x1UL << RADIO_PUBLISH_MODEWRITTEN_EN_Pos) /*!< Bit mask of EN field.              */
  #define RADIO_PUBLISH_MODEWRITTEN_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_MODEWRITTEN_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_MODEWRITTEN_EN_Disabled (0x0UL) /*!< Disable publishing                                                */
  #define RADIO_PUBLISH_MODEWRITTEN_EN_Enabled (0x1UL) /*!< Enable publishing                                                  */


/* RADIO_PUBLISH_MODEREADY: Publish configuration for event MODEREADY */
  #define RADIO_PUBLISH_MODEREADY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_MODEREADY register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event MODEREADY will publish to */
  #define RADIO_PUBLISH_MODEREADY_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_MODEREADY_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_MODEREADY_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define RADIO_PUBLISH_MODEREADY_CHIDX_Min (0x0UL)  /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_MODEREADY_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_MODEREADY_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_MODEREADY_EN_Msk (0x1UL << RADIO_PUBLISH_MODEREADY_EN_Pos) /*!< Bit mask of EN field.                  */
  #define RADIO_PUBLISH_MODEREADY_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_MODEREADY_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_MODEREADY_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define RADIO_PUBLISH_MODEREADY_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_CTEEND: Publish configuration for event CTEEND */
  #define RADIO_PUBLISH_CTEEND_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_CTEEND register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that event CTEEND will publish to */
  #define RADIO_PUBLISH_CTEEND_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_CTEEND_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_CTEEND_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define RADIO_PUBLISH_CTEEND_CHIDX_Min (0x0UL)     /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_CTEEND_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_CTEEND_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_CTEEND_EN_Msk (0x1UL << RADIO_PUBLISH_CTEEND_EN_Pos) /*!< Bit mask of EN field.                        */
  #define RADIO_PUBLISH_CTEEND_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_CTEEND_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_CTEEND_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define RADIO_PUBLISH_CTEEND_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_LBREADY: Publish configuration for event LBREADY */
  #define RADIO_PUBLISH_LBREADY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_LBREADY register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event LBREADY will publish to */
  #define RADIO_PUBLISH_LBREADY_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_LBREADY_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_LBREADY_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define RADIO_PUBLISH_LBREADY_CHIDX_Min (0x0UL)    /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_LBREADY_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_LBREADY_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_LBREADY_EN_Msk (0x1UL << RADIO_PUBLISH_LBREADY_EN_Pos) /*!< Bit mask of EN field.                      */
  #define RADIO_PUBLISH_LBREADY_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_LBREADY_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_LBREADY_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define RADIO_PUBLISH_LBREADY_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_CALDONE: Publish configuration for event CALDONE */
  #define RADIO_PUBLISH_CALDONE_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_CALDONE register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event CALDONE will publish to */
  #define RADIO_PUBLISH_CALDONE_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_CALDONE_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_CALDONE_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define RADIO_PUBLISH_CALDONE_CHIDX_Min (0x0UL)    /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_CALDONE_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_CALDONE_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_CALDONE_EN_Msk (0x1UL << RADIO_PUBLISH_CALDONE_EN_Pos) /*!< Bit mask of EN field.                      */
  #define RADIO_PUBLISH_CALDONE_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_CALDONE_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_CALDONE_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define RADIO_PUBLISH_CALDONE_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_CHNOUPDATED: Publish configuration for event CHNOUPDATED */
  #define RADIO_PUBLISH_CHNOUPDATED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_CHNOUPDATED register.                */

/* CHIDX @Bits 0..7 : DPPI channel that event CHNOUPDATED will publish to */
  #define RADIO_PUBLISH_CHNOUPDATED_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_CHNOUPDATED_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_CHNOUPDATED_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define RADIO_PUBLISH_CHNOUPDATED_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                           */
  #define RADIO_PUBLISH_CHNOUPDATED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_CHNOUPDATED_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_CHNOUPDATED_EN_Msk (0x1UL << RADIO_PUBLISH_CHNOUPDATED_EN_Pos) /*!< Bit mask of EN field.              */
  #define RADIO_PUBLISH_CHNOUPDATED_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_CHNOUPDATED_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_CHNOUPDATED_EN_Disabled (0x0UL) /*!< Disable publishing                                                */
  #define RADIO_PUBLISH_CHNOUPDATED_EN_Enabled (0x1UL) /*!< Enable publishing                                                  */


/* RADIO_PUBLISH_DBCTIMEOUT: Publish configuration for event DBCTIMEOUT */
  #define RADIO_PUBLISH_DBCTIMEOUT_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_DBCTIMEOUT register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that event DBCTIMEOUT will publish to */
  #define RADIO_PUBLISH_DBCTIMEOUT_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_DBCTIMEOUT_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_DBCTIMEOUT_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define RADIO_PUBLISH_DBCTIMEOUT_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_DBCTIMEOUT_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_DBCTIMEOUT_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_DBCTIMEOUT_EN_Msk (0x1UL << RADIO_PUBLISH_DBCTIMEOUT_EN_Pos) /*!< Bit mask of EN field.                */
  #define RADIO_PUBLISH_DBCTIMEOUT_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_DBCTIMEOUT_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_DBCTIMEOUT_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define RADIO_PUBLISH_DBCTIMEOUT_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* RADIO_PUBLISH_TXTIMERMATCH: Publish configuration for event TXTIMERMATCH */
  #define RADIO_PUBLISH_TXTIMERMATCH_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXTIMERMATCH register.              */

/* CHIDX @Bits 0..7 : DPPI channel that event TXTIMERMATCH will publish to */
  #define RADIO_PUBLISH_TXTIMERMATCH_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_TXTIMERMATCH_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_TXTIMERMATCH_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define RADIO_PUBLISH_TXTIMERMATCH_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                          */
  #define RADIO_PUBLISH_TXTIMERMATCH_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_TXTIMERMATCH_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_TXTIMERMATCH_EN_Msk (0x1UL << RADIO_PUBLISH_TXTIMERMATCH_EN_Pos) /*!< Bit mask of EN field.            */
  #define RADIO_PUBLISH_TXTIMERMATCH_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_TXTIMERMATCH_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_TXTIMERMATCH_EN_Disabled (0x0UL) /*!< Disable publishing                                               */
  #define RADIO_PUBLISH_TXTIMERMATCH_EN_Enabled (0x1UL) /*!< Enable publishing                                                 */


/* RADIO_PUBLISH_RXTIMERMATCH: Publish configuration for event RXTIMERMATCH */
  #define RADIO_PUBLISH_RXTIMERMATCH_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXTIMERMATCH register.              */

/* CHIDX @Bits 0..7 : DPPI channel that event RXTIMERMATCH will publish to */
  #define RADIO_PUBLISH_RXTIMERMATCH_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_RXTIMERMATCH_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_RXTIMERMATCH_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define RADIO_PUBLISH_RXTIMERMATCH_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                          */
  #define RADIO_PUBLISH_RXTIMERMATCH_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_RXTIMERMATCH_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_RXTIMERMATCH_EN_Msk (0x1UL << RADIO_PUBLISH_RXTIMERMATCH_EN_Pos) /*!< Bit mask of EN field.            */
  #define RADIO_PUBLISH_RXTIMERMATCH_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_RXTIMERMATCH_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_RXTIMERMATCH_EN_Disabled (0x0UL) /*!< Disable publishing                                               */
  #define RADIO_PUBLISH_RXTIMERMATCH_EN_Enabled (0x1UL) /*!< Enable publishing                                                 */


/* RADIO_PUBLISH_BESPOKEACK: Publish configuration for event BESPOKEACK */
  #define RADIO_PUBLISH_BESPOKEACK_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_BESPOKEACK register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that event BESPOKEACK will publish to */
  #define RADIO_PUBLISH_BESPOKEACK_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_BESPOKEACK_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_BESPOKEACK_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define RADIO_PUBLISH_BESPOKEACK_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_BESPOKEACK_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_BESPOKEACK_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_BESPOKEACK_EN_Msk (0x1UL << RADIO_PUBLISH_BESPOKEACK_EN_Pos) /*!< Bit mask of EN field.                */
  #define RADIO_PUBLISH_BESPOKEACK_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_BESPOKEACK_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_BESPOKEACK_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define RADIO_PUBLISH_BESPOKEACK_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* RADIO_PUBLISH_RXDIGEN: Publish configuration for event RXDIGEN */
  #define RADIO_PUBLISH_RXDIGEN_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXDIGEN register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event RXDIGEN will publish to */
  #define RADIO_PUBLISH_RXDIGEN_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_RXDIGEN_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_RXDIGEN_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define RADIO_PUBLISH_RXDIGEN_CHIDX_Min (0x0UL)    /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_RXDIGEN_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_RXDIGEN_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_RXDIGEN_EN_Msk (0x1UL << RADIO_PUBLISH_RXDIGEN_EN_Pos) /*!< Bit mask of EN field.                      */
  #define RADIO_PUBLISH_RXDIGEN_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_RXDIGEN_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_RXDIGEN_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define RADIO_PUBLISH_RXDIGEN_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_RAWDETECT: Publish configuration for event RAWDETECT */
  #define RADIO_PUBLISH_RAWDETECT_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RAWDETECT register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event RAWDETECT will publish to */
  #define RADIO_PUBLISH_RAWDETECT_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_RAWDETECT_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_RAWDETECT_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define RADIO_PUBLISH_RAWDETECT_CHIDX_Min (0x0UL)  /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_RAWDETECT_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_RAWDETECT_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_RAWDETECT_EN_Msk (0x1UL << RADIO_PUBLISH_RAWDETECT_EN_Pos) /*!< Bit mask of EN field.                  */
  #define RADIO_PUBLISH_RAWDETECT_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_RAWDETECT_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_RAWDETECT_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define RADIO_PUBLISH_RAWDETECT_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_DETECTFIFOFULL: Publish configuration for event DETECTFIFOFULL */
  #define RADIO_PUBLISH_DETECTFIFOFULL_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_DETECTFIFOFULL register.          */

/* CHIDX @Bits 0..7 : DPPI channel that event DETECTFIFOFULL will publish to */
  #define RADIO_PUBLISH_DETECTFIFOFULL_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                           */
  #define RADIO_PUBLISH_DETECTFIFOFULL_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_DETECTFIFOFULL_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIO_PUBLISH_DETECTFIFOFULL_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                        */
  #define RADIO_PUBLISH_DETECTFIFOFULL_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                        */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_DETECTFIFOFULL_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_DETECTFIFOFULL_EN_Msk (0x1UL << RADIO_PUBLISH_DETECTFIFOFULL_EN_Pos) /*!< Bit mask of EN field.        */
  #define RADIO_PUBLISH_DETECTFIFOFULL_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define RADIO_PUBLISH_DETECTFIFOFULL_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define RADIO_PUBLISH_DETECTFIFOFULL_EN_Disabled (0x0UL) /*!< Disable publishing                                             */
  #define RADIO_PUBLISH_DETECTFIFOFULL_EN_Enabled (0x1UL) /*!< Enable publishing                                               */


