adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_PUBLISH_TIMERWRAPS: Publish configuration for event TIMERWRAPS */
  #define RADIO_PUBLISH_TIMERWRAPS_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TIMERWRAPS register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that event TIMERWRAPS will publish to */
  #define RADIO_PUBLISH_TIMERWRAPS_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_TIMERWRAPS_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_TIMERWRAPS_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define RADIO_PUBLISH_TIMERWRAPS_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_TIMERWRAPS_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_TIMERWRAPS_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_TIMERWRAPS_EN_Msk (0x1UL << RADIO_PUBLISH_TIMERWRAPS_EN_Pos) /*!< Bit mask of EN field.                */
  #define RADIO_PUBLISH_TIMERWRAPS_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_TIMERWRAPS_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_TIMERWRAPS_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define RADIO_PUBLISH_TIMERWRAPS_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* RADIO_PUBLISH_STROBETIMETRACKUPDATED: Publish configuration for event STROBETIMETRACKUPDATED */
  #define RADIO_PUBLISH_STROBETIMETRACKUPDATED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STROBETIMETRACKUPDATED
                                                                            register.*/                                           

/* CHIDX @Bits 0..7 : DPPI channel that event STROBETIMETRACKUPDATED will publish to */
  #define RADIO_PUBLISH_STROBETIMETRACKUPDATED_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                   */
  #define RADIO_PUBLISH_STROBETIMETRACKUPDATED_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_STROBETIMETRACKUPDATED_CHIDX_Pos) /*!< Bit
                                                                            mask of CHIDX field.*/                                
  #define RADIO_PUBLISH_STROBETIMETRACKUPDATED_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                */
  #define RADIO_PUBLISH_STROBETIMETRACKUPDATED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_STROBETIMETRACKUPDATED_EN_Pos (31UL) /*!< Position of EN field.                                        */
  #define RADIO_PUBLISH_STROBETIMETRACKUPDATED_EN_Msk (0x1UL << RADIO_PUBLISH_STROBETIMETRACKUPDATED_EN_Pos) /*!< Bit mask of EN
                                                                            field.*/                                              
  #define RADIO_PUBLISH_STROBETIMETRACKUPDATED_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                           */
  #define RADIO_PUBLISH_STROBETIMETRACKUPDATED_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                           */
  #define RADIO_PUBLISH_STROBETIMETRACKUPDATED_EN_Disabled (0x0UL) /*!< Disable publishing                                     */
  #define RADIO_PUBLISH_STROBETIMETRACKUPDATED_EN_Enabled (0x1UL) /*!< Enable publishing                                       */


/* RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0: Publish configuration for event DEMODCTRLCONDTRIGGERED0 */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_DEMODCTRLCONDTRIGGERED0
                                                                            register.*/                                           

/* CHIDX @Bits 0..7 : DPPI channel that event DEMODCTRLCONDTRIGGERED0 will publish to */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                  */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_CHIDX_Pos) /*!< Bit
                                                                            mask of CHIDX field.*/                                
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                               */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                               */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_EN_Pos (31UL) /*!< Position of EN field.                                       */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_EN_Msk (0x1UL << RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_EN_Pos) /*!< Bit mask of
                                                                            EN field.*/                                           
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                          */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                          */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_EN_Disabled (0x0UL) /*!< Disable publishing                                    */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED0_EN_Enabled (0x1UL) /*!< Enable publishing                                      */


/* RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1: Publish configuration for event DEMODCTRLCONDTRIGGERED1 */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_DEMODCTRLCONDTRIGGERED1
                                                                            register.*/                                           

/* CHIDX @Bits 0..7 : DPPI channel that event DEMODCTRLCONDTRIGGERED1 will publish to */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                  */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_CHIDX_Pos) /*!< Bit
                                                                            mask of CHIDX field.*/                                
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                               */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                               */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_EN_Pos (31UL) /*!< Position of EN field.                                       */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_EN_Msk (0x1UL << RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_EN_Pos) /*!< Bit mask of
                                                                            EN field.*/                                           
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                          */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                          */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_EN_Disabled (0x0UL) /*!< Disable publishing                                    */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED1_EN_Enabled (0x1UL) /*!< Enable publishing                                      */


/* RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2: Publish configuration for event DEMODCTRLCONDTRIGGERED2 */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_DEMODCTRLCONDTRIGGERED2
                                                                            register.*/                                           

