adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event DEMODCTRLCONDTRIGGERED2 will publish to */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                  */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_CHIDX_Pos) /*!< Bit
                                                                            mask of CHIDX field.*/                                
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                               */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                               */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_EN_Pos (31UL) /*!< Position of EN field.                                       */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_EN_Msk (0x1UL << RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_EN_Pos) /*!< Bit mask of
                                                                            EN field.*/                                           
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                          */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                          */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_EN_Disabled (0x0UL) /*!< Disable publishing                                    */
  #define RADIO_PUBLISH_DEMODCTRLCONDTRIGGERED2_EN_Enabled (0x1UL) /*!< Enable publishing                                      */


/* RADIO_PUBLISH_INTERCEPTEDTASK: Publish configuration for event INTERCEPTEDTASK */
  #define RADIO_PUBLISH_INTERCEPTEDTASK_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_INTERCEPTEDTASK register.        */

/* CHIDX @Bits 0..7 : DPPI channel that event INTERCEPTEDTASK will publish to */
  #define RADIO_PUBLISH_INTERCEPTEDTASK_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                          */
  #define RADIO_PUBLISH_INTERCEPTEDTASK_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_INTERCEPTEDTASK_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIO_PUBLISH_INTERCEPTEDTASK_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                       */
  #define RADIO_PUBLISH_INTERCEPTEDTASK_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                       */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_INTERCEPTEDTASK_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define RADIO_PUBLISH_INTERCEPTEDTASK_EN_Msk (0x1UL << RADIO_PUBLISH_INTERCEPTEDTASK_EN_Pos) /*!< Bit mask of EN field.      */
  #define RADIO_PUBLISH_INTERCEPTEDTASK_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define RADIO_PUBLISH_INTERCEPTEDTASK_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define RADIO_PUBLISH_INTERCEPTEDTASK_EN_Disabled (0x0UL) /*!< Disable publishing                                            */
  #define RADIO_PUBLISH_INTERCEPTEDTASK_EN_Enabled (0x1UL) /*!< Enable publishing                                              */


/* RADIO_PUBLISH_INTERCEPTEDEVENT: Publish configuration for event INTERCEPTEDEVENT */
  #define RADIO_PUBLISH_INTERCEPTEDEVENT_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_INTERCEPTEDEVENT register.      */

/* CHIDX @Bits 0..7 : DPPI channel that event INTERCEPTEDEVENT will publish to */
  #define RADIO_PUBLISH_INTERCEPTEDEVENT_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                         */
  #define RADIO_PUBLISH_INTERCEPTEDEVENT_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_INTERCEPTEDEVENT_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIO_PUBLISH_INTERCEPTEDEVENT_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                      */
  #define RADIO_PUBLISH_INTERCEPTEDEVENT_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                      */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_INTERCEPTEDEVENT_EN_Pos (31UL) /*!< Position of EN field.                                              */
  #define RADIO_PUBLISH_INTERCEPTEDEVENT_EN_Msk (0x1UL << RADIO_PUBLISH_INTERCEPTEDEVENT_EN_Pos) /*!< Bit mask of EN field.    */
  #define RADIO_PUBLISH_INTERCEPTEDEVENT_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                 */
  #define RADIO_PUBLISH_INTERCEPTEDEVENT_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                 */
  #define RADIO_PUBLISH_INTERCEPTEDEVENT_EN_Disabled (0x0UL) /*!< Disable publishing                                           */
  #define RADIO_PUBLISH_INTERCEPTEDEVENT_EN_Enabled (0x1UL) /*!< Enable publishing                                             */


/* RADIO_PUBLISH_TXADDRESS: Publish configuration for event TXADDRESS */
  #define RADIO_PUBLISH_TXADDRESS_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXADDRESS register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event TXADDRESS will publish to */
  #define RADIO_PUBLISH_TXADDRESS_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_TXADDRESS_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_TXADDRESS_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define RADIO_PUBLISH_TXADDRESS_CHIDX_Min (0x0UL)  /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_TXADDRESS_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_TXADDRESS_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_TXADDRESS_EN_Msk (0x1UL << RADIO_PUBLISH_TXADDRESS_EN_Pos) /*!< Bit mask of EN field.                  */
  #define RADIO_PUBLISH_TXADDRESS_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_TXADDRESS_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_TXADDRESS_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define RADIO_PUBLISH_TXADDRESS_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_RXADDRESS: Publish configuration for event RXADDRESS */
  #define RADIO_PUBLISH_RXADDRESS_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXADDRESS register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event RXADDRESS will publish to */
  #define RADIO_PUBLISH_RXADDRESS_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_RXADDRESS_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_RXADDRESS_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define RADIO_PUBLISH_RXADDRESS_CHIDX_Min (0x0UL)  /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_RXADDRESS_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_RXADDRESS_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_RXADDRESS_EN_Msk (0x1UL << RADIO_PUBLISH_RXADDRESS_EN_Pos) /*!< Bit mask of EN field.                  */
  #define RADIO_PUBLISH_RXADDRESS_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_RXADDRESS_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_RXADDRESS_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define RADIO_PUBLISH_RXADDRESS_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


