adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_PUBLISH_ACQINJ0DMAEND: Publish configuration for event ACQINJ0DMAEND */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ACQINJ0DMAEND register.            */

/* CHIDX @Bits 0..7 : DPPI channel that event ACQINJ0DMAEND will publish to */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_ACQINJ0DMAEND_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define RADIO_PUBLISH_ACQINJ0DMAEND_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                         */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_EN_Msk (0x1UL << RADIO_PUBLISH_ACQINJ0DMAEND_EN_Pos) /*!< Bit mask of EN field.          */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_EN_Disabled (0x0UL) /*!< Disable publishing                                              */
  #define RADIO_PUBLISH_ACQINJ0DMAEND_EN_Enabled (0x1UL) /*!< Enable publishing                                                */


/* RADIO_PUBLISH_ACQINJ1DMAEND: Publish configuration for event ACQINJ1DMAEND */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ACQINJ1DMAEND register.            */

/* CHIDX @Bits 0..7 : DPPI channel that event ACQINJ1DMAEND will publish to */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_ACQINJ1DMAEND_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define RADIO_PUBLISH_ACQINJ1DMAEND_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                         */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_EN_Msk (0x1UL << RADIO_PUBLISH_ACQINJ1DMAEND_EN_Pos) /*!< Bit mask of EN field.          */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_EN_Disabled (0x0UL) /*!< Disable publishing                                              */
  #define RADIO_PUBLISH_ACQINJ1DMAEND_EN_Enabled (0x1UL) /*!< Enable publishing                                                */


/* RADIO_SHORTS: Shortcuts between local events and tasks */
  #define RADIO_SHORTS_ResetValue (0x00000000UL)     /*!< Reset value of SHORTS register.                                      */

/* READY_START @Bit 0 : Shortcut between event READY and task START */
  #define RADIO_SHORTS_READY_START_Pos (0UL)         /*!< Position of READY_START field.                                       */
  #define RADIO_SHORTS_READY_START_Msk (0x1UL << RADIO_SHORTS_READY_START_Pos) /*!< Bit mask of READY_START field.             */
  #define RADIO_SHORTS_READY_START_Min (0x0UL)       /*!< Min enumerator value of READY_START field.                           */
  #define RADIO_SHORTS_READY_START_Max (0x1UL)       /*!< Max enumerator value of READY_START field.                           */
  #define RADIO_SHORTS_READY_START_Disabled (0x0UL)  /*!< Disable shortcut                                                     */
  #define RADIO_SHORTS_READY_START_Enabled (0x1UL)   /*!< Enable shortcut                                                      */

/* END_DISABLE @Bit 1 : Shortcut between event END and task DISABLE */
  #define RADIO_SHORTS_END_DISABLE_Pos (1UL)         /*!< Position of END_DISABLE field.                                       */
  #define RADIO_SHORTS_END_DISABLE_Msk (0x1UL << RADIO_SHORTS_END_DISABLE_Pos) /*!< Bit mask of END_DISABLE field.             */
  #define RADIO_SHORTS_END_DISABLE_Min (0x0UL)       /*!< Min enumerator value of END_DISABLE field.                           */
  #define RADIO_SHORTS_END_DISABLE_Max (0x1UL)       /*!< Max enumerator value of END_DISABLE field.                           */
  #define RADIO_SHORTS_END_DISABLE_Disabled (0x0UL)  /*!< Disable shortcut                                                     */
  #define RADIO_SHORTS_END_DISABLE_Enabled (0x1UL)   /*!< Enable shortcut                                                      */

/* DISABLED_TXEN @Bit 2 : Shortcut between event DISABLED and task TXEN */
  #define RADIO_SHORTS_DISABLED_TXEN_Pos (2UL)       /*!< Position of DISABLED_TXEN field.                                     */
  #define RADIO_SHORTS_DISABLED_TXEN_Msk (0x1UL << RADIO_SHORTS_DISABLED_TXEN_Pos) /*!< Bit mask of DISABLED_TXEN field.       */
  #define RADIO_SHORTS_DISABLED_TXEN_Min (0x0UL)     /*!< Min enumerator value of DISABLED_TXEN field.                         */
  #define RADIO_SHORTS_DISABLED_TXEN_Max (0x1UL)     /*!< Max enumerator value of DISABLED_TXEN field.                         */
  #define RADIO_SHORTS_DISABLED_TXEN_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define RADIO_SHORTS_DISABLED_TXEN_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* DISABLED_RXEN @Bit 3 : Shortcut between event DISABLED and task RXEN */
  #define RADIO_SHORTS_DISABLED_RXEN_Pos (3UL)       /*!< Position of DISABLED_RXEN field.                                     */
  #define RADIO_SHORTS_DISABLED_RXEN_Msk (0x1UL << RADIO_SHORTS_DISABLED_RXEN_Pos) /*!< Bit mask of DISABLED_RXEN field.       */
  #define RADIO_SHORTS_DISABLED_RXEN_Min (0x0UL)     /*!< Min enumerator value of DISABLED_RXEN field.                         */
  #define RADIO_SHORTS_DISABLED_RXEN_Max (0x1UL)     /*!< Max enumerator value of DISABLED_RXEN field.                         */
  #define RADIO_SHORTS_DISABLED_RXEN_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define RADIO_SHORTS_DISABLED_RXEN_Enabled (0x1UL) /*!< Enable shortcut                                                      */

