adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PHYEND_START @Bit 20 : Shortcut between event PHYEND and task START */
  #define RADIO_SHORTS_PHYEND_START_Pos (20UL)       /*!< Position of PHYEND_START field.                                      */
  #define RADIO_SHORTS_PHYEND_START_Msk (0x1UL << RADIO_SHORTS_PHYEND_START_Pos) /*!< Bit mask of PHYEND_START field.          */
  #define RADIO_SHORTS_PHYEND_START_Min (0x0UL)      /*!< Min enumerator value of PHYEND_START field.                          */
  #define RADIO_SHORTS_PHYEND_START_Max (0x1UL)      /*!< Max enumerator value of PHYEND_START field.                          */
  #define RADIO_SHORTS_PHYEND_START_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define RADIO_SHORTS_PHYEND_START_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* DFEEND_STOP @Bit 21 : Shortcut between event DFEEND and task STOP */
  #define RADIO_SHORTS_DFEEND_STOP_Pos (21UL)        /*!< Position of DFEEND_STOP field.                                       */
  #define RADIO_SHORTS_DFEEND_STOP_Msk (0x1UL << RADIO_SHORTS_DFEEND_STOP_Pos) /*!< Bit mask of DFEEND_STOP field.             */
  #define RADIO_SHORTS_DFEEND_STOP_Min (0x0UL)       /*!< Min enumerator value of DFEEND_STOP field.                           */
  #define RADIO_SHORTS_DFEEND_STOP_Max (0x1UL)       /*!< Max enumerator value of DFEEND_STOP field.                           */
  #define RADIO_SHORTS_DFEEND_STOP_Disabled (0x0UL)  /*!< Disable shortcut                                                     */
  #define RADIO_SHORTS_DFEEND_STOP_Enabled (0x1UL)   /*!< Enable shortcut                                                      */

/* DISABLED_LOOPBACKEN @Bit 22 : Shortcut between event DISABLED and task LOOPBACKEN */
  #define RADIO_SHORTS_DISABLED_LOOPBACKEN_Pos (22UL) /*!< Position of DISABLED_LOOPBACKEN field.                              */
  #define RADIO_SHORTS_DISABLED_LOOPBACKEN_Msk (0x1UL << RADIO_SHORTS_DISABLED_LOOPBACKEN_Pos) /*!< Bit mask of
                                                                            DISABLED_LOOPBACKEN field.*/                          
  #define RADIO_SHORTS_DISABLED_LOOPBACKEN_Min (0x0UL) /*!< Min enumerator value of DISABLED_LOOPBACKEN field.                 */
  #define RADIO_SHORTS_DISABLED_LOOPBACKEN_Max (0x1UL) /*!< Max enumerator value of DISABLED_LOOPBACKEN field.                 */
  #define RADIO_SHORTS_DISABLED_LOOPBACKEN_Disabled (0x0UL) /*!< Disable shortcut                                              */
  #define RADIO_SHORTS_DISABLED_LOOPBACKEN_Enabled (0x1UL) /*!< Enable shortcut                                                */

/* DISABLED_CHNOINCR @Bit 23 : Shortcut between event DISABLED and task CHNOINCR */
  #define RADIO_SHORTS_DISABLED_CHNOINCR_Pos (23UL)  /*!< Position of DISABLED_CHNOINCR field.                                 */
  #define RADIO_SHORTS_DISABLED_CHNOINCR_Msk (0x1UL << RADIO_SHORTS_DISABLED_CHNOINCR_Pos) /*!< Bit mask of DISABLED_CHNOINCR
                                                                            field.*/                                              
  #define RADIO_SHORTS_DISABLED_CHNOINCR_Min (0x0UL) /*!< Min enumerator value of DISABLED_CHNOINCR field.                     */
  #define RADIO_SHORTS_DISABLED_CHNOINCR_Max (0x1UL) /*!< Max enumerator value of DISABLED_CHNOINCR field.                     */
  #define RADIO_SHORTS_DISABLED_CHNOINCR_Disabled (0x0UL) /*!< Disable shortcut                                                */
  #define RADIO_SHORTS_DISABLED_CHNOINCR_Enabled (0x1UL) /*!< Enable shortcut                                                  */

/* CHNOUPDATED_TXEN @Bit 24 : Shortcut between event CHNOUPDATED and task TXEN */
  #define RADIO_SHORTS_CHNOUPDATED_TXEN_Pos (24UL)   /*!< Position of CHNOUPDATED_TXEN field.                                  */
  #define RADIO_SHORTS_CHNOUPDATED_TXEN_Msk (0x1UL << RADIO_SHORTS_CHNOUPDATED_TXEN_Pos) /*!< Bit mask of CHNOUPDATED_TXEN
                                                                            field.*/                                              
  #define RADIO_SHORTS_CHNOUPDATED_TXEN_Min (0x0UL)  /*!< Min enumerator value of CHNOUPDATED_TXEN field.                      */
  #define RADIO_SHORTS_CHNOUPDATED_TXEN_Max (0x1UL)  /*!< Max enumerator value of CHNOUPDATED_TXEN field.                      */
  #define RADIO_SHORTS_CHNOUPDATED_TXEN_Disabled (0x0UL) /*!< Disable shortcut                                                 */
  #define RADIO_SHORTS_CHNOUPDATED_TXEN_Enabled (0x1UL) /*!< Enable shortcut                                                   */

/* CHNOUPDATED_RXEN @Bit 25 : Shortcut between event CHNOUPDATED and task RXEN */
  #define RADIO_SHORTS_CHNOUPDATED_RXEN_Pos (25UL)   /*!< Position of CHNOUPDATED_RXEN field.                                  */
  #define RADIO_SHORTS_CHNOUPDATED_RXEN_Msk (0x1UL << RADIO_SHORTS_CHNOUPDATED_RXEN_Pos) /*!< Bit mask of CHNOUPDATED_RXEN
                                                                            field.*/                                              
  #define RADIO_SHORTS_CHNOUPDATED_RXEN_Min (0x0UL)  /*!< Min enumerator value of CHNOUPDATED_RXEN field.                      */
  #define RADIO_SHORTS_CHNOUPDATED_RXEN_Max (0x1UL)  /*!< Max enumerator value of CHNOUPDATED_RXEN field.                      */
  #define RADIO_SHORTS_CHNOUPDATED_RXEN_Disabled (0x0UL) /*!< Disable shortcut                                                 */
  #define RADIO_SHORTS_CHNOUPDATED_RXEN_Enabled (0x1UL) /*!< Enable shortcut                                                   */

/* CHNOUPDATED_LOOPBACKEN @Bit 26 : Shortcut between event CHNOUPDATED and task LOOPBACKEN */
  #define RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Pos (26UL) /*!< Position of CHNOUPDATED_LOOPBACKEN field.                        */
  #define RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Msk (0x1UL << RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Pos) /*!< Bit mask of
                                                                            CHNOUPDATED_LOOPBACKEN field.*/                       
  #define RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Min (0x0UL) /*!< Min enumerator value of CHNOUPDATED_LOOPBACKEN field.           */
  #define RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Max (0x1UL) /*!< Max enumerator value of CHNOUPDATED_LOOPBACKEN field.           */
  #define RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Disabled (0x0UL) /*!< Disable shortcut                                           */
  #define RADIO_SHORTS_CHNOUPDATED_LOOPBACKEN_Enabled (0x1UL) /*!< Enable shortcut                                             */


/* RADIO_INTEN00: Enable or disable interrupt */
  #define RADIO_INTEN00_ResetValue (0x00000000UL)    /*!< Reset value of INTEN00 register.                                     */

