adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CRCOK @Bit 11 : Enable or disable interrupt for event CRCOK */
  #define RADIO_INTEN00_CRCOK_Pos (11UL)             /*!< Position of CRCOK field.                                             */
  #define RADIO_INTEN00_CRCOK_Msk (0x1UL << RADIO_INTEN00_CRCOK_Pos) /*!< Bit mask of CRCOK field.                             */
  #define RADIO_INTEN00_CRCOK_Min (0x0UL)            /*!< Min enumerator value of CRCOK field.                                 */
  #define RADIO_INTEN00_CRCOK_Max (0x1UL)            /*!< Max enumerator value of CRCOK field.                                 */
  #define RADIO_INTEN00_CRCOK_Disabled (0x0UL)       /*!< Disable                                                              */
  #define RADIO_INTEN00_CRCOK_Enabled (0x1UL)        /*!< Enable                                                               */

/* CRCERROR @Bit 12 : Enable or disable interrupt for event CRCERROR */
  #define RADIO_INTEN00_CRCERROR_Pos (12UL)          /*!< Position of CRCERROR field.                                          */
  #define RADIO_INTEN00_CRCERROR_Msk (0x1UL << RADIO_INTEN00_CRCERROR_Pos) /*!< Bit mask of CRCERROR field.                    */
  #define RADIO_INTEN00_CRCERROR_Min (0x0UL)         /*!< Min enumerator value of CRCERROR field.                              */
  #define RADIO_INTEN00_CRCERROR_Max (0x1UL)         /*!< Max enumerator value of CRCERROR field.                              */
  #define RADIO_INTEN00_CRCERROR_Disabled (0x0UL)    /*!< Disable                                                              */
  #define RADIO_INTEN00_CRCERROR_Enabled (0x1UL)     /*!< Enable                                                               */

/* BCMATCH @Bit 14 : Enable or disable interrupt for event BCMATCH */
  #define RADIO_INTEN00_BCMATCH_Pos (14UL)           /*!< Position of BCMATCH field.                                           */
  #define RADIO_INTEN00_BCMATCH_Msk (0x1UL << RADIO_INTEN00_BCMATCH_Pos) /*!< Bit mask of BCMATCH field.                       */
  #define RADIO_INTEN00_BCMATCH_Min (0x0UL)          /*!< Min enumerator value of BCMATCH field.                               */
  #define RADIO_INTEN00_BCMATCH_Max (0x1UL)          /*!< Max enumerator value of BCMATCH field.                               */
  #define RADIO_INTEN00_BCMATCH_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN00_BCMATCH_Enabled (0x1UL)      /*!< Enable                                                               */

/* EDEND @Bit 15 : Enable or disable interrupt for event EDEND */
  #define RADIO_INTEN00_EDEND_Pos (15UL)             /*!< Position of EDEND field.                                             */
  #define RADIO_INTEN00_EDEND_Msk (0x1UL << RADIO_INTEN00_EDEND_Pos) /*!< Bit mask of EDEND field.                             */
  #define RADIO_INTEN00_EDEND_Min (0x0UL)            /*!< Min enumerator value of EDEND field.                                 */
  #define RADIO_INTEN00_EDEND_Max (0x1UL)            /*!< Max enumerator value of EDEND field.                                 */
  #define RADIO_INTEN00_EDEND_Disabled (0x0UL)       /*!< Disable                                                              */
  #define RADIO_INTEN00_EDEND_Enabled (0x1UL)        /*!< Enable                                                               */

/* EDSTOPPED @Bit 16 : Enable or disable interrupt for event EDSTOPPED */
  #define RADIO_INTEN00_EDSTOPPED_Pos (16UL)         /*!< Position of EDSTOPPED field.                                         */
  #define RADIO_INTEN00_EDSTOPPED_Msk (0x1UL << RADIO_INTEN00_EDSTOPPED_Pos) /*!< Bit mask of EDSTOPPED field.                 */
  #define RADIO_INTEN00_EDSTOPPED_Min (0x0UL)        /*!< Min enumerator value of EDSTOPPED field.                             */
  #define RADIO_INTEN00_EDSTOPPED_Max (0x1UL)        /*!< Max enumerator value of EDSTOPPED field.                             */
  #define RADIO_INTEN00_EDSTOPPED_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIO_INTEN00_EDSTOPPED_Enabled (0x1UL)    /*!< Enable                                                               */

/* CCAIDLE @Bit 17 : Enable or disable interrupt for event CCAIDLE */
  #define RADIO_INTEN00_CCAIDLE_Pos (17UL)           /*!< Position of CCAIDLE field.                                           */
  #define RADIO_INTEN00_CCAIDLE_Msk (0x1UL << RADIO_INTEN00_CCAIDLE_Pos) /*!< Bit mask of CCAIDLE field.                       */
  #define RADIO_INTEN00_CCAIDLE_Min (0x0UL)          /*!< Min enumerator value of CCAIDLE field.                               */
  #define RADIO_INTEN00_CCAIDLE_Max (0x1UL)          /*!< Max enumerator value of CCAIDLE field.                               */
  #define RADIO_INTEN00_CCAIDLE_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN00_CCAIDLE_Enabled (0x1UL)      /*!< Enable                                                               */

/* CCABUSY @Bit 18 : Enable or disable interrupt for event CCABUSY */
  #define RADIO_INTEN00_CCABUSY_Pos (18UL)           /*!< Position of CCABUSY field.                                           */
  #define RADIO_INTEN00_CCABUSY_Msk (0x1UL << RADIO_INTEN00_CCABUSY_Pos) /*!< Bit mask of CCABUSY field.                       */
  #define RADIO_INTEN00_CCABUSY_Min (0x0UL)          /*!< Min enumerator value of CCABUSY field.                               */
  #define RADIO_INTEN00_CCABUSY_Max (0x1UL)          /*!< Max enumerator value of CCABUSY field.                               */
  #define RADIO_INTEN00_CCABUSY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN00_CCABUSY_Enabled (0x1UL)      /*!< Enable                                                               */

/* CCASTOPPED @Bit 19 : Enable or disable interrupt for event CCASTOPPED */
  #define RADIO_INTEN00_CCASTOPPED_Pos (19UL)        /*!< Position of CCASTOPPED field.                                        */
  #define RADIO_INTEN00_CCASTOPPED_Msk (0x1UL << RADIO_INTEN00_CCASTOPPED_Pos) /*!< Bit mask of CCASTOPPED field.              */
  #define RADIO_INTEN00_CCASTOPPED_Min (0x0UL)       /*!< Min enumerator value of CCASTOPPED field.                            */
  #define RADIO_INTEN00_CCASTOPPED_Max (0x1UL)       /*!< Max enumerator value of CCASTOPPED field.                            */
  #define RADIO_INTEN00_CCASTOPPED_Disabled (0x0UL)  /*!< Disable                                                              */
  #define RADIO_INTEN00_CCASTOPPED_Enabled (0x1UL)   /*!< Enable                                                               */

