adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TIMERWRAPS @Bit 7 : Enable or disable interrupt for event TIMERWRAPS */
  #define RADIO_INTEN01_TIMERWRAPS_Pos (7UL)         /*!< Position of TIMERWRAPS field.                                        */
  #define RADIO_INTEN01_TIMERWRAPS_Msk (0x1UL << RADIO_INTEN01_TIMERWRAPS_Pos) /*!< Bit mask of TIMERWRAPS field.              */
  #define RADIO_INTEN01_TIMERWRAPS_Min (0x0UL)       /*!< Min enumerator value of TIMERWRAPS field.                            */
  #define RADIO_INTEN01_TIMERWRAPS_Max (0x1UL)       /*!< Max enumerator value of TIMERWRAPS field.                            */
  #define RADIO_INTEN01_TIMERWRAPS_Disabled (0x0UL)  /*!< Disable                                                              */
  #define RADIO_INTEN01_TIMERWRAPS_Enabled (0x1UL)   /*!< Enable                                                               */

/* STROBETIMETRACKUPDATED @Bit 8 : Enable or disable interrupt for event STROBETIMETRACKUPDATED */
  #define RADIO_INTEN01_STROBETIMETRACKUPDATED_Pos (8UL) /*!< Position of STROBETIMETRACKUPDATED field.                        */
  #define RADIO_INTEN01_STROBETIMETRACKUPDATED_Msk (0x1UL << RADIO_INTEN01_STROBETIMETRACKUPDATED_Pos) /*!< Bit mask of
                                                                            STROBETIMETRACKUPDATED field.*/                       
  #define RADIO_INTEN01_STROBETIMETRACKUPDATED_Min (0x0UL) /*!< Min enumerator value of STROBETIMETRACKUPDATED field.          */
  #define RADIO_INTEN01_STROBETIMETRACKUPDATED_Max (0x1UL) /*!< Max enumerator value of STROBETIMETRACKUPDATED field.          */
  #define RADIO_INTEN01_STROBETIMETRACKUPDATED_Disabled (0x0UL) /*!< Disable                                                   */
  #define RADIO_INTEN01_STROBETIMETRACKUPDATED_Enabled (0x1UL) /*!< Enable                                                     */

/* DEMODCTRLCONDTRIGGERED0 @Bit 9 : Enable or disable interrupt for event DEMODCTRLCONDTRIGGERED0 */
  #define RADIO_INTEN01_DEMODCTRLCONDTRIGGERED0_Pos (9UL) /*!< Position of DEMODCTRLCONDTRIGGERED0 field.                      */
  #define RADIO_INTEN01_DEMODCTRLCONDTRIGGERED0_Msk (0x1UL << RADIO_INTEN01_DEMODCTRLCONDTRIGGERED0_Pos) /*!< Bit mask of
                                                                            DEMODCTRLCONDTRIGGERED0 field.*/                      
  #define RADIO_INTEN01_DEMODCTRLCONDTRIGGERED0_Min (0x0UL) /*!< Min enumerator value of DEMODCTRLCONDTRIGGERED0 field.        */
  #define RADIO_INTEN01_DEMODCTRLCONDTRIGGERED0_Max (0x1UL) /*!< Max enumerator value of DEMODCTRLCONDTRIGGERED0 field.        */
  #define RADIO_INTEN01_DEMODCTRLCONDTRIGGERED0_Disabled (0x0UL) /*!< Disable                                                  */
  #define RADIO_INTEN01_DEMODCTRLCONDTRIGGERED0_Enabled (0x1UL) /*!< Enable                                                    */

/* DEMODCTRLCONDTRIGGERED1 @Bit 10 : Enable or disable interrupt for event DEMODCTRLCONDTRIGGERED1 */
  #define RADIO_INTEN01_DEMODCTRLCONDTRIGGERED1_Pos (10UL) /*!< Position of DEMODCTRLCONDTRIGGERED1 field.                     */
  #define RADIO_INTEN01_DEMODCTRLCONDTRIGGERED1_Msk (0x1UL << RADIO_INTEN01_DEMODCTRLCONDTRIGGERED1_Pos) /*!< Bit mask of
                                                                            DEMODCTRLCONDTRIGGERED1 field.*/                      
  #define RADIO_INTEN01_DEMODCTRLCONDTRIGGERED1_Min (0x0UL) /*!< Min enumerator value of DEMODCTRLCONDTRIGGERED1 field.        */
  #define RADIO_INTEN01_DEMODCTRLCONDTRIGGERED1_Max (0x1UL) /*!< Max enumerator value of DEMODCTRLCONDTRIGGERED1 field.        */
  #define RADIO_INTEN01_DEMODCTRLCONDTRIGGERED1_Disabled (0x0UL) /*!< Disable                                                  */
  #define RADIO_INTEN01_DEMODCTRLCONDTRIGGERED1_Enabled (0x1UL) /*!< Enable                                                    */

/* DEMODCTRLCONDTRIGGERED2 @Bit 11 : Enable or disable interrupt for event DEMODCTRLCONDTRIGGERED2 */
  #define RADIO_INTEN01_DEMODCTRLCONDTRIGGERED2_Pos (11UL) /*!< Position of DEMODCTRLCONDTRIGGERED2 field.                     */
  #define RADIO_INTEN01_DEMODCTRLCONDTRIGGERED2_Msk (0x1UL << RADIO_INTEN01_DEMODCTRLCONDTRIGGERED2_Pos) /*!< Bit mask of
                                                                            DEMODCTRLCONDTRIGGERED2 field.*/                      
  #define RADIO_INTEN01_DEMODCTRLCONDTRIGGERED2_Min (0x0UL) /*!< Min enumerator value of DEMODCTRLCONDTRIGGERED2 field.        */
  #define RADIO_INTEN01_DEMODCTRLCONDTRIGGERED2_Max (0x1UL) /*!< Max enumerator value of DEMODCTRLCONDTRIGGERED2 field.        */
  #define RADIO_INTEN01_DEMODCTRLCONDTRIGGERED2_Disabled (0x0UL) /*!< Disable                                                  */
  #define RADIO_INTEN01_DEMODCTRLCONDTRIGGERED2_Enabled (0x1UL) /*!< Enable                                                    */

/* INTERCEPTEDTASK @Bit 12 : Enable or disable interrupt for event INTERCEPTEDTASK */
  #define RADIO_INTEN01_INTERCEPTEDTASK_Pos (12UL)   /*!< Position of INTERCEPTEDTASK field.                                   */
  #define RADIO_INTEN01_INTERCEPTEDTASK_Msk (0x1UL << RADIO_INTEN01_INTERCEPTEDTASK_Pos) /*!< Bit mask of INTERCEPTEDTASK
                                                                            field.*/                                              
  #define RADIO_INTEN01_INTERCEPTEDTASK_Min (0x0UL)  /*!< Min enumerator value of INTERCEPTEDTASK field.                       */
  #define RADIO_INTEN01_INTERCEPTEDTASK_Max (0x1UL)  /*!< Max enumerator value of INTERCEPTEDTASK field.                       */
  #define RADIO_INTEN01_INTERCEPTEDTASK_Disabled (0x0UL) /*!< Disable                                                          */
  #define RADIO_INTEN01_INTERCEPTEDTASK_Enabled (0x1UL) /*!< Enable                                                            */

/* INTERCEPTEDEVENT @Bit 13 : Enable or disable interrupt for event INTERCEPTEDEVENT */
  #define RADIO_INTEN01_INTERCEPTEDEVENT_Pos (13UL)  /*!< Position of INTERCEPTEDEVENT field.                                  */
  #define RADIO_INTEN01_INTERCEPTEDEVENT_Msk (0x1UL << RADIO_INTEN01_INTERCEPTEDEVENT_Pos) /*!< Bit mask of INTERCEPTEDEVENT
                                                                            field.*/                                              
  #define RADIO_INTEN01_INTERCEPTEDEVENT_Min (0x0UL) /*!< Min enumerator value of INTERCEPTEDEVENT field.                      */
  #define RADIO_INTEN01_INTERCEPTEDEVENT_Max (0x1UL) /*!< Max enumerator value of INTERCEPTEDEVENT field.                      */
  #define RADIO_INTEN01_INTERCEPTEDEVENT_Disabled (0x0UL) /*!< Disable                                                         */
  #define RADIO_INTEN01_INTERCEPTEDEVENT_Enabled (0x1UL) /*!< Enable                                                           */

/* TXADDRESS @Bit 14 : Enable or disable interrupt for event TXADDRESS */
  #define RADIO_INTEN01_TXADDRESS_Pos (14UL)         /*!< Position of TXADDRESS field.                                         */
  #define RADIO_INTEN01_TXADDRESS_Msk (0x1UL << RADIO_INTEN01_TXADDRESS_Pos) /*!< Bit mask of TXADDRESS field.                 */
  #define RADIO_INTEN01_TXADDRESS_Min (0x0UL)        /*!< Min enumerator value of TXADDRESS field.                             */
  #define RADIO_INTEN01_TXADDRESS_Max (0x1UL)        /*!< Max enumerator value of TXADDRESS field.                             */
  #define RADIO_INTEN01_TXADDRESS_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIO_INTEN01_TXADDRESS_Enabled (0x1UL)    /*!< Enable                                                               */

/* RXADDRESS @Bit 15 : Enable or disable interrupt for event RXADDRESS */
  #define RADIO_INTEN01_RXADDRESS_Pos (15UL)         /*!< Position of RXADDRESS field.                                         */
  #define RADIO_INTEN01_RXADDRESS_Msk (0x1UL << RADIO_INTEN01_RXADDRESS_Pos) /*!< Bit mask of RXADDRESS field.                 */
  #define RADIO_INTEN01_RXADDRESS_Min (0x0UL)        /*!< Min enumerator value of RXADDRESS field.                             */
  #define RADIO_INTEN01_RXADDRESS_Max (0x1UL)        /*!< Max enumerator value of RXADDRESS field.                             */
  #define RADIO_INTEN01_RXADDRESS_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIO_INTEN01_RXADDRESS_Enabled (0x1UL)    /*!< Enable                                                               */

/* ACQINJ0DMAEND @Bit 16 : Enable or disable interrupt for event ACQINJ0DMAEND */
  #define RADIO_INTEN01_ACQINJ0DMAEND_Pos (16UL)     /*!< Position of ACQINJ0DMAEND field.                                     */
  #define RADIO_INTEN01_ACQINJ0DMAEND_Msk (0x1UL << RADIO_INTEN01_ACQINJ0DMAEND_Pos) /*!< Bit mask of ACQINJ0DMAEND field.     */
  #define RADIO_INTEN01_ACQINJ0DMAEND_Min (0x0UL)    /*!< Min enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTEN01_ACQINJ0DMAEND_Max (0x1UL)    /*!< Max enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTEN01_ACQINJ0DMAEND_Disabled (0x0UL) /*!< Disable                                                            */
  #define RADIO_INTEN01_ACQINJ0DMAEND_Enabled (0x1UL) /*!< Enable                                                              */

