adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RXTIMERMATCH @Bit 2 : Write '1' to enable interrupt for event RXTIMERMATCH */
  #define RADIO_INTENSET01_RXTIMERMATCH_Pos (2UL)    /*!< Position of RXTIMERMATCH field.                                      */
  #define RADIO_INTENSET01_RXTIMERMATCH_Msk (0x1UL << RADIO_INTENSET01_RXTIMERMATCH_Pos) /*!< Bit mask of RXTIMERMATCH field.  */
  #define RADIO_INTENSET01_RXTIMERMATCH_Min (0x0UL)  /*!< Min enumerator value of RXTIMERMATCH field.                          */
  #define RADIO_INTENSET01_RXTIMERMATCH_Max (0x1UL)  /*!< Max enumerator value of RXTIMERMATCH field.                          */
  #define RADIO_INTENSET01_RXTIMERMATCH_Set (0x1UL)  /*!< Enable                                                               */
  #define RADIO_INTENSET01_RXTIMERMATCH_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define RADIO_INTENSET01_RXTIMERMATCH_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* BESPOKEACK @Bit 3 : Write '1' to enable interrupt for event BESPOKEACK */
  #define RADIO_INTENSET01_BESPOKEACK_Pos (3UL)      /*!< Position of BESPOKEACK field.                                        */
  #define RADIO_INTENSET01_BESPOKEACK_Msk (0x1UL << RADIO_INTENSET01_BESPOKEACK_Pos) /*!< Bit mask of BESPOKEACK field.        */
  #define RADIO_INTENSET01_BESPOKEACK_Min (0x0UL)    /*!< Min enumerator value of BESPOKEACK field.                            */
  #define RADIO_INTENSET01_BESPOKEACK_Max (0x1UL)    /*!< Max enumerator value of BESPOKEACK field.                            */
  #define RADIO_INTENSET01_BESPOKEACK_Set (0x1UL)    /*!< Enable                                                               */
  #define RADIO_INTENSET01_BESPOKEACK_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIO_INTENSET01_BESPOKEACK_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* RXDIGEN @Bit 4 : Write '1' to enable interrupt for event RXDIGEN */
  #define RADIO_INTENSET01_RXDIGEN_Pos (4UL)         /*!< Position of RXDIGEN field.                                           */
  #define RADIO_INTENSET01_RXDIGEN_Msk (0x1UL << RADIO_INTENSET01_RXDIGEN_Pos) /*!< Bit mask of RXDIGEN field.                 */
  #define RADIO_INTENSET01_RXDIGEN_Min (0x0UL)       /*!< Min enumerator value of RXDIGEN field.                               */
  #define RADIO_INTENSET01_RXDIGEN_Max (0x1UL)       /*!< Max enumerator value of RXDIGEN field.                               */
  #define RADIO_INTENSET01_RXDIGEN_Set (0x1UL)       /*!< Enable                                                               */
  #define RADIO_INTENSET01_RXDIGEN_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET01_RXDIGEN_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RAWDETECT @Bit 5 : Write '1' to enable interrupt for event RAWDETECT */
  #define RADIO_INTENSET01_RAWDETECT_Pos (5UL)       /*!< Position of RAWDETECT field.                                         */
  #define RADIO_INTENSET01_RAWDETECT_Msk (0x1UL << RADIO_INTENSET01_RAWDETECT_Pos) /*!< Bit mask of RAWDETECT field.           */
  #define RADIO_INTENSET01_RAWDETECT_Min (0x0UL)     /*!< Min enumerator value of RAWDETECT field.                             */
  #define RADIO_INTENSET01_RAWDETECT_Max (0x1UL)     /*!< Max enumerator value of RAWDETECT field.                             */
  #define RADIO_INTENSET01_RAWDETECT_Set (0x1UL)     /*!< Enable                                                               */
  #define RADIO_INTENSET01_RAWDETECT_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENSET01_RAWDETECT_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* DETECTFIFOFULL @Bit 6 : Write '1' to enable interrupt for event DETECTFIFOFULL */
  #define RADIO_INTENSET01_DETECTFIFOFULL_Pos (6UL)  /*!< Position of DETECTFIFOFULL field.                                    */
  #define RADIO_INTENSET01_DETECTFIFOFULL_Msk (0x1UL << RADIO_INTENSET01_DETECTFIFOFULL_Pos) /*!< Bit mask of DETECTFIFOFULL
                                                                            field.*/                                              
  #define RADIO_INTENSET01_DETECTFIFOFULL_Min (0x0UL) /*!< Min enumerator value of DETECTFIFOFULL field.                       */
  #define RADIO_INTENSET01_DETECTFIFOFULL_Max (0x1UL) /*!< Max enumerator value of DETECTFIFOFULL field.                       */
  #define RADIO_INTENSET01_DETECTFIFOFULL_Set (0x1UL) /*!< Enable                                                              */
  #define RADIO_INTENSET01_DETECTFIFOFULL_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define RADIO_INTENSET01_DETECTFIFOFULL_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TIMERWRAPS @Bit 7 : Write '1' to enable interrupt for event TIMERWRAPS */
  #define RADIO_INTENSET01_TIMERWRAPS_Pos (7UL)      /*!< Position of TIMERWRAPS field.                                        */
  #define RADIO_INTENSET01_TIMERWRAPS_Msk (0x1UL << RADIO_INTENSET01_TIMERWRAPS_Pos) /*!< Bit mask of TIMERWRAPS field.        */
  #define RADIO_INTENSET01_TIMERWRAPS_Min (0x0UL)    /*!< Min enumerator value of TIMERWRAPS field.                            */
  #define RADIO_INTENSET01_TIMERWRAPS_Max (0x1UL)    /*!< Max enumerator value of TIMERWRAPS field.                            */
  #define RADIO_INTENSET01_TIMERWRAPS_Set (0x1UL)    /*!< Enable                                                               */
  #define RADIO_INTENSET01_TIMERWRAPS_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIO_INTENSET01_TIMERWRAPS_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* STROBETIMETRACKUPDATED @Bit 8 : Write '1' to enable interrupt for event STROBETIMETRACKUPDATED */
  #define RADIO_INTENSET01_STROBETIMETRACKUPDATED_Pos (8UL) /*!< Position of STROBETIMETRACKUPDATED field.                     */
  #define RADIO_INTENSET01_STROBETIMETRACKUPDATED_Msk (0x1UL << RADIO_INTENSET01_STROBETIMETRACKUPDATED_Pos) /*!< Bit mask of
                                                                            STROBETIMETRACKUPDATED field.*/                       
  #define RADIO_INTENSET01_STROBETIMETRACKUPDATED_Min (0x0UL) /*!< Min enumerator value of STROBETIMETRACKUPDATED field.       */
  #define RADIO_INTENSET01_STROBETIMETRACKUPDATED_Max (0x1UL) /*!< Max enumerator value of STROBETIMETRACKUPDATED field.       */
  #define RADIO_INTENSET01_STROBETIMETRACKUPDATED_Set (0x1UL) /*!< Enable                                                      */
  #define RADIO_INTENSET01_STROBETIMETRACKUPDATED_Disabled (0x0UL) /*!< Read: Disabled                                         */
  #define RADIO_INTENSET01_STROBETIMETRACKUPDATED_Enabled (0x1UL) /*!< Read: Enabled                                           */

/* DEMODCTRLCONDTRIGGERED0 @Bit 9 : Write '1' to enable interrupt for event DEMODCTRLCONDTRIGGERED0 */
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED0_Pos (9UL) /*!< Position of DEMODCTRLCONDTRIGGERED0 field.                   */
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED0_Msk (0x1UL << RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED0_Pos) /*!< Bit mask of
                                                                            DEMODCTRLCONDTRIGGERED0 field.*/                      
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED0_Min (0x0UL) /*!< Min enumerator value of DEMODCTRLCONDTRIGGERED0 field.     */
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED0_Max (0x1UL) /*!< Max enumerator value of DEMODCTRLCONDTRIGGERED0 field.     */
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED0_Set (0x1UL) /*!< Enable                                                     */
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED0_Disabled (0x0UL) /*!< Read: Disabled                                        */
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED0_Enabled (0x1UL) /*!< Read: Enabled                                          */

/* DEMODCTRLCONDTRIGGERED1 @Bit 10 : Write '1' to enable interrupt for event DEMODCTRLCONDTRIGGERED1 */
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED1_Pos (10UL) /*!< Position of DEMODCTRLCONDTRIGGERED1 field.                  */
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED1_Msk (0x1UL << RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED1_Pos) /*!< Bit mask of
                                                                            DEMODCTRLCONDTRIGGERED1 field.*/                      
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED1_Min (0x0UL) /*!< Min enumerator value of DEMODCTRLCONDTRIGGERED1 field.     */
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED1_Max (0x1UL) /*!< Max enumerator value of DEMODCTRLCONDTRIGGERED1 field.     */
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED1_Set (0x1UL) /*!< Enable                                                     */
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED1_Disabled (0x0UL) /*!< Read: Disabled                                        */
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED1_Enabled (0x1UL) /*!< Read: Enabled                                          */

/* DEMODCTRLCONDTRIGGERED2 @Bit 11 : Write '1' to enable interrupt for event DEMODCTRLCONDTRIGGERED2 */
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED2_Pos (11UL) /*!< Position of DEMODCTRLCONDTRIGGERED2 field.                  */
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED2_Msk (0x1UL << RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED2_Pos) /*!< Bit mask of
                                                                            DEMODCTRLCONDTRIGGERED2 field.*/                      
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED2_Min (0x0UL) /*!< Min enumerator value of DEMODCTRLCONDTRIGGERED2 field.     */
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED2_Max (0x1UL) /*!< Max enumerator value of DEMODCTRLCONDTRIGGERED2 field.     */
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED2_Set (0x1UL) /*!< Enable                                                     */
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED2_Disabled (0x0UL) /*!< Read: Disabled                                        */
  #define RADIO_INTENSET01_DEMODCTRLCONDTRIGGERED2_Enabled (0x1UL) /*!< Read: Enabled                                          */

/* INTERCEPTEDTASK @Bit 12 : Write '1' to enable interrupt for event INTERCEPTEDTASK */
  #define RADIO_INTENSET01_INTERCEPTEDTASK_Pos (12UL) /*!< Position of INTERCEPTEDTASK field.                                  */
  #define RADIO_INTENSET01_INTERCEPTEDTASK_Msk (0x1UL << RADIO_INTENSET01_INTERCEPTEDTASK_Pos) /*!< Bit mask of INTERCEPTEDTASK
                                                                            field.*/                                              
  #define RADIO_INTENSET01_INTERCEPTEDTASK_Min (0x0UL) /*!< Min enumerator value of INTERCEPTEDTASK field.                     */
  #define RADIO_INTENSET01_INTERCEPTEDTASK_Max (0x1UL) /*!< Max enumerator value of INTERCEPTEDTASK field.                     */
  #define RADIO_INTENSET01_INTERCEPTEDTASK_Set (0x1UL) /*!< Enable                                                             */
  #define RADIO_INTENSET01_INTERCEPTEDTASK_Disabled (0x0UL) /*!< Read: Disabled                                                */
  #define RADIO_INTENSET01_INTERCEPTEDTASK_Enabled (0x1UL) /*!< Read: Enabled                                                  */

/* INTERCEPTEDEVENT @Bit 13 : Write '1' to enable interrupt for event INTERCEPTEDEVENT */
  #define RADIO_INTENSET01_INTERCEPTEDEVENT_Pos (13UL) /*!< Position of INTERCEPTEDEVENT field.                                */
  #define RADIO_INTENSET01_INTERCEPTEDEVENT_Msk (0x1UL << RADIO_INTENSET01_INTERCEPTEDEVENT_Pos) /*!< Bit mask of
                                                                            INTERCEPTEDEVENT field.*/                             
  #define RADIO_INTENSET01_INTERCEPTEDEVENT_Min (0x0UL) /*!< Min enumerator value of INTERCEPTEDEVENT field.                   */
  #define RADIO_INTENSET01_INTERCEPTEDEVENT_Max (0x1UL) /*!< Max enumerator value of INTERCEPTEDEVENT field.                   */
  #define RADIO_INTENSET01_INTERCEPTEDEVENT_Set (0x1UL) /*!< Enable                                                            */
  #define RADIO_INTENSET01_INTERCEPTEDEVENT_Disabled (0x0UL) /*!< Read: Disabled                                               */
  #define RADIO_INTENSET01_INTERCEPTEDEVENT_Enabled (0x1UL) /*!< Read: Enabled                                                 */

