adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TXADDRESS @Bit 14 : Write '1' to enable interrupt for event TXADDRESS */
  #define RADIO_INTENSET01_TXADDRESS_Pos (14UL)      /*!< Position of TXADDRESS field.                                         */
  #define RADIO_INTENSET01_TXADDRESS_Msk (0x1UL << RADIO_INTENSET01_TXADDRESS_Pos) /*!< Bit mask of TXADDRESS field.           */
  #define RADIO_INTENSET01_TXADDRESS_Min (0x0UL)     /*!< Min enumerator value of TXADDRESS field.                             */
  #define RADIO_INTENSET01_TXADDRESS_Max (0x1UL)     /*!< Max enumerator value of TXADDRESS field.                             */
  #define RADIO_INTENSET01_TXADDRESS_Set (0x1UL)     /*!< Enable                                                               */
  #define RADIO_INTENSET01_TXADDRESS_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENSET01_TXADDRESS_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* RXADDRESS @Bit 15 : Write '1' to enable interrupt for event RXADDRESS */
  #define RADIO_INTENSET01_RXADDRESS_Pos (15UL)      /*!< Position of RXADDRESS field.                                         */
  #define RADIO_INTENSET01_RXADDRESS_Msk (0x1UL << RADIO_INTENSET01_RXADDRESS_Pos) /*!< Bit mask of RXADDRESS field.           */
  #define RADIO_INTENSET01_RXADDRESS_Min (0x0UL)     /*!< Min enumerator value of RXADDRESS field.                             */
  #define RADIO_INTENSET01_RXADDRESS_Max (0x1UL)     /*!< Max enumerator value of RXADDRESS field.                             */
  #define RADIO_INTENSET01_RXADDRESS_Set (0x1UL)     /*!< Enable                                                               */
  #define RADIO_INTENSET01_RXADDRESS_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENSET01_RXADDRESS_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* ACQINJ0DMAEND @Bit 16 : Write '1' to enable interrupt for event ACQINJ0DMAEND */
  #define RADIO_INTENSET01_ACQINJ0DMAEND_Pos (16UL)  /*!< Position of ACQINJ0DMAEND field.                                     */
  #define RADIO_INTENSET01_ACQINJ0DMAEND_Msk (0x1UL << RADIO_INTENSET01_ACQINJ0DMAEND_Pos) /*!< Bit mask of ACQINJ0DMAEND
                                                                            field.*/                                              
  #define RADIO_INTENSET01_ACQINJ0DMAEND_Min (0x0UL) /*!< Min enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTENSET01_ACQINJ0DMAEND_Max (0x1UL) /*!< Max enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTENSET01_ACQINJ0DMAEND_Set (0x1UL) /*!< Enable                                                               */
  #define RADIO_INTENSET01_ACQINJ0DMAEND_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIO_INTENSET01_ACQINJ0DMAEND_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* ACQINJ1DMAEND @Bit 17 : Write '1' to enable interrupt for event ACQINJ1DMAEND */
  #define RADIO_INTENSET01_ACQINJ1DMAEND_Pos (17UL)  /*!< Position of ACQINJ1DMAEND field.                                     */
  #define RADIO_INTENSET01_ACQINJ1DMAEND_Msk (0x1UL << RADIO_INTENSET01_ACQINJ1DMAEND_Pos) /*!< Bit mask of ACQINJ1DMAEND
                                                                            field.*/                                              
  #define RADIO_INTENSET01_ACQINJ1DMAEND_Min (0x0UL) /*!< Min enumerator value of ACQINJ1DMAEND field.                         */
  #define RADIO_INTENSET01_ACQINJ1DMAEND_Max (0x1UL) /*!< Max enumerator value of ACQINJ1DMAEND field.                         */
  #define RADIO_INTENSET01_ACQINJ1DMAEND_Set (0x1UL) /*!< Enable                                                               */
  #define RADIO_INTENSET01_ACQINJ1DMAEND_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIO_INTENSET01_ACQINJ1DMAEND_Enabled (0x1UL) /*!< Read: Enabled                                                    */


/* RADIO_INTENCLR00: Disable interrupt */
  #define RADIO_INTENCLR00_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR00 register.                                  */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define RADIO_INTENCLR00_READY_Pos (0UL)           /*!< Position of READY field.                                             */
  #define RADIO_INTENCLR00_READY_Msk (0x1UL << RADIO_INTENCLR00_READY_Pos) /*!< Bit mask of READY field.                       */
  #define RADIO_INTENCLR00_READY_Min (0x0UL)         /*!< Min enumerator value of READY field.                                 */
  #define RADIO_INTENCLR00_READY_Max (0x1UL)         /*!< Max enumerator value of READY field.                                 */
  #define RADIO_INTENCLR00_READY_Clear (0x1UL)       /*!< Disable                                                              */
  #define RADIO_INTENCLR00_READY_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR00_READY_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* TXREADY @Bit 1 : Write '1' to disable interrupt for event TXREADY */
  #define RADIO_INTENCLR00_TXREADY_Pos (1UL)         /*!< Position of TXREADY field.                                           */
  #define RADIO_INTENCLR00_TXREADY_Msk (0x1UL << RADIO_INTENCLR00_TXREADY_Pos) /*!< Bit mask of TXREADY field.                 */
  #define RADIO_INTENCLR00_TXREADY_Min (0x0UL)       /*!< Min enumerator value of TXREADY field.                               */
  #define RADIO_INTENCLR00_TXREADY_Max (0x1UL)       /*!< Max enumerator value of TXREADY field.                               */
  #define RADIO_INTENCLR00_TXREADY_Clear (0x1UL)     /*!< Disable                                                              */
  #define RADIO_INTENCLR00_TXREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR00_TXREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

