adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DEMODCTRLCONDTRIGGERED2 @Bit 11 : Write '1' to disable interrupt for event DEMODCTRLCONDTRIGGERED2 */
  #define RADIO_INTENCLR01_DEMODCTRLCONDTRIGGERED2_Pos (11UL) /*!< Position of DEMODCTRLCONDTRIGGERED2 field.                  */
  #define RADIO_INTENCLR01_DEMODCTRLCONDTRIGGERED2_Msk (0x1UL << RADIO_INTENCLR01_DEMODCTRLCONDTRIGGERED2_Pos) /*!< Bit mask of
                                                                            DEMODCTRLCONDTRIGGERED2 field.*/                      
  #define RADIO_INTENCLR01_DEMODCTRLCONDTRIGGERED2_Min (0x0UL) /*!< Min enumerator value of DEMODCTRLCONDTRIGGERED2 field.     */
  #define RADIO_INTENCLR01_DEMODCTRLCONDTRIGGERED2_Max (0x1UL) /*!< Max enumerator value of DEMODCTRLCONDTRIGGERED2 field.     */
  #define RADIO_INTENCLR01_DEMODCTRLCONDTRIGGERED2_Clear (0x1UL) /*!< Disable                                                  */
  #define RADIO_INTENCLR01_DEMODCTRLCONDTRIGGERED2_Disabled (0x0UL) /*!< Read: Disabled                                        */
  #define RADIO_INTENCLR01_DEMODCTRLCONDTRIGGERED2_Enabled (0x1UL) /*!< Read: Enabled                                          */

/* INTERCEPTEDTASK @Bit 12 : Write '1' to disable interrupt for event INTERCEPTEDTASK */
  #define RADIO_INTENCLR01_INTERCEPTEDTASK_Pos (12UL) /*!< Position of INTERCEPTEDTASK field.                                  */
  #define RADIO_INTENCLR01_INTERCEPTEDTASK_Msk (0x1UL << RADIO_INTENCLR01_INTERCEPTEDTASK_Pos) /*!< Bit mask of INTERCEPTEDTASK
                                                                            field.*/                                              
  #define RADIO_INTENCLR01_INTERCEPTEDTASK_Min (0x0UL) /*!< Min enumerator value of INTERCEPTEDTASK field.                     */
  #define RADIO_INTENCLR01_INTERCEPTEDTASK_Max (0x1UL) /*!< Max enumerator value of INTERCEPTEDTASK field.                     */
  #define RADIO_INTENCLR01_INTERCEPTEDTASK_Clear (0x1UL) /*!< Disable                                                          */
  #define RADIO_INTENCLR01_INTERCEPTEDTASK_Disabled (0x0UL) /*!< Read: Disabled                                                */
  #define RADIO_INTENCLR01_INTERCEPTEDTASK_Enabled (0x1UL) /*!< Read: Enabled                                                  */

/* INTERCEPTEDEVENT @Bit 13 : Write '1' to disable interrupt for event INTERCEPTEDEVENT */
  #define RADIO_INTENCLR01_INTERCEPTEDEVENT_Pos (13UL) /*!< Position of INTERCEPTEDEVENT field.                                */
  #define RADIO_INTENCLR01_INTERCEPTEDEVENT_Msk (0x1UL << RADIO_INTENCLR01_INTERCEPTEDEVENT_Pos) /*!< Bit mask of
                                                                            INTERCEPTEDEVENT field.*/                             
  #define RADIO_INTENCLR01_INTERCEPTEDEVENT_Min (0x0UL) /*!< Min enumerator value of INTERCEPTEDEVENT field.                   */
  #define RADIO_INTENCLR01_INTERCEPTEDEVENT_Max (0x1UL) /*!< Max enumerator value of INTERCEPTEDEVENT field.                   */
  #define RADIO_INTENCLR01_INTERCEPTEDEVENT_Clear (0x1UL) /*!< Disable                                                         */
  #define RADIO_INTENCLR01_INTERCEPTEDEVENT_Disabled (0x0UL) /*!< Read: Disabled                                               */
  #define RADIO_INTENCLR01_INTERCEPTEDEVENT_Enabled (0x1UL) /*!< Read: Enabled                                                 */

/* TXADDRESS @Bit 14 : Write '1' to disable interrupt for event TXADDRESS */
  #define RADIO_INTENCLR01_TXADDRESS_Pos (14UL)      /*!< Position of TXADDRESS field.                                         */
  #define RADIO_INTENCLR01_TXADDRESS_Msk (0x1UL << RADIO_INTENCLR01_TXADDRESS_Pos) /*!< Bit mask of TXADDRESS field.           */
  #define RADIO_INTENCLR01_TXADDRESS_Min (0x0UL)     /*!< Min enumerator value of TXADDRESS field.                             */
  #define RADIO_INTENCLR01_TXADDRESS_Max (0x1UL)     /*!< Max enumerator value of TXADDRESS field.                             */
  #define RADIO_INTENCLR01_TXADDRESS_Clear (0x1UL)   /*!< Disable                                                              */
  #define RADIO_INTENCLR01_TXADDRESS_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENCLR01_TXADDRESS_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* RXADDRESS @Bit 15 : Write '1' to disable interrupt for event RXADDRESS */
  #define RADIO_INTENCLR01_RXADDRESS_Pos (15UL)      /*!< Position of RXADDRESS field.                                         */
  #define RADIO_INTENCLR01_RXADDRESS_Msk (0x1UL << RADIO_INTENCLR01_RXADDRESS_Pos) /*!< Bit mask of RXADDRESS field.           */
  #define RADIO_INTENCLR01_RXADDRESS_Min (0x0UL)     /*!< Min enumerator value of RXADDRESS field.                             */
  #define RADIO_INTENCLR01_RXADDRESS_Max (0x1UL)     /*!< Max enumerator value of RXADDRESS field.                             */
  #define RADIO_INTENCLR01_RXADDRESS_Clear (0x1UL)   /*!< Disable                                                              */
  #define RADIO_INTENCLR01_RXADDRESS_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENCLR01_RXADDRESS_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* ACQINJ0DMAEND @Bit 16 : Write '1' to disable interrupt for event ACQINJ0DMAEND */
  #define RADIO_INTENCLR01_ACQINJ0DMAEND_Pos (16UL)  /*!< Position of ACQINJ0DMAEND field.                                     */
  #define RADIO_INTENCLR01_ACQINJ0DMAEND_Msk (0x1UL << RADIO_INTENCLR01_ACQINJ0DMAEND_Pos) /*!< Bit mask of ACQINJ0DMAEND
                                                                            field.*/                                              
  #define RADIO_INTENCLR01_ACQINJ0DMAEND_Min (0x0UL) /*!< Min enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTENCLR01_ACQINJ0DMAEND_Max (0x1UL) /*!< Max enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTENCLR01_ACQINJ0DMAEND_Clear (0x1UL) /*!< Disable                                                            */
  #define RADIO_INTENCLR01_ACQINJ0DMAEND_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIO_INTENCLR01_ACQINJ0DMAEND_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* ACQINJ1DMAEND @Bit 17 : Write '1' to disable interrupt for event ACQINJ1DMAEND */
  #define RADIO_INTENCLR01_ACQINJ1DMAEND_Pos (17UL)  /*!< Position of ACQINJ1DMAEND field.                                     */
  #define RADIO_INTENCLR01_ACQINJ1DMAEND_Msk (0x1UL << RADIO_INTENCLR01_ACQINJ1DMAEND_Pos) /*!< Bit mask of ACQINJ1DMAEND
                                                                            field.*/                                              
  #define RADIO_INTENCLR01_ACQINJ1DMAEND_Min (0x0UL) /*!< Min enumerator value of ACQINJ1DMAEND field.                         */
  #define RADIO_INTENCLR01_ACQINJ1DMAEND_Max (0x1UL) /*!< Max enumerator value of ACQINJ1DMAEND field.                         */
  #define RADIO_INTENCLR01_ACQINJ1DMAEND_Clear (0x1UL) /*!< Disable                                                            */
  #define RADIO_INTENCLR01_ACQINJ1DMAEND_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIO_INTENCLR01_ACQINJ1DMAEND_Enabled (0x1UL) /*!< Read: Enabled                                                    */


/* RADIO_INTPEND00: Pending interrupts */
  #define RADIO_INTPEND00_ResetValue (0x00000000UL)  /*!< Reset value of INTPEND00 register.                                   */

/* READY @Bit 0 : Read pending status of interrupt for event READY */
  #define RADIO_INTPEND00_READY_Pos (0UL)            /*!< Position of READY field.                                             */
  #define RADIO_INTPEND00_READY_Msk (0x1UL << RADIO_INTPEND00_READY_Pos) /*!< Bit mask of READY field.                         */
  #define RADIO_INTPEND00_READY_Min (0x0UL)          /*!< Min enumerator value of READY field.                                 */
  #define RADIO_INTPEND00_READY_Max (0x1UL)          /*!< Max enumerator value of READY field.                                 */
  #define RADIO_INTPEND00_READY_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND00_READY_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* TXREADY @Bit 1 : Read pending status of interrupt for event TXREADY */
  #define RADIO_INTPEND00_TXREADY_Pos (1UL)          /*!< Position of TXREADY field.                                           */
  #define RADIO_INTPEND00_TXREADY_Msk (0x1UL << RADIO_INTPEND00_TXREADY_Pos) /*!< Bit mask of TXREADY field.                   */
  #define RADIO_INTPEND00_TXREADY_Min (0x0UL)        /*!< Min enumerator value of TXREADY field.                               */
  #define RADIO_INTPEND00_TXREADY_Max (0x1UL)        /*!< Max enumerator value of TXREADY field.                               */
  #define RADIO_INTPEND00_TXREADY_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND00_TXREADY_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* RXREADY @Bit 2 : Read pending status of interrupt for event RXREADY */
  #define RADIO_INTPEND00_RXREADY_Pos (2UL)          /*!< Position of RXREADY field.                                           */
  #define RADIO_INTPEND00_RXREADY_Msk (0x1UL << RADIO_INTPEND00_RXREADY_Pos) /*!< Bit mask of RXREADY field.                   */
  #define RADIO_INTPEND00_RXREADY_Min (0x0UL)        /*!< Min enumerator value of RXREADY field.                               */
  #define RADIO_INTPEND00_RXREADY_Max (0x1UL)        /*!< Max enumerator value of RXREADY field.                               */
  #define RADIO_INTPEND00_RXREADY_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND00_RXREADY_Pending (0x1UL)    /*!< Read: Pending                                                        */

