adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RXDIGEN @Bit 4 : Read pending status of interrupt for event RXDIGEN */
  #define RADIO_INTPEND01_RXDIGEN_Pos (4UL)          /*!< Position of RXDIGEN field.                                           */
  #define RADIO_INTPEND01_RXDIGEN_Msk (0x1UL << RADIO_INTPEND01_RXDIGEN_Pos) /*!< Bit mask of RXDIGEN field.                   */
  #define RADIO_INTPEND01_RXDIGEN_Min (0x0UL)        /*!< Min enumerator value of RXDIGEN field.                               */
  #define RADIO_INTPEND01_RXDIGEN_Max (0x1UL)        /*!< Max enumerator value of RXDIGEN field.                               */
  #define RADIO_INTPEND01_RXDIGEN_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND01_RXDIGEN_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* RAWDETECT @Bit 5 : Read pending status of interrupt for event RAWDETECT */
  #define RADIO_INTPEND01_RAWDETECT_Pos (5UL)        /*!< Position of RAWDETECT field.                                         */
  #define RADIO_INTPEND01_RAWDETECT_Msk (0x1UL << RADIO_INTPEND01_RAWDETECT_Pos) /*!< Bit mask of RAWDETECT field.             */
  #define RADIO_INTPEND01_RAWDETECT_Min (0x0UL)      /*!< Min enumerator value of RAWDETECT field.                             */
  #define RADIO_INTPEND01_RAWDETECT_Max (0x1UL)      /*!< Max enumerator value of RAWDETECT field.                             */
  #define RADIO_INTPEND01_RAWDETECT_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define RADIO_INTPEND01_RAWDETECT_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* DETECTFIFOFULL @Bit 6 : Read pending status of interrupt for event DETECTFIFOFULL */
  #define RADIO_INTPEND01_DETECTFIFOFULL_Pos (6UL)   /*!< Position of DETECTFIFOFULL field.                                    */
  #define RADIO_INTPEND01_DETECTFIFOFULL_Msk (0x1UL << RADIO_INTPEND01_DETECTFIFOFULL_Pos) /*!< Bit mask of DETECTFIFOFULL
                                                                            field.*/                                              
  #define RADIO_INTPEND01_DETECTFIFOFULL_Min (0x0UL) /*!< Min enumerator value of DETECTFIFOFULL field.                        */
  #define RADIO_INTPEND01_DETECTFIFOFULL_Max (0x1UL) /*!< Max enumerator value of DETECTFIFOFULL field.                        */
  #define RADIO_INTPEND01_DETECTFIFOFULL_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define RADIO_INTPEND01_DETECTFIFOFULL_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TIMERWRAPS @Bit 7 : Read pending status of interrupt for event TIMERWRAPS */
  #define RADIO_INTPEND01_TIMERWRAPS_Pos (7UL)       /*!< Position of TIMERWRAPS field.                                        */
  #define RADIO_INTPEND01_TIMERWRAPS_Msk (0x1UL << RADIO_INTPEND01_TIMERWRAPS_Pos) /*!< Bit mask of TIMERWRAPS field.          */
  #define RADIO_INTPEND01_TIMERWRAPS_Min (0x0UL)     /*!< Min enumerator value of TIMERWRAPS field.                            */
  #define RADIO_INTPEND01_TIMERWRAPS_Max (0x1UL)     /*!< Max enumerator value of TIMERWRAPS field.                            */
  #define RADIO_INTPEND01_TIMERWRAPS_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define RADIO_INTPEND01_TIMERWRAPS_Pending (0x1UL) /*!< Read: Pending                                                        */

/* STROBETIMETRACKUPDATED @Bit 8 : Read pending status of interrupt for event STROBETIMETRACKUPDATED */
  #define RADIO_INTPEND01_STROBETIMETRACKUPDATED_Pos (8UL) /*!< Position of STROBETIMETRACKUPDATED field.                      */
  #define RADIO_INTPEND01_STROBETIMETRACKUPDATED_Msk (0x1UL << RADIO_INTPEND01_STROBETIMETRACKUPDATED_Pos) /*!< Bit mask of
                                                                            STROBETIMETRACKUPDATED field.*/                       
  #define RADIO_INTPEND01_STROBETIMETRACKUPDATED_Min (0x0UL) /*!< Min enumerator value of STROBETIMETRACKUPDATED field.        */
  #define RADIO_INTPEND01_STROBETIMETRACKUPDATED_Max (0x1UL) /*!< Max enumerator value of STROBETIMETRACKUPDATED field.        */
  #define RADIO_INTPEND01_STROBETIMETRACKUPDATED_NotPending (0x0UL) /*!< Read: Not pending                                     */
  #define RADIO_INTPEND01_STROBETIMETRACKUPDATED_Pending (0x1UL) /*!< Read: Pending                                            */

/* DEMODCTRLCONDTRIGGERED0 @Bit 9 : Read pending status of interrupt for event DEMODCTRLCONDTRIGGERED0 */
  #define RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED0_Pos (9UL) /*!< Position of DEMODCTRLCONDTRIGGERED0 field.                    */
  #define RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED0_Msk (0x1UL << RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED0_Pos) /*!< Bit mask of
                                                                            DEMODCTRLCONDTRIGGERED0 field.*/                      
  #define RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED0_Min (0x0UL) /*!< Min enumerator value of DEMODCTRLCONDTRIGGERED0 field.      */
  #define RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED0_Max (0x1UL) /*!< Max enumerator value of DEMODCTRLCONDTRIGGERED0 field.      */
  #define RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED0_NotPending (0x0UL) /*!< Read: Not pending                                    */
  #define RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED0_Pending (0x1UL) /*!< Read: Pending                                           */

/* DEMODCTRLCONDTRIGGERED1 @Bit 10 : Read pending status of interrupt for event DEMODCTRLCONDTRIGGERED1 */
  #define RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED1_Pos (10UL) /*!< Position of DEMODCTRLCONDTRIGGERED1 field.                   */
  #define RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED1_Msk (0x1UL << RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED1_Pos) /*!< Bit mask of
                                                                            DEMODCTRLCONDTRIGGERED1 field.*/                      
  #define RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED1_Min (0x0UL) /*!< Min enumerator value of DEMODCTRLCONDTRIGGERED1 field.      */
  #define RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED1_Max (0x1UL) /*!< Max enumerator value of DEMODCTRLCONDTRIGGERED1 field.      */
  #define RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED1_NotPending (0x0UL) /*!< Read: Not pending                                    */
  #define RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED1_Pending (0x1UL) /*!< Read: Pending                                           */

/* DEMODCTRLCONDTRIGGERED2 @Bit 11 : Read pending status of interrupt for event DEMODCTRLCONDTRIGGERED2 */
  #define RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED2_Pos (11UL) /*!< Position of DEMODCTRLCONDTRIGGERED2 field.                   */
  #define RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED2_Msk (0x1UL << RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED2_Pos) /*!< Bit mask of
                                                                            DEMODCTRLCONDTRIGGERED2 field.*/                      
  #define RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED2_Min (0x0UL) /*!< Min enumerator value of DEMODCTRLCONDTRIGGERED2 field.      */
  #define RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED2_Max (0x1UL) /*!< Max enumerator value of DEMODCTRLCONDTRIGGERED2 field.      */
  #define RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED2_NotPending (0x0UL) /*!< Read: Not pending                                    */
  #define RADIO_INTPEND01_DEMODCTRLCONDTRIGGERED2_Pending (0x1UL) /*!< Read: Pending                                           */

/* INTERCEPTEDTASK @Bit 12 : Read pending status of interrupt for event INTERCEPTEDTASK */
  #define RADIO_INTPEND01_INTERCEPTEDTASK_Pos (12UL) /*!< Position of INTERCEPTEDTASK field.                                   */
  #define RADIO_INTPEND01_INTERCEPTEDTASK_Msk (0x1UL << RADIO_INTPEND01_INTERCEPTEDTASK_Pos) /*!< Bit mask of INTERCEPTEDTASK
                                                                            field.*/                                              
  #define RADIO_INTPEND01_INTERCEPTEDTASK_Min (0x0UL) /*!< Min enumerator value of INTERCEPTEDTASK field.                      */
  #define RADIO_INTPEND01_INTERCEPTEDTASK_Max (0x1UL) /*!< Max enumerator value of INTERCEPTEDTASK field.                      */
  #define RADIO_INTPEND01_INTERCEPTEDTASK_NotPending (0x0UL) /*!< Read: Not pending                                            */
  #define RADIO_INTPEND01_INTERCEPTEDTASK_Pending (0x1UL) /*!< Read: Pending                                                   */

/* INTERCEPTEDEVENT @Bit 13 : Read pending status of interrupt for event INTERCEPTEDEVENT */
  #define RADIO_INTPEND01_INTERCEPTEDEVENT_Pos (13UL) /*!< Position of INTERCEPTEDEVENT field.                                 */
  #define RADIO_INTPEND01_INTERCEPTEDEVENT_Msk (0x1UL << RADIO_INTPEND01_INTERCEPTEDEVENT_Pos) /*!< Bit mask of INTERCEPTEDEVENT
                                                                            field.*/                                              
  #define RADIO_INTPEND01_INTERCEPTEDEVENT_Min (0x0UL) /*!< Min enumerator value of INTERCEPTEDEVENT field.                    */
  #define RADIO_INTPEND01_INTERCEPTEDEVENT_Max (0x1UL) /*!< Max enumerator value of INTERCEPTEDEVENT field.                    */
  #define RADIO_INTPEND01_INTERCEPTEDEVENT_NotPending (0x0UL) /*!< Read: Not pending                                           */
  #define RADIO_INTPEND01_INTERCEPTEDEVENT_Pending (0x1UL) /*!< Read: Pending                                                  */

/* TXADDRESS @Bit 14 : Read pending status of interrupt for event TXADDRESS */
  #define RADIO_INTPEND01_TXADDRESS_Pos (14UL)       /*!< Position of TXADDRESS field.                                         */
  #define RADIO_INTPEND01_TXADDRESS_Msk (0x1UL << RADIO_INTPEND01_TXADDRESS_Pos) /*!< Bit mask of TXADDRESS field.             */
  #define RADIO_INTPEND01_TXADDRESS_Min (0x0UL)      /*!< Min enumerator value of TXADDRESS field.                             */
  #define RADIO_INTPEND01_TXADDRESS_Max (0x1UL)      /*!< Max enumerator value of TXADDRESS field.                             */
  #define RADIO_INTPEND01_TXADDRESS_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define RADIO_INTPEND01_TXADDRESS_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* RXADDRESS @Bit 15 : Read pending status of interrupt for event RXADDRESS */
  #define RADIO_INTPEND01_RXADDRESS_Pos (15UL)       /*!< Position of RXADDRESS field.                                         */
  #define RADIO_INTPEND01_RXADDRESS_Msk (0x1UL << RADIO_INTPEND01_RXADDRESS_Pos) /*!< Bit mask of RXADDRESS field.             */
  #define RADIO_INTPEND01_RXADDRESS_Min (0x0UL)      /*!< Min enumerator value of RXADDRESS field.                             */
  #define RADIO_INTPEND01_RXADDRESS_Max (0x1UL)      /*!< Max enumerator value of RXADDRESS field.                             */
  #define RADIO_INTPEND01_RXADDRESS_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define RADIO_INTPEND01_RXADDRESS_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* ACQINJ0DMAEND @Bit 16 : Read pending status of interrupt for event ACQINJ0DMAEND */
  #define RADIO_INTPEND01_ACQINJ0DMAEND_Pos (16UL)   /*!< Position of ACQINJ0DMAEND field.                                     */
  #define RADIO_INTPEND01_ACQINJ0DMAEND_Msk (0x1UL << RADIO_INTPEND01_ACQINJ0DMAEND_Pos) /*!< Bit mask of ACQINJ0DMAEND field. */
  #define RADIO_INTPEND01_ACQINJ0DMAEND_Min (0x0UL)  /*!< Min enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTPEND01_ACQINJ0DMAEND_Max (0x1UL)  /*!< Max enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTPEND01_ACQINJ0DMAEND_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RADIO_INTPEND01_ACQINJ0DMAEND_Pending (0x1UL) /*!< Read: Pending                                                     */

/* ACQINJ1DMAEND @Bit 17 : Read pending status of interrupt for event ACQINJ1DMAEND */
  #define RADIO_INTPEND01_ACQINJ1DMAEND_Pos (17UL)   /*!< Position of ACQINJ1DMAEND field.                                     */
  #define RADIO_INTPEND01_ACQINJ1DMAEND_Msk (0x1UL << RADIO_INTPEND01_ACQINJ1DMAEND_Pos) /*!< Bit mask of ACQINJ1DMAEND field. */
  #define RADIO_INTPEND01_ACQINJ1DMAEND_Min (0x0UL)  /*!< Min enumerator value of ACQINJ1DMAEND field.                         */
  #define RADIO_INTPEND01_ACQINJ1DMAEND_Max (0x1UL)  /*!< Max enumerator value of ACQINJ1DMAEND field.                         */
  #define RADIO_INTPEND01_ACQINJ1DMAEND_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RADIO_INTPEND01_ACQINJ1DMAEND_Pending (0x1UL) /*!< Read: Pending                                                     */


/* RADIO_INTEN10: Enable or disable interrupt */
  #define RADIO_INTEN10_ResetValue (0x00000000UL)    /*!< Reset value of INTEN10 register.                                     */

