adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define RADIO_INTEN10_READY_Pos (0UL)              /*!< Position of READY field.                                             */
  #define RADIO_INTEN10_READY_Msk (0x1UL << RADIO_INTEN10_READY_Pos) /*!< Bit mask of READY field.                             */
  #define RADIO_INTEN10_READY_Min (0x0UL)            /*!< Min enumerator value of READY field.                                 */
  #define RADIO_INTEN10_READY_Max (0x1UL)            /*!< Max enumerator value of READY field.                                 */
  #define RADIO_INTEN10_READY_Disabled (0x0UL)       /*!< Disable                                                              */
  #define RADIO_INTEN10_READY_Enabled (0x1UL)        /*!< Enable                                                               */

/* TXREADY @Bit 1 : Enable or disable interrupt for event TXREADY */
  #define RADIO_INTEN10_TXREADY_Pos (1UL)            /*!< Position of TXREADY field.                                           */
  #define RADIO_INTEN10_TXREADY_Msk (0x1UL << RADIO_INTEN10_TXREADY_Pos) /*!< Bit mask of TXREADY field.                       */
  #define RADIO_INTEN10_TXREADY_Min (0x0UL)          /*!< Min enumerator value of TXREADY field.                               */
  #define RADIO_INTEN10_TXREADY_Max (0x1UL)          /*!< Max enumerator value of TXREADY field.                               */
  #define RADIO_INTEN10_TXREADY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN10_TXREADY_Enabled (0x1UL)      /*!< Enable                                                               */

/* RXREADY @Bit 2 : Enable or disable interrupt for event RXREADY */
  #define RADIO_INTEN10_RXREADY_Pos (2UL)            /*!< Position of RXREADY field.                                           */
  #define RADIO_INTEN10_RXREADY_Msk (0x1UL << RADIO_INTEN10_RXREADY_Pos) /*!< Bit mask of RXREADY field.                       */
  #define RADIO_INTEN10_RXREADY_Min (0x0UL)          /*!< Min enumerator value of RXREADY field.                               */
  #define RADIO_INTEN10_RXREADY_Max (0x1UL)          /*!< Max enumerator value of RXREADY field.                               */
  #define RADIO_INTEN10_RXREADY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN10_RXREADY_Enabled (0x1UL)      /*!< Enable                                                               */

/* ADDRESS @Bit 3 : Enable or disable interrupt for event ADDRESS */
  #define RADIO_INTEN10_ADDRESS_Pos (3UL)            /*!< Position of ADDRESS field.                                           */
  #define RADIO_INTEN10_ADDRESS_Msk (0x1UL << RADIO_INTEN10_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.                       */
  #define RADIO_INTEN10_ADDRESS_Min (0x0UL)          /*!< Min enumerator value of ADDRESS field.                               */
  #define RADIO_INTEN10_ADDRESS_Max (0x1UL)          /*!< Max enumerator value of ADDRESS field.                               */
  #define RADIO_INTEN10_ADDRESS_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN10_ADDRESS_Enabled (0x1UL)      /*!< Enable                                                               */

/* FRAMESTART @Bit 4 : Enable or disable interrupt for event FRAMESTART */
  #define RADIO_INTEN10_FRAMESTART_Pos (4UL)         /*!< Position of FRAMESTART field.                                        */
  #define RADIO_INTEN10_FRAMESTART_Msk (0x1UL << RADIO_INTEN10_FRAMESTART_Pos) /*!< Bit mask of FRAMESTART field.              */
  #define RADIO_INTEN10_FRAMESTART_Min (0x0UL)       /*!< Min enumerator value of FRAMESTART field.                            */
  #define RADIO_INTEN10_FRAMESTART_Max (0x1UL)       /*!< Max enumerator value of FRAMESTART field.                            */
  #define RADIO_INTEN10_FRAMESTART_Disabled (0x0UL)  /*!< Disable                                                              */
  #define RADIO_INTEN10_FRAMESTART_Enabled (0x1UL)   /*!< Enable                                                               */

/* PAYLOAD @Bit 5 : Enable or disable interrupt for event PAYLOAD */
  #define RADIO_INTEN10_PAYLOAD_Pos (5UL)            /*!< Position of PAYLOAD field.                                           */
  #define RADIO_INTEN10_PAYLOAD_Msk (0x1UL << RADIO_INTEN10_PAYLOAD_Pos) /*!< Bit mask of PAYLOAD field.                       */
  #define RADIO_INTEN10_PAYLOAD_Min (0x0UL)          /*!< Min enumerator value of PAYLOAD field.                               */
  #define RADIO_INTEN10_PAYLOAD_Max (0x1UL)          /*!< Max enumerator value of PAYLOAD field.                               */
  #define RADIO_INTEN10_PAYLOAD_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN10_PAYLOAD_Enabled (0x1UL)      /*!< Enable                                                               */

/* END @Bit 6 : Enable or disable interrupt for event END */
  #define RADIO_INTEN10_END_Pos (6UL)                /*!< Position of END field.                                               */
  #define RADIO_INTEN10_END_Msk (0x1UL << RADIO_INTEN10_END_Pos) /*!< Bit mask of END field.                                   */
  #define RADIO_INTEN10_END_Min (0x0UL)              /*!< Min enumerator value of END field.                                   */
  #define RADIO_INTEN10_END_Max (0x1UL)              /*!< Max enumerator value of END field.                                   */
  #define RADIO_INTEN10_END_Disabled (0x0UL)         /*!< Disable                                                              */
  #define RADIO_INTEN10_END_Enabled (0x1UL)          /*!< Enable                                                               */

/* PHYEND @Bit 7 : Enable or disable interrupt for event PHYEND */
  #define RADIO_INTEN10_PHYEND_Pos (7UL)             /*!< Position of PHYEND field.                                            */
  #define RADIO_INTEN10_PHYEND_Msk (0x1UL << RADIO_INTEN10_PHYEND_Pos) /*!< Bit mask of PHYEND field.                          */
  #define RADIO_INTEN10_PHYEND_Min (0x0UL)           /*!< Min enumerator value of PHYEND field.                                */
  #define RADIO_INTEN10_PHYEND_Max (0x1UL)           /*!< Max enumerator value of PHYEND field.                                */
  #define RADIO_INTEN10_PHYEND_Disabled (0x0UL)      /*!< Disable                                                              */
  #define RADIO_INTEN10_PHYEND_Enabled (0x1UL)       /*!< Enable                                                               */

/* DISABLED @Bit 8 : Enable or disable interrupt for event DISABLED */
  #define RADIO_INTEN10_DISABLED_Pos (8UL)           /*!< Position of DISABLED field.                                          */
  #define RADIO_INTEN10_DISABLED_Msk (0x1UL << RADIO_INTEN10_DISABLED_Pos) /*!< Bit mask of DISABLED field.                    */
  #define RADIO_INTEN10_DISABLED_Min (0x0UL)         /*!< Min enumerator value of DISABLED field.                              */
  #define RADIO_INTEN10_DISABLED_Max (0x1UL)         /*!< Max enumerator value of DISABLED field.                              */
  #define RADIO_INTEN10_DISABLED_Disabled (0x0UL)    /*!< Disable                                                              */
  #define RADIO_INTEN10_DISABLED_Enabled (0x1UL)     /*!< Enable                                                               */

/* DEVMATCH @Bit 9 : Enable or disable interrupt for event DEVMATCH */
  #define RADIO_INTEN10_DEVMATCH_Pos (9UL)           /*!< Position of DEVMATCH field.                                          */
  #define RADIO_INTEN10_DEVMATCH_Msk (0x1UL << RADIO_INTEN10_DEVMATCH_Pos) /*!< Bit mask of DEVMATCH field.                    */
  #define RADIO_INTEN10_DEVMATCH_Min (0x0UL)         /*!< Min enumerator value of DEVMATCH field.                              */
  #define RADIO_INTEN10_DEVMATCH_Max (0x1UL)         /*!< Max enumerator value of DEVMATCH field.                              */
  #define RADIO_INTEN10_DEVMATCH_Disabled (0x0UL)    /*!< Disable                                                              */
  #define RADIO_INTEN10_DEVMATCH_Enabled (0x1UL)     /*!< Enable                                                               */

/* DEVMISS @Bit 10 : Enable or disable interrupt for event DEVMISS */
  #define RADIO_INTEN10_DEVMISS_Pos (10UL)           /*!< Position of DEVMISS field.                                           */
  #define RADIO_INTEN10_DEVMISS_Msk (0x1UL << RADIO_INTEN10_DEVMISS_Pos) /*!< Bit mask of DEVMISS field.                       */
  #define RADIO_INTEN10_DEVMISS_Min (0x0UL)          /*!< Min enumerator value of DEVMISS field.                               */
  #define RADIO_INTEN10_DEVMISS_Max (0x1UL)          /*!< Max enumerator value of DEVMISS field.                               */
  #define RADIO_INTEN10_DEVMISS_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN10_DEVMISS_Enabled (0x1UL)      /*!< Enable                                                               */

