adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CHNOUPDATED @Bit 31 : Enable or disable interrupt for event CHNOUPDATED */
  #define RADIO_INTEN10_CHNOUPDATED_Pos (31UL)       /*!< Position of CHNOUPDATED field.                                       */
  #define RADIO_INTEN10_CHNOUPDATED_Msk (0x1UL << RADIO_INTEN10_CHNOUPDATED_Pos) /*!< Bit mask of CHNOUPDATED field.           */
  #define RADIO_INTEN10_CHNOUPDATED_Min (0x0UL)      /*!< Min enumerator value of CHNOUPDATED field.                           */
  #define RADIO_INTEN10_CHNOUPDATED_Max (0x1UL)      /*!< Max enumerator value of CHNOUPDATED field.                           */
  #define RADIO_INTEN10_CHNOUPDATED_Disabled (0x0UL) /*!< Disable                                                              */
  #define RADIO_INTEN10_CHNOUPDATED_Enabled (0x1UL)  /*!< Enable                                                               */


/* RADIO_INTEN11: Enable or disable interrupt */
  #define RADIO_INTEN11_ResetValue (0x00000000UL)    /*!< Reset value of INTEN11 register.                                     */

/* DBCTIMEOUT @Bit 0 : Enable or disable interrupt for event DBCTIMEOUT */
  #define RADIO_INTEN11_DBCTIMEOUT_Pos (0UL)         /*!< Position of DBCTIMEOUT field.                                        */
  #define RADIO_INTEN11_DBCTIMEOUT_Msk (0x1UL << RADIO_INTEN11_DBCTIMEOUT_Pos) /*!< Bit mask of DBCTIMEOUT field.              */
  #define RADIO_INTEN11_DBCTIMEOUT_Min (0x0UL)       /*!< Min enumerator value of DBCTIMEOUT field.                            */
  #define RADIO_INTEN11_DBCTIMEOUT_Max (0x1UL)       /*!< Max enumerator value of DBCTIMEOUT field.                            */
  #define RADIO_INTEN11_DBCTIMEOUT_Disabled (0x0UL)  /*!< Disable                                                              */
  #define RADIO_INTEN11_DBCTIMEOUT_Enabled (0x1UL)   /*!< Enable                                                               */

/* TXTIMERMATCH @Bit 1 : Enable or disable interrupt for event TXTIMERMATCH */
  #define RADIO_INTEN11_TXTIMERMATCH_Pos (1UL)       /*!< Position of TXTIMERMATCH field.                                      */
  #define RADIO_INTEN11_TXTIMERMATCH_Msk (0x1UL << RADIO_INTEN11_TXTIMERMATCH_Pos) /*!< Bit mask of TXTIMERMATCH field.        */
  #define RADIO_INTEN11_TXTIMERMATCH_Min (0x0UL)     /*!< Min enumerator value of TXTIMERMATCH field.                          */
  #define RADIO_INTEN11_TXTIMERMATCH_Max (0x1UL)     /*!< Max enumerator value of TXTIMERMATCH field.                          */
  #define RADIO_INTEN11_TXTIMERMATCH_Disabled (0x0UL) /*!< Disable                                                             */
  #define RADIO_INTEN11_TXTIMERMATCH_Enabled (0x1UL) /*!< Enable                                                               */

/* RXTIMERMATCH @Bit 2 : Enable or disable interrupt for event RXTIMERMATCH */
  #define RADIO_INTEN11_RXTIMERMATCH_Pos (2UL)       /*!< Position of RXTIMERMATCH field.                                      */
  #define RADIO_INTEN11_RXTIMERMATCH_Msk (0x1UL << RADIO_INTEN11_RXTIMERMATCH_Pos) /*!< Bit mask of RXTIMERMATCH field.        */
  #define RADIO_INTEN11_RXTIMERMATCH_Min (0x0UL)     /*!< Min enumerator value of RXTIMERMATCH field.                          */
  #define RADIO_INTEN11_RXTIMERMATCH_Max (0x1UL)     /*!< Max enumerator value of RXTIMERMATCH field.                          */
  #define RADIO_INTEN11_RXTIMERMATCH_Disabled (0x0UL) /*!< Disable                                                             */
  #define RADIO_INTEN11_RXTIMERMATCH_Enabled (0x1UL) /*!< Enable                                                               */

/* BESPOKEACK @Bit 3 : Enable or disable interrupt for event BESPOKEACK */
  #define RADIO_INTEN11_BESPOKEACK_Pos (3UL)         /*!< Position of BESPOKEACK field.                                        */
  #define RADIO_INTEN11_BESPOKEACK_Msk (0x1UL << RADIO_INTEN11_BESPOKEACK_Pos) /*!< Bit mask of BESPOKEACK field.              */
  #define RADIO_INTEN11_BESPOKEACK_Min (0x0UL)       /*!< Min enumerator value of BESPOKEACK field.                            */
  #define RADIO_INTEN11_BESPOKEACK_Max (0x1UL)       /*!< Max enumerator value of BESPOKEACK field.                            */
  #define RADIO_INTEN11_BESPOKEACK_Disabled (0x0UL)  /*!< Disable                                                              */
  #define RADIO_INTEN11_BESPOKEACK_Enabled (0x1UL)   /*!< Enable                                                               */

/* RXDIGEN @Bit 4 : Enable or disable interrupt for event RXDIGEN */
  #define RADIO_INTEN11_RXDIGEN_Pos (4UL)            /*!< Position of RXDIGEN field.                                           */
  #define RADIO_INTEN11_RXDIGEN_Msk (0x1UL << RADIO_INTEN11_RXDIGEN_Pos) /*!< Bit mask of RXDIGEN field.                       */
  #define RADIO_INTEN11_RXDIGEN_Min (0x0UL)          /*!< Min enumerator value of RXDIGEN field.                               */
  #define RADIO_INTEN11_RXDIGEN_Max (0x1UL)          /*!< Max enumerator value of RXDIGEN field.                               */
  #define RADIO_INTEN11_RXDIGEN_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RADIO_INTEN11_RXDIGEN_Enabled (0x1UL)      /*!< Enable                                                               */

/* RAWDETECT @Bit 5 : Enable or disable interrupt for event RAWDETECT */
  #define RADIO_INTEN11_RAWDETECT_Pos (5UL)          /*!< Position of RAWDETECT field.                                         */
  #define RADIO_INTEN11_RAWDETECT_Msk (0x1UL << RADIO_INTEN11_RAWDETECT_Pos) /*!< Bit mask of RAWDETECT field.                 */
  #define RADIO_INTEN11_RAWDETECT_Min (0x0UL)        /*!< Min enumerator value of RAWDETECT field.                             */
  #define RADIO_INTEN11_RAWDETECT_Max (0x1UL)        /*!< Max enumerator value of RAWDETECT field.                             */
  #define RADIO_INTEN11_RAWDETECT_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIO_INTEN11_RAWDETECT_Enabled (0x1UL)    /*!< Enable                                                               */

/* DETECTFIFOFULL @Bit 6 : Enable or disable interrupt for event DETECTFIFOFULL */
  #define RADIO_INTEN11_DETECTFIFOFULL_Pos (6UL)     /*!< Position of DETECTFIFOFULL field.                                    */
  #define RADIO_INTEN11_DETECTFIFOFULL_Msk (0x1UL << RADIO_INTEN11_DETECTFIFOFULL_Pos) /*!< Bit mask of DETECTFIFOFULL field.  */
  #define RADIO_INTEN11_DETECTFIFOFULL_Min (0x0UL)   /*!< Min enumerator value of DETECTFIFOFULL field.                        */
  #define RADIO_INTEN11_DETECTFIFOFULL_Max (0x1UL)   /*!< Max enumerator value of DETECTFIFOFULL field.                        */
  #define RADIO_INTEN11_DETECTFIFOFULL_Disabled (0x0UL) /*!< Disable                                                           */
  #define RADIO_INTEN11_DETECTFIFOFULL_Enabled (0x1UL) /*!< Enable                                                             */

