adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CTEPRESENT @Bit 23 : Write '1' to disable interrupt for event CTEPRESENT */
  #define RADIO_INTENCLR10_CTEPRESENT_Pos (23UL)     /*!< Position of CTEPRESENT field.                                        */
  #define RADIO_INTENCLR10_CTEPRESENT_Msk (0x1UL << RADIO_INTENCLR10_CTEPRESENT_Pos) /*!< Bit mask of CTEPRESENT field.        */
  #define RADIO_INTENCLR10_CTEPRESENT_Min (0x0UL)    /*!< Min enumerator value of CTEPRESENT field.                            */
  #define RADIO_INTENCLR10_CTEPRESENT_Max (0x1UL)    /*!< Max enumerator value of CTEPRESENT field.                            */
  #define RADIO_INTENCLR10_CTEPRESENT_Clear (0x1UL)  /*!< Disable                                                              */
  #define RADIO_INTENCLR10_CTEPRESENT_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIO_INTENCLR10_CTEPRESENT_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* CTEWARNING @Bit 24 : Write '1' to disable interrupt for event CTEWARNING */
  #define RADIO_INTENCLR10_CTEWARNING_Pos (24UL)     /*!< Position of CTEWARNING field.                                        */
  #define RADIO_INTENCLR10_CTEWARNING_Msk (0x1UL << RADIO_INTENCLR10_CTEWARNING_Pos) /*!< Bit mask of CTEWARNING field.        */
  #define RADIO_INTENCLR10_CTEWARNING_Min (0x0UL)    /*!< Min enumerator value of CTEWARNING field.                            */
  #define RADIO_INTENCLR10_CTEWARNING_Max (0x1UL)    /*!< Max enumerator value of CTEWARNING field.                            */
  #define RADIO_INTENCLR10_CTEWARNING_Clear (0x1UL)  /*!< Disable                                                              */
  #define RADIO_INTENCLR10_CTEWARNING_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIO_INTENCLR10_CTEWARNING_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* DFEEND @Bit 25 : Write '1' to disable interrupt for event DFEEND */
  #define RADIO_INTENCLR10_DFEEND_Pos (25UL)         /*!< Position of DFEEND field.                                            */
  #define RADIO_INTENCLR10_DFEEND_Msk (0x1UL << RADIO_INTENCLR10_DFEEND_Pos) /*!< Bit mask of DFEEND field.                    */
  #define RADIO_INTENCLR10_DFEEND_Min (0x0UL)        /*!< Min enumerator value of DFEEND field.                                */
  #define RADIO_INTENCLR10_DFEEND_Max (0x1UL)        /*!< Max enumerator value of DFEEND field.                                */
  #define RADIO_INTENCLR10_DFEEND_Clear (0x1UL)      /*!< Disable                                                              */
  #define RADIO_INTENCLR10_DFEEND_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_DFEEND_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* MODEWRITTEN @Bit 26 : Write '1' to disable interrupt for event MODEWRITTEN */
  #define RADIO_INTENCLR10_MODEWRITTEN_Pos (26UL)    /*!< Position of MODEWRITTEN field.                                       */
  #define RADIO_INTENCLR10_MODEWRITTEN_Msk (0x1UL << RADIO_INTENCLR10_MODEWRITTEN_Pos) /*!< Bit mask of MODEWRITTEN field.     */
  #define RADIO_INTENCLR10_MODEWRITTEN_Min (0x0UL)   /*!< Min enumerator value of MODEWRITTEN field.                           */
  #define RADIO_INTENCLR10_MODEWRITTEN_Max (0x1UL)   /*!< Max enumerator value of MODEWRITTEN field.                           */
  #define RADIO_INTENCLR10_MODEWRITTEN_Clear (0x1UL) /*!< Disable                                                              */
  #define RADIO_INTENCLR10_MODEWRITTEN_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define RADIO_INTENCLR10_MODEWRITTEN_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* MODEREADY @Bit 27 : Write '1' to disable interrupt for event MODEREADY */
  #define RADIO_INTENCLR10_MODEREADY_Pos (27UL)      /*!< Position of MODEREADY field.                                         */
  #define RADIO_INTENCLR10_MODEREADY_Msk (0x1UL << RADIO_INTENCLR10_MODEREADY_Pos) /*!< Bit mask of MODEREADY field.           */
  #define RADIO_INTENCLR10_MODEREADY_Min (0x0UL)     /*!< Min enumerator value of MODEREADY field.                             */
  #define RADIO_INTENCLR10_MODEREADY_Max (0x1UL)     /*!< Max enumerator value of MODEREADY field.                             */
  #define RADIO_INTENCLR10_MODEREADY_Clear (0x1UL)   /*!< Disable                                                              */
  #define RADIO_INTENCLR10_MODEREADY_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENCLR10_MODEREADY_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* CTEEND @Bit 28 : Write '1' to disable interrupt for event CTEEND */
  #define RADIO_INTENCLR10_CTEEND_Pos (28UL)         /*!< Position of CTEEND field.                                            */
  #define RADIO_INTENCLR10_CTEEND_Msk (0x1UL << RADIO_INTENCLR10_CTEEND_Pos) /*!< Bit mask of CTEEND field.                    */
  #define RADIO_INTENCLR10_CTEEND_Min (0x0UL)        /*!< Min enumerator value of CTEEND field.                                */
  #define RADIO_INTENCLR10_CTEEND_Max (0x1UL)        /*!< Max enumerator value of CTEEND field.                                */
  #define RADIO_INTENCLR10_CTEEND_Clear (0x1UL)      /*!< Disable                                                              */
  #define RADIO_INTENCLR10_CTEEND_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_CTEEND_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* LBREADY @Bit 29 : Write '1' to disable interrupt for event LBREADY */
  #define RADIO_INTENCLR10_LBREADY_Pos (29UL)        /*!< Position of LBREADY field.                                           */
  #define RADIO_INTENCLR10_LBREADY_Msk (0x1UL << RADIO_INTENCLR10_LBREADY_Pos) /*!< Bit mask of LBREADY field.                 */
  #define RADIO_INTENCLR10_LBREADY_Min (0x0UL)       /*!< Min enumerator value of LBREADY field.                               */
  #define RADIO_INTENCLR10_LBREADY_Max (0x1UL)       /*!< Max enumerator value of LBREADY field.                               */
  #define RADIO_INTENCLR10_LBREADY_Clear (0x1UL)     /*!< Disable                                                              */
  #define RADIO_INTENCLR10_LBREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_LBREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CALDONE @Bit 30 : Write '1' to disable interrupt for event CALDONE */
  #define RADIO_INTENCLR10_CALDONE_Pos (30UL)        /*!< Position of CALDONE field.                                           */
  #define RADIO_INTENCLR10_CALDONE_Msk (0x1UL << RADIO_INTENCLR10_CALDONE_Pos) /*!< Bit mask of CALDONE field.                 */
  #define RADIO_INTENCLR10_CALDONE_Min (0x0UL)       /*!< Min enumerator value of CALDONE field.                               */
  #define RADIO_INTENCLR10_CALDONE_Max (0x1UL)       /*!< Max enumerator value of CALDONE field.                               */
  #define RADIO_INTENCLR10_CALDONE_Clear (0x1UL)     /*!< Disable                                                              */
  #define RADIO_INTENCLR10_CALDONE_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_CALDONE_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CHNOUPDATED @Bit 31 : Write '1' to disable interrupt for event CHNOUPDATED */
  #define RADIO_INTENCLR10_CHNOUPDATED_Pos (31UL)    /*!< Position of CHNOUPDATED field.                                       */
  #define RADIO_INTENCLR10_CHNOUPDATED_Msk (0x1UL << RADIO_INTENCLR10_CHNOUPDATED_Pos) /*!< Bit mask of CHNOUPDATED field.     */
  #define RADIO_INTENCLR10_CHNOUPDATED_Min (0x0UL)   /*!< Min enumerator value of CHNOUPDATED field.                           */
  #define RADIO_INTENCLR10_CHNOUPDATED_Max (0x1UL)   /*!< Max enumerator value of CHNOUPDATED field.                           */
  #define RADIO_INTENCLR10_CHNOUPDATED_Clear (0x1UL) /*!< Disable                                                              */
  #define RADIO_INTENCLR10_CHNOUPDATED_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define RADIO_INTENCLR10_CHNOUPDATED_Enabled (0x1UL) /*!< Read: Enabled                                                      */


/* RADIO_INTENCLR11: Disable interrupt */
  #define RADIO_INTENCLR11_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR11 register.                                  */

/* DBCTIMEOUT @Bit 0 : Write '1' to disable interrupt for event DBCTIMEOUT */
  #define RADIO_INTENCLR11_DBCTIMEOUT_Pos (0UL)      /*!< Position of DBCTIMEOUT field.                                        */
  #define RADIO_INTENCLR11_DBCTIMEOUT_Msk (0x1UL << RADIO_INTENCLR11_DBCTIMEOUT_Pos) /*!< Bit mask of DBCTIMEOUT field.        */
  #define RADIO_INTENCLR11_DBCTIMEOUT_Min (0x0UL)    /*!< Min enumerator value of DBCTIMEOUT field.                            */
  #define RADIO_INTENCLR11_DBCTIMEOUT_Max (0x1UL)    /*!< Max enumerator value of DBCTIMEOUT field.                            */
  #define RADIO_INTENCLR11_DBCTIMEOUT_Clear (0x1UL)  /*!< Disable                                                              */
  #define RADIO_INTENCLR11_DBCTIMEOUT_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIO_INTENCLR11_DBCTIMEOUT_Enabled (0x1UL) /*!< Read: Enabled                                                       */

