adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CRCOK @Bit 11 : Read pending status of interrupt for event CRCOK */
  #define RADIO_INTPEND10_CRCOK_Pos (11UL)           /*!< Position of CRCOK field.                                             */
  #define RADIO_INTPEND10_CRCOK_Msk (0x1UL << RADIO_INTPEND10_CRCOK_Pos) /*!< Bit mask of CRCOK field.                         */
  #define RADIO_INTPEND10_CRCOK_Min (0x0UL)          /*!< Min enumerator value of CRCOK field.                                 */
  #define RADIO_INTPEND10_CRCOK_Max (0x1UL)          /*!< Max enumerator value of CRCOK field.                                 */
  #define RADIO_INTPEND10_CRCOK_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND10_CRCOK_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* CRCERROR @Bit 12 : Read pending status of interrupt for event CRCERROR */
  #define RADIO_INTPEND10_CRCERROR_Pos (12UL)        /*!< Position of CRCERROR field.                                          */
  #define RADIO_INTPEND10_CRCERROR_Msk (0x1UL << RADIO_INTPEND10_CRCERROR_Pos) /*!< Bit mask of CRCERROR field.                */
  #define RADIO_INTPEND10_CRCERROR_Min (0x0UL)       /*!< Min enumerator value of CRCERROR field.                              */
  #define RADIO_INTPEND10_CRCERROR_Max (0x1UL)       /*!< Max enumerator value of CRCERROR field.                              */
  #define RADIO_INTPEND10_CRCERROR_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define RADIO_INTPEND10_CRCERROR_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* BCMATCH @Bit 14 : Read pending status of interrupt for event BCMATCH */
  #define RADIO_INTPEND10_BCMATCH_Pos (14UL)         /*!< Position of BCMATCH field.                                           */
  #define RADIO_INTPEND10_BCMATCH_Msk (0x1UL << RADIO_INTPEND10_BCMATCH_Pos) /*!< Bit mask of BCMATCH field.                   */
  #define RADIO_INTPEND10_BCMATCH_Min (0x0UL)        /*!< Min enumerator value of BCMATCH field.                               */
  #define RADIO_INTPEND10_BCMATCH_Max (0x1UL)        /*!< Max enumerator value of BCMATCH field.                               */
  #define RADIO_INTPEND10_BCMATCH_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND10_BCMATCH_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* EDEND @Bit 15 : Read pending status of interrupt for event EDEND */
  #define RADIO_INTPEND10_EDEND_Pos (15UL)           /*!< Position of EDEND field.                                             */
  #define RADIO_INTPEND10_EDEND_Msk (0x1UL << RADIO_INTPEND10_EDEND_Pos) /*!< Bit mask of EDEND field.                         */
  #define RADIO_INTPEND10_EDEND_Min (0x0UL)          /*!< Min enumerator value of EDEND field.                                 */
  #define RADIO_INTPEND10_EDEND_Max (0x1UL)          /*!< Max enumerator value of EDEND field.                                 */
  #define RADIO_INTPEND10_EDEND_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND10_EDEND_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* EDSTOPPED @Bit 16 : Read pending status of interrupt for event EDSTOPPED */
  #define RADIO_INTPEND10_EDSTOPPED_Pos (16UL)       /*!< Position of EDSTOPPED field.                                         */
  #define RADIO_INTPEND10_EDSTOPPED_Msk (0x1UL << RADIO_INTPEND10_EDSTOPPED_Pos) /*!< Bit mask of EDSTOPPED field.             */
  #define RADIO_INTPEND10_EDSTOPPED_Min (0x0UL)      /*!< Min enumerator value of EDSTOPPED field.                             */
  #define RADIO_INTPEND10_EDSTOPPED_Max (0x1UL)      /*!< Max enumerator value of EDSTOPPED field.                             */
  #define RADIO_INTPEND10_EDSTOPPED_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define RADIO_INTPEND10_EDSTOPPED_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* CCAIDLE @Bit 17 : Read pending status of interrupt for event CCAIDLE */
  #define RADIO_INTPEND10_CCAIDLE_Pos (17UL)         /*!< Position of CCAIDLE field.                                           */
  #define RADIO_INTPEND10_CCAIDLE_Msk (0x1UL << RADIO_INTPEND10_CCAIDLE_Pos) /*!< Bit mask of CCAIDLE field.                   */
  #define RADIO_INTPEND10_CCAIDLE_Min (0x0UL)        /*!< Min enumerator value of CCAIDLE field.                               */
  #define RADIO_INTPEND10_CCAIDLE_Max (0x1UL)        /*!< Max enumerator value of CCAIDLE field.                               */
  #define RADIO_INTPEND10_CCAIDLE_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND10_CCAIDLE_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CCABUSY @Bit 18 : Read pending status of interrupt for event CCABUSY */
  #define RADIO_INTPEND10_CCABUSY_Pos (18UL)         /*!< Position of CCABUSY field.                                           */
  #define RADIO_INTPEND10_CCABUSY_Msk (0x1UL << RADIO_INTPEND10_CCABUSY_Pos) /*!< Bit mask of CCABUSY field.                   */
  #define RADIO_INTPEND10_CCABUSY_Min (0x0UL)        /*!< Min enumerator value of CCABUSY field.                               */
  #define RADIO_INTPEND10_CCABUSY_Max (0x1UL)        /*!< Max enumerator value of CCABUSY field.                               */
  #define RADIO_INTPEND10_CCABUSY_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND10_CCABUSY_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* CCASTOPPED @Bit 19 : Read pending status of interrupt for event CCASTOPPED */
  #define RADIO_INTPEND10_CCASTOPPED_Pos (19UL)      /*!< Position of CCASTOPPED field.                                        */
  #define RADIO_INTPEND10_CCASTOPPED_Msk (0x1UL << RADIO_INTPEND10_CCASTOPPED_Pos) /*!< Bit mask of CCASTOPPED field.          */
  #define RADIO_INTPEND10_CCASTOPPED_Min (0x0UL)     /*!< Min enumerator value of CCASTOPPED field.                            */
  #define RADIO_INTPEND10_CCASTOPPED_Max (0x1UL)     /*!< Max enumerator value of CCASTOPPED field.                            */
  #define RADIO_INTPEND10_CCASTOPPED_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define RADIO_INTPEND10_CCASTOPPED_Pending (0x1UL) /*!< Read: Pending                                                        */

/* RATEBOOST @Bit 20 : Read pending status of interrupt for event RATEBOOST */
  #define RADIO_INTPEND10_RATEBOOST_Pos (20UL)       /*!< Position of RATEBOOST field.                                         */
  #define RADIO_INTPEND10_RATEBOOST_Msk (0x1UL << RADIO_INTPEND10_RATEBOOST_Pos) /*!< Bit mask of RATEBOOST field.             */
  #define RADIO_INTPEND10_RATEBOOST_Min (0x0UL)      /*!< Min enumerator value of RATEBOOST field.                             */
  #define RADIO_INTPEND10_RATEBOOST_Max (0x1UL)      /*!< Max enumerator value of RATEBOOST field.                             */
  #define RADIO_INTPEND10_RATEBOOST_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define RADIO_INTPEND10_RATEBOOST_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* MHRMATCH @Bit 21 : Read pending status of interrupt for event MHRMATCH */
  #define RADIO_INTPEND10_MHRMATCH_Pos (21UL)        /*!< Position of MHRMATCH field.                                          */
  #define RADIO_INTPEND10_MHRMATCH_Msk (0x1UL << RADIO_INTPEND10_MHRMATCH_Pos) /*!< Bit mask of MHRMATCH field.                */
  #define RADIO_INTPEND10_MHRMATCH_Min (0x0UL)       /*!< Min enumerator value of MHRMATCH field.                              */
  #define RADIO_INTPEND10_MHRMATCH_Max (0x1UL)       /*!< Max enumerator value of MHRMATCH field.                              */
  #define RADIO_INTPEND10_MHRMATCH_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define RADIO_INTPEND10_MHRMATCH_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* SYNC @Bit 22 : Read pending status of interrupt for event SYNC */
  #define RADIO_INTPEND10_SYNC_Pos (22UL)            /*!< Position of SYNC field.                                              */
  #define RADIO_INTPEND10_SYNC_Msk (0x1UL << RADIO_INTPEND10_SYNC_Pos) /*!< Bit mask of SYNC field.                            */
  #define RADIO_INTPEND10_SYNC_Min (0x0UL)           /*!< Min enumerator value of SYNC field.                                  */
  #define RADIO_INTPEND10_SYNC_Max (0x1UL)           /*!< Max enumerator value of SYNC field.                                  */
  #define RADIO_INTPEND10_SYNC_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND10_SYNC_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* CTEPRESENT @Bit 23 : Read pending status of interrupt for event CTEPRESENT */
  #define RADIO_INTPEND10_CTEPRESENT_Pos (23UL)      /*!< Position of CTEPRESENT field.                                        */
  #define RADIO_INTPEND10_CTEPRESENT_Msk (0x1UL << RADIO_INTPEND10_CTEPRESENT_Pos) /*!< Bit mask of CTEPRESENT field.          */
  #define RADIO_INTPEND10_CTEPRESENT_Min (0x0UL)     /*!< Min enumerator value of CTEPRESENT field.                            */
  #define RADIO_INTPEND10_CTEPRESENT_Max (0x1UL)     /*!< Max enumerator value of CTEPRESENT field.                            */
  #define RADIO_INTPEND10_CTEPRESENT_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define RADIO_INTPEND10_CTEPRESENT_Pending (0x1UL) /*!< Read: Pending                                                        */

/* CTEWARNING @Bit 24 : Read pending status of interrupt for event CTEWARNING */
  #define RADIO_INTPEND10_CTEWARNING_Pos (24UL)      /*!< Position of CTEWARNING field.                                        */
  #define RADIO_INTPEND10_CTEWARNING_Msk (0x1UL << RADIO_INTPEND10_CTEWARNING_Pos) /*!< Bit mask of CTEWARNING field.          */
  #define RADIO_INTPEND10_CTEWARNING_Min (0x0UL)     /*!< Min enumerator value of CTEWARNING field.                            */
  #define RADIO_INTPEND10_CTEWARNING_Max (0x1UL)     /*!< Max enumerator value of CTEWARNING field.                            */
  #define RADIO_INTPEND10_CTEWARNING_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define RADIO_INTPEND10_CTEWARNING_Pending (0x1UL) /*!< Read: Pending                                                        */

