adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_INTPEND11: Pending interrupts */
  #define RADIO_INTPEND11_ResetValue (0x00000000UL)  /*!< Reset value of INTPEND11 register.                                   */

/* DBCTIMEOUT @Bit 0 : Read pending status of interrupt for event DBCTIMEOUT */
  #define RADIO_INTPEND11_DBCTIMEOUT_Pos (0UL)       /*!< Position of DBCTIMEOUT field.                                        */
  #define RADIO_INTPEND11_DBCTIMEOUT_Msk (0x1UL << RADIO_INTPEND11_DBCTIMEOUT_Pos) /*!< Bit mask of DBCTIMEOUT field.          */
  #define RADIO_INTPEND11_DBCTIMEOUT_Min (0x0UL)     /*!< Min enumerator value of DBCTIMEOUT field.                            */
  #define RADIO_INTPEND11_DBCTIMEOUT_Max (0x1UL)     /*!< Max enumerator value of DBCTIMEOUT field.                            */
  #define RADIO_INTPEND11_DBCTIMEOUT_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define RADIO_INTPEND11_DBCTIMEOUT_Pending (0x1UL) /*!< Read: Pending                                                        */

/* TXTIMERMATCH @Bit 1 : Read pending status of interrupt for event TXTIMERMATCH */
  #define RADIO_INTPEND11_TXTIMERMATCH_Pos (1UL)     /*!< Position of TXTIMERMATCH field.                                      */
  #define RADIO_INTPEND11_TXTIMERMATCH_Msk (0x1UL << RADIO_INTPEND11_TXTIMERMATCH_Pos) /*!< Bit mask of TXTIMERMATCH field.    */
  #define RADIO_INTPEND11_TXTIMERMATCH_Min (0x0UL)   /*!< Min enumerator value of TXTIMERMATCH field.                          */
  #define RADIO_INTPEND11_TXTIMERMATCH_Max (0x1UL)   /*!< Max enumerator value of TXTIMERMATCH field.                          */
  #define RADIO_INTPEND11_TXTIMERMATCH_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define RADIO_INTPEND11_TXTIMERMATCH_Pending (0x1UL) /*!< Read: Pending                                                      */

/* RXTIMERMATCH @Bit 2 : Read pending status of interrupt for event RXTIMERMATCH */
  #define RADIO_INTPEND11_RXTIMERMATCH_Pos (2UL)     /*!< Position of RXTIMERMATCH field.                                      */
  #define RADIO_INTPEND11_RXTIMERMATCH_Msk (0x1UL << RADIO_INTPEND11_RXTIMERMATCH_Pos) /*!< Bit mask of RXTIMERMATCH field.    */
  #define RADIO_INTPEND11_RXTIMERMATCH_Min (0x0UL)   /*!< Min enumerator value of RXTIMERMATCH field.                          */
  #define RADIO_INTPEND11_RXTIMERMATCH_Max (0x1UL)   /*!< Max enumerator value of RXTIMERMATCH field.                          */
  #define RADIO_INTPEND11_RXTIMERMATCH_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define RADIO_INTPEND11_RXTIMERMATCH_Pending (0x1UL) /*!< Read: Pending                                                      */

/* BESPOKEACK @Bit 3 : Read pending status of interrupt for event BESPOKEACK */
  #define RADIO_INTPEND11_BESPOKEACK_Pos (3UL)       /*!< Position of BESPOKEACK field.                                        */
  #define RADIO_INTPEND11_BESPOKEACK_Msk (0x1UL << RADIO_INTPEND11_BESPOKEACK_Pos) /*!< Bit mask of BESPOKEACK field.          */
  #define RADIO_INTPEND11_BESPOKEACK_Min (0x0UL)     /*!< Min enumerator value of BESPOKEACK field.                            */
  #define RADIO_INTPEND11_BESPOKEACK_Max (0x1UL)     /*!< Max enumerator value of BESPOKEACK field.                            */
  #define RADIO_INTPEND11_BESPOKEACK_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define RADIO_INTPEND11_BESPOKEACK_Pending (0x1UL) /*!< Read: Pending                                                        */

/* RXDIGEN @Bit 4 : Read pending status of interrupt for event RXDIGEN */
  #define RADIO_INTPEND11_RXDIGEN_Pos (4UL)          /*!< Position of RXDIGEN field.                                           */
  #define RADIO_INTPEND11_RXDIGEN_Msk (0x1UL << RADIO_INTPEND11_RXDIGEN_Pos) /*!< Bit mask of RXDIGEN field.                   */
  #define RADIO_INTPEND11_RXDIGEN_Min (0x0UL)        /*!< Min enumerator value of RXDIGEN field.                               */
  #define RADIO_INTPEND11_RXDIGEN_Max (0x1UL)        /*!< Max enumerator value of RXDIGEN field.                               */
  #define RADIO_INTPEND11_RXDIGEN_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define RADIO_INTPEND11_RXDIGEN_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* RAWDETECT @Bit 5 : Read pending status of interrupt for event RAWDETECT */
  #define RADIO_INTPEND11_RAWDETECT_Pos (5UL)        /*!< Position of RAWDETECT field.                                         */
  #define RADIO_INTPEND11_RAWDETECT_Msk (0x1UL << RADIO_INTPEND11_RAWDETECT_Pos) /*!< Bit mask of RAWDETECT field.             */
  #define RADIO_INTPEND11_RAWDETECT_Min (0x0UL)      /*!< Min enumerator value of RAWDETECT field.                             */
  #define RADIO_INTPEND11_RAWDETECT_Max (0x1UL)      /*!< Max enumerator value of RAWDETECT field.                             */
  #define RADIO_INTPEND11_RAWDETECT_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define RADIO_INTPEND11_RAWDETECT_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* DETECTFIFOFULL @Bit 6 : Read pending status of interrupt for event DETECTFIFOFULL */
  #define RADIO_INTPEND11_DETECTFIFOFULL_Pos (6UL)   /*!< Position of DETECTFIFOFULL field.                                    */
  #define RADIO_INTPEND11_DETECTFIFOFULL_Msk (0x1UL << RADIO_INTPEND11_DETECTFIFOFULL_Pos) /*!< Bit mask of DETECTFIFOFULL
                                                                            field.*/                                              
  #define RADIO_INTPEND11_DETECTFIFOFULL_Min (0x0UL) /*!< Min enumerator value of DETECTFIFOFULL field.                        */
  #define RADIO_INTPEND11_DETECTFIFOFULL_Max (0x1UL) /*!< Max enumerator value of DETECTFIFOFULL field.                        */
  #define RADIO_INTPEND11_DETECTFIFOFULL_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define RADIO_INTPEND11_DETECTFIFOFULL_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TIMERWRAPS @Bit 7 : Read pending status of interrupt for event TIMERWRAPS */
  #define RADIO_INTPEND11_TIMERWRAPS_Pos (7UL)       /*!< Position of TIMERWRAPS field.                                        */
  #define RADIO_INTPEND11_TIMERWRAPS_Msk (0x1UL << RADIO_INTPEND11_TIMERWRAPS_Pos) /*!< Bit mask of TIMERWRAPS field.          */
  #define RADIO_INTPEND11_TIMERWRAPS_Min (0x0UL)     /*!< Min enumerator value of TIMERWRAPS field.                            */
  #define RADIO_INTPEND11_TIMERWRAPS_Max (0x1UL)     /*!< Max enumerator value of TIMERWRAPS field.                            */
  #define RADIO_INTPEND11_TIMERWRAPS_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define RADIO_INTPEND11_TIMERWRAPS_Pending (0x1UL) /*!< Read: Pending                                                        */

/* STROBETIMETRACKUPDATED @Bit 8 : Read pending status of interrupt for event STROBETIMETRACKUPDATED */
  #define RADIO_INTPEND11_STROBETIMETRACKUPDATED_Pos (8UL) /*!< Position of STROBETIMETRACKUPDATED field.                      */
  #define RADIO_INTPEND11_STROBETIMETRACKUPDATED_Msk (0x1UL << RADIO_INTPEND11_STROBETIMETRACKUPDATED_Pos) /*!< Bit mask of
                                                                            STROBETIMETRACKUPDATED field.*/                       
  #define RADIO_INTPEND11_STROBETIMETRACKUPDATED_Min (0x0UL) /*!< Min enumerator value of STROBETIMETRACKUPDATED field.        */
  #define RADIO_INTPEND11_STROBETIMETRACKUPDATED_Max (0x1UL) /*!< Max enumerator value of STROBETIMETRACKUPDATED field.        */
  #define RADIO_INTPEND11_STROBETIMETRACKUPDATED_NotPending (0x0UL) /*!< Read: Not pending                                     */
  #define RADIO_INTPEND11_STROBETIMETRACKUPDATED_Pending (0x1UL) /*!< Read: Pending                                            */

/* DEMODCTRLCONDTRIGGERED0 @Bit 9 : Read pending status of interrupt for event DEMODCTRLCONDTRIGGERED0 */
  #define RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED0_Pos (9UL) /*!< Position of DEMODCTRLCONDTRIGGERED0 field.                    */
  #define RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED0_Msk (0x1UL << RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED0_Pos) /*!< Bit mask of
                                                                            DEMODCTRLCONDTRIGGERED0 field.*/                      
  #define RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED0_Min (0x0UL) /*!< Min enumerator value of DEMODCTRLCONDTRIGGERED0 field.      */
  #define RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED0_Max (0x1UL) /*!< Max enumerator value of DEMODCTRLCONDTRIGGERED0 field.      */
  #define RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED0_NotPending (0x0UL) /*!< Read: Not pending                                    */
  #define RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED0_Pending (0x1UL) /*!< Read: Pending                                           */

/* DEMODCTRLCONDTRIGGERED1 @Bit 10 : Read pending status of interrupt for event DEMODCTRLCONDTRIGGERED1 */
  #define RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED1_Pos (10UL) /*!< Position of DEMODCTRLCONDTRIGGERED1 field.                   */
  #define RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED1_Msk (0x1UL << RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED1_Pos) /*!< Bit mask of
                                                                            DEMODCTRLCONDTRIGGERED1 field.*/                      
  #define RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED1_Min (0x0UL) /*!< Min enumerator value of DEMODCTRLCONDTRIGGERED1 field.      */
  #define RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED1_Max (0x1UL) /*!< Max enumerator value of DEMODCTRLCONDTRIGGERED1 field.      */
  #define RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED1_NotPending (0x0UL) /*!< Read: Not pending                                    */
  #define RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED1_Pending (0x1UL) /*!< Read: Pending                                           */

/* DEMODCTRLCONDTRIGGERED2 @Bit 11 : Read pending status of interrupt for event DEMODCTRLCONDTRIGGERED2 */
  #define RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED2_Pos (11UL) /*!< Position of DEMODCTRLCONDTRIGGERED2 field.                   */
  #define RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED2_Msk (0x1UL << RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED2_Pos) /*!< Bit mask of
                                                                            DEMODCTRLCONDTRIGGERED2 field.*/                      
  #define RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED2_Min (0x0UL) /*!< Min enumerator value of DEMODCTRLCONDTRIGGERED2 field.      */
  #define RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED2_Max (0x1UL) /*!< Max enumerator value of DEMODCTRLCONDTRIGGERED2 field.      */
  #define RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED2_NotPending (0x0UL) /*!< Read: Not pending                                    */
  #define RADIO_INTPEND11_DEMODCTRLCONDTRIGGERED2_Pending (0x1UL) /*!< Read: Pending                                           */

/* INTERCEPTEDTASK @Bit 12 : Read pending status of interrupt for event INTERCEPTEDTASK */
  #define RADIO_INTPEND11_INTERCEPTEDTASK_Pos (12UL) /*!< Position of INTERCEPTEDTASK field.                                   */
  #define RADIO_INTPEND11_INTERCEPTEDTASK_Msk (0x1UL << RADIO_INTPEND11_INTERCEPTEDTASK_Pos) /*!< Bit mask of INTERCEPTEDTASK
                                                                            field.*/                                              
  #define RADIO_INTPEND11_INTERCEPTEDTASK_Min (0x0UL) /*!< Min enumerator value of INTERCEPTEDTASK field.                      */
  #define RADIO_INTPEND11_INTERCEPTEDTASK_Max (0x1UL) /*!< Max enumerator value of INTERCEPTEDTASK field.                      */
  #define RADIO_INTPEND11_INTERCEPTEDTASK_NotPending (0x0UL) /*!< Read: Not pending                                            */
  #define RADIO_INTPEND11_INTERCEPTEDTASK_Pending (0x1UL) /*!< Read: Pending                                                   */

/* INTERCEPTEDEVENT @Bit 13 : Read pending status of interrupt for event INTERCEPTEDEVENT */
  #define RADIO_INTPEND11_INTERCEPTEDEVENT_Pos (13UL) /*!< Position of INTERCEPTEDEVENT field.                                 */
  #define RADIO_INTPEND11_INTERCEPTEDEVENT_Msk (0x1UL << RADIO_INTPEND11_INTERCEPTEDEVENT_Pos) /*!< Bit mask of INTERCEPTEDEVENT
                                                                            field.*/                                              
  #define RADIO_INTPEND11_INTERCEPTEDEVENT_Min (0x0UL) /*!< Min enumerator value of INTERCEPTEDEVENT field.                    */
  #define RADIO_INTPEND11_INTERCEPTEDEVENT_Max (0x1UL) /*!< Max enumerator value of INTERCEPTEDEVENT field.                    */
  #define RADIO_INTPEND11_INTERCEPTEDEVENT_NotPending (0x0UL) /*!< Read: Not pending                                           */
  #define RADIO_INTPEND11_INTERCEPTEDEVENT_Pending (0x1UL) /*!< Read: Pending                                                  */

/* TXADDRESS @Bit 14 : Read pending status of interrupt for event TXADDRESS */
  #define RADIO_INTPEND11_TXADDRESS_Pos (14UL)       /*!< Position of TXADDRESS field.                                         */
  #define RADIO_INTPEND11_TXADDRESS_Msk (0x1UL << RADIO_INTPEND11_TXADDRESS_Pos) /*!< Bit mask of TXADDRESS field.             */
  #define RADIO_INTPEND11_TXADDRESS_Min (0x0UL)      /*!< Min enumerator value of TXADDRESS field.                             */
  #define RADIO_INTPEND11_TXADDRESS_Max (0x1UL)      /*!< Max enumerator value of TXADDRESS field.                             */
  #define RADIO_INTPEND11_TXADDRESS_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define RADIO_INTPEND11_TXADDRESS_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* RXADDRESS @Bit 15 : Read pending status of interrupt for event RXADDRESS */
  #define RADIO_INTPEND11_RXADDRESS_Pos (15UL)       /*!< Position of RXADDRESS field.                                         */
  #define RADIO_INTPEND11_RXADDRESS_Msk (0x1UL << RADIO_INTPEND11_RXADDRESS_Pos) /*!< Bit mask of RXADDRESS field.             */
  #define RADIO_INTPEND11_RXADDRESS_Min (0x0UL)      /*!< Min enumerator value of RXADDRESS field.                             */
  #define RADIO_INTPEND11_RXADDRESS_Max (0x1UL)      /*!< Max enumerator value of RXADDRESS field.                             */
  #define RADIO_INTPEND11_RXADDRESS_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define RADIO_INTPEND11_RXADDRESS_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* ACQINJ0DMAEND @Bit 16 : Read pending status of interrupt for event ACQINJ0DMAEND */
  #define RADIO_INTPEND11_ACQINJ0DMAEND_Pos (16UL)   /*!< Position of ACQINJ0DMAEND field.                                     */
  #define RADIO_INTPEND11_ACQINJ0DMAEND_Msk (0x1UL << RADIO_INTPEND11_ACQINJ0DMAEND_Pos) /*!< Bit mask of ACQINJ0DMAEND field. */
  #define RADIO_INTPEND11_ACQINJ0DMAEND_Min (0x0UL)  /*!< Min enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTPEND11_ACQINJ0DMAEND_Max (0x1UL)  /*!< Max enumerator value of ACQINJ0DMAEND field.                         */
  #define RADIO_INTPEND11_ACQINJ0DMAEND_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RADIO_INTPEND11_ACQINJ0DMAEND_Pending (0x1UL) /*!< Read: Pending                                                     */

/* ACQINJ1DMAEND @Bit 17 : Read pending status of interrupt for event ACQINJ1DMAEND */
  #define RADIO_INTPEND11_ACQINJ1DMAEND_Pos (17UL)   /*!< Position of ACQINJ1DMAEND field.                                     */
  #define RADIO_INTPEND11_ACQINJ1DMAEND_Msk (0x1UL << RADIO_INTPEND11_ACQINJ1DMAEND_Pos) /*!< Bit mask of ACQINJ1DMAEND field. */
  #define RADIO_INTPEND11_ACQINJ1DMAEND_Min (0x0UL)  /*!< Min enumerator value of ACQINJ1DMAEND field.                         */
  #define RADIO_INTPEND11_ACQINJ1DMAEND_Max (0x1UL)  /*!< Max enumerator value of ACQINJ1DMAEND field.                         */
  #define RADIO_INTPEND11_ACQINJ1DMAEND_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RADIO_INTPEND11_ACQINJ1DMAEND_Pending (0x1UL) /*!< Read: Pending                                                     */


/* RADIO_MODE: Data rate and modulation */
  #define RADIO_MODE_ResetValue (0x00000000UL)       /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..3 : Radio data rate and modulation setting. The radio supports frequency-shift keying (FSK) modulation. */
  #define RADIO_MODE_MODE_Pos (0UL)                  /*!< Position of MODE field.                                              */
  #define RADIO_MODE_MODE_Msk (0xFUL << RADIO_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                      */
  #define RADIO_MODE_MODE_Min (0x0UL)                /*!< Min enumerator value of MODE field.                                  */
  #define RADIO_MODE_MODE_Max (0xFUL)                /*!< Max enumerator value of MODE field.                                  */
  #define RADIO_MODE_MODE_Nrf_1Mbit (0x0UL)          /*!< 1 Mbps Nordic proprietary radio mode                                 */
  #define RADIO_MODE_MODE_Nrf_2Mbit (0x1UL)          /*!< 2 Mbps Nordic proprietary radio mode                                 */
  #define RADIO_MODE_MODE_Nrf_250Kbit (0x2UL)        /*!< 250 kbps Nordic proprietary radio mode                               */
  #define RADIO_MODE_MODE_Ble_1Mbit (0x3UL)          /*!< 1 Mbps BLE                                                           */
  #define RADIO_MODE_MODE_Ble_2Mbit (0x4UL)          /*!< 2 Mbps BLE                                                           */
  #define RADIO_MODE_MODE_Ble_LR125Kbit (0x5UL)      /*!< Long range 125 kbps TX, 125 kbps and 500 kbps RX                     */
  #define RADIO_MODE_MODE_Ble_LR500Kbit (0x6UL)      /*!< Long range 500 kbps TX, 125 kbps and 500 kbps RX                     */
  #define RADIO_MODE_MODE_Nrf_4Mbit0_5 (0x9UL)       /*!< 4 Mbps Nordic proprietary radio mode (BT=0.5/h=0.5)                  */
  #define RADIO_MODE_MODE_Nrf_4Mbit0_25 (0xAUL)      /*!< 4 Mbps Nordic proprietary radio mode (BT=0.5/h=0.25)                 */
  #define RADIO_MODE_MODE_Ieee802154_250Kbit (0xFUL) /*!< IEEE 802.15.4-2006 250 kbps                                          */


/* RADIO_MODEINTERNAL: Internal mode setting, active only when MODEPROGENABLE==1 */
  #define RADIO_MODEINTERNAL_ResetValue (0x00000000UL) /*!< Reset value of MODEINTERNAL register.                              */

/* MODEINTERNAL @Bits 0..3 : Radio data rate and modulation setting. Same definition as MODE. */
  #define RADIO_MODEINTERNAL_MODEINTERNAL_Pos (0UL)  /*!< Position of MODEINTERNAL field.                                      */
  #define RADIO_MODEINTERNAL_MODEINTERNAL_Msk (0xFUL << RADIO_MODEINTERNAL_MODEINTERNAL_Pos) /*!< Bit mask of MODEINTERNAL
                                                                            field.*/                                              


/* RADIO_MODEPROGENABLE: Switch that enables programmable modes */
  #define RADIO_MODEPROGENABLE_ResetValue (0x00000000UL) /*!< Reset value of MODEPROGENABLE register.                          */

/* MODEPROGENABLE @Bit 0 : Enable manual triggering of MODEREADY event and activate MODEINTERNAL register (ie. MODEINTERNAL
                           overrides MODE register) */                                                                            
                                                                                                                                  
  #define RADIO_MODEPROGENABLE_MODEPROGENABLE_Pos (0UL) /*!< Position of MODEPROGENABLE field.                                 */
  #define RADIO_MODEPROGENABLE_MODEPROGENABLE_Msk (0x1UL << RADIO_MODEPROGENABLE_MODEPROGENABLE_Pos) /*!< Bit mask of
                                                                            MODEPROGENABLE field.*/                               


/* RADIO_MODEDEPENDENTXPBTEST: Mode dependent XPB test register */
  #define RADIO_MODEDEPENDENTXPBTEST_ResetValue (0x00000000UL) /*!< Reset value of MODEDEPENDENTXPBTEST register.              */

/* VAL @Bits 0..31 : 32 bits, only for testing mode dependency */
  #define RADIO_MODEDEPENDENTXPBTEST_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define RADIO_MODEDEPENDENTXPBTEST_VAL_Msk (0xFFFFFFFFUL << RADIO_MODEDEPENDENTXPBTEST_VAL_Pos) /*!< Bit mask of VAL field.  */


/* RADIO_MODECNF: Radio mode configuration register */
  #define RADIO_MODECNF_ResetValue (0x00000011UL)    /*!< Reset value of MODECNF register.                                     */

/* DEMODN @Bit 0 : Demodulator mode override value */
  #define RADIO_MODECNF_DEMODN_Pos (0UL)             /*!< Position of DEMODN field.                                            */
  #define RADIO_MODECNF_DEMODN_Msk (0x1UL << RADIO_MODECNF_DEMODN_Pos) /*!< Bit mask of DEMODN field.                          */
  #define RADIO_MODECNF_DEMODN_Min (0x0UL)           /*!< Min enumerator value of DEMODN field.                                */
  #define RADIO_MODECNF_DEMODN_Max (0x1UL)           /*!< Max enumerator value of DEMODN field.                                */
  #define RADIO_MODECNF_DEMODN_Standard (0x0UL)      /*!< Standard demodulator mode                                            */
  #define RADIO_MODECNF_DEMODN_Hyper (0x1UL)         /*!< Hyper demodulator mode                                               */

/* ZEROIF @Bit 1 : Zero-IF mode */
  #define RADIO_MODECNF_ZEROIF_Pos (1UL)             /*!< Position of ZEROIF field.                                            */
  #define RADIO_MODECNF_ZEROIF_Msk (0x1UL << RADIO_MODECNF_ZEROIF_Pos) /*!< Bit mask of ZEROIF field.                          */
  #define RADIO_MODECNF_ZEROIF_Min (0x0UL)           /*!< Min enumerator value of ZEROIF field.                                */
  #define RADIO_MODECNF_ZEROIF_Max (0x1UL)           /*!< Max enumerator value of ZEROIF field.                                */
  #define RADIO_MODECNF_ZEROIF_Default (0x0UL)       /*!< Default mode (heterodyne)                                            */
  #define RADIO_MODECNF_ZEROIF_ZeroIF (0x1UL)        /*!< Zero-IF mode                                                         */

/* SSEL @Bit 2 : Sideband select */
  #define RADIO_MODECNF_SSEL_Pos (2UL)               /*!< Position of SSEL field.                                              */
  #define RADIO_MODECNF_SSEL_Msk (0x1UL << RADIO_MODECNF_SSEL_Pos) /*!< Bit mask of SSEL field.                                */
  #define RADIO_MODECNF_SSEL_Min (0x0UL)             /*!< Min enumerator value of SSEL field.                                  */
  #define RADIO_MODECNF_SSEL_Max (0x1UL)             /*!< Max enumerator value of SSEL field.                                  */
  #define RADIO_MODECNF_SSEL_Low (0x0UL)             /*!< Low-side LO                                                          */
  #define RADIO_MODECNF_SSEL_High (0x1UL)            /*!< High-side LO                                                         */

