adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DTX @Bits 3..4 : Default TX value. Specifies what the RADIO will transmit when it is not started, i.e. between:
                    RADIO.EVENTS_READY and RADIO.TASKS_START RADIO.EVENTS_END and RADIO.TASKS_START RADIO.EVENTS_END and
                    RADIO.EVENTS_DISABLED) */                                                                                     
                                                                                                                                  
  #define RADIO_MODECNF_DTX_Pos (3UL)                /*!< Position of DTX field.                                               */
  #define RADIO_MODECNF_DTX_Msk (0x3UL << RADIO_MODECNF_DTX_Pos) /*!< Bit mask of DTX field.                                   */
  #define RADIO_MODECNF_DTX_Min (0x0UL)              /*!< Min enumerator value of DTX field.                                   */
  #define RADIO_MODECNF_DTX_Max (0x2UL)              /*!< Max enumerator value of DTX field.                                   */
  #define RADIO_MODECNF_DTX_B1 (0x0UL)               /*!< Transmit '1'                                                         */
  #define RADIO_MODECNF_DTX_B0 (0x1UL)               /*!< Transmit '0'                                                         */
  #define RADIO_MODECNF_DTX_Center (0x2UL)           /*!< Transmit center frequency When tuning the crystal for centre
                                                          frequency, the RADIO must be set in DTX = Center mode to be able to
                                                          achieve the expected accuracy. This is only a valid setting for
                                                          Nrf_1Mbit, Nrf_2Mbit, Nrf_250kbit, Ble_1Mbit and Ble_2Mbit.*/           

/* IQMODLOOPBACK @Bit 5 : Loopback from IQ modulator TODO: is it a good place? */
  #define RADIO_MODECNF_IQMODLOOPBACK_Pos (5UL)      /*!< Position of IQMODLOOPBACK field.                                     */
  #define RADIO_MODECNF_IQMODLOOPBACK_Msk (0x1UL << RADIO_MODECNF_IQMODLOOPBACK_Pos) /*!< Bit mask of IQMODLOOPBACK field.     */
  #define RADIO_MODECNF_IQMODLOOPBACK_Min (0x0UL)    /*!< Min enumerator value of IQMODLOOPBACK field.                         */
  #define RADIO_MODECNF_IQMODLOOPBACK_Max (0x1UL)    /*!< Max enumerator value of IQMODLOOPBACK field.                         */
  #define RADIO_MODECNF_IQMODLOOPBACK_Off (0x0UL)    /*!< Digital loopback off                                                 */
  #define RADIO_MODECNF_IQMODLOOPBACK_On (0x1UL)     /*!< Digital loopback on                                                  */

/* IQRAMSEL @Bit 6 : IQ RAM select */
  #define RADIO_MODECNF_IQRAMSEL_Pos (6UL)           /*!< Position of IQRAMSEL field.                                          */
  #define RADIO_MODECNF_IQRAMSEL_Msk (0x1UL << RADIO_MODECNF_IQRAMSEL_Pos) /*!< Bit mask of IQRAMSEL field.                    */
  #define RADIO_MODECNF_IQRAMSEL_Min (0x0UL)         /*!< Min enumerator value of IQRAMSEL field.                              */
  #define RADIO_MODECNF_IQRAMSEL_Max (0x1UL)         /*!< Max enumerator value of IQRAMSEL field.                              */
  #define RADIO_MODECNF_IQRAMSEL_off (0x0UL)         /*!< IQ RAM select off                                                    */
  #define RADIO_MODECNF_IQRAMSEL_on (0x1UL)          /*!< IQ RAM select on                                                     */


/* RADIO_MISC: Misc configuration collection (to be renamed when more bits are defined) */
  #define RADIO_MISC_ResetValue (0x00000004UL)       /*!< Reset value of MISC register.                                        */

/* DISABLEADDRWINDOW @Bit 0 : (unspecified) */
  #define RADIO_MISC_DISABLEADDRWINDOW_Pos (0UL)     /*!< Position of DISABLEADDRWINDOW field.                                 */
  #define RADIO_MISC_DISABLEADDRWINDOW_Msk (0x1UL << RADIO_MISC_DISABLEADDRWINDOW_Pos) /*!< Bit mask of DISABLEADDRWINDOW
                                                                            field.*/                                              
  #define RADIO_MISC_DISABLEADDRWINDOW_Min (0x0UL)   /*!< Min enumerator value of DISABLEADDRWINDOW field.                     */
  #define RADIO_MISC_DISABLEADDRWINDOW_Max (0x1UL)   /*!< Max enumerator value of DISABLEADDRWINDOW field.                     */
  #define RADIO_MISC_DISABLEADDRWINDOW_Disabled (0x1UL) /*!< Disable                                                           */
  #define RADIO_MISC_DISABLEADDRWINDOW_Enabled (0x0UL) /*!< Enable                                                             */

/* AGCFREEZEAFTERREF @Bit 1 : (unspecified) */
  #define RADIO_MISC_AGCFREEZEAFTERREF_Pos (1UL)     /*!< Position of AGCFREEZEAFTERREF field.                                 */
  #define RADIO_MISC_AGCFREEZEAFTERREF_Msk (0x1UL << RADIO_MISC_AGCFREEZEAFTERREF_Pos) /*!< Bit mask of AGCFREEZEAFTERREF
                                                                            field.*/                                              
  #define RADIO_MISC_AGCFREEZEAFTERREF_Min (0x0UL)   /*!< Min enumerator value of AGCFREEZEAFTERREF field.                     */
  #define RADIO_MISC_AGCFREEZEAFTERREF_Max (0x1UL)   /*!< Max enumerator value of AGCFREEZEAFTERREF field.                     */
  #define RADIO_MISC_AGCFREEZEAFTERREF_EntireCTE (0x0UL) /*!< Gain freeze will apply to whole CTE,                             */
  #define RADIO_MISC_AGCFREEZEAFTERREF_AfterRefPeriod (0x1UL) /*!< Gain freeze will apply to only after reference period of
                                                                   CTE.*/                                                         

/* AGCFREEZEGAINENABLE @Bit 2 : Override AGC gain setting during CTE (from QOVERRIDE10) */
  #define RADIO_MISC_AGCFREEZEGAINENABLE_Pos (2UL)   /*!< Position of AGCFREEZEGAINENABLE field.                               */
  #define RADIO_MISC_AGCFREEZEGAINENABLE_Msk (0x1UL << RADIO_MISC_AGCFREEZEGAINENABLE_Pos) /*!< Bit mask of AGCFREEZEGAINENABLE
                                                                            field.*/                                              
  #define RADIO_MISC_AGCFREEZEGAINENABLE_Min (0x0UL) /*!< Min enumerator value of AGCFREEZEGAINENABLE field.                   */
  #define RADIO_MISC_AGCFREEZEGAINENABLE_Max (0x1UL) /*!< Max enumerator value of AGCFREEZEGAINENABLE field.                   */
  #define RADIO_MISC_AGCFREEZEGAINENABLE_Adjust (0x0UL) /*!< AGC gain settings will keep adjusting during CTE                  */
  #define RADIO_MISC_AGCFREEZEGAINENABLE_Freeze (0x1UL) /*!< AGC gain settings will freeze (not keep adjusting) during CTE     */


