adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_DATAWHITEIV: Data whitening initial value TODO:move to FelisMAC */
  #define RADIO_DATAWHITEIV_ResetValue (0x00000040UL) /*!< Reset value of DATAWHITEIV register.                                */

/* DATAWHITEIV @Bits 0..5 : (unspecified) */
  #define RADIO_DATAWHITEIV_DATAWHITEIV_Pos (0UL)    /*!< Position of DATAWHITEIV field.                                       */
  #define RADIO_DATAWHITEIV_DATAWHITEIV_Msk (0x3FUL << RADIO_DATAWHITEIV_DATAWHITEIV_Pos) /*!< Bit mask of DATAWHITEIV field.  */


/* RADIO_GAINOUT: Gain readout (LNA_OUT_SPI for nrf52/53) */
  #define RADIO_GAINOUT_ResetValue (0x00000000UL)    /*!< Reset value of GAINOUT register.                                     */

/* LNAGAIN @Bits 0..1 : (unspecified) */
  #define RADIO_GAINOUT_LNAGAIN_Pos (0UL)            /*!< Position of LNAGAIN field.                                           */
  #define RADIO_GAINOUT_LNAGAIN_Msk (0x3UL << RADIO_GAINOUT_LNAGAIN_Pos) /*!< Bit mask of LNAGAIN field.                       */

/* MIXGAIN @Bit 8 : (unspecified) */
  #define RADIO_GAINOUT_MIXGAIN_Pos (8UL)            /*!< Position of MIXGAIN field.                                           */
  #define RADIO_GAINOUT_MIXGAIN_Msk (0x1UL << RADIO_GAINOUT_MIXGAIN_Pos) /*!< Bit mask of MIXGAIN field.                       */

/* AAFGAIN @Bits 12..15 : (unspecified) */
  #define RADIO_GAINOUT_AAFGAIN_Pos (12UL)           /*!< Position of AAFGAIN field.                                           */
  #define RADIO_GAINOUT_AAFGAIN_Msk (0xFUL << RADIO_GAINOUT_AAFGAIN_Pos) /*!< Bit mask of AAFGAIN field.                       */


/* RADIO_SHORTCUTANA: Internal shortcuts for RADIO PHY */
  #define RADIO_SHORTCUTANA_ResetValue (0x00000000UL) /*!< Reset value of SHORTCUTANA register.                                */

/* TXREADYCALSTART @Bit 0 : Internal shortcut */
  #define RADIO_SHORTCUTANA_TXREADYCALSTART_Pos (0UL) /*!< Position of TXREADYCALSTART field.                                  */
  #define RADIO_SHORTCUTANA_TXREADYCALSTART_Msk (0x1UL << RADIO_SHORTCUTANA_TXREADYCALSTART_Pos) /*!< Bit mask of
                                                                            TXREADYCALSTART field.*/                              

/* RXREADYCALSTART @Bit 1 : Internal shortcut */
  #define RADIO_SHORTCUTANA_RXREADYCALSTART_Pos (1UL) /*!< Position of RXREADYCALSTART field.                                  */
  #define RADIO_SHORTCUTANA_RXREADYCALSTART_Msk (0x1UL << RADIO_SHORTCUTANA_RXREADYCALSTART_Pos) /*!< Bit mask of
                                                                            RXREADYCALSTART field.*/                              

/* LBREADYCALSTART @Bit 2 : Internal shortcut */
  #define RADIO_SHORTCUTANA_LBREADYCALSTART_Pos (2UL) /*!< Position of LBREADYCALSTART field.                                  */
  #define RADIO_SHORTCUTANA_LBREADYCALSTART_Msk (0x1UL << RADIO_SHORTCUTANA_LBREADYCALSTART_Pos) /*!< Bit mask of
                                                                            LBREADYCALSTART field.*/                              

/* RXREADYDMASTART @Bit 3 : Internal shortcut */
  #define RADIO_SHORTCUTANA_RXREADYDMASTART_Pos (3UL) /*!< Position of RXREADYDMASTART field.                                  */
  #define RADIO_SHORTCUTANA_RXREADYDMASTART_Msk (0x1UL << RADIO_SHORTCUTANA_RXREADYDMASTART_Pos) /*!< Bit mask of
                                                                            RXREADYDMASTART field.*/                              

/* LBREADYDMASTART @Bit 4 : Internal shortcut */
  #define RADIO_SHORTCUTANA_LBREADYDMASTART_Pos (4UL) /*!< Position of LBREADYDMASTART field.                                  */
  #define RADIO_SHORTCUTANA_LBREADYDMASTART_Msk (0x1UL << RADIO_SHORTCUTANA_LBREADYDMASTART_Pos) /*!< Bit mask of
                                                                            LBREADYDMASTART field.*/                              

/* CALDONEDISABLE @Bit 5 : Internal shortcut */
  #define RADIO_SHORTCUTANA_CALDONEDISABLE_Pos (5UL) /*!< Position of CALDONEDISABLE field.                                    */
  #define RADIO_SHORTCUTANA_CALDONEDISABLE_Msk (0x1UL << RADIO_SHORTCUTANA_CALDONEDISABLE_Pos) /*!< Bit mask of CALDONEDISABLE
                                                                            field.*/                                              

/* CALDONEPATESTSTART @Bit 6 : Internal shortcut */
  #define RADIO_SHORTCUTANA_CALDONEPATESTSTART_Pos (6UL) /*!< Position of CALDONEPATESTSTART field.                            */
  #define RADIO_SHORTCUTANA_CALDONEPATESTSTART_Msk (0x1UL << RADIO_SHORTCUTANA_CALDONEPATESTSTART_Pos) /*!< Bit mask of
                                                                            CALDONEPATESTSTART field.*/                           

/* CALDONEDMASTART @Bit 7 : Internal shortcut */
  #define RADIO_SHORTCUTANA_CALDONEDMASTART_Pos (7UL) /*!< Position of CALDONEDMASTART field.                                  */
  #define RADIO_SHORTCUTANA_CALDONEDMASTART_Msk (0x1UL << RADIO_SHORTCUTANA_CALDONEDMASTART_Pos) /*!< Bit mask of
                                                                            CALDONEDMASTART field.*/                              


/* RADIO_TIMING: Timing */
  #define RADIO_TIMING_ResetValue (0x00000000UL)     /*!< Reset value of TIMING register.                                      */

/* RU @Bit 0 : 0: Default ramp-up time, compatible with 180nm radio. 1: Fast ramp-up. */
  #define RADIO_TIMING_RU_Pos (0UL)                  /*!< Position of RU field.                                                */
  #define RADIO_TIMING_RU_Msk (0x1UL << RADIO_TIMING_RU_Pos) /*!< Bit mask of RU field.                                        */


/* RADIO_FREQUENCY: Frequency */
  #define RADIO_FREQUENCY_ResetValue (0x00000002UL)  /*!< Reset value of FREQUENCY register.                                   */

/* FREQUENCY @Bits 0..6 : Radio channel frequency. Frequency = 2400 + FREQUENCY (MHz). */
  #define RADIO_FREQUENCY_FREQUENCY_Pos (0UL)        /*!< Position of FREQUENCY field.                                         */
  #define RADIO_FREQUENCY_FREQUENCY_Msk (0x7FUL << RADIO_FREQUENCY_FREQUENCY_Pos) /*!< Bit mask of FREQUENCY field.            */

/* MAP @Bit 8 : Channel map selection. 0: Channel map between 2400 MHZ to 2500 MHz, Frequency = 2400 + FREQUENCY (MHz). 1:
                Channel map between 2360 MHZ to 2460 MHz, Frequency = 2360 + FREQUENCY (MHz). */                                  
                                                                                                                                  
  #define RADIO_FREQUENCY_MAP_Pos (8UL)              /*!< Position of MAP field.                                               */
  #define RADIO_FREQUENCY_MAP_Msk (0x1UL << RADIO_FREQUENCY_MAP_Pos) /*!< Bit mask of MAP field.                               */


/* RADIO_FREQUENCYCONFIG: Configuration of frequency control */
  #define RADIO_FREQUENCYCONFIG_ResetValue (0x80000001UL) /*!< Reset value of FREQUENCYCONFIG register.                        */

/* FSCHNOINCRSTEP @Bits 0..5 : Radio channel incremental step unit */
  #define RADIO_FREQUENCYCONFIG_FSCHNOINCRSTEP_Pos (0UL) /*!< Position of FSCHNOINCRSTEP field.                                */
  #define RADIO_FREQUENCYCONFIG_FSCHNOINCRSTEP_Msk (0x3FUL << RADIO_FREQUENCYCONFIG_FSCHNOINCRSTEP_Pos) /*!< Bit mask of
                                                                            FSCHNOINCRSTEP field.*/                               

/* BUFFEREDFSCH @Bit 31 : Set to high to buffer FREQUENCY register so that sub-modules in the MMI will only update next
                          frequency config at TX_EN, RX_EN and LB_EN. Set to low if special test is needed for FS test. */        
                                                                                                                                  
  #define RADIO_FREQUENCYCONFIG_BUFFEREDFSCH_Pos (31UL) /*!< Position of BUFFEREDFSCH field.                                   */
  #define RADIO_FREQUENCYCONFIG_BUFFEREDFSCH_Msk (0x1UL << RADIO_FREQUENCYCONFIG_BUFFEREDFSCH_Pos) /*!< Bit mask of BUFFEREDFSCH
                                                                            field.*/                                              


/* RADIO_TXPOWER: Output power */
  #define RADIO_TXPOWER_ResetValue (0x00000000UL)    /*!< Reset value of TXPOWER register.                                     */

/* TXPOWER @Bits 0..7 : RADIO output power */
  #define RADIO_TXPOWER_TXPOWER_Pos (0UL)            /*!< Position of TXPOWER field.                                           */
  #define RADIO_TXPOWER_TXPOWER_Msk (0xFFUL << RADIO_TXPOWER_TXPOWER_Pos) /*!< Bit mask of TXPOWER field.                      */
  #define RADIO_TXPOWER_TXPOWER_Min (0x0UL)          /*!< Min enumerator value of TXPOWER field.                               */
  #define RADIO_TXPOWER_TXPOWER_Max (0xFFUL)         /*!< Max enumerator value of TXPOWER field.                               */
  #define RADIO_TXPOWER_TXPOWER_Pos10dBm (0x0AUL)    /*!< +10 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Pos9dBm (0x09UL)     /*!< +9 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos8dBm (0x08UL)     /*!< +8 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos7dBm (0x07UL)     /*!< +7 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos6dBm (0x06UL)     /*!< +6 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos5dBm (0x05UL)     /*!< +5 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos4dBm (0x04UL)     /*!< +4 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos3dBm (0x03UL)     /*!< +3 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos2dBm (0x02UL)     /*!< +2 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos1dBm (0x01UL)     /*!< +1 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_0dBm (0x00UL)        /*!< 0 dBm                                                                */
  #define RADIO_TXPOWER_TXPOWER_Neg1dBm (0xFFUL)     /*!< -1 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Neg2dBm (0xFEUL)     /*!< -2 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Neg4dBm (0xFCUL)     /*!< -4 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Neg8dBm (0xF8UL)     /*!< -8 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Neg12dBm (0xF4UL)    /*!< -12 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg16dBm (0xF0UL)    /*!< -16 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg20dBm (0xECUL)    /*!< -20 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg30dBm (0xE2UL)    /*!< -30 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg40dBm (0xD8UL)    /*!< -40 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg70dBm (0xBAUL)    /*!< -70 dBm                                                              */


/* RADIO_TIFS: Interframe spacing in us */
  #define RADIO_TIFS_ResetValue (0x00000000UL)       /*!< Reset value of TIFS register.                                        */

/* TIFS @Bits 0..9 : Interframe spacing in us. Interframe space is the time interval between two consecutive packets. It is
                     defined as the time, in microseconds, from the end of the last bit of the previous packet to the start of
                     the first bit of the subsequent packet. */                                                                   
                                                                                                                                  
  #define RADIO_TIFS_TIFS_Pos (0UL)                  /*!< Position of TIFS field.                                              */
  #define RADIO_TIFS_TIFS_Msk (0x3FFUL << RADIO_TIFS_TIFS_Pos) /*!< Bit mask of TIFS field.                                    */


