adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FINALCALOFFSETQ @Bits 12..23 : ADC offset compensation of channel Q (unsigned) */
  #define RADIO_BITCONVERTER_FINALCALOFFSETQ_Pos (12UL) /*!< Position of FINALCALOFFSETQ field.                                */
  #define RADIO_BITCONVERTER_FINALCALOFFSETQ_Msk (0xFFFUL << RADIO_BITCONVERTER_FINALCALOFFSETQ_Pos) /*!< Bit mask of
                                                                            FINALCALOFFSETQ field.*/                              


/* RADIO_DATAACQVIADMA: Data acquisition settings. Only available when INCLUDE_DMA is set to 1 */
  #define RADIO_DATAACQVIADMA_ResetValue (0x00000000UL) /*!< Reset value of DATAACQVIADMA register.                            */

/* DATACAPTUREMODESELECT @Bits 0..1 : Which of 4 existing mode it is running (each mode correspond the a particular set of data
                                      to be logged) */                                                                            
                                                                                                                                  
  #define RADIO_DATAACQVIADMA_DATACAPTUREMODESELECT_Pos (0UL) /*!< Position of DATACAPTUREMODESELECT field.                    */
  #define RADIO_DATAACQVIADMA_DATACAPTUREMODESELECT_Msk (0x3UL << RADIO_DATAACQVIADMA_DATACAPTUREMODESELECT_Pos) /*!< Bit mask
                                                                            of DATACAPTUREMODESELECT field.*/                     

/* DATAACQENABLE @Bit 7 : Set high to enable data acquisition */
  #define RADIO_DATAACQVIADMA_DATAACQENABLE_Pos (7UL) /*!< Position of DATAACQENABLE field.                                    */
  #define RADIO_DATAACQVIADMA_DATAACQENABLE_Msk (0x1UL << RADIO_DATAACQVIADMA_DATAACQENABLE_Pos) /*!< Bit mask of DATAACQENABLE
                                                                            field.*/                                              


/* RADIO_MODESTANDALONE: Data rate and modulation when SPHYNX in standalone mode */
  #define RADIO_MODESTANDALONE_ResetValue (0x00000000UL) /*!< Reset value of MODESTANDALONE register.                          */

/* RADIOMODEINT @Bits 0..7 : Internal radio mode consists of sSel, zeroIf, deModN and mode[3:0] */
  #define RADIO_MODESTANDALONE_RADIOMODEINT_Pos (0UL) /*!< Position of RADIOMODEINT field.                                     */
  #define RADIO_MODESTANDALONE_RADIOMODEINT_Msk (0xFFUL << RADIO_MODESTANDALONE_RADIOMODEINT_Pos) /*!< Bit mask of RADIOMODEINT
                                                                            field.*/                                              

/* USERADIOMODEINT @Bit 31 : 0: use radioMode/radioModeUpdate from port (controlled from top), 1: use radioMode/radioModeUpdate
                             from registers in this IP */                                                                         
                                                                                                                                  
  #define RADIO_MODESTANDALONE_USERADIOMODEINT_Pos (31UL) /*!< Position of USERADIOMODEINT field.                              */
  #define RADIO_MODESTANDALONE_USERADIOMODEINT_Msk (0x1UL << RADIO_MODESTANDALONE_USERADIOMODEINT_Pos) /*!< Bit mask of
                                                                            USERADIOMODEINT field.*/                              


/* RADIO_DEBUGRADIOPHY: Debug for radio PHY */
  #define RADIO_DEBUGRADIOPHY_ResetValue (0x00000100UL) /*!< Reset value of DEBUGRADIOPHY register.                            */

/* OVRVALTXPWR @Bits 0..4 : Override value of TX_PWR_0V8 */
  #define RADIO_DEBUGRADIOPHY_OVRVALTXPWR_Pos (0UL)  /*!< Position of OVRVALTXPWR field.                                       */
  #define RADIO_DEBUGRADIOPHY_OVRVALTXPWR_Msk (0x1FUL << RADIO_DEBUGRADIOPHY_OVRVALTXPWR_Pos) /*!< Bit mask of OVRVALTXPWR
                                                                            field.*/                                              

/* OVRENTXPWR @Bit 7 : Enable override of TX_PWR_0V8 */
  #define RADIO_DEBUGRADIOPHY_OVRENTXPWR_Pos (7UL)   /*!< Position of OVRENTXPWR field.                                        */
  #define RADIO_DEBUGRADIOPHY_OVRENTXPWR_Msk (0x1UL << RADIO_DEBUGRADIOPHY_OVRENTXPWR_Pos) /*!< Bit mask of OVRENTXPWR field.  */

/* BUFFEREDTXPWR @Bit 8 : Set to high to buffer TXPOWER so that sub-modules in the MMI will only update next tx power config at
                          TX_EN, RX_EN and LB_EN. Set to low if special test is needed for Tx test. */                            
                                                                                                                                  
  #define RADIO_DEBUGRADIOPHY_BUFFEREDTXPWR_Pos (8UL) /*!< Position of BUFFEREDTXPWR field.                                    */
  #define RADIO_DEBUGRADIOPHY_BUFFEREDTXPWR_Msk (0x1UL << RADIO_DEBUGRADIOPHY_BUFFEREDTXPWR_Pos) /*!< Bit mask of BUFFEREDTXPWR
                                                                            field.*/                                              

/* TIEADCBITOZERO @Bit 9 : 0: output normal adcBinaryBI, 1: tie adcBinaryBI to zero */
  #define RADIO_DEBUGRADIOPHY_TIEADCBITOZERO_Pos (9UL) /*!< Position of TIEADCBITOZERO field.                                  */
  #define RADIO_DEBUGRADIOPHY_TIEADCBITOZERO_Msk (0x1UL << RADIO_DEBUGRADIOPHY_TIEADCBITOZERO_Pos) /*!< Bit mask of
                                                                            TIEADCBITOZERO field.*/                               

/* TIEADCBQTOZERO @Bit 10 : 0: output normal adcBinaryBQ, 1: tie adcBinaryBQ to zero */
  #define RADIO_DEBUGRADIOPHY_TIEADCBQTOZERO_Pos (10UL) /*!< Position of TIEADCBQTOZERO field.                                 */
  #define RADIO_DEBUGRADIOPHY_TIEADCBQTOZERO_Msk (0x1UL << RADIO_DEBUGRADIOPHY_TIEADCBQTOZERO_Pos) /*!< Bit mask of
                                                                            TIEADCBQTOZERO field.*/                               

/* RFMIXINVERTSIGNBIT @Bit 11 : 1: Invert the sign bit of calibration code for DC offset calibration(invert DCCAL[4]). This
                                inverts both channel I and Q. */                                                                  
                                                                                                                                  
  #define RADIO_DEBUGRADIOPHY_RFMIXINVERTSIGNBIT_Pos (11UL) /*!< Position of RFMIXINVERTSIGNBIT field.                         */
  #define RADIO_DEBUGRADIOPHY_RFMIXINVERTSIGNBIT_Msk (0x1UL << RADIO_DEBUGRADIOPHY_RFMIXINVERTSIGNBIT_Pos) /*!< Bit mask of
                                                                            RFMIXINVERTSIGNBIT field.*/                           

/* SHORTRCCALCODETOAAFRCTRIM @Bit 12 : 1: short RCCAL_CODE[3:0] to RX_AAF_RCTRIMM[3:0] */
  #define RADIO_DEBUGRADIOPHY_SHORTRCCALCODETOAAFRCTRIM_Pos (12UL) /*!< Position of SHORTRCCALCODETOAAFRCTRIM field.           */
  #define RADIO_DEBUGRADIOPHY_SHORTRCCALCODETOAAFRCTRIM_Msk (0x1UL << RADIO_DEBUGRADIOPHY_SHORTRCCALCODETOAAFRCTRIM_Pos) /*!<
                                                                            Bit mask of SHORTRCCALCODETOAAFRCTRIM field.*/        


/* RADIO_ADPLLCOMMAND: Send or receive command directly to the AdPll digital island. Only write to this register when
                        FSASYNCBUSBUSY returns 0 */                                                                               
                                                                                                                                  
  #define RADIO_ADPLLCOMMAND_ResetValue (0x00000000UL) /*!< Reset value of ADPLLCOMMAND register.                              */

/* ADPLLCOMMAND @Bits 0..27 : Controls the asynch interface, bits[27:16] are address, bits [15:0] are command/data field */
  #define RADIO_ADPLLCOMMAND_ADPLLCOMMAND_Pos (0UL)  /*!< Position of ADPLLCOMMAND field.                                      */
  #define RADIO_ADPLLCOMMAND_ADPLLCOMMAND_Msk (0xFFFFFFFUL << RADIO_ADPLLCOMMAND_ADPLLCOMMAND_Pos) /*!< Bit mask of ADPLLCOMMAND
                                                                            field.*/                                              

/* READ @Bit 31 : When 1, a read transaction is initiated. When the event COMPLETETRANS is set, read back this register */
  #define RADIO_ADPLLCOMMAND_READ_Pos (31UL)         /*!< Position of READ field.                                              */
  #define RADIO_ADPLLCOMMAND_READ_Msk (0x1UL << RADIO_ADPLLCOMMAND_READ_Pos) /*!< Bit mask of READ field.                      */


/* RADIO_FSFREQFINETUNE: Allows fine-tuning the RF frequency with a very fine resolution */
  #define RADIO_FSFREQFINETUNE_ResetValue (0x00000000UL) /*!< Reset value of FSFREQFINETUNE register.                          */

/* FSFREQFINETUNE @Bits 0..12 : 2-complement number for fine-tuning the frequency in steps of 488.28 Hz */
  #define RADIO_FSFREQFINETUNE_FSFREQFINETUNE_Pos (0UL) /*!< Position of FSFREQFINETUNE field.                                 */
  #define RADIO_FSFREQFINETUNE_FSFREQFINETUNE_Msk (0x1FFFUL << RADIO_FSFREQFINETUNE_FSFREQFINETUNE_Pos) /*!< Bit mask of
                                                                            FSFREQFINETUNE field.*/                               


/* RADIO_DEVIATION: Frequency deviation for modulation */
  #define RADIO_DEVIATION_ResetValue (0x00000055UL)  /*!< Reset value of DEVIATION register.                                   */

/* DEVIATION @Bits 0..9 : Frequency deviation for modulation */
  #define RADIO_DEVIATION_DEVIATION_Pos (0UL)        /*!< Position of DEVIATION field.                                         */
  #define RADIO_DEVIATION_DEVIATION_Msk (0x3FFUL << RADIO_DEVIATION_DEVIATION_Pos) /*!< Bit mask of DEVIATION field.           */


