adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_MODRATE: Select modulation rate */
  #define RADIO_MODRATE_ResetValue (0x00000002UL)    /*!< Reset value of MODRATE register.                                     */

/* MODRATE @Bits 0..2 : Select modulation rate */
  #define RADIO_MODRATE_MODRATE_Pos (0UL)            /*!< Position of MODRATE field.                                           */
  #define RADIO_MODRATE_MODRATE_Msk (0x7UL << RADIO_MODRATE_MODRATE_Pos) /*!< Bit mask of MODRATE field.                       */
  #define RADIO_MODRATE_MODRATE_Min (0x0UL)          /*!< Min enumerator value of MODRATE field.                               */
  #define RADIO_MODRATE_MODRATE_Max (0x4UL)          /*!< Max enumerator value of MODRATE field.                               */
  #define RADIO_MODRATE_MODRATE_250Kbit (0x0UL)      /*!< 250 kbps                                                             */
  #define RADIO_MODRATE_MODRATE_500Kbit (0x1UL)      /*!< 500 kbps                                                             */
  #define RADIO_MODRATE_MODRATE_1Mbit (0x2UL)        /*!< 1 Mbps                                                               */
  #define RADIO_MODRATE_MODRATE_2Mbit (0x3UL)        /*!< 2 Mbps                                                               */
  #define RADIO_MODRATE_MODRATE_4Mbit (0x4UL)        /*!< 4 Mbps                                                               */


/* RADIO_MODFILTERING: Select gaussian filtering mode */
  #define RADIO_MODFILTERING_ResetValue (0x00000002UL) /*!< Reset value of MODFILTERING register.                              */

/* MODFILTERING @Bits 0..2 : Select gaussian filtering mode */
  #define RADIO_MODFILTERING_MODFILTERING_Pos (0UL)  /*!< Position of MODFILTERING field.                                      */
  #define RADIO_MODFILTERING_MODFILTERING_Msk (0x7UL << RADIO_MODFILTERING_MODFILTERING_Pos) /*!< Bit mask of MODFILTERING
                                                                            field.*/                                              
  #define RADIO_MODFILTERING_MODFILTERING_Min (0x0UL) /*!< Min enumerator value of MODFILTERING field.                         */
  #define RADIO_MODFILTERING_MODFILTERING_Max (0x3UL) /*!< Max enumerator value of MODFILTERING field.                         */
  #define RADIO_MODFILTERING_MODFILTERING_None (0x0UL) /*!< No filtering                                                       */
  #define RADIO_MODFILTERING_MODFILTERING_1bt00 (0x1UL) /*!< Gfsk Bt=1.00                                                      */
  #define RADIO_MODFILTERING_MODFILTERING_0bt60 (0x2UL) /*!< Gfsk Bt=0.60                                                      */
  #define RADIO_MODFILTERING_MODFILTERING_2bt00 (0x3UL) /*!< Gfsk Bt=2.00                                                      */


/* RADIO_CUSTOMMODULATION: Enable reading from memory and passing data over to AdPll */
  #define RADIO_CUSTOMMODULATION_ResetValue (0x00000000UL) /*!< Reset value of CUSTOMMODULATION register.                      */

/* ENABLE @Bit 0 : Enable reading from memory and passing data over to AdPll */
  #define RADIO_CUSTOMMODULATION_ENABLE_Pos (0UL)    /*!< Position of ENABLE field.                                            */
  #define RADIO_CUSTOMMODULATION_ENABLE_Msk (0x1UL << RADIO_CUSTOMMODULATION_ENABLE_Pos) /*!< Bit mask of ENABLE field.        */
  #define RADIO_CUSTOMMODULATION_ENABLE_Min (0x0UL)  /*!< Min enumerator value of ENABLE field.                                */
  #define RADIO_CUSTOMMODULATION_ENABLE_Max (0x1UL)  /*!< Max enumerator value of ENABLE field.                                */
  #define RADIO_CUSTOMMODULATION_ENABLE_Disabled (0x0UL) /*!< Custom modulation disabled                                       */
  #define RADIO_CUSTOMMODULATION_ENABLE_Enabled (0x1UL) /*!< Custom modulation enabled                                         */

/* CIRCULARDMA @Bit 30 : If set to 1, the END event of the DMA will trigger the START task in order to transmit the same data
                         over and over again (only works if DmaChannelPeripheral is inside AdPllCompanion) */                     
                                                                                                                                  
  #define RADIO_CUSTOMMODULATION_CIRCULARDMA_Pos (30UL) /*!< Position of CIRCULARDMA field.                                    */
  #define RADIO_CUSTOMMODULATION_CIRCULARDMA_Msk (0x1UL << RADIO_CUSTOMMODULATION_CIRCULARDMA_Pos) /*!< Bit mask of CIRCULARDMA
                                                                            field.*/                                              


/* RADIO_FSCLOCKSELECT: Set the clock source for the AdPll digital island */
  #define RADIO_FSCLOCKSELECT_ResetValue (0x00000001UL) /*!< Reset value of FSCLOCKSELECT register.                            */

/* INTERNAL @Bits 0..1 : Set the clock source for the AdPll digital island when fsStart is high */
  #define RADIO_FSCLOCKSELECT_INTERNAL_Pos (0UL)     /*!< Position of INTERNAL field.                                          */
  #define RADIO_FSCLOCKSELECT_INTERNAL_Msk (0x3UL << RADIO_FSCLOCKSELECT_INTERNAL_Pos) /*!< Bit mask of INTERNAL field.        */

/* CORE @Bits 2..3 : Set the clock source for the AdPll digital island when fsStart is low */
  #define RADIO_FSCLOCKSELECT_CORE_Pos (2UL)         /*!< Position of CORE field.                                              */
  #define RADIO_FSCLOCKSELECT_CORE_Msk (0x3UL << RADIO_FSCLOCKSELECT_CORE_Pos) /*!< Bit mask of CORE field.                    */

/* STOP @Bit 8 : Force-stopping the clock internally in the AdPll island */
  #define RADIO_FSCLOCKSELECT_STOP_Pos (8UL)         /*!< Position of STOP field.                                              */
  #define RADIO_FSCLOCKSELECT_STOP_Msk (0x1UL << RADIO_FSCLOCKSELECT_STOP_Pos) /*!< Bit mask of STOP field.                    */

/* OVRVAL @Bit 30 : Used instead of 'fsStart' if FSCLOCKSELECT.OVREN is set */
  #define RADIO_FSCLOCKSELECT_OVRVAL_Pos (30UL)      /*!< Position of OVRVAL field.                                            */
  #define RADIO_FSCLOCKSELECT_OVRVAL_Msk (0x1UL << RADIO_FSCLOCKSELECT_OVRVAL_Pos) /*!< Bit mask of OVRVAL field.              */

