adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* OVREN @Bit 31 : Override enable for setting the clock switch. If 0, fsStart decides which clock to use. If 1,
                   FSCLOCKSELECT.OVRVAL selects which clock to use */                                                             
                                                                                                                                  
  #define RADIO_FSCLOCKSELECT_OVREN_Pos (31UL)       /*!< Position of OVREN field.                                             */
  #define RADIO_FSCLOCKSELECT_OVREN_Msk (0x1UL << RADIO_FSCLOCKSELECT_OVREN_Pos) /*!< Bit mask of OVREN field.                 */


/* RADIO_FSUNITRIGCALVAL: Read the calibrated value for the universal trigger */
  #define RADIO_FSUNITRIGCALVAL_ResetValue (0x00000000UL) /*!< Reset value of FSUNITRIGCALVAL register.                        */

/* FSUNITRIGCALVAL @Bits 0..4 : Read the calibrated value for the universal trigger */
  #define RADIO_FSUNITRIGCALVAL_FSUNITRIGCALVAL_Pos (0UL) /*!< Position of FSUNITRIGCALVAL field.                              */
  #define RADIO_FSUNITRIGCALVAL_FSUNITRIGCALVAL_Msk (0x1FUL << RADIO_FSUNITRIGCALVAL_FSUNITRIGCALVAL_Pos) /*!< Bit mask of
                                                                            FSUNITRIGCALVAL field.*/                              


/* RADIO_FSUNITRIGMANUAL: Manual control of the uni trigger signals. Note that fsUniTriggerCalWord is controlled by writing to
                           the separate register FSUNITRIGCALVAL */                                                               
                                                                                                                                  
  #define RADIO_FSUNITRIGMANUAL_ResetValue (0x00000000UL) /*!< Reset value of FSUNITRIGMANUAL register.                        */

/* ENABLEMANUAL @Bit 0 : Enable manual control */
  #define RADIO_FSUNITRIGMANUAL_ENABLEMANUAL_Pos (0UL) /*!< Position of ENABLEMANUAL field.                                    */
  #define RADIO_FSUNITRIGMANUAL_ENABLEMANUAL_Msk (0x1UL << RADIO_FSUNITRIGMANUAL_ENABLEMANUAL_Pos) /*!< Bit mask of ENABLEMANUAL
                                                                            field.*/                                              

/* FSUNITRIGGER @Bit 1 : The fsUniTrigger signal when using manual control */
  #define RADIO_FSUNITRIGMANUAL_FSUNITRIGGER_Pos (1UL) /*!< Position of FSUNITRIGGER field.                                    */
  #define RADIO_FSUNITRIGMANUAL_FSUNITRIGGER_Msk (0x1UL << RADIO_FSUNITRIGMANUAL_FSUNITRIGGER_Pos) /*!< Bit mask of FSUNITRIGGER
                                                                            field.*/                                              

/* FSUNITRIGGERCALEN @Bit 2 : The fsUniTriggerCalEn signal when using manual control */
  #define RADIO_FSUNITRIGMANUAL_FSUNITRIGGERCALEN_Pos (2UL) /*!< Position of FSUNITRIGGERCALEN field.                          */
  #define RADIO_FSUNITRIGMANUAL_FSUNITRIGGERCALEN_Msk (0x1UL << RADIO_FSUNITRIGMANUAL_FSUNITRIGGERCALEN_Pos) /*!< Bit mask of
                                                                            FSUNITRIGGERCALEN field.*/                            

/* FSUNITRIGGERSRC @Bits 8..14 : The fsUniTriggerCalSrc signal when using manual control */
  #define RADIO_FSUNITRIGMANUAL_FSUNITRIGGERSRC_Pos (8UL) /*!< Position of FSUNITRIGGERSRC field.                              */
  #define RADIO_FSUNITRIGMANUAL_FSUNITRIGGERSRC_Msk (0x7FUL << RADIO_FSUNITRIGMANUAL_FSUNITRIGGERSRC_Pos) /*!< Bit mask of
                                                                            FSUNITRIGGERSRC field.*/                              


/* RADIO_FSUNITRIGCALOUT: Read the signal directly from fsUniTriggerCalOut */
  #define RADIO_FSUNITRIGCALOUT_ResetValue (0x00000000UL) /*!< Reset value of FSUNITRIGCALOUT register.                        */

/* FSUNITRIGCALOUT @Bits 0..1 : Read the raw fsUniTriggerCalOut value */
  #define RADIO_FSUNITRIGCALOUT_FSUNITRIGCALOUT_Pos (0UL) /*!< Position of FSUNITRIGCALOUT field.                              */
  #define RADIO_FSUNITRIGCALOUT_FSUNITRIGCALOUT_Msk (0x3UL << RADIO_FSUNITRIGCALOUT_FSUNITRIGCALOUT_Pos) /*!< Bit mask of
                                                                            FSUNITRIGCALOUT field.*/                              


/* RADIO_FSASYNCBUSCONF: Some special settings for the asynchronous bus configuration */
  #define RADIO_FSASYNCBUSCONF_ResetValue (0x00000004UL) /*!< Reset value of FSASYNCBUSCONF register.                          */

/* CHECKSTATUS @Bit 0 : When 1, every write transaction uses 8 x 32 MHz clock cycles instead of 4 x 32 MHz clock cycles.
                        Confirmation is received whether the transaction was actually received by AdPll. */                       
                                                                                                                                  
  #define RADIO_FSASYNCBUSCONF_CHECKSTATUS_Pos (0UL) /*!< Position of CHECKSTATUS field.                                       */
  #define RADIO_FSASYNCBUSCONF_CHECKSTATUS_Msk (0x1UL << RADIO_FSASYNCBUSCONF_CHECKSTATUS_Pos) /*!< Bit mask of CHECKSTATUS
                                                                            field.*/                                              

/* DISABLEAUTOSETTING @Bit 1 : Do not send settings at the beginning to AdPll */
  #define RADIO_FSASYNCBUSCONF_DISABLEAUTOSETTING_Pos (1UL) /*!< Position of DISABLEAUTOSETTING field.                         */
  #define RADIO_FSASYNCBUSCONF_DISABLEAUTOSETTING_Msk (0x1UL << RADIO_FSASYNCBUSCONF_DISABLEAUTOSETTING_Pos) /*!< Bit mask of
                                                                            DISABLEAUTOSETTING field.*/                           

/* CHECKSTATUSAUTO @Bit 2 : When 1, check the first transaction during sending auto. If errorenous stop the state machine */
  #define RADIO_FSASYNCBUSCONF_CHECKSTATUSAUTO_Pos (2UL) /*!< Position of CHECKSTATUSAUTO field.                               */
  #define RADIO_FSASYNCBUSCONF_CHECKSTATUSAUTO_Msk (0x1UL << RADIO_FSASYNCBUSCONF_CHECKSTATUSAUTO_Pos) /*!< Bit mask of
                                                                            CHECKSTATUSAUTO field.*/                              

/* IGNORECLOCKSTARTED @Bit 3 : The bus scheduler will not wait for AdPll to say clockStarted */
  #define RADIO_FSASYNCBUSCONF_IGNORECLOCKSTARTED_Pos (3UL) /*!< Position of IGNORECLOCKSTARTED field.                         */
  #define RADIO_FSASYNCBUSCONF_IGNORECLOCKSTARTED_Msk (0x1UL << RADIO_FSASYNCBUSCONF_IGNORECLOCKSTARTED_Pos) /*!< Bit mask of
                                                                            IGNORECLOCKSTARTED field.*/                           


/* RADIO_FSASYNCBUSBUSY: Status bit indicating whether the bus is currently busy or not */
  #define RADIO_FSASYNCBUSBUSY_ResetValue (0x00000001UL) /*!< Reset value of FSASYNCBUSBUSY register.                          */

/* FSASYNCBUSBUSY @Bit 0 : Whether the bus is currently busy or not */
  #define RADIO_FSASYNCBUSBUSY_FSASYNCBUSBUSY_Pos (0UL) /*!< Position of FSASYNCBUSBUSY field.                                 */
  #define RADIO_FSASYNCBUSBUSY_FSASYNCBUSBUSY_Msk (0x1UL << RADIO_FSASYNCBUSBUSY_FSASYNCBUSBUSY_Pos) /*!< Bit mask of
                                                                            FSASYNCBUSBUSY field.*/                               


/* RADIO_ADPLLCOMPANIONBACKDOORS: This value is written to the AdPll when powering up the digital island */
  #define RADIO_ADPLLCOMPANIONBACKDOORS_ResetValue (0x00000310UL) /*!< Reset value of ADPLLCOMPANIONBACKDOORS register.        */

/* FLIPSSEL @Bit 0 : If 0, we flip the interpretation of the sSel signal (to work around a bug if we have managed to flip it
                     somewhere in the design process) */                                                                          
                                                                                                                                  
  #define RADIO_ADPLLCOMPANIONBACKDOORS_FLIPSSEL_Pos (0UL) /*!< Position of FLIPSSEL field.                                    */
  #define RADIO_ADPLLCOMPANIONBACKDOORS_FLIPSSEL_Msk (0x1UL << RADIO_ADPLLCOMPANIONBACKDOORS_FLIPSSEL_Pos) /*!< Bit mask of
                                                                            FLIPSSEL field.*/                                     

/* REQUESTCLOCKOVERRIDE @Bit 1 : In normal operation we request clock when pwrupFsLdoDig0 is set. By setting this to 1, we will
                                 request clock even when pwrupFsLdoDig0. This may be useful for current measurements of FS_DIG */ 
                                                                                                                                  
  #define RADIO_ADPLLCOMPANIONBACKDOORS_REQUESTCLOCKOVERRIDE_Pos (1UL) /*!< Position of REQUESTCLOCKOVERRIDE field.            */
  #define RADIO_ADPLLCOMPANIONBACKDOORS_REQUESTCLOCKOVERRIDE_Msk (0x1UL << RADIO_ADPLLCOMPANIONBACKDOORS_REQUESTCLOCKOVERRIDE_Pos)
                                                                            /*!< Bit mask of REQUESTCLOCKOVERRIDE field.*/        

/* OVRENCK32MCORE @Bit 2 : Make it possible to manually control whether ck32MCore is sent to the AdPll digital island. Needed to
                           test complete clock silence in the AdPll island. It can also be used to enable the clock activity on
                           the clock net even when the clock is not selected. */                                                  
                                                                                                                                  
  #define RADIO_ADPLLCOMPANIONBACKDOORS_OVRENCK32MCORE_Pos (2UL) /*!< Position of OVRENCK32MCORE field.                        */
  #define RADIO_ADPLLCOMPANIONBACKDOORS_OVRENCK32MCORE_Msk (0x1UL << RADIO_ADPLLCOMPANIONBACKDOORS_OVRENCK32MCORE_Pos) /*!< Bit
                                                                            mask of OVRENCK32MCORE field.*/                       

/* OVRVALCK32MCORE @Bit 3 : Whether ck32MCore is active or not when OVRENCK32MCORE is set. See also description of
                            OVRENCK32MCORE */                                                                                     
                                                                                                                                  
