adamkondraciuk/nrfx/mdk/nrf7140_types.h
  #define RADIO_ADPLLCOMPANIONBACKDOORS_OVRVALCK32MCORE_Pos (3UL) /*!< Position of OVRVALCK32MCORE field.                      */
  #define RADIO_ADPLLCOMPANIONBACKDOORS_OVRVALCK32MCORE_Msk (0x1UL << RADIO_ADPLLCOMPANIONBACKDOORS_OVRVALCK32MCORE_Pos) /*!<
                                                                            Bit mask of OVRVALCK32MCORE field.*/                  

/* ONTHEFLYWILLTRIGGER @Bits 4..5 : 0: no relock, 1: first gear of TRK, 2: back to ACQ, 3: back to full lock */
  #define RADIO_ADPLLCOMPANIONBACKDOORS_ONTHEFLYWILLTRIGGER_Pos (4UL) /*!< Position of ONTHEFLYWILLTRIGGER field.              */
  #define RADIO_ADPLLCOMPANIONBACKDOORS_ONTHEFLYWILLTRIGGER_Msk (0x3UL << RADIO_ADPLLCOMPANIONBACKDOORS_ONTHEFLYWILLTRIGGER_Pos)
                                                                            /*!< Bit mask of ONTHEFLYWILLTRIGGER field.*/         

/* RELOADFREQWILLTRIGGER @Bits 8..9 : 0: no relock, 1: first gear of TRK, 2: back to ACQ, 3: back to full lock */
  #define RADIO_ADPLLCOMPANIONBACKDOORS_RELOADFREQWILLTRIGGER_Pos (8UL) /*!< Position of RELOADFREQWILLTRIGGER field.          */
  #define RADIO_ADPLLCOMPANIONBACKDOORS_RELOADFREQWILLTRIGGER_Msk (0x3UL << RADIO_ADPLLCOMPANIONBACKDOORS_RELOADFREQWILLTRIGGER_Pos)
                                                                            /*!< Bit mask of RELOADFREQWILLTRIGGER field.*/       


/* RADIO_EXPECTEDPVTTOTRATIO: This value is written to the AdPll when powering up the digital island */
  #define RADIO_EXPECTEDPVTTOTRATIO_ResetValue (0x80000000UL) /*!< Reset value of EXPECTEDPVTTOTRATIO register.                */

/* EXPECTEDPVTTOTRATIO @Bits 0..8 : The ratio between PVT and the total cap ratio. Used for Estkmod, Estkdtc and TdcReadout */
  #define RADIO_EXPECTEDPVTTOTRATIO_EXPECTEDPVTTOTRATIO_Pos (0UL) /*!< Position of EXPECTEDPVTTOTRATIO field.                  */
  #define RADIO_EXPECTEDPVTTOTRATIO_EXPECTEDPVTTOTRATIO_Msk (0x1FFUL << RADIO_EXPECTEDPVTTOTRATIO_EXPECTEDPVTTOTRATIO_Pos) /*!<
                                                                            Bit mask of EXPECTEDPVTTOTRATIO field.*/              

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_EXPECTEDPVTTOTRATIO_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field.                             */
  #define RADIO_EXPECTEDPVTTOTRATIO_DONOTTRANSFER_Msk (0x1UL << RADIO_EXPECTEDPVTTOTRATIO_DONOTTRANSFER_Pos) /*!< Bit mask of
                                                                            DONOTTRANSFER field.*/                                


/* RADIO_ESTKDTCVAL: This value is written to the AdPll when powering up the digital island */
  #define RADIO_ESTKDTCVAL_ResetValue (0x80000000UL) /*!< Reset value of ESTKDTCVAL register.                                  */

/* ESTKDTVAL @Bits 0..11 : The estimated kDTV value in typical */
  #define RADIO_ESTKDTCVAL_ESTKDTVAL_Pos (0UL)       /*!< Position of ESTKDTVAL field.                                         */
  #define RADIO_ESTKDTCVAL_ESTKDTVAL_Msk (0xFFFUL << RADIO_ESTKDTCVAL_ESTKDTVAL_Pos) /*!< Bit mask of ESTKDTVAL field.         */

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_ESTKDTCVAL_DONOTTRANSFER_Pos (31UL)  /*!< Position of DONOTTRANSFER field.                                     */
  #define RADIO_ESTKDTCVAL_DONOTTRANSFER_Msk (0x1UL << RADIO_ESTKDTCVAL_DONOTTRANSFER_Pos) /*!< Bit mask of DONOTTRANSFER
                                                                            field.*/                                              


/* RADIO_TXINTERFACEHFGAIN: This value is written to the AdPll when powering up the digital island */
  #define RADIO_TXINTERFACEHFGAIN_ResetValue (0x80000000UL) /*!< Reset value of TXINTERFACEHFGAIN register.                    */

/* TXINTERFACEHFGAIN @Bits 0..9 : The gain for the HF path */
  #define RADIO_TXINTERFACEHFGAIN_TXINTERFACEHFGAIN_Pos (0UL) /*!< Position of TXINTERFACEHFGAIN field.                        */
  #define RADIO_TXINTERFACEHFGAIN_TXINTERFACEHFGAIN_Msk (0x3FFUL << RADIO_TXINTERFACEHFGAIN_TXINTERFACEHFGAIN_Pos) /*!< Bit mask
                                                                            of TXINTERFACEHFGAIN field.*/                         

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_TXINTERFACEHFGAIN_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field.                               */
  #define RADIO_TXINTERFACEHFGAIN_DONOTTRANSFER_Msk (0x1UL << RADIO_TXINTERFACEHFGAIN_DONOTTRANSFER_Pos) /*!< Bit mask of
                                                                            DONOTTRANSFER field.*/                                


/* RADIO_TRACING: Enable tracing from AdPll */
  #define RADIO_TRACING_ResetValue (0x00000000UL)    /*!< Reset value of TRACING register.                                     */

/* ENABLE @Bit 0 : Enable tracing from AdPll */
  #define RADIO_TRACING_ENABLE_Pos (0UL)             /*!< Position of ENABLE field.                                            */
  #define RADIO_TRACING_ENABLE_Msk (0x1UL << RADIO_TRACING_ENABLE_Pos) /*!< Bit mask of ENABLE field.                          */


/* RADIO_IFFREQ: Select between two different IF frequencies */
  #define RADIO_IFFREQ_ResetValue (0x00000000UL)     /*!< Reset value of IFFREQ register.                                      */

/* IFFREQ @Bits 0..1 : Select which IF frequency to use */
  #define RADIO_IFFREQ_IFFREQ_Pos (0UL)              /*!< Position of IFFREQ field.                                            */
  #define RADIO_IFFREQ_IFFREQ_Msk (0x3UL << RADIO_IFFREQ_IFFREQ_Pos) /*!< Bit mask of IFFREQ field.                            */
  #define RADIO_IFFREQ_IFFREQ_Min (0x0UL)            /*!< Min enumerator value of IFFREQ field.                                */
  #define RADIO_IFFREQ_IFFREQ_Max (0x3UL)            /*!< Max enumerator value of IFFREQ field.                                */
  #define RADIO_IFFREQ_IFFREQ_1MHz (0x0UL)           /*!< 1 MHz IF                                                             */
  #define RADIO_IFFREQ_IFFREQ_2MHz (0x1UL)           /*!< 2 MHz IF                                                             */
  #define RADIO_IFFREQ_IFFREQ_4MHz (0x3UL)           /*!< 4 MHz IF                                                             */


/* RADIO_ADPLLCOMPANIONSTATE: State in the AdPllCompanion state machines */
  #define RADIO_ADPLLCOMPANIONSTATE_ResetValue (0x00000000UL) /*!< Reset value of ADPLLCOMPANIONSTATE register.                */

/* BUSSCHEDULERSTATE @Bits 0..2 : The state of the state machine which sends commands automatically at startup */
  #define RADIO_ADPLLCOMPANIONSTATE_BUSSCHEDULERSTATE_Pos (0UL) /*!< Position of BUSSCHEDULERSTATE field.                      */
  #define RADIO_ADPLLCOMPANIONSTATE_BUSSCHEDULERSTATE_Msk (0x7UL << RADIO_ADPLLCOMPANIONSTATE_BUSSCHEDULERSTATE_Pos) /*!< Bit
                                                                            mask of BUSSCHEDULERSTATE field.*/                    

/* BUSMASTERSTATE @Bits 4..5 : The state of the async bus master */
  #define RADIO_ADPLLCOMPANIONSTATE_BUSMASTERSTATE_Pos (4UL) /*!< Position of BUSMASTERSTATE field.                            */
  #define RADIO_ADPLLCOMPANIONSTATE_BUSMASTERSTATE_Msk (0x3UL << RADIO_ADPLLCOMPANIONSTATE_BUSMASTERSTATE_Pos) /*!< Bit mask of
                                                                            BUSMASTERSTATE field.*/                               

/* CLOCKSWITCHSTATE @Bits 8..9 : The state of the clock switching state machine */
  #define RADIO_ADPLLCOMPANIONSTATE_CLOCKSWITCHSTATE_Pos (8UL) /*!< Position of CLOCKSWITCHSTATE field.                        */
  #define RADIO_ADPLLCOMPANIONSTATE_CLOCKSWITCHSTATE_Msk (0x3UL << RADIO_ADPLLCOMPANIONSTATE_CLOCKSWITCHSTATE_Pos) /*!< Bit mask
                                                                            of CLOCKSWITCHSTATE field.*/                          

/* UNITRIGCALSTATE @Bits 12..14 : The state of the universal trigger calibration routine */
  #define RADIO_ADPLLCOMPANIONSTATE_UNITRIGCALSTATE_Pos (12UL) /*!< Position of UNITRIGCALSTATE field.                         */
  #define RADIO_ADPLLCOMPANIONSTATE_UNITRIGCALSTATE_Msk (0x7UL << RADIO_ADPLLCOMPANIONSTATE_UNITRIGCALSTATE_Pos) /*!< Bit mask
                                                                            of UNITRIGCALSTATE field.*/                           


