adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_RELOADFREQINTERNAL: Non-official task: AdPll will reread the frequency input signal */
  #define RADIO_RELOADFREQINTERNAL_ResetValue (0x00000000UL) /*!< Reset value of RELOADFREQINTERNAL register.                  */

/* TRIGGER @Bit 0 : (unspecified) */
  #define RADIO_RELOADFREQINTERNAL_TRIGGER_Pos (0UL) /*!< Position of TRIGGER field.                                           */
  #define RADIO_RELOADFREQINTERNAL_TRIGGER_Msk (0x1UL << RADIO_RELOADFREQINTERNAL_TRIGGER_Pos) /*!< Bit mask of TRIGGER field. */


/* RADIO_UNITRIGCALSTART: Non-official task: Start automatic universal trigger calibration */
  #define RADIO_UNITRIGCALSTART_ResetValue (0x00000000UL) /*!< Reset value of UNITRIGCALSTART register.                        */

/* TRIGGER @Bit 0 : (unspecified) */
  #define RADIO_UNITRIGCALSTART_TRIGGER_Pos (0UL)    /*!< Position of TRIGGER field.                                           */
  #define RADIO_UNITRIGCALSTART_TRIGGER_Msk (0x1UL << RADIO_UNITRIGCALSTART_TRIGGER_Pos) /*!< Bit mask of TRIGGER field.       */


/* RADIO_FSSENDSETTINGS: Non-official task: Send the auto-settings to AdPll again. This also happens at every startup */
  #define RADIO_FSSENDSETTINGS_ResetValue (0x00000000UL) /*!< Reset value of FSSENDSETTINGS register.                          */

/* TRIGGER @Bit 0 : (unspecified) */
  #define RADIO_FSSENDSETTINGS_TRIGGER_Pos (0UL)     /*!< Position of TRIGGER field.                                           */
  #define RADIO_FSSENDSETTINGS_TRIGGER_Msk (0x1UL << RADIO_FSSENDSETTINGS_TRIGGER_Pos) /*!< Bit mask of TRIGGER field.         */


/* RADIO_CHANGEPHASEINTERNAL: Non-official task: AdPll will change the phase as given by the internal AdPll register
                               PHASE_CHANGE */                                                                                    
                                                                                                                                  
  #define RADIO_CHANGEPHASEINTERNAL_ResetValue (0x00000000UL) /*!< Reset value of CHANGEPHASEINTERNAL register.                */

/* TRIGGER @Bit 0 : (unspecified) */
  #define RADIO_CHANGEPHASEINTERNAL_TRIGGER_Pos (0UL) /*!< Position of TRIGGER field.                                          */
  #define RADIO_CHANGEPHASEINTERNAL_TRIGGER_Msk (0x1UL << RADIO_CHANGEPHASEINTERNAL_TRIGGER_Pos) /*!< Bit mask of TRIGGER
                                                                            field.*/                                              


/* RADIO_UNITRIGCALDONE: Non-official event: Start automatic universal trigger calibration */
  #define RADIO_UNITRIGCALDONE_ResetValue (0x00000000UL) /*!< Reset value of UNITRIGCALDONE register.                          */

/* VAL @Bit 0 : (unspecified) */
  #define RADIO_UNITRIGCALDONE_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define RADIO_UNITRIGCALDONE_VAL_Msk (0x1UL << RADIO_UNITRIGCALDONE_VAL_Pos) /*!< Bit mask of VAL field.                     */


/* RADIO_REJECTEDTRANS: Non-official event: The command written to AdPll was rejected because of an ongoing transaction */
  #define RADIO_REJECTEDTRANS_ResetValue (0x00000000UL) /*!< Reset value of REJECTEDTRANS register.                            */

/* VAL @Bit 0 : (unspecified) */
  #define RADIO_REJECTEDTRANS_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define RADIO_REJECTEDTRANS_VAL_Msk (0x1UL << RADIO_REJECTEDTRANS_VAL_Pos) /*!< Bit mask of VAL field.                       */


/* RADIO_COMPLETETRANS: Non-official event: Completed a transaction to AdPll successfully (only when CHECKSTATUS is set) */
  #define RADIO_COMPLETETRANS_ResetValue (0x00000000UL) /*!< Reset value of COMPLETETRANS register.                            */

/* VAL @Bit 0 : (unspecified) */
  #define RADIO_COMPLETETRANS_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define RADIO_COMPLETETRANS_VAL_Msk (0x1UL << RADIO_COMPLETETRANS_VAL_Pos) /*!< Bit mask of VAL field.                       */


/* RADIO_FAILEDTRANS: Non-official event: Did not successfully complete a transaction to AdPll. (only when CHECKSTATUS is set) */
  #define RADIO_FAILEDTRANS_ResetValue (0x00000000UL) /*!< Reset value of FAILEDTRANS register.                                */

/* VAL @Bit 0 : (unspecified) */
  #define RADIO_FAILEDTRANS_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define RADIO_FAILEDTRANS_VAL_Msk (0x1UL << RADIO_FAILEDTRANS_VAL_Pos) /*!< Bit mask of VAL field.                           */


/* RADIO_ADPLLSTARTUPCOMMAND0: This value is written to the AdPll when powering up the digital island */
  #define RADIO_ADPLLSTARTUPCOMMAND0_ResetValue (0x80000000UL) /*!< Reset value of ADPLLSTARTUPCOMMAND0 register.              */

/* VALUE @Bits 0..15 : The value to be written the register in the digital island */
  #define RADIO_ADPLLSTARTUPCOMMAND0_VALUE_Pos (0UL) /*!< Position of VALUE field.                                             */
  #define RADIO_ADPLLSTARTUPCOMMAND0_VALUE_Msk (0xFFFFUL << RADIO_ADPLLSTARTUPCOMMAND0_VALUE_Pos) /*!< Bit mask of VALUE field.*/

/* ADDRESS @Bits 16..27 : The address of the digital island to write to */
  #define RADIO_ADPLLSTARTUPCOMMAND0_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field.                                        */
  #define RADIO_ADPLLSTARTUPCOMMAND0_ADDRESS_Msk (0xFFFUL << RADIO_ADPLLSTARTUPCOMMAND0_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/                                              

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_ADPLLSTARTUPCOMMAND0_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field.                            */
  #define RADIO_ADPLLSTARTUPCOMMAND0_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLLSTARTUPCOMMAND0_DONOTTRANSFER_Pos) /*!< Bit mask of
                                                                            DONOTTRANSFER field.*/                                


/* RADIO_ADPLLSTARTUPCOMMAND1: This value is written to the AdPll when powering up the digital island */
  #define RADIO_ADPLLSTARTUPCOMMAND1_ResetValue (0x80000000UL) /*!< Reset value of ADPLLSTARTUPCOMMAND1 register.              */

