adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VALUE @Bits 0..15 : The value to be written the register in the digital island */
  #define RADIO_ADPLLSTARTUPCOMMAND1_VALUE_Pos (0UL) /*!< Position of VALUE field.                                             */
  #define RADIO_ADPLLSTARTUPCOMMAND1_VALUE_Msk (0xFFFFUL << RADIO_ADPLLSTARTUPCOMMAND1_VALUE_Pos) /*!< Bit mask of VALUE field.*/

/* ADDRESS @Bits 16..27 : The address of the digital island to write to */
  #define RADIO_ADPLLSTARTUPCOMMAND1_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field.                                        */
  #define RADIO_ADPLLSTARTUPCOMMAND1_ADDRESS_Msk (0xFFFUL << RADIO_ADPLLSTARTUPCOMMAND1_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/                                              

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_ADPLLSTARTUPCOMMAND1_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field.                            */
  #define RADIO_ADPLLSTARTUPCOMMAND1_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLLSTARTUPCOMMAND1_DONOTTRANSFER_Pos) /*!< Bit mask of
                                                                            DONOTTRANSFER field.*/                                


/* RADIO_ADPLLSTARTUPCOMMAND2: This value is written to the AdPll when powering up the digital island */
  #define RADIO_ADPLLSTARTUPCOMMAND2_ResetValue (0x80000000UL) /*!< Reset value of ADPLLSTARTUPCOMMAND2 register.              */

/* VALUE @Bits 0..15 : The value to be written the register in the digital island */
  #define RADIO_ADPLLSTARTUPCOMMAND2_VALUE_Pos (0UL) /*!< Position of VALUE field.                                             */
  #define RADIO_ADPLLSTARTUPCOMMAND2_VALUE_Msk (0xFFFFUL << RADIO_ADPLLSTARTUPCOMMAND2_VALUE_Pos) /*!< Bit mask of VALUE field.*/

/* ADDRESS @Bits 16..27 : The address of the digital island to write to */
  #define RADIO_ADPLLSTARTUPCOMMAND2_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field.                                        */
  #define RADIO_ADPLLSTARTUPCOMMAND2_ADDRESS_Msk (0xFFFUL << RADIO_ADPLLSTARTUPCOMMAND2_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/                                              

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_ADPLLSTARTUPCOMMAND2_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field.                            */
  #define RADIO_ADPLLSTARTUPCOMMAND2_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLLSTARTUPCOMMAND2_DONOTTRANSFER_Pos) /*!< Bit mask of
                                                                            DONOTTRANSFER field.*/                                


/* RADIO_ADPLLSTARTUPCOMMAND3: This value is written to the AdPll when powering up the digital island */
  #define RADIO_ADPLLSTARTUPCOMMAND3_ResetValue (0x80000000UL) /*!< Reset value of ADPLLSTARTUPCOMMAND3 register.              */

/* VALUE @Bits 0..15 : The value to be written the register in the digital island */
  #define RADIO_ADPLLSTARTUPCOMMAND3_VALUE_Pos (0UL) /*!< Position of VALUE field.                                             */
  #define RADIO_ADPLLSTARTUPCOMMAND3_VALUE_Msk (0xFFFFUL << RADIO_ADPLLSTARTUPCOMMAND3_VALUE_Pos) /*!< Bit mask of VALUE field.*/

/* ADDRESS @Bits 16..27 : The address of the digital island to write to */
  #define RADIO_ADPLLSTARTUPCOMMAND3_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field.                                        */
  #define RADIO_ADPLLSTARTUPCOMMAND3_ADDRESS_Msk (0xFFFUL << RADIO_ADPLLSTARTUPCOMMAND3_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/                                              

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_ADPLLSTARTUPCOMMAND3_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field.                            */
  #define RADIO_ADPLLSTARTUPCOMMAND3_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLLSTARTUPCOMMAND3_DONOTTRANSFER_Pos) /*!< Bit mask of
                                                                            DONOTTRANSFER field.*/                                


/* RADIO_ADPLLSTARTUPCOMMAND4: This value is written to the AdPll when powering up the digital island */
  #define RADIO_ADPLLSTARTUPCOMMAND4_ResetValue (0x80000000UL) /*!< Reset value of ADPLLSTARTUPCOMMAND4 register.              */

/* VALUE @Bits 0..15 : The value to be written the register in the digital island */
  #define RADIO_ADPLLSTARTUPCOMMAND4_VALUE_Pos (0UL) /*!< Position of VALUE field.                                             */
  #define RADIO_ADPLLSTARTUPCOMMAND4_VALUE_Msk (0xFFFFUL << RADIO_ADPLLSTARTUPCOMMAND4_VALUE_Pos) /*!< Bit mask of VALUE field.*/

/* ADDRESS @Bits 16..27 : The address of the digital island to write to */
  #define RADIO_ADPLLSTARTUPCOMMAND4_ADDRESS_Pos (16UL) /*!< Position of ADDRESS field.                                        */
  #define RADIO_ADPLLSTARTUPCOMMAND4_ADDRESS_Msk (0xFFFUL << RADIO_ADPLLSTARTUPCOMMAND4_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/                                              

/* DONOTTRANSFER @Bit 31 : When 1, we do not transfer this word to AdPll at power up */
  #define RADIO_ADPLLSTARTUPCOMMAND4_DONOTTRANSFER_Pos (31UL) /*!< Position of DONOTTRANSFER field.                            */
  #define RADIO_ADPLLSTARTUPCOMMAND4_DONOTTRANSFER_Msk (0x1UL << RADIO_ADPLLSTARTUPCOMMAND4_DONOTTRANSFER_Pos) /*!< Bit mask of
                                                                            DONOTTRANSFER field.*/                                


/* RADIO_ADPLLSTARTUPCOMMAND5: This value is written to the AdPll when powering up the digital island */
  #define RADIO_ADPLLSTARTUPCOMMAND5_ResetValue (0x80000000UL) /*!< Reset value of ADPLLSTARTUPCOMMAND5 register.              */

