adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_ADPLLCOMPANIONINTPEND: (unspecified) */
  #define RADIO_ADPLLCOMPANIONINTPEND_ResetValue (0x00000000UL) /*!< Reset value of ADPLLCOMPANIONINTPEND register.            */

/* EVENTS @Bits 0..3 : (unspecified) */
  #define RADIO_ADPLLCOMPANIONINTPEND_EVENTS_Pos (0UL) /*!< Position of EVENTS field.                                          */
  #define RADIO_ADPLLCOMPANIONINTPEND_EVENTS_Msk (0xFUL << RADIO_ADPLLCOMPANIONINTPEND_EVENTS_Pos) /*!< Bit mask of EVENTS
                                                                            field.*/                                              


/* RADIO_MODECONF: Mode specific configuration regiser */
  #define RADIO_MODECONF_ResetValue (0x0001001BUL)   /*!< Reset value of MODECONF register.                                    */

/* SATDLY @Bits 0..4 : Mode dependent saturation delay for different modes */
  #define RADIO_MODECONF_SATDLY_Pos (0UL)            /*!< Position of SATDLY field.                                            */
  #define RADIO_MODECONF_SATDLY_Msk (0x1FUL << RADIO_MODECONF_SATDLY_Pos) /*!< Bit mask of SATDLY field.                       */

/* HIGHIFMODE @Bit 16 : Selects mixing frequency. Setting this register to 0 halves the mixing frequency. */
  #define RADIO_MODECONF_HIGHIFMODE_Pos (16UL)       /*!< Position of HIGHIFMODE field.                                        */
  #define RADIO_MODECONF_HIGHIFMODE_Msk (0x1UL << RADIO_MODECONF_HIGHIFMODE_Pos) /*!< Bit mask of HIGHIFMODE field.            */


/* RADIO_FESTATUS: Frontend readout register */
  #define RADIO_FESTATUS_ResetValue (0x00001010UL)   /*!< Reset value of FESTATUS register.                                    */

/* CALPHI @Bits 0..4 : calPhi from IQCal */
  #define RADIO_FESTATUS_CALPHI_Pos (0UL)            /*!< Position of CALPHI field.                                            */
  #define RADIO_FESTATUS_CALPHI_Msk (0x1FUL << RADIO_FESTATUS_CALPHI_Pos) /*!< Bit mask of CALPHI field.                       */

/* CALAMP @Bits 8..12 : calAmp from IQCal */
  #define RADIO_FESTATUS_CALAMP_Pos (8UL)            /*!< Position of CALAMP field.                                            */
  #define RADIO_FESTATUS_CALAMP_Msk (0x1FUL << RADIO_FESTATUS_CALAMP_Pos) /*!< Bit mask of CALAMP field.                       */

/* CALFIN @Bit 15 : High when IQCal search finished */
  #define RADIO_FESTATUS_CALFIN_Pos (15UL)           /*!< Position of CALFIN field.                                            */
  #define RADIO_FESTATUS_CALFIN_Msk (0x1UL << RADIO_FESTATUS_CALFIN_Pos) /*!< Bit mask of CALFIN field.                        */

/* MAGNITUDE @Bits 16..27 : Magnitude output from BB peak detector */
  #define RADIO_FESTATUS_MAGNITUDE_Pos (16UL)        /*!< Position of MAGNITUDE field.                                         */
  #define RADIO_FESTATUS_MAGNITUDE_Msk (0xFFFUL << RADIO_FESTATUS_MAGNITUDE_Pos) /*!< Bit mask of MAGNITUDE field.             */


/* RADIO_FECONFIG: Config register */
  #define RADIO_FECONFIG_ResetValue (0x10800005UL)   /*!< Reset value of FECONFIG register.                                    */

/* ALPHA @Bits 0..7 : Alpha for IIR filter used in logMag calculation */
  #define RADIO_FECONFIG_ALPHA_Pos (0UL)             /*!< Position of ALPHA field.                                             */
  #define RADIO_FECONFIG_ALPHA_Msk (0xFFUL << RADIO_FECONFIG_ALPHA_Pos) /*!< Bit mask of ALPHA field.                          */

/* SCALERDECAY @Bits 8..13 : The number of clock cycles to wait before stepping down the internal memory for the scaling. The
                             value 0 means that the decay feature is off. */                                                      
                                                                                                                                  
  #define RADIO_FECONFIG_SCALERDECAY_Pos (8UL)       /*!< Position of SCALERDECAY field.                                       */
  #define RADIO_FECONFIG_SCALERDECAY_Msk (0x3FUL << RADIO_FECONFIG_SCALERDECAY_Pos) /*!< Bit mask of SCALERDECAY field.        */

/* SCALECONST @Bits 16..19 : A constant scaling that overrides dynamic scaling behaviour in the IQ Scaler. Value != 0 enables
                             constant scaling. */                                                                                 
                                                                                                                                  
  #define RADIO_FECONFIG_SCALECONST_Pos (16UL)       /*!< Position of SCALECONST field.                                        */
  #define RADIO_FECONFIG_SCALECONST_Msk (0xFUL << RADIO_FECONFIG_SCALECONST_Pos) /*!< Bit mask of SCALECONST field.            */

/* SCALERWRAPPROTEN @Bit 23 : Wraparound protection in IQ Scaler. */
  #define RADIO_FECONFIG_SCALERWRAPPROTEN_Pos (23UL) /*!< Position of SCALERWRAPPROTEN field.                                  */
  #define RADIO_FECONFIG_SCALERWRAPPROTEN_Msk (0x1UL << RADIO_FECONFIG_SCALERWRAPPROTEN_Pos) /*!< Bit mask of SCALERWRAPPROTEN
                                                                            field.*/                                              
  #define RADIO_FECONFIG_SCALERWRAPPROTEN_Min (0x0UL) /*!< Min enumerator value of SCALERWRAPPROTEN field.                     */
  #define RADIO_FECONFIG_SCALERWRAPPROTEN_Max (0x1UL) /*!< Max enumerator value of SCALERWRAPPROTEN field.                     */
  #define RADIO_FECONFIG_SCALERWRAPPROTEN_Disabled (0x0UL) /*!< Disable wraparound protection. Not recommended to diable with
                                                                constant scaling.*/                                               
  #define RADIO_FECONFIG_SCALERWRAPPROTEN_Enabled (0x1UL) /*!< Enable wraparound protection. Scaled input is set to max or min
                                                               instead of wrapping around.*/                                      

/* QDISABLE @Bit 24 : Disable Q samples to save power */
  #define RADIO_FECONFIG_QDISABLE_Pos (24UL)         /*!< Position of QDISABLE field.                                          */
  #define RADIO_FECONFIG_QDISABLE_Msk (0x1UL << RADIO_FECONFIG_QDISABLE_Pos) /*!< Bit mask of QDISABLE field.                  */

