adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* INVERTI @Bit 28 : Invert I channel in case Q channel leads I */
  #define RADIO_FECONFIG_INVERTI_Pos (28UL)          /*!< Position of INVERTI field.                                           */
  #define RADIO_FECONFIG_INVERTI_Msk (0x1UL << RADIO_FECONFIG_INVERTI_Pos) /*!< Bit mask of INVERTI field.                     */

/* SELINPUTMIX @Bit 29 : Mixer Input Select between Decimator's Output and Injection DMA, i.e., SELINPUTMIX = 0 for Decimator;
                         SELINPUTMIX = 1 for Injection DMA */                                                                     
                                                                                                                                  
  #define RADIO_FECONFIG_SELINPUTMIX_Pos (29UL)      /*!< Position of SELINPUTMIX field.                                       */
  #define RADIO_FECONFIG_SELINPUTMIX_Msk (0x1UL << RADIO_FECONFIG_SELINPUTMIX_Pos) /*!< Bit mask of SELINPUTMIX field.         */

/* SELINPUTCHAN @Bit 30 : Channel Filters Input Select between Mixer and Injection DMA, i.e., SELINPUTCHAN = 0 for Mixer;
                          SELINPUTCHAN = 1 for Injection DMA */                                                                   
                                                                                                                                  
  #define RADIO_FECONFIG_SELINPUTCHAN_Pos (30UL)     /*!< Position of SELINPUTCHAN field.                                      */
  #define RADIO_FECONFIG_SELINPUTCHAN_Msk (0x1UL << RADIO_FECONFIG_SELINPUTCHAN_Pos) /*!< Bit mask of SELINPUTCHAN field.      */


/* RADIO_IQCALCONF: Gain and phase mismatch calibration control for I and Q */
  #define RADIO_IQCALCONF_ResetValue (0x00101028UL)  /*!< Reset value of IQCALCONF register.                                   */

/* IQCALWAIT @Bits 0..7 : Settling time (in number of 16 MHz clock periods) for rssi input to stabilize */
  #define RADIO_IQCALCONF_IQCALWAIT_Pos (0UL)        /*!< Position of IQCALWAIT field.                                         */
  #define RADIO_IQCALCONF_IQCALWAIT_Msk (0xFFUL << RADIO_IQCALCONF_IQCALWAIT_Pos) /*!< Bit mask of IQCALWAIT field.            */

/* CALAMP @Bits 8..12 : Stored calAmp value */
  #define RADIO_IQCALCONF_CALAMP_Pos (8UL)           /*!< Position of CALAMP field.                                            */
  #define RADIO_IQCALCONF_CALAMP_Msk (0x1FUL << RADIO_IQCALCONF_CALAMP_Pos) /*!< Bit mask of CALAMP field.                     */

/* CALPHI @Bits 16..20 : Stored calPhi value */
  #define RADIO_IQCALCONF_CALPHI_Pos (16UL)          /*!< Position of CALPHI field.                                            */
  #define RADIO_IQCALCONF_CALPHI_Msk (0x1FUL << RADIO_IQCALCONF_CALPHI_Pos) /*!< Bit mask of CALPHI field.                     */

/* CALPHISIGN @Bit 27 : Sign of calPhi value */
  #define RADIO_IQCALCONF_CALPHISIGN_Pos (27UL)      /*!< Position of CALPHISIGN field.                                        */
  #define RADIO_IQCALCONF_CALPHISIGN_Msk (0x1UL << RADIO_IQCALCONF_CALPHISIGN_Pos) /*!< Bit mask of CALPHISIGN field.          */

/* MODE @Bits 28..29 : IQCal search mode */
  #define RADIO_IQCALCONF_MODE_Pos (28UL)            /*!< Position of MODE field.                                              */
  #define RADIO_IQCALCONF_MODE_Msk (0x3UL << RADIO_IQCALCONF_MODE_Pos) /*!< Bit mask of MODE field.                            */
  #define RADIO_IQCALCONF_MODE_Min (0x0UL)           /*!< Min enumerator value of MODE field.                                  */
  #define RADIO_IQCALCONF_MODE_Max (0x2UL)           /*!< Max enumerator value of MODE field.                                  */
  #define RADIO_IQCALCONF_MODE_Optimized (0x0UL)     /*!< Optimized search algorithm.                                          */
  #define RADIO_IQCALCONF_MODE_Exhaustive (0x1UL)    /*!< Exhaustive search.                                                   */
  #define RADIO_IQCALCONF_MODE_Cancellation (0x2UL)  /*!< Optimized search with cancellation.                                  */

/* RUN @Bit 31 : Run I and Q calibration procedure */
  #define RADIO_IQCALCONF_RUN_Pos (31UL)             /*!< Position of RUN field.                                               */
  #define RADIO_IQCALCONF_RUN_Msk (0x1UL << RADIO_IQCALCONF_RUN_Pos) /*!< Bit mask of RUN field.                               */
  #define RADIO_IQCALCONF_RUN_Min (0x0UL)            /*!< Min enumerator value of RUN field.                                   */
  #define RADIO_IQCALCONF_RUN_Max (0x1UL)            /*!< Max enumerator value of RUN field.                                   */
  #define RADIO_IQCALCONF_RUN_Stored (0x0UL)         /*!< Using stored values for calPhi and calAmp                            */
  #define RADIO_IQCALCONF_RUN_Calib (0x1UL)          /*!< Running calibration                                                  */


/* RADIO_BBPKDETCONF: Configuration for baseband peak detector */
  #define RADIO_BBPKDETCONF_ResetValue (0x030140C8UL) /*!< Reset value of BBPKDETCONF register.                                */

/* HIGHTHRES @Bits 0..11 : High threshold for peak detector */
  #define RADIO_BBPKDETCONF_HIGHTHRES_Pos (0UL)      /*!< Position of HIGHTHRES field.                                         */
  #define RADIO_BBPKDETCONF_HIGHTHRES_Msk (0xFFFUL << RADIO_BBPKDETCONF_HIGHTHRES_Pos) /*!< Bit mask of HIGHTHRES field.       */

/* LOWTHRESH @Bits 12..23 : Low threshold for peak detector */
  #define RADIO_BBPKDETCONF_LOWTHRESH_Pos (12UL)     /*!< Position of LOWTHRESH field.                                         */
  #define RADIO_BBPKDETCONF_LOWTHRESH_Msk (0xFFFUL << RADIO_BBPKDETCONF_LOWTHRESH_Pos) /*!< Bit mask of LOWTHRESH field.       */

/* DECAYSTEP @Bits 24..29 : Constant output reduction step */
  #define RADIO_BBPKDETCONF_DECAYSTEP_Pos (24UL)     /*!< Position of DECAYSTEP field.                                         */
  #define RADIO_BBPKDETCONF_DECAYSTEP_Msk (0x3FUL << RADIO_BBPKDETCONF_DECAYSTEP_Pos) /*!< Bit mask of DECAYSTEP field.        */


/* RADIO_CFO_STAT: Carrier freq. offset estimate */
  #define RADIO_CFO_STAT_ResetValue (0x00000000UL)   /*!< Reset value of CFO_STAT register.                                    */

/* VALUE @Bits 0..8 : Readout of last valid decision level set in BitSlicer (signed) */
  #define RADIO_CFO_STAT_VALUE_Pos (0UL)             /*!< Position of VALUE field.                                             */
  #define RADIO_CFO_STAT_VALUE_Msk (0x1FFUL << RADIO_CFO_STAT_VALUE_Pos) /*!< Bit mask of VALUE field.                         */

