adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LASTDEMODACTIVE @Bit 12 : 0: Standard mode was used last 1: Hypermode was last used */
  #define RADIO_CFO_STAT_LASTDEMODACTIVE_Pos (12UL)  /*!< Position of LASTDEMODACTIVE field.                                   */
  #define RADIO_CFO_STAT_LASTDEMODACTIVE_Msk (0x1UL << RADIO_CFO_STAT_LASTDEMODACTIVE_Pos) /*!< Bit mask of LASTDEMODACTIVE
                                                                            field.*/                                              

/* PHASE @Bits 16..28 : Readout of last valid phase set in correlator (hypermode only) (signed) */
  #define RADIO_CFO_STAT_PHASE_Pos (16UL)            /*!< Position of PHASE field.                                             */
  #define RADIO_CFO_STAT_PHASE_Msk (0x1FFFUL << RADIO_CFO_STAT_PHASE_Pos) /*!< Bit mask of PHASE field.                        */


/* RADIO_PBTEST: Test: PB calibration */
  #define RADIO_PBTEST_ResetValue (0x00000880UL)     /*!< Reset value of PBTEST register.                                      */

/* PBIBPSTRIM @Bits 4..7 : Trim code for IBPS currents */
  #define RADIO_PBTEST_PBIBPSTRIM_Pos (4UL)          /*!< Position of PBIBPSTRIM field.                                        */
  #define RADIO_PBTEST_PBIBPSTRIM_Msk (0xFUL << RADIO_PBTEST_PBIBPSTRIM_Pos) /*!< Bit mask of PBIBPSTRIM field.                */

/* VBGTRIM @Bits 8..11 : Trim code for VBG to FS_VCOREG */
  #define RADIO_PBTEST_VBGTRIM_Pos (8UL)             /*!< Position of VBGTRIM field.                                           */
  #define RADIO_PBTEST_VBGTRIM_Msk (0xFUL << RADIO_PBTEST_VBGTRIM_Pos) /*!< Bit mask of VBGTRIM field.                         */

/* OVRENPBIBPSTRIM @Bit 30 : if '1' enable override for PBIBPSTRIM */
  #define RADIO_PBTEST_OVRENPBIBPSTRIM_Pos (30UL)    /*!< Position of OVRENPBIBPSTRIM field.                                   */
  #define RADIO_PBTEST_OVRENPBIBPSTRIM_Msk (0x1UL << RADIO_PBTEST_OVRENPBIBPSTRIM_Pos) /*!< Bit mask of OVRENPBIBPSTRIM field. */

/* OVRENVBGTRIM @Bit 31 : if '1' enable override for VBGTRIM */
  #define RADIO_PBTEST_OVRENVBGTRIM_Pos (31UL)       /*!< Position of OVRENVBGTRIM field.                                      */
  #define RADIO_PBTEST_OVRENVBGTRIM_Msk (0x1UL << RADIO_PBTEST_OVRENVBGTRIM_Pos) /*!< Bit mask of OVRENVBGTRIM field.          */


/* RADIO_DBCCOEFFS: Test and Debug: DBC coefficients override */
  #define RADIO_DBCCOEFFS_ResetValue (0x00000000UL)  /*!< Reset value of DBCCOEFFS register.                                   */

/* PADDRUPDATEOVREN @Bit 10 : paddrUpdateOvrEn */
  #define RADIO_DBCCOEFFS_PADDRUPDATEOVREN_Pos (10UL) /*!< Position of PADDRUPDATEOVREN field.                                 */
  #define RADIO_DBCCOEFFS_PADDRUPDATEOVREN_Msk (0x1UL << RADIO_DBCCOEFFS_PADDRUPDATEOVREN_Pos) /*!< Bit mask of PADDRUPDATEOVREN
                                                                            field.*/                                              

/* PADDRUPDATEOVRVAL @Bit 11 : paddrUpdateOvrVal */
  #define RADIO_DBCCOEFFS_PADDRUPDATEOVRVAL_Pos (11UL) /*!< Position of PADDRUPDATEOVRVAL field.                               */
  #define RADIO_DBCCOEFFS_PADDRUPDATEOVRVAL_Msk (0x1UL << RADIO_DBCCOEFFS_PADDRUPDATEOVRVAL_Pos) /*!< Bit mask of
                                                                            PADDRUPDATEOVRVAL field.*/                            

/* OVRALWAYSUPDATE @Bit 12 : Zero means coefficients only updated when needed (default), set to 1 coefficients are always
                             updated when the radio is enabled. */                                                                
                                                                                                                                  
  #define RADIO_DBCCOEFFS_OVRALWAYSUPDATE_Pos (12UL) /*!< Position of OVRALWAYSUPDATE field.                                   */
  #define RADIO_DBCCOEFFS_OVRALWAYSUPDATE_Msk (0x1UL << RADIO_DBCCOEFFS_OVRALWAYSUPDATE_Pos) /*!< Bit mask of OVRALWAYSUPDATE
                                                                            field.*/                                              


/* RADIO_QOVERRIDE4: Trim value override register 4 for nRF52 */
  #define RADIO_QOVERRIDE4_ResetValue (0x00140000UL) /*!< Reset value of QOVERRIDE4 register.                                  */

/* PREAMBFILTTH @Bits 16..24 : Threshold for the preamble filter */
  #define RADIO_QOVERRIDE4_PREAMBFILTTH_Pos (16UL)   /*!< Position of PREAMBFILTTH field.                                      */
  #define RADIO_QOVERRIDE4_PREAMBFILTTH_Msk (0x1FFUL << RADIO_QOVERRIDE4_PREAMBFILTTH_Pos) /*!< Bit mask of PREAMBFILTTH field.*/

/* ENPREAMBFILT @Bit 25 : Enable preamble filter */
  #define RADIO_QOVERRIDE4_ENPREAMBFILT_Pos (25UL)   /*!< Position of ENPREAMBFILT field.                                      */
  #define RADIO_QOVERRIDE4_ENPREAMBFILT_Msk (0x1UL << RADIO_QOVERRIDE4_ENPREAMBFILT_Pos) /*!< Bit mask of ENPREAMBFILT field.  */


/* RADIO_QOVERRIDE5: Trim value override register 5 for nRF52 */
  #define RADIO_QOVERRIDE5_ResetValue (0x00060020UL) /*!< Reset value of QOVERRIDE5 register.                                  */

/* PREAMBFILTCYCLES @Bits 0..7 : Override value for preambFiltCycles */
  #define RADIO_QOVERRIDE5_PREAMBFILTCYCLES_Pos (0UL) /*!< Position of PREAMBFILTCYCLES field.                                 */
  #define RADIO_QOVERRIDE5_PREAMBFILTCYCLES_Msk (0xFFUL << RADIO_QOVERRIDE5_PREAMBFILTCYCLES_Pos) /*!< Bit mask of
                                                                            PREAMBFILTCYCLES field.*/                             

/* BITSLICERSWINGTH @Bits 8..15 : Override value for bitSlicerSwingTh */
  #define RADIO_QOVERRIDE5_BITSLICERSWINGTH_Pos (8UL) /*!< Position of BITSLICERSWINGTH field.                                 */
  #define RADIO_QOVERRIDE5_BITSLICERSWINGTH_Msk (0xFFUL << RADIO_QOVERRIDE5_BITSLICERSWINGTH_Pos) /*!< Bit mask of
                                                                            BITSLICERSWINGTH field.*/                             

