adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PREAMBFILTMINSTRLEN @Bits 16..18 : Override value for preambFiltMinStrLen */
  #define RADIO_QOVERRIDE5_PREAMBFILTMINSTRLEN_Pos (16UL) /*!< Position of PREAMBFILTMINSTRLEN field.                          */
  #define RADIO_QOVERRIDE5_PREAMBFILTMINSTRLEN_Msk (0x7UL << RADIO_QOVERRIDE5_PREAMBFILTMINSTRLEN_Pos) /*!< Bit mask of
                                                                            PREAMBFILTMINSTRLEN field.*/                          


/* RADIO_QOVERRIDE6: Trim value override register 6 for nRF52 */
  #define RADIO_QOVERRIDE6_ResetValue (0x40000000UL) /*!< Reset value of QOVERRIDE6 register.                                  */

/* DBCENABLESRC @Bits 8..9 : Override value for dbcEnableSrc */
  #define RADIO_QOVERRIDE6_DBCENABLESRC_Pos (8UL)    /*!< Position of DBCENABLESRC field.                                      */
  #define RADIO_QOVERRIDE6_DBCENABLESRC_Msk (0x3UL << RADIO_QOVERRIDE6_DBCENABLESRC_Pos) /*!< Bit mask of DBCENABLESRC field.  */
  #define RADIO_QOVERRIDE6_DBCENABLESRC_Min (0x0UL)  /*!< Min enumerator value of DBCENABLESRC field.                          */
  #define RADIO_QOVERRIDE6_DBCENABLESRC_Max (0x3UL)  /*!< Max enumerator value of DBCENABLESRC field.                          */
  #define RADIO_QOVERRIDE6_DBCENABLESRC_AlwaysOn (0x0UL) /*!< Always on when not address match                                 */
  #define RADIO_QOVERRIDE6_DBCENABLESRC_BBLogMag (0x1UL) /*!< When bbLogMag is above a threshold                               */
  #define RADIO_QOVERRIDE6_DBCENABLESRC_BitSlicerSwing (0x2UL) /*!< When a certain time has gone since the input to the
                                                                    bitslicer was above BITSLICERSWINGTH*/                        
  #define RADIO_QOVERRIDE6_DBCENABLESRC_Both (0x3UL) /*!< Both BBLogMag and BitSlicerSwing                                     */

/* DBCTIMEOUT @Bits 16..23 : Override value for correlator timeout,in bit periods (hypermode) */
  #define RADIO_QOVERRIDE6_DBCTIMEOUT_Pos (16UL)     /*!< Position of DBCTIMEOUT field.                                        */
  #define RADIO_QOVERRIDE6_DBCTIMEOUT_Msk (0xFFUL << RADIO_QOVERRIDE6_DBCTIMEOUT_Pos) /*!< Bit mask of DBCTIMEOUT field.       */

/* DBCENABLETH @Bits 24..29 : Override value for correlator enable threshold */
  #define RADIO_QOVERRIDE6_DBCENABLETH_Pos (24UL)    /*!< Position of DBCENABLETH field.                                       */
  #define RADIO_QOVERRIDE6_DBCENABLETH_Msk (0x3FUL << RADIO_QOVERRIDE6_DBCENABLETH_Pos) /*!< Bit mask of DBCENABLETH field.    */

/* ENCHECKMULTIPEAKS @Bit 30 : Enable checking of several correlator peaks in hypermode */
  #define RADIO_QOVERRIDE6_ENCHECKMULTIPEAKS_Pos (30UL) /*!< Position of ENCHECKMULTIPEAKS field.                              */
  #define RADIO_QOVERRIDE6_ENCHECKMULTIPEAKS_Msk (0x1UL << RADIO_QOVERRIDE6_ENCHECKMULTIPEAKS_Pos) /*!< Bit mask of
                                                                            ENCHECKMULTIPEAKS field.*/                            

/* DBCCORRTHEN @Bit 31 : Override value enable for DBCCORRTH and MFBSTRBOFFSET */
  #define RADIO_QOVERRIDE6_DBCCORRTHEN_Pos (31UL)    /*!< Position of DBCCORRTHEN field.                                       */
  #define RADIO_QOVERRIDE6_DBCCORRTHEN_Msk (0x1UL << RADIO_QOVERRIDE6_DBCCORRTHEN_Pos) /*!< Bit mask of DBCCORRTHEN field.     */


/* RADIO_QOVERRIDE9: Trim value override register 9 for nRF52 */
  #define RADIO_QOVERRIDE9_ResetValue (0x00000053UL) /*!< Reset value of QOVERRIDE9 register.                                  */

/* PSDDEMODDELAY @Bits 0..1 : Override value for psdDemodDelay (standard mode) */
  #define RADIO_QOVERRIDE9_PSDDEMODDELAY_Pos (0UL)   /*!< Position of PSDDEMODDELAY field.                                     */
  #define RADIO_QOVERRIDE9_PSDDEMODDELAY_Msk (0x3UL << RADIO_QOVERRIDE9_PSDDEMODDELAY_Pos) /*!< Bit mask of PSDDEMODDELAY
                                                                            field.*/                                              

/* DEMODINVERT @Bit 2 : Override value for demodInvert (standard and hyper) */
  #define RADIO_QOVERRIDE9_DEMODINVERT_Pos (2UL)     /*!< Position of DEMODINVERT field.                                       */
  #define RADIO_QOVERRIDE9_DEMODINVERT_Msk (0x1UL << RADIO_QOVERRIDE9_DEMODINVERT_Pos) /*!< Bit mask of DEMODINVERT field.     */

/* DELAYBITOUTSTDDEMOD @Bits 4..6 : Override value for delayBitOutStdDemod (standard mode) */
  #define RADIO_QOVERRIDE9_DELAYBITOUTSTDDEMOD_Pos (4UL) /*!< Position of DELAYBITOUTSTDDEMOD field.                           */
  #define RADIO_QOVERRIDE9_DELAYBITOUTSTDDEMOD_Msk (0x7UL << RADIO_QOVERRIDE9_DELAYBITOUTSTDDEMOD_Pos) /*!< Bit mask of
                                                                            DELAYBITOUTSTDDEMOD field.*/                          

/* BITSLICERSWINGTIME @Bits 8..15 : Bit slicer swing time */
  #define RADIO_QOVERRIDE9_BITSLICERSWINGTIME_Pos (8UL) /*!< Position of BITSLICERSWINGTIME field.                             */
  #define RADIO_QOVERRIDE9_BITSLICERSWINGTIME_Msk (0xFFUL << RADIO_QOVERRIDE9_BITSLICERSWINGTIME_Pos) /*!< Bit mask of
                                                                            BITSLICERSWINGTIME field.*/                           

/* SCALERDECAYDELAY @Bits 20..25 : Decay delay for the IQ scaler */
  #define RADIO_QOVERRIDE9_SCALERDECAYDELAY_Pos (20UL) /*!< Position of SCALERDECAYDELAY field.                                */
  #define RADIO_QOVERRIDE9_SCALERDECAYDELAY_Msk (0x3FUL << RADIO_QOVERRIDE9_SCALERDECAYDELAY_Pos) /*!< Bit mask of
                                                                            SCALERDECAYDELAY field.*/                             


/* RADIO_QOVERRIDE12: Trim value override register 12 for nRF52 */
  #define RADIO_QOVERRIDE12_ResetValue (0x01F4044CUL) /*!< Reset value of QOVERRIDE12 register.                                */

/* IFPKDETHIGHTHRES @Bits 0..11 : Override value for IfpkDetHighThres */
  #define RADIO_QOVERRIDE12_IFPKDETHIGHTHRES_Pos (0UL) /*!< Position of IFPKDETHIGHTHRES field.                                */
  #define RADIO_QOVERRIDE12_IFPKDETHIGHTHRES_Msk (0xFFFUL << RADIO_QOVERRIDE12_IFPKDETHIGHTHRES_Pos) /*!< Bit mask of
                                                                            IFPKDETHIGHTHRES field.*/                             

/* SATDELAYCORRECTION @Bits 12..15 : Signed correction value for how much the saturation information is delayed from the input
                                     ADC samples to the samples being stored to RAM in direction finding operation */             
                                                                                                                                  
