adamkondraciuk/nrfx/mdk/nrf7140_types.h
  #define RADIO_QOVERRIDE12_SATDELAYCORRECTION_Pos (12UL) /*!< Position of SATDELAYCORRECTION field.                           */
  #define RADIO_QOVERRIDE12_SATDELAYCORRECTION_Msk (0xFUL << RADIO_QOVERRIDE12_SATDELAYCORRECTION_Pos) /*!< Bit mask of
                                                                            SATDELAYCORRECTION field.*/                           

/* IFPKDETLOWTHRES @Bits 16..27 : Override value for IfpkDetLowThres */
  #define RADIO_QOVERRIDE12_IFPKDETLOWTHRES_Pos (16UL) /*!< Position of IFPKDETLOWTHRES field.                                 */
  #define RADIO_QOVERRIDE12_IFPKDETLOWTHRES_Msk (0xFFFUL << RADIO_QOVERRIDE12_IFPKDETLOWTHRES_Pos) /*!< Bit mask of
                                                                            IFPKDETLOWTHRES field.*/                              


/* RADIO_QOVERRIDE23: Trim value override register 23 for nRF52 */
  #define RADIO_QOVERRIDE23_ResetValue (0x00002848UL) /*!< Reset value of QOVERRIDE23 register.                                */

/* OVRENCNRIPPLEWARNCFG @Bit 5 : Override enable for CNPEAKMINTHR and CNABSMAXTHR in the CNRIPPLEWARNCFG register */
  #define RADIO_QOVERRIDE23_OVRENCNRIPPLEWARNCFG_Pos (5UL) /*!< Position of OVRENCNRIPPLEWARNCFG field.                        */
  #define RADIO_QOVERRIDE23_OVRENCNRIPPLEWARNCFG_Msk (0x1UL << RADIO_QOVERRIDE23_OVRENCNRIPPLEWARNCFG_Pos) /*!< Bit mask of
                                                                            OVRENCNRIPPLEWARNCFG field.*/                         

/* ENABLEFEEDBACK @Bit 6 : Enable decision feedback for matched filter bank */
  #define RADIO_QOVERRIDE23_ENABLEFEEDBACK_Pos (6UL) /*!< Position of ENABLEFEEDBACK field.                                    */
  #define RADIO_QOVERRIDE23_ENABLEFEEDBACK_Msk (0x1UL << RADIO_QOVERRIDE23_ENABLEFEEDBACK_Pos) /*!< Bit mask of ENABLEFEEDBACK
                                                                            field.*/                                              

/* HIGHERTHANMARGINDBC @Bits 8..15 : Required peak height required for a double correlator peak to be considered higher than
                                     previous ones. The register value will be multiplied by 25 to obtain the actual margin. The
                                     bitfield is NOT subject to the enable override at bit position 31, and will always be
                                     enabled for hypermode. */                                                                    
                                                                                                                                  
  #define RADIO_QOVERRIDE23_HIGHERTHANMARGINDBC_Pos (8UL) /*!< Position of HIGHERTHANMARGINDBC field.                          */
  #define RADIO_QOVERRIDE23_HIGHERTHANMARGINDBC_Msk (0xFFUL << RADIO_QOVERRIDE23_HIGHERTHANMARGINDBC_Pos) /*!< Bit mask of
                                                                            HIGHERTHANMARGINDBC field.*/                          

/* KEEPSTDINDSSS @Bit 16 : Keep standard demod in DSSS mode */
  #define RADIO_QOVERRIDE23_KEEPSTDINDSSS_Pos (16UL) /*!< Position of KEEPSTDINDSSS field.                                     */
  #define RADIO_QOVERRIDE23_KEEPSTDINDSSS_Msk (0x1UL << RADIO_QOVERRIDE23_KEEPSTDINDSSS_Pos) /*!< Bit mask of KEEPSTDINDSSS
                                                                            field.*/                                              

/* DISABLESYMBOLTRACK @Bit 17 : Disable symbol tracking for IEEE 802.15.4 and BLE LR modes */
  #define RADIO_QOVERRIDE23_DISABLESYMBOLTRACK_Pos (17UL) /*!< Position of DISABLESYMBOLTRACK field.                           */
  #define RADIO_QOVERRIDE23_DISABLESYMBOLTRACK_Msk (0x1UL << RADIO_QOVERRIDE23_DISABLESYMBOLTRACK_Pos) /*!< Bit mask of
                                                                            DISABLESYMBOLTRACK field.*/                           


/* RADIO_LELRMISC: Miscellaneous Controls for Long Range */
  #define RADIO_LELRMISC_ResetValue (0x58780114UL)   /*!< Reset value of LELRMISC register.                                    */

/* LRFRAMERRTRSH @Bits 0..3 : Framer Receive Threshold */
  #define RADIO_LELRMISC_LRFRAMERRTRSH_Pos (0UL)     /*!< Position of LRFRAMERRTRSH field.                                     */
  #define RADIO_LELRMISC_LRFRAMERRTRSH_Msk (0xFUL << RADIO_LELRMISC_LRFRAMERRTRSH_Pos) /*!< Bit mask of LRFRAMERRTRSH field.   */

/* VITERBIUSESTATEZERO @Bit 4 : Use Viterbi state zero when flushing out bits for BLE LR */
  #define RADIO_LELRMISC_VITERBIUSESTATEZERO_Pos (4UL) /*!< Position of VITERBIUSESTATEZERO field.                             */
  #define RADIO_LELRMISC_VITERBIUSESTATEZERO_Msk (0x1UL << RADIO_LELRMISC_VITERBIUSESTATEZERO_Pos) /*!< Bit mask of
                                                                            VITERBIUSESTATEZERO field.*/                          

/* KEEPMFBONINBLELR125 @Bit 5 : Do not stop the clock to RxMFB in BLE LR 125 mode */
  #define RADIO_LELRMISC_KEEPMFBONINBLELR125_Pos (5UL) /*!< Position of KEEPMFBONINBLELR125 field.                             */
  #define RADIO_LELRMISC_KEEPMFBONINBLELR125_Msk (0x1UL << RADIO_LELRMISC_KEEPMFBONINBLELR125_Pos) /*!< Bit mask of
                                                                            KEEPMFBONINBLELR125 field.*/                          

/* KEEPDESPREADONINBLELR500 @Bit 6 : Do not stop the clock to the Despreader in BLE LR 500 mode */
  #define RADIO_LELRMISC_KEEPDESPREADONINBLELR500_Pos (6UL) /*!< Position of KEEPDESPREADONINBLELR500 field.                   */
  #define RADIO_LELRMISC_KEEPDESPREADONINBLELR500_Msk (0x1UL << RADIO_LELRMISC_KEEPDESPREADONINBLELR500_Pos) /*!< Bit mask of
                                                                            KEEPDESPREADONINBLELR500 field.*/                     

/* DISABLEFRAMESYNCLRTIMEOUT @Bit 7 : Disable framesync timeout (early address match timeout) for BLE LR mode (hypermode). */
  #define RADIO_LELRMISC_DISABLEFRAMESYNCLRTIMEOUT_Pos (7UL) /*!< Position of DISABLEFRAMESYNCLRTIMEOUT field.                 */
  #define RADIO_LELRMISC_DISABLEFRAMESYNCLRTIMEOUT_Msk (0x1UL << RADIO_LELRMISC_DISABLEFRAMESYNCLRTIMEOUT_Pos) /*!< Bit mask of
                                                                            DISABLEFRAMESYNCLRTIMEOUT field.*/                    

/* LELROFFADDRCHECK @Bits 8..10 : The number of chip periods earlier which it is allowed to declare frameSync in DecodeLELong */
  #define RADIO_LELRMISC_LELROFFADDRCHECK_Pos (8UL)  /*!< Position of LELROFFADDRCHECK field.                                  */
  #define RADIO_LELRMISC_LELROFFADDRCHECK_Msk (0x7UL << RADIO_LELRMISC_LELROFFADDRCHECK_Pos) /*!< Bit mask of LELROFFADDRCHECK
                                                                            field.*/                                              

/* CODEPOLY0 @Bits 16..22 : Code Polynom 0 */
  #define RADIO_LELRMISC_CODEPOLY0_Pos (16UL)        /*!< Position of CODEPOLY0 field.                                         */
  #define RADIO_LELRMISC_CODEPOLY0_Msk (0x7FUL << RADIO_LELRMISC_CODEPOLY0_Pos) /*!< Bit mask of CODEPOLY0 field.              */

/* CODEPOLY1 @Bits 24..30 : Code Polynom 1 */
  #define RADIO_LELRMISC_CODEPOLY1_Pos (24UL)        /*!< Position of CODEPOLY1 field.                                         */
  #define RADIO_LELRMISC_CODEPOLY1_Msk (0x7FUL << RADIO_LELRMISC_CODEPOLY1_Pos) /*!< Bit mask of CODEPOLY1 field.              */

/* LRDESPREADSWAP @Bit 31 : Swap de-spreader */
  #define RADIO_LELRMISC_LRDESPREADSWAP_Pos (31UL)   /*!< Position of LRDESPREADSWAP field.                                    */
  #define RADIO_LELRMISC_LRDESPREADSWAP_Msk (0x1UL << RADIO_LELRMISC_LRDESPREADSWAP_Pos) /*!< Bit mask of LRDESPREADSWAP field.*/


/* RADIO_QOVERRIDE25: TODO */
  #define RADIO_QOVERRIDE25_ResetValue (0x00000000UL) /*!< Reset value of QOVERRIDE25 register.                                */

/* DBCCORRTHSTRICT @Bits 0..7 : Correlation threshold for double correlator used in BleLr mode to resync to another preamble
                                while already working on a previous preamble. */                                                  
                                                                                                                                  
  #define RADIO_QOVERRIDE25_DBCCORRTHSTRICT_Pos (0UL) /*!< Position of DBCCORRTHSTRICT field.                                  */
  #define RADIO_QOVERRIDE25_DBCCORRTHSTRICT_Msk (0xFFUL << RADIO_QOVERRIDE25_DBCCORRTHSTRICT_Pos) /*!< Bit mask of
                                                                            DBCCORRTHSTRICT field.*/                              

/* DBCCORRTHPREVREQUIR @Bits 8..15 : Correlation threshold for double correlator used in BleLr mode to reject a later resync
                                     using DBCCORRTHSTRICT. */                                                                    
                                                                                                                                  
  #define RADIO_QOVERRIDE25_DBCCORRTHPREVREQUIR_Pos (8UL) /*!< Position of DBCCORRTHPREVREQUIR field.                          */
  #define RADIO_QOVERRIDE25_DBCCORRTHPREVREQUIR_Msk (0xFFUL << RADIO_QOVERRIDE25_DBCCORRTHPREVREQUIR_Pos) /*!< Bit mask of
                                                                            DBCCORRTHPREVREQUIR field.*/                          

/* MINPEAKCOUNTSTRICT @Bits 16..18 : Min number of peaks to detect before resyncing to another preamble while already working on
                                     a previous preamble in BleLrx. */                                                            
                                                                                                                                  
  #define RADIO_QOVERRIDE25_MINPEAKCOUNTSTRICT_Pos (16UL) /*!< Position of MINPEAKCOUNTSTRICT field.                           */
  #define RADIO_QOVERRIDE25_MINPEAKCOUNTSTRICT_Msk (0x7UL << RADIO_QOVERRIDE25_MINPEAKCOUNTSTRICT_Pos) /*!< Bit mask of
                                                                            MINPEAKCOUNTSTRICT field.*/                           

