adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_DBCCORR: Thresholds for the double correlator */
  #define RADIO_DBCCORR_ResetValue (0x1FFFFF90UL)    /*!< Reset value of DBCCORR register.                                     */

/* TH @Bits 0..7 : Correlation threshold for double correlator in normal operation */
  #define RADIO_DBCCORR_TH_Pos (0UL)                 /*!< Position of TH field.                                                */
  #define RADIO_DBCCORR_TH_Msk (0xFFUL << RADIO_DBCCORR_TH_Pos) /*!< Bit mask of TH field.                                     */

/* STRICT @Bits 8..15 : Correlation threshold for double correlator used in BleLr mode to resync to another preamble while
                        already working on a previous preamble. Also applies for Ieee 802.15.4 mode */                            
                                                                                                                                  
  #define RADIO_DBCCORR_STRICT_Pos (8UL)             /*!< Position of STRICT field.                                            */
  #define RADIO_DBCCORR_STRICT_Msk (0xFFUL << RADIO_DBCCORR_STRICT_Pos) /*!< Bit mask of STRICT field.                         */

/* PREVREQUIR @Bits 16..23 : Correlation threshold for double correlator used in BleLr mode to reject a later resync using
                             DBCCORRTHSTRICT. Also applies for Ieee 802.15.4 mode */                                              
                                                                                                                                  
  #define RADIO_DBCCORR_PREVREQUIR_Pos (16UL)        /*!< Position of PREVREQUIR field.                                        */
  #define RADIO_DBCCORR_PREVREQUIR_Msk (0xFFUL << RADIO_DBCCORR_PREVREQUIR_Pos) /*!< Bit mask of PREVREQUIR field.             */

/* ADDRTIMEOUT @Bits 24..31 : Override value for address match timeout, [in bit periods] (hypermode). 0 means no timeout. If
                              BALEN is 3, the actual value of DBCADDRTIMEOUT will be the value written to this register minus 8.
                              */                                                                                                  
                                                                                                                                  
  #define RADIO_DBCCORR_ADDRTIMEOUT_Pos (24UL)       /*!< Position of ADDRTIMEOUT field.                                       */
  #define RADIO_DBCCORR_ADDRTIMEOUT_Msk (0xFFUL << RADIO_DBCCORR_ADDRTIMEOUT_Pos) /*!< Bit mask of ADDRTIMEOUT field.          */


/* RADIO_BSCONFIG: Bitslicer configuration */
  #define RADIO_BSCONFIG_ResetValue (0x0000205AUL)   /*!< Reset value of BSCONFIG register.                                    */

/* BITLENGTHTOLERANSE @Bits 0..1 : Override for bsBitLengthToleranse */
  #define RADIO_BSCONFIG_BITLENGTHTOLERANSE_Pos (0UL) /*!< Position of BITLENGTHTOLERANSE field.                               */
  #define RADIO_BSCONFIG_BITLENGTHTOLERANSE_Msk (0x3UL << RADIO_BSCONFIG_BITLENGTHTOLERANSE_Pos) /*!< Bit mask of
                                                                            BITLENGTHTOLERANSE field.*/                           

/* DISABLEPREAMBLEBLOCK @Bit 2 : Override for bsDisablePreambleBlock */
  #define RADIO_BSCONFIG_DISABLEPREAMBLEBLOCK_Pos (2UL) /*!< Position of DISABLEPREAMBLEBLOCK field.                           */
  #define RADIO_BSCONFIG_DISABLEPREAMBLEBLOCK_Msk (0x1UL << RADIO_BSCONFIG_DISABLEPREAMBLEBLOCK_Pos) /*!< Bit mask of
                                                                            DISABLEPREAMBLEBLOCK field.*/                         

/* ENABLETHRESHOLDADJUST @Bit 3 : Override for bsEnableThresholdAdjust */
  #define RADIO_BSCONFIG_ENABLETHRESHOLDADJUST_Pos (3UL) /*!< Position of ENABLETHRESHOLDADJUST field.                         */
  #define RADIO_BSCONFIG_ENABLETHRESHOLDADJUST_Msk (0x1UL << RADIO_BSCONFIG_ENABLETHRESHOLDADJUST_Pos) /*!< Bit mask of
                                                                            ENABLETHRESHOLDADJUST field.*/                        

/* DATAPEAK2PEAK @Bits 4..10 : Override for bsDataPeak2Peak */
  #define RADIO_BSCONFIG_DATAPEAK2PEAK_Pos (4UL)     /*!< Position of DATAPEAK2PEAK field.                                     */
  #define RADIO_BSCONFIG_DATAPEAK2PEAK_Msk (0x7FUL << RADIO_BSCONFIG_DATAPEAK2PEAK_Pos) /*!< Bit mask of DATAPEAK2PEAK field.  */

/* STROBEDATAIN @Bit 11 : Override for bsStrobeDataIn */
  #define RADIO_BSCONFIG_STROBEDATAIN_Pos (11UL)     /*!< Position of STROBEDATAIN field.                                      */
  #define RADIO_BSCONFIG_STROBEDATAIN_Msk (0x1UL << RADIO_BSCONFIG_STROBEDATAIN_Pos) /*!< Bit mask of STROBEDATAIN field.      */

/* STROBEDELAY @Bits 12..14 : Override for bsStrobeDelay */
  #define RADIO_BSCONFIG_STROBEDELAY_Pos (12UL)      /*!< Position of STROBEDELAY field.                                       */
  #define RADIO_BSCONFIG_STROBEDELAY_Msk (0x7UL << RADIO_BSCONFIG_STROBEDELAY_Pos) /*!< Bit mask of STROBEDELAY field.         */

/* YLEVALG @Bit 15 : Override for bsYlevAlg */
  #define RADIO_BSCONFIG_YLEVALG_Pos (15UL)          /*!< Position of YLEVALG field.                                           */
  #define RADIO_BSCONFIG_YLEVALG_Msk (0x1UL << RADIO_BSCONFIG_YLEVALG_Pos) /*!< Bit mask of YLEVALG field.                     */


/* RADIO_MFB: Matched Filter Bank (MFB) configuration */
  #define RADIO_MFB_ResetValue (0x00000003UL)        /*!< Reset value of MFB register.                                         */

/* STRBOFFSET @Bits 0..2 : Override value for strobe offset */
  #define RADIO_MFB_STRBOFFSET_Pos (0UL)             /*!< Position of STRBOFFSET field.                                        */
  #define RADIO_MFB_STRBOFFSET_Msk (0x7UL << RADIO_MFB_STRBOFFSET_Pos) /*!< Bit mask of STRBOFFSET field.                      */

/* BYPASSMAJVOTE @Bit 7 : Bypass majority vote */
  #define RADIO_MFB_BYPASSMAJVOTE_Pos (7UL)          /*!< Position of BYPASSMAJVOTE field.                                     */
  #define RADIO_MFB_BYPASSMAJVOTE_Msk (0x1UL << RADIO_MFB_BYPASSMAJVOTE_Pos) /*!< Bit mask of BYPASSMAJVOTE field.             */
  #define RADIO_MFB_BYPASSMAJVOTE_Min (0x0UL)        /*!< Min enumerator value of BYPASSMAJVOTE field.                         */
  #define RADIO_MFB_BYPASSMAJVOTE_Max (0x1UL)        /*!< Max enumerator value of BYPASSMAJVOTE field.                         */
  #define RADIO_MFB_BYPASSMAJVOTE_PASS (0x0UL)       /*!< Majority vite                                                        */
  #define RADIO_MFB_BYPASSMAJVOTE_BYPASS (0x1UL)     /*!< Bypass through majority vote                                         */

