adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* HYPDEMODDIVA @Bits 8..10 : Hyper demod clock divider A */
  #define RADIO_BBCKSEL_HYPDEMODDIVA_Pos (8UL)       /*!< Position of HYPDEMODDIVA field.                                      */
  #define RADIO_BBCKSEL_HYPDEMODDIVA_Msk (0x7UL << RADIO_BBCKSEL_HYPDEMODDIVA_Pos) /*!< Bit mask of HYPDEMODDIVA field.        */
  #define RADIO_BBCKSEL_HYPDEMODDIVA_Min (0x0UL)     /*!< Min enumerator value of HYPDEMODDIVA field.                          */
  #define RADIO_BBCKSEL_HYPDEMODDIVA_Max (0x7UL)     /*!< Max enumerator value of HYPDEMODDIVA field.                          */
  #define RADIO_BBCKSEL_HYPDEMODDIVA_32M (0x0UL)     /*!< Clock 32MHz                                                          */
  #define RADIO_BBCKSEL_HYPDEMODDIVA_16M (0x1UL)     /*!< Clock 16MHz                                                          */
  #define RADIO_BBCKSEL_HYPDEMODDIVA_8M (0x2UL)      /*!< Clock 8MHz                                                           */
  #define RADIO_BBCKSEL_HYPDEMODDIVA_4M (0x3UL)      /*!< Clock 4MHz                                                           */
  #define RADIO_BBCKSEL_HYPDEMODDIVA_2M (0x4UL)      /*!< Clock 2MHz                                                           */
  #define RADIO_BBCKSEL_HYPDEMODDIVA_1M (0x5UL)      /*!< Clock 1MHz                                                           */
  #define RADIO_BBCKSEL_HYPDEMODDIVA_500K (0x6UL)    /*!< Clock 500kHz                                                         */
  #define RADIO_BBCKSEL_HYPDEMODDIVA_Disabled (0x7UL) /*!< Clock OFF                                                           */

/* HYPDEMODDIVB @Bits 12..14 : Hyper demod clock divider B */
  #define RADIO_BBCKSEL_HYPDEMODDIVB_Pos (12UL)      /*!< Position of HYPDEMODDIVB field.                                      */
  #define RADIO_BBCKSEL_HYPDEMODDIVB_Msk (0x7UL << RADIO_BBCKSEL_HYPDEMODDIVB_Pos) /*!< Bit mask of HYPDEMODDIVB field.        */
  #define RADIO_BBCKSEL_HYPDEMODDIVB_Min (0x0UL)     /*!< Min enumerator value of HYPDEMODDIVB field.                          */
  #define RADIO_BBCKSEL_HYPDEMODDIVB_Max (0x7UL)     /*!< Max enumerator value of HYPDEMODDIVB field.                          */
  #define RADIO_BBCKSEL_HYPDEMODDIVB_32M (0x0UL)     /*!< Clock 32MHz                                                          */
  #define RADIO_BBCKSEL_HYPDEMODDIVB_16M (0x1UL)     /*!< Clock 16MHz                                                          */
  #define RADIO_BBCKSEL_HYPDEMODDIVB_8M (0x2UL)      /*!< Clock 8MHz                                                           */
  #define RADIO_BBCKSEL_HYPDEMODDIVB_4M (0x3UL)      /*!< Clock 4MHz                                                           */
  #define RADIO_BBCKSEL_HYPDEMODDIVB_2M (0x4UL)      /*!< Clock 2MHz                                                           */
  #define RADIO_BBCKSEL_HYPDEMODDIVB_1M (0x5UL)      /*!< Clock 1MHz                                                           */
  #define RADIO_BBCKSEL_HYPDEMODDIVB_500K (0x6UL)    /*!< Clock 500kHz                                                         */
  #define RADIO_BBCKSEL_HYPDEMODDIVB_Disabled (0x7UL) /*!< Clock OFF                                                           */

/* HYPDEMODDIVC @Bits 16..18 : Hyper demod clock divider C (max 8MHz) */
  #define RADIO_BBCKSEL_HYPDEMODDIVC_Pos (16UL)      /*!< Position of HYPDEMODDIVC field.                                      */
  #define RADIO_BBCKSEL_HYPDEMODDIVC_Msk (0x7UL << RADIO_BBCKSEL_HYPDEMODDIVC_Pos) /*!< Bit mask of HYPDEMODDIVC field.        */
  #define RADIO_BBCKSEL_HYPDEMODDIVC_Min (0x2UL)     /*!< Min enumerator value of HYPDEMODDIVC field.                          */
  #define RADIO_BBCKSEL_HYPDEMODDIVC_Max (0x7UL)     /*!< Max enumerator value of HYPDEMODDIVC field.                          */
  #define RADIO_BBCKSEL_HYPDEMODDIVC_8M (0x2UL)      /*!< Clock 8MHz                                                           */
  #define RADIO_BBCKSEL_HYPDEMODDIVC_4M (0x3UL)      /*!< Clock 4MHz                                                           */
  #define RADIO_BBCKSEL_HYPDEMODDIVC_2M (0x4UL)      /*!< Clock 2MHz                                                           */
  #define RADIO_BBCKSEL_HYPDEMODDIVC_1M (0x5UL)      /*!< Clock 1MHz                                                           */
  #define RADIO_BBCKSEL_HYPDEMODDIVC_500K (0x6UL)    /*!< Clock 500kHz                                                         */
  #define RADIO_BBCKSEL_HYPDEMODDIVC_Disabled (0x7UL) /*!< Clock OFF                                                           */

/* HYPDEMODDIVD @Bits 20..22 : Hyper demod clock divider D (max 4MHz) */
  #define RADIO_BBCKSEL_HYPDEMODDIVD_Pos (20UL)      /*!< Position of HYPDEMODDIVD field.                                      */
  #define RADIO_BBCKSEL_HYPDEMODDIVD_Msk (0x7UL << RADIO_BBCKSEL_HYPDEMODDIVD_Pos) /*!< Bit mask of HYPDEMODDIVD field.        */
  #define RADIO_BBCKSEL_HYPDEMODDIVD_Min (0x3UL)     /*!< Min enumerator value of HYPDEMODDIVD field.                          */
  #define RADIO_BBCKSEL_HYPDEMODDIVD_Max (0x7UL)     /*!< Max enumerator value of HYPDEMODDIVD field.                          */
  #define RADIO_BBCKSEL_HYPDEMODDIVD_4M (0x3UL)      /*!< Clock 4MHz                                                           */
  #define RADIO_BBCKSEL_HYPDEMODDIVD_2M (0x4UL)      /*!< Clock 2MHz                                                           */
  #define RADIO_BBCKSEL_HYPDEMODDIVD_1M (0x5UL)      /*!< Clock 1MHz                                                           */
  #define RADIO_BBCKSEL_HYPDEMODDIVD_500K (0x6UL)    /*!< Clock 500kHz                                                         */
  #define RADIO_BBCKSEL_HYPDEMODDIVD_Disabled (0x7UL) /*!< Clock OFF                                                           */


/* RADIO_DBCORRADAP: Adaptive thresholds for double correlator. */
  #define RADIO_DBCORRADAP_ResetValue (0x0000037DUL) /*!< Reset value of DBCORRADAP register.                                  */

/* TH @Bits 0..4 : A ratio to update the DBC ratio threshold when adaptive threshold is enabled and a strong peak is found.
                   Fraction of highest correlator match historically seen. Setting of 0.90625 is default. */                      
                                                                                                                                  
  #define RADIO_DBCORRADAP_TH_Pos (0UL)              /*!< Position of TH field.                                                */
  #define RADIO_DBCORRADAP_TH_Msk (0x1FUL << RADIO_DBCORRADAP_TH_Pos) /*!< Bit mask of TH field.                               */

/* DE @Bits 5..9 : A ratio to decay the DBC ration threshold when using adaptive threshold and a weak peak is found. */
  #define RADIO_DBCORRADAP_DE_Pos (5UL)              /*!< Position of DE field.                                                */
  #define RADIO_DBCORRADAP_DE_Msk (0x1FUL << RADIO_DBCORRADAP_DE_Pos) /*!< Bit mask of DE field.                               */

/* OFFS @Bits 10..16 : Offset for comparing between current and historical DBC magnitude */
  #define RADIO_DBCORRADAP_OFFS_Pos (10UL)           /*!< Position of OFFS field.                                              */
  #define RADIO_DBCORRADAP_OFFS_Msk (0x7FUL << RADIO_DBCORRADAP_OFFS_Pos) /*!< Bit mask of OFFS field.                         */


/* RADIO_MNSTORED: Stored value of Cn and Pn from the double correlator at the last detect */
  #define RADIO_MNSTORED_ResetValue (0x00000000UL)   /*!< Reset value of MNSTORED register.                                    */

