adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CNMIDSQUARED @Bits 0..15 : Squared value of Cn which can be used to find Mn associated with the last double correlator detect
                              */                                                                                                  
                                                                                                                                  
  #define RADIO_MNSTORED_CNMIDSQUARED_Pos (0UL)      /*!< Position of CNMIDSQUARED field.                                      */
  #define RADIO_MNSTORED_CNMIDSQUARED_Msk (0xFFFFUL << RADIO_MNSTORED_CNMIDSQUARED_Pos) /*!< Bit mask of CNMIDSQUARED field.   */

/* PNMIDSQUARED @Bits 16..31 : Squared value of Cn which can be used to find Mn associated with the last double correlator
                               detect */                                                                                          
                                                                                                                                  
  #define RADIO_MNSTORED_PNMIDSQUARED_Pos (16UL)     /*!< Position of PNMIDSQUARED field.                                      */
  #define RADIO_MNSTORED_PNMIDSQUARED_Msk (0xFFFFUL << RADIO_MNSTORED_PNMIDSQUARED_Pos) /*!< Bit mask of PNMIDSQUARED field.   */


/* RADIO_CNEARLYLATE: The Cn value associated with the clock cycle before and after the actually double correlator peak was
                       found (detect) */                                                                                          
                                                                                                                                  
  #define RADIO_CNEARLYLATE_ResetValue (0x00000000UL) /*!< Reset value of CNEARLYLATE register.                                */

/* CNEARLYSQUARED @Bits 0..15 : Squared value of Cn before the peak */
  #define RADIO_CNEARLYLATE_CNEARLYSQUARED_Pos (0UL) /*!< Position of CNEARLYSQUARED field.                                    */
  #define RADIO_CNEARLYLATE_CNEARLYSQUARED_Msk (0xFFFFUL << RADIO_CNEARLYLATE_CNEARLYSQUARED_Pos) /*!< Bit mask of
                                                                            CNEARLYSQUARED field.*/                               

/* CNLATESQUARED @Bits 16..31 : Squared value of Cn after the peak */
  #define RADIO_CNEARLYLATE_CNLATESQUARED_Pos (16UL) /*!< Position of CNLATESQUARED field.                                     */
  #define RADIO_CNEARLYLATE_CNLATESQUARED_Msk (0xFFFFUL << RADIO_CNEARLYLATE_CNLATESQUARED_Pos) /*!< Bit mask of CNLATESQUARED
                                                                            field.*/                                              


/* RADIO_STTCNFG_LR: Strobe time tracking configuration in long range mode */
  #define RADIO_STTCNFG_LR_ResetValue (0x000010FAUL) /*!< Reset value of STTCNFG_LR register.                                  */

/* STTERRORTHLR @Bits 0..7 : Strobe time tracking error threshold in BLE LR mode */
  #define RADIO_STTCNFG_LR_STTERRORTHLR_Pos (0UL)    /*!< Position of STTERRORTHLR field.                                      */
  #define RADIO_STTCNFG_LR_STTERRORTHLR_Msk (0xFFUL << RADIO_STTCNFG_LR_STTERRORTHLR_Pos) /*!< Bit mask of STTERRORTHLR field. */

/* STTTIMEOUTLR @Bits 8..15 : Strobe time tracking timeout in BLE LR mode */
  #define RADIO_STTCNFG_LR_STTTIMEOUTLR_Pos (8UL)    /*!< Position of STTTIMEOUTLR field.                                      */
  #define RADIO_STTCNFG_LR_STTTIMEOUTLR_Msk (0xFFUL << RADIO_STTCNFG_LR_STTTIMEOUTLR_Pos) /*!< Bit mask of STTTIMEOUTLR field. */


/* RADIO_STTCNFG: Strobe time tracking Configuration (Symbol Timing) */
  #define RADIO_STTCNFG_ResetValue (0x00000000UL)    /*!< Reset value of STTCNFG register.                                     */

/* STTALPHA @Bits 0..7 : Strobe time tracking: IIR filter alpha */
  #define RADIO_STTCNFG_STTALPHA_Pos (0UL)           /*!< Position of STTALPHA field.                                          */
  #define RADIO_STTCNFG_STTALPHA_Msk (0xFFUL << RADIO_STTCNFG_STTALPHA_Pos) /*!< Bit mask of STTALPHA field.                   */

/* STTERRORTH @Bits 8..15 : Strobe time tracking: strobe time error threshold */
  #define RADIO_STTCNFG_STTERRORTH_Pos (8UL)         /*!< Position of STTERRORTH field.                                        */
  #define RADIO_STTCNFG_STTERRORTH_Msk (0xFFUL << RADIO_STTCNFG_STTERRORTH_Pos) /*!< Bit mask of STTERRORTH field.             */

/* STTTIMEOUT @Bits 16..23 : Strobe time tracking: adjustment timeout (min distance in symbolperiods between strobe adjustments
                             in same direction) */                                                                                
                                                                                                                                  
  #define RADIO_STTCNFG_STTTIMEOUT_Pos (16UL)        /*!< Position of STTTIMEOUT field.                                        */
  #define RADIO_STTCNFG_STTTIMEOUT_Msk (0xFFUL << RADIO_STTCNFG_STTTIMEOUT_Pos) /*!< Bit mask of STTTIMEOUT field.             */


/* RADIO_DRIFTLR: Drift Controls in Long Range */
  #define RADIO_DRIFTLR_ResetValue (0x0000033CUL)    /*!< Reset value of DRIFTLR register.                                     */

/* DRIFTHALPHA125 @Bits 0..7 : Override value for IIR feedback , drift estimator (despreadLELLong) */
  #define RADIO_DRIFTLR_DRIFTHALPHA125_Pos (0UL)     /*!< Position of DRIFTHALPHA125 field.                                    */
  #define RADIO_DRIFTLR_DRIFTHALPHA125_Msk (0xFFUL << RADIO_DRIFTLR_DRIFTHALPHA125_Pos) /*!< Bit mask of DRIFTHALPHA125 field. */

/* DRIFTVALIDTH125 @Bits 8..16 : Override value for driftValidTh, drift estimator (despreadLELLong) */
  #define RADIO_DRIFTLR_DRIFTVALIDTH125_Pos (8UL)    /*!< Position of DRIFTVALIDTH125 field.                                   */
  #define RADIO_DRIFTLR_DRIFTVALIDTH125_Msk (0x1FFUL << RADIO_DRIFTLR_DRIFTVALIDTH125_Pos) /*!< Bit mask of DRIFTVALIDTH125
                                                                            field.*/                                              

/* DRIFTLOWTH125 @Bits 24..29 : Override value for driftLowTh, drift estimator (despreadLELLong) */
  #define RADIO_DRIFTLR_DRIFTLOWTH125_Pos (24UL)     /*!< Position of DRIFTLOWTH125 field.                                     */
  #define RADIO_DRIFTLR_DRIFTLOWTH125_Msk (0x3FUL << RADIO_DRIFTLR_DRIFTLOWTH125_Pos) /*!< Bit mask of DRIFTLOWTH125 field.    */


/* RADIO_DRIFT1: Drift Estimator configuration */
  #define RADIO_DRIFT1_ResetValue (0x00002820UL)     /*!< Reset value of DRIFT1 register.                                      */

