adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* USE154SYNCENGINE @Bit 0 : Select whether to use enhanced IEEE 802.15.4 or the classic IEEE 802.15.4 demodulator. */
  #define RADIO_QOVERRIDE27_USE154SYNCENGINE_Pos (0UL) /*!< Position of USE154SYNCENGINE field.                                */
  #define RADIO_QOVERRIDE27_USE154SYNCENGINE_Msk (0x1UL << RADIO_QOVERRIDE27_USE154SYNCENGINE_Pos) /*!< Bit mask of
                                                                            USE154SYNCENGINE field.*/                             
  #define RADIO_QOVERRIDE27_USE154SYNCENGINE_Min (0x0UL) /*!< Min enumerator value of USE154SYNCENGINE field.                  */
  #define RADIO_QOVERRIDE27_USE154SYNCENGINE_Max (0x1UL) /*!< Max enumerator value of USE154SYNCENGINE field.                  */
  #define RADIO_QOVERRIDE27_USE154SYNCENGINE_Classic (0x0UL) /*!< Use classic demodulator                                      */
  #define RADIO_QOVERRIDE27_USE154SYNCENGINE_Ieee154SyncEngine (0x1UL) /*!< Use IEEE 802.15.4 sync demodulator                 */


/* RADIO_RXSYNC: RxSyncEngine configuration */
  #define RADIO_RXSYNC_ResetValue (0x00003C90UL)     /*!< Reset value of RXSYNC register.                                      */

/* ALPHAFREQ @Bits 0..4 : Coefficient to update frequency offset. Default value is 10000, corresponds to 1/2. */
  #define RADIO_RXSYNC_ALPHAFREQ_Pos (0UL)           /*!< Position of ALPHAFREQ field.                                         */
  #define RADIO_RXSYNC_ALPHAFREQ_Msk (0x1FUL << RADIO_RXSYNC_ALPHAFREQ_Pos) /*!< Bit mask of ALPHAFREQ field.                  */

/* BETAFREQ @Bits 5..9 : Coefficient to update frequency offset. Default value is 00100, corresponds to 1/8. */
  #define RADIO_RXSYNC_BETAFREQ_Pos (5UL)            /*!< Position of BETAFREQ field.                                          */
  #define RADIO_RXSYNC_BETAFREQ_Msk (0x1FUL << RADIO_RXSYNC_BETAFREQ_Pos) /*!< Bit mask of BETAFREQ field.                     */

/* PEAKTH @Bits 10..16 : Threshold value for peak strength. Default value is 0001111, corresponds to 0.35. */
  #define RADIO_RXSYNC_PEAKTH_Pos (10UL)             /*!< Position of PEAKTH field.                                            */
  #define RADIO_RXSYNC_PEAKTH_Msk (0x7FUL << RADIO_RXSYNC_PEAKTH_Pos) /*!< Bit mask of PEAKTH field.                           */


/* RADIO_TXCONFIG: Tx configuration */
  #define RADIO_TXCONFIG_ResetValue (0x00405878UL)   /*!< Reset value of TXCONFIG register.                                    */

/* CODEPOLY0 @Bits 0..6 : Code polynomial 0 */
  #define RADIO_TXCONFIG_CODEPOLY0_Pos (0UL)         /*!< Position of CODEPOLY0 field.                                         */
  #define RADIO_TXCONFIG_CODEPOLY0_Msk (0x7FUL << RADIO_TXCONFIG_CODEPOLY0_Pos) /*!< Bit mask of CODEPOLY0 field.              */

/* CODEPOLY1 @Bits 8..14 : Code polynomial 1 */
  #define RADIO_TXCONFIG_CODEPOLY1_Pos (8UL)         /*!< Position of CODEPOLY1 field.                                         */
  #define RADIO_TXCONFIG_CODEPOLY1_Msk (0x7FUL << RADIO_TXCONFIG_CODEPOLY1_Pos) /*!< Bit mask of CODEPOLY1 field.              */

/* LRSPREADSWAP @Bit 16 : Swap pattern mapping. Default 0, 0 is mapped to a 0011 sequence, 1 is mapped to a 1100 sequence. If
                          swap bit is set, 1 is mapped to a 0011 sequence, 0 is mapped to a 1100 sequence. */                     
                                                                                                                                  
  #define RADIO_TXCONFIG_LRSPREADSWAP_Pos (16UL)     /*!< Position of LRSPREADSWAP field.                                      */
  #define RADIO_TXCONFIG_LRSPREADSWAP_Msk (0x1UL << RADIO_TXCONFIG_LRSPREADSWAP_Pos) /*!< Bit mask of LRSPREADSWAP field.      */

/* BYPASSPRECODE @Bit 17 : Bypass MSK precoding */
  #define RADIO_TXCONFIG_BYPASSPRECODE_Pos (17UL)    /*!< Position of BYPASSPRECODE field.                                     */
  #define RADIO_TXCONFIG_BYPASSPRECODE_Msk (0x1UL << RADIO_TXCONFIG_BYPASSPRECODE_Pos) /*!< Bit mask of BYPASSPRECODE field.   */

/* IQMODENABLE @Bit 18 : Enable IQ modulator */
  #define RADIO_TXCONFIG_IQMODENABLE_Pos (18UL)      /*!< Position of IQMODENABLE field.                                       */
  #define RADIO_TXCONFIG_IQMODENABLE_Msk (0x1UL << RADIO_TXCONFIG_IQMODENABLE_Pos) /*!< Bit mask of IQMODENABLE field.         */

/* IQMODSYMBOL @Bits 19..21 : IQMOD additional symbol mapping not set by MODE(Future) */
  #define RADIO_TXCONFIG_IQMODSYMBOL_Pos (19UL)      /*!< Position of IQMODSYMBOL field.                                       */
  #define RADIO_TXCONFIG_IQMODSYMBOL_Msk (0x7UL << RADIO_TXCONFIG_IQMODSYMBOL_Pos) /*!< Bit mask of IQMODSYMBOL field.         */

/* IQMODBT @Bits 22..23 : IQMOD GFSK bandwidth */
  #define RADIO_TXCONFIG_IQMODBT_Pos (22UL)          /*!< Position of IQMODBT field.                                           */
  #define RADIO_TXCONFIG_IQMODBT_Msk (0x3UL << RADIO_TXCONFIG_IQMODBT_Pos) /*!< Bit mask of IQMODBT field.                     */
  #define RADIO_TXCONFIG_IQMODBT_Min (0x0UL)         /*!< Min enumerator value of IQMODBT field.                               */
  #define RADIO_TXCONFIG_IQMODBT_Max (0x1UL)         /*!< Max enumerator value of IQMODBT field.                               */
  #define RADIO_TXCONFIG_IQMODBT_0BT55 (0x0UL)       /*!< BT=0.55                                                              */
  #define RADIO_TXCONFIG_IQMODBT_0BT60 (0x1UL)       /*!< BT=0.60                                                              */

/* IQMODINDEX @Bits 25..27 : IQMOD modulation index */
  #define RADIO_TXCONFIG_IQMODINDEX_Pos (25UL)       /*!< Position of IQMODINDEX field.                                        */
  #define RADIO_TXCONFIG_IQMODINDEX_Msk (0x7UL << RADIO_TXCONFIG_IQMODINDEX_Pos) /*!< Bit mask of IQMODINDEX field.            */
  #define RADIO_TXCONFIG_IQMODINDEX_Min (0x0UL)      /*!< Min enumerator value of IQMODINDEX field.                            */
  #define RADIO_TXCONFIG_IQMODINDEX_Max (0x4UL)      /*!< Max enumerator value of IQMODINDEX field.                            */
  #define RADIO_TXCONFIG_IQMODINDEX_ModIndex0h25 (0x0UL) /*!< Modulation index = 0.25(Future)                                  */
  #define RADIO_TXCONFIG_IQMODINDEX_ModIndex0h32 (0x1UL) /*!< Modulation index = 0.32(Future)                                  */
  #define RADIO_TXCONFIG_IQMODINDEX_ModIndex0h5 (0x2UL) /*!< Modulation index = 0.5(Future)                                    */
  #define RADIO_TXCONFIG_IQMODINDEX_ModIndex1h0 (0x3UL) /*!< Modulation index = 1(Future)                                      */
  #define RADIO_TXCONFIG_IQMODINDEX_ModIndex2h0 (0x4UL) /*!< Modulation index = 2(Future)                                      */

/* IEEE802154 @Bit 28 : Enable Tx for Ieee802154_250Kbit mode and long range modes (Do not enable both Ieee802154_250Kbit and
                        long range) */                                                                                            
                                                                                                                                  
