adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIO_DFECTRL4: Various hacker/tuning configuration for Direction finding */
  #define RADIO_DFECTRL4_ResetValue (0xFFF7FF00UL)   /*!< Reset value of DFECTRL4 register.                                    */

/* SAMPLESTARTRELATIVETO @Bits 0..1 : Start point of TSAMPLEOFFSET sampling relative to which part in the switching state
                                      machine */                                                                                  
                                                                                                                                  
  #define RADIO_DFECTRL4_SAMPLESTARTRELATIVETO_Pos (0UL) /*!< Position of SAMPLESTARTRELATIVETO field.                         */
  #define RADIO_DFECTRL4_SAMPLESTARTRELATIVETO_Msk (0x3UL << RADIO_DFECTRL4_SAMPLESTARTRELATIVETO_Pos) /*!< Bit mask of
                                                                            SAMPLESTARTRELATIVETO field.*/                        
  #define RADIO_DFECTRL4_SAMPLESTARTRELATIVETO_Min (0x0UL) /*!< Min enumerator value of SAMPLESTARTRELATIVETO field.           */
  #define RADIO_DFECTRL4_SAMPLESTARTRELATIVETO_Max (0x3UL) /*!< Max enumerator value of SAMPLESTARTRELATIVETO field.           */
  #define RADIO_DFECTRL4_SAMPLESTARTRELATIVETO_Reference (0x0UL) /*!< At the start of the reference antenna period             */
  #define RADIO_DFECTRL4_SAMPLESTARTRELATIVETO_Switching (0x1UL) /*!< At the start of antenna switching after the reference
                                                                      antenna period*/                                            
  #define RADIO_DFECTRL4_SAMPLESTARTRELATIVETO_Trigger (0x2UL) /*!< When it is triggered Either TASKS_DFESTART, address match or
                                                                    AoA/AoD procedure trigger source*/                            
  #define RADIO_DFECTRL4_SAMPLESTARTRELATIVETO_Guard (0x3UL) /*!< At the start of the GUARD period                             */

/* IGNORE8USLENGTH @Bit 2 : Ignore the length specification in numberOf8us */
  #define RADIO_DFECTRL4_IGNORE8USLENGTH_Pos (2UL)   /*!< Position of IGNORE8USLENGTH field.                                   */
  #define RADIO_DFECTRL4_IGNORE8USLENGTH_Msk (0x1UL << RADIO_DFECTRL4_IGNORE8USLENGTH_Pos) /*!< Bit mask of IGNORE8USLENGTH
                                                                            field.*/                                              
  #define RADIO_DFECTRL4_IGNORE8USLENGTH_Min (0x0UL) /*!< Min enumerator value of IGNORE8USLENGTH field.                       */
  #define RADIO_DFECTRL4_IGNORE8USLENGTH_Max (0x1UL) /*!< Max enumerator value of IGNORE8USLENGTH field.                       */
  #define RADIO_DFECTRL4_IGNORE8USLENGTH_DoNotIgnore (0x0UL) /*!< Use the length specification                                 */
  #define RADIO_DFECTRL4_IGNORE8USLENGTH_Ignore (0x1UL) /*!< Ignore the length specification                                   */

/* IGNOREMAXSPEC @Bit 3 : Ignore the maximum number of samples and antenna slots specified with MAXTOTALSAMPLES and
                          MAXTOTALSLOTS */                                                                                        
                                                                                                                                  
  #define RADIO_DFECTRL4_IGNOREMAXSPEC_Pos (3UL)     /*!< Position of IGNOREMAXSPEC field.                                     */
  #define RADIO_DFECTRL4_IGNOREMAXSPEC_Msk (0x1UL << RADIO_DFECTRL4_IGNOREMAXSPEC_Pos) /*!< Bit mask of IGNOREMAXSPEC field.   */
  #define RADIO_DFECTRL4_IGNOREMAXSPEC_Min (0x0UL)   /*!< Min enumerator value of IGNOREMAXSPEC field.                         */
  #define RADIO_DFECTRL4_IGNOREMAXSPEC_Max (0x1UL)   /*!< Max enumerator value of IGNOREMAXSPEC field.                         */
  #define RADIO_DFECTRL4_IGNOREMAXSPEC_DoNotIgnore (0x0UL) /*!< Use the max specs                                              */
  #define RADIO_DFECTRL4_IGNOREMAXSPEC_Ignore (0x1UL) /*!< Ignore the max specs                                                */

/* SWITCHBACKTOREF @Bit 4 : Insert reference antenna(SWITCHPATTERN[1]) between antenna switches, from SWITCHPATTERN[2] onwards */
  #define RADIO_DFECTRL4_SWITCHBACKTOREF_Pos (4UL)   /*!< Position of SWITCHBACKTOREF field.                                   */
  #define RADIO_DFECTRL4_SWITCHBACKTOREF_Msk (0x1UL << RADIO_DFECTRL4_SWITCHBACKTOREF_Pos) /*!< Bit mask of SWITCHBACKTOREF
                                                                            field.*/                                              
  #define RADIO_DFECTRL4_SWITCHBACKTOREF_Min (0x0UL) /*!< Min enumerator value of SWITCHBACKTOREF field.                       */
  #define RADIO_DFECTRL4_SWITCHBACKTOREF_Max (0x1UL) /*!< Max enumerator value of SWITCHBACKTOREF field.                       */
  #define RADIO_DFECTRL4_SWITCHBACKTOREF_Disabled (0x0UL) /*!< Do not insert reference antenna between switches                */
  #define RADIO_DFECTRL4_SWITCHBACKTOREF_Enabled (0x1UL) /*!< Insert reference antenna between switches                        */

/* IGNOREENDOFPACKET @Bit 5 : Ignore that the UTxRxChain says that the packet has been received Continue running if more time to
                              run */                                                                                              
                                                                                                                                  
  #define RADIO_DFECTRL4_IGNOREENDOFPACKET_Pos (5UL) /*!< Position of IGNOREENDOFPACKET field.                                 */
  #define RADIO_DFECTRL4_IGNOREENDOFPACKET_Msk (0x1UL << RADIO_DFECTRL4_IGNOREENDOFPACKET_Pos) /*!< Bit mask of
                                                                            IGNOREENDOFPACKET field.*/                            
  #define RADIO_DFECTRL4_IGNOREENDOFPACKET_Min (0x0UL) /*!< Min enumerator value of IGNOREENDOFPACKET field.                   */
  #define RADIO_DFECTRL4_IGNOREENDOFPACKET_Max (0x1UL) /*!< Max enumerator value of IGNOREENDOFPACKET field.                   */
  #define RADIO_DFECTRL4_IGNOREENDOFPACKET_DoNotIgnore (0x0UL) /*!< Do not ignore the end of packet                            */
  #define RADIO_DFECTRL4_IGNOREENDOFPACKET_Ignore (0x1UL) /*!< Ignore the end of packet                                        */

