adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ONESAMPLEPERSLOT @Bit 6 : TSAMPLESPACING is ignored for the samples taken in the SWITCHING state TSAMPLESPACINGREF is still
                             used for the first samples (REFERENCE period) */                                                     
                                                                                                                                  
  #define RADIO_DFECTRL4_ONESAMPLEPERSLOT_Pos (6UL)  /*!< Position of ONESAMPLEPERSLOT field.                                  */
  #define RADIO_DFECTRL4_ONESAMPLEPERSLOT_Msk (0x1UL << RADIO_DFECTRL4_ONESAMPLEPERSLOT_Pos) /*!< Bit mask of ONESAMPLEPERSLOT
                                                                            field.*/                                              

/* DFECORREN @Bit 7 : Enable correlator before Direction Finding samples */
  #define RADIO_DFECTRL4_DFECORREN_Pos (7UL)         /*!< Position of DFECORREN field.                                         */
  #define RADIO_DFECTRL4_DFECORREN_Msk (0x1UL << RADIO_DFECTRL4_DFECORREN_Pos) /*!< Bit mask of DFECORREN field.               */
  #define RADIO_DFECTRL4_DFECORREN_Min (0x0UL)       /*!< Min enumerator value of DFECORREN field.                             */
  #define RADIO_DFECTRL4_DFECORREN_Max (0x1UL)       /*!< Max enumerator value of DFECORREN field.                             */
  #define RADIO_DFECTRL4_DFECORREN_Disabled (0x0UL)  /*!< Disable correlator                                                   */
  #define RADIO_DFECTRL4_DFECORREN_Enabled (0x1UL)   /*!< Enable correlator                                                    */

/* MAXTOTALSLOTS @Bits 8..18 : Maximum number of antenna slots */
  #define RADIO_DFECTRL4_MAXTOTALSLOTS_Pos (8UL)     /*!< Position of MAXTOTALSLOTS field.                                     */
  #define RADIO_DFECTRL4_MAXTOTALSLOTS_Msk (0x7FFUL << RADIO_DFECTRL4_MAXTOTALSLOTS_Pos) /*!< Bit mask of MAXTOTALSLOTS field. */

/* RETURNTOREFATEND @Bit 19 : Start position of repeated part of switching pattern sequence */
  #define RADIO_DFECTRL4_RETURNTOREFATEND_Pos (19UL) /*!< Position of RETURNTOREFATEND field.                                  */
  #define RADIO_DFECTRL4_RETURNTOREFATEND_Msk (0x1UL << RADIO_DFECTRL4_RETURNTOREFATEND_Pos) /*!< Bit mask of RETURNTOREFATEND
                                                                            field.*/                                              
  #define RADIO_DFECTRL4_RETURNTOREFATEND_Min (0x0UL) /*!< Min enumerator value of RETURNTOREFATEND field.                     */
  #define RADIO_DFECTRL4_RETURNTOREFATEND_Max (0x1UL) /*!< Max enumerator value of RETURNTOREFATEND field.                     */
  #define RADIO_DFECTRL4_RETURNTOREFATEND_Disabled (0x0UL) /*!< Return to SWITCHPATTERN[2] after reaching the end of the
                                                                switching pattern sequence*/                                      
  #define RADIO_DFECTRL4_RETURNTOREFATEND_Enabled (0x1UL) /*!< Return to SWITCHPATTERN[1] after reaching the end of the
                                                               switching pattern sequence*/                                       

/* MAXTOTALSAMPLES @Bits 20..31 : Maximum number of samples to capture */
  #define RADIO_DFECTRL4_MAXTOTALSAMPLES_Pos (20UL)  /*!< Position of MAXTOTALSAMPLES field.                                   */
  #define RADIO_DFECTRL4_MAXTOTALSAMPLES_Msk (0xFFFUL << RADIO_DFECTRL4_MAXTOTALSAMPLES_Pos) /*!< Bit mask of MAXTOTALSAMPLES
                                                                            field.*/                                              


/* RADIO_DFECTRL5: Various hacker/tuning configuration for Direction finding */
  #define RADIO_DFECTRL5_ResetValue (0x00010000UL)   /*!< Reset value of DFECTRL5 register.                                    */

/* SATURATIONMODE @Bits 16..17 : Set how input saturation will be present in the captured samples */
  #define RADIO_DFECTRL5_SATURATIONMODE_Pos (16UL)   /*!< Position of SATURATIONMODE field.                                    */
  #define RADIO_DFECTRL5_SATURATIONMODE_Msk (0x3UL << RADIO_DFECTRL5_SATURATIONMODE_Pos) /*!< Bit mask of SATURATIONMODE field.*/
  #define RADIO_DFECTRL5_SATURATIONMODE_Min (0x0UL)  /*!< Min enumerator value of SATURATIONMODE field.                        */
  #define RADIO_DFECTRL5_SATURATIONMODE_Max (0x2UL)  /*!< Max enumerator value of SATURATIONMODE field.                        */
  #define RADIO_DFECTRL5_SATURATIONMODE_OFF (0x0UL)  /*!< No saturation is presented                                           */
  #define RADIO_DFECTRL5_SATURATIONMODE_SETMINVAL (0x1UL) /*!< Saturation is marked by setting both I and Q to -32768 (or
                                                               mag/phase if SAMPLETYPE is 1)*/                                    
  #define RADIO_DFECTRL5_SATURATIONMODE_SATURATIONBIT (0x2UL) /*!< Bit 15 of both the I and Q values indicates saturation. I and
                                                                   Q are hence only 15 bit values*/                               

/* NEVERIGNORESAT @Bit 18 : Selects whether saturation (being reported from the radio front-end) should be ignored in the
                            beginning of the slot or not */                                                                       
                                                                                                                                  
  #define RADIO_DFECTRL5_NEVERIGNORESAT_Pos (18UL)   /*!< Position of NEVERIGNORESAT field.                                    */
  #define RADIO_DFECTRL5_NEVERIGNORESAT_Msk (0x1UL << RADIO_DFECTRL5_NEVERIGNORESAT_Pos) /*!< Bit mask of NEVERIGNORESAT field.*/
  #define RADIO_DFECTRL5_NEVERIGNORESAT_Min (0x0UL)  /*!< Min enumerator value of NEVERIGNORESAT field.                        */
  #define RADIO_DFECTRL5_NEVERIGNORESAT_Max (0x1UL)  /*!< Max enumerator value of NEVERIGNORESAT field.                        */
  #define RADIO_DFECTRL5_NEVERIGNORESAT_IGNORE (0x0UL) /*!< Saturation being indicated from the front-end is ignored if it
                                                            happens in the first 40 percent of the sample spacing after a sample
                                                            was saved to RAM*/                                                    
  #define RADIO_DFECTRL5_NEVERIGNORESAT_NEVERIGNORE (0x1UL) /*!< Saturation is always reported in RAM if detected by the
                                                                 frontend*/                                                       

/* DFEOFFSETSTDHYP @Bits 24..28 : Tuning of the timing difference between the hypermode demodulator and the standard demodulator
                                  for the DFE start event, in 62.5 ns units */                                                    
                                                                                                                                  
  #define RADIO_DFECTRL5_DFEOFFSETSTDHYP_Pos (24UL)  /*!< Position of DFEOFFSETSTDHYP field.                                   */
  #define RADIO_DFECTRL5_DFEOFFSETSTDHYP_Msk (0x1FUL << RADIO_DFECTRL5_DFEOFFSETSTDHYP_Pos) /*!< Bit mask of DFEOFFSETSTDHYP
                                                                            field.*/                                              


