adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CTEINLINERXMODE2US @Bits 13..15 : Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Pos (13UL) /*!< Position of CTEINLINERXMODE2US field.                         */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Msk (0x7UL << RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Pos) /*!< Bit mask of
                                                                            CTEINLINERXMODE2US field.*/                           
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Min (0x0UL) /*!< Min enumerator value of CTEINLINERXMODE2US field.            */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Max (0x6UL) /*!< Max enumerator value of CTEINLINERXMODE2US field.            */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_8us (0x0UL) /*!< 8us                                                          */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_4us (0x1UL) /*!< 4us                                                          */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_2us (0x2UL) /*!< 2us                                                          */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_1us (0x3UL) /*!< 1us                                                          */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_500ns (0x4UL) /*!< 0.5us                                                      */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_250ns (0x5UL) /*!< 0.25us                                                     */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_125ns (0x6UL) /*!< 0.125us                                                    */

/* S0CONF @Bits 16..23 : S0 bit pattern to match */
  #define RADIO_CTEINLINECONF_S0CONF_Pos (16UL)      /*!< Position of S0CONF field.                                            */
  #define RADIO_CTEINLINECONF_S0CONF_Msk (0xFFUL << RADIO_CTEINLINECONF_S0CONF_Pos) /*!< Bit mask of S0CONF field.             */

/* S0MASK @Bits 24..31 : S0 bit mask to set which bit to match */
  #define RADIO_CTEINLINECONF_S0MASK_Pos (24UL)      /*!< Position of S0MASK field.                                            */
  #define RADIO_CTEINLINECONF_S0MASK_Msk (0xFFUL << RADIO_CTEINLINECONF_S0MASK_Pos) /*!< Bit mask of S0MASK field.             */


/* RADIO_DMASTART: (unspecified) */
  #define RADIO_DMASTART_ResetValue (0x00000000UL)   /*!< Reset value of DMASTART register.                                    */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_DMASTART_TRIG_Pos (0UL)              /*!< Position of TRIG field.                                              */
  #define RADIO_DMASTART_TRIG_Msk (0x1UL << RADIO_DMASTART_TRIG_Pos) /*!< Bit mask of TRIG field.                              */


/* RADIO_DMASTOP: (unspecified) */
  #define RADIO_DMASTOP_ResetValue (0x00000000UL)    /*!< Reset value of DMASTOP register.                                     */

/* TRIG @Bit 0 : (unspecified) */
  #define RADIO_DMASTOP_TRIG_Pos (0UL)               /*!< Position of TRIG field.                                              */
  #define RADIO_DMASTOP_TRIG_Msk (0x1UL << RADIO_DMASTOP_TRIG_Pos) /*!< Bit mask of TRIG field.                                */


/* RADIO_DMAENABLE: (unspecified) */
  #define RADIO_DMAENABLE_ResetValue (0x00000000UL)  /*!< Reset value of DMAENABLE register.                                   */

/* ENABLE @Bit 0 : (unspecified) */
  #define RADIO_DMAENABLE_ENABLE_Pos (0UL)           /*!< Position of ENABLE field.                                            */
  #define RADIO_DMAENABLE_ENABLE_Msk (0x1UL << RADIO_DMAENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                      */


/* RADIO_PACKETPTR: (unspecified) */
  #define RADIO_PACKETPTR_ResetValue (0x00000000UL)  /*!< Reset value of PACKETPTR register.                                   */

/* OFFSET @Bits 0..15 : (unspecified) */
  #define RADIO_PACKETPTR_OFFSET_Pos (0UL)           /*!< Position of OFFSET field.                                            */
  #define RADIO_PACKETPTR_OFFSET_Msk (0xFFFFUL << RADIO_PACKETPTR_OFFSET_Pos) /*!< Bit mask of OFFSET field.                   */

/* BASE @Bit 29 : (unspecified) */
  #define RADIO_PACKETPTR_BASE_Pos (29UL)            /*!< Position of BASE field.                                              */
  #define RADIO_PACKETPTR_BASE_Msk (0x1UL << RADIO_PACKETPTR_BASE_Pos) /*!< Bit mask of BASE field.                            */


/* RADIO_DMAAMOUNT: (unspecified) */
  #define RADIO_DMAAMOUNT_ResetValue (0x00000000UL)  /*!< Reset value of DMAAMOUNT register.                                   */

/* AMOUNT @Bits 0..8 : (unspecified) */
  #define RADIO_DMAAMOUNT_AMOUNT_Pos (0UL)           /*!< Position of AMOUNT field.                                            */
  #define RADIO_DMAAMOUNT_AMOUNT_Msk (0x1FFUL << RADIO_DMAAMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.                    */


/* RADIO_DMAMAXCNT: (unspecified) */
  #define RADIO_DMAMAXCNT_ResetValue (0x00000103UL)  /*!< Reset value of DMAMAXCNT register.                                   */

/* MAXCNT @Bits 0..8 : (unspecified) */
  #define RADIO_DMAMAXCNT_MAXCNT_Pos (0UL)           /*!< Position of MAXCNT field.                                            */
  #define RADIO_DMAMAXCNT_MAXCNT_Msk (0x1FFUL << RADIO_DMAMAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                    */


/* RADIO_AUTOCLOCKSOURCEREQ: (unspecified) */
  #define RADIO_AUTOCLOCKSOURCEREQ_ResetValue (0x00000000UL) /*!< Reset value of AUTOCLOCKSOURCEREQ register.                  */

/* PCP0 @Bit 0 : (unspecified) */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP0_Pos (0UL)    /*!< Position of PCP0 field.                                              */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP0_Msk (0x1UL << RADIO_AUTOCLOCKSOURCEREQ_PCP0_Pos) /*!< Bit mask of PCP0 field.          */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP0_Min (0x0UL)  /*!< Min enumerator value of PCP0 field.                                  */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP0_Max (0x1UL)  /*!< Max enumerator value of PCP0 field.                                  */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP0_On (0x0UL)   /*!< (unspecified)                                                        */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP0_Off (0x1UL)  /*!< (unspecified)                                                        */

/* PCP1 @Bit 1 : (unspecified) */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP1_Pos (1UL)    /*!< Position of PCP1 field.                                              */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP1_Msk (0x1UL << RADIO_AUTOCLOCKSOURCEREQ_PCP1_Pos) /*!< Bit mask of PCP1 field.          */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP1_Min (0x0UL)  /*!< Min enumerator value of PCP1 field.                                  */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP1_Max (0x1UL)  /*!< Max enumerator value of PCP1 field.                                  */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP1_On (0x0UL)   /*!< (unspecified)                                                        */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP1_Off (0x1UL)  /*!< (unspecified)                                                        */

/* PCP2 @Bit 2 : (unspecified) */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP2_Pos (2UL)    /*!< Position of PCP2 field.                                              */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP2_Msk (0x1UL << RADIO_AUTOCLOCKSOURCEREQ_PCP2_Pos) /*!< Bit mask of PCP2 field.          */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP2_Min (0x0UL)  /*!< Min enumerator value of PCP2 field.                                  */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP2_Max (0x1UL)  /*!< Max enumerator value of PCP2 field.                                  */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP2_On (0x0UL)   /*!< (unspecified)                                                        */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP2_Off (0x1UL)  /*!< (unspecified)                                                        */

/* PCP3 @Bit 3 : (unspecified) */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP3_Pos (3UL)    /*!< Position of PCP3 field.                                              */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP3_Msk (0x1UL << RADIO_AUTOCLOCKSOURCEREQ_PCP3_Pos) /*!< Bit mask of PCP3 field.          */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP3_Min (0x0UL)  /*!< Min enumerator value of PCP3 field.                                  */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP3_Max (0x1UL)  /*!< Max enumerator value of PCP3 field.                                  */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP3_On (0x0UL)   /*!< (unspecified)                                                        */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP3_Off (0x1UL)  /*!< (unspecified)                                                        */

