adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PCP4 @Bit 4 : (unspecified) */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP4_Pos (4UL)    /*!< Position of PCP4 field.                                              */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP4_Msk (0x1UL << RADIO_AUTOCLOCKSOURCEREQ_PCP4_Pos) /*!< Bit mask of PCP4 field.          */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP4_Min (0x0UL)  /*!< Min enumerator value of PCP4 field.                                  */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP4_Max (0x1UL)  /*!< Max enumerator value of PCP4 field.                                  */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP4_On (0x0UL)   /*!< (unspecified)                                                        */
  #define RADIO_AUTOCLOCKSOURCEREQ_PCP4_Off (0x1UL)  /*!< (unspecified)                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         RADIOACC                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =============================================== Struct RADIOACC_TASKS_DMAA ================================================ */
/**
  * @brief TASKS_DMAA [RADIOACC_TASKS_DMAA] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  START;                             /*!< (@ 0x00000000) Start the Task for DMA-A                              */
  __OM  uint32_t  STOP;                              /*!< (@ 0x00000004) Start the Task Stop for DMA-A                         */
  __OM  uint32_t  RESET;                             /*!< (@ 0x00000008) Start the Task Reset for DMA-A                        */
} NRF_RADIOACC_TASKS_DMAA_Type;                      /*!< Size = 12 (0x00C)                                                    */

/* RADIOACC_TASKS_DMAA_START: Start the Task for DMA-A */
  #define RADIOACC_TASKS_DMAA_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                              */

/* START @Bit 0 : Start the Task for DMA-A */
  #define RADIOACC_TASKS_DMAA_START_START_Pos (0UL)  /*!< Position of START field.                                             */
  #define RADIOACC_TASKS_DMAA_START_START_Msk (0x1UL << RADIOACC_TASKS_DMAA_START_START_Pos) /*!< Bit mask of START field.     */
  #define RADIOACC_TASKS_DMAA_START_START_Min (0x1UL) /*!< Min enumerator value of START field.                                */
  #define RADIOACC_TASKS_DMAA_START_START_Max (0x1UL) /*!< Max enumerator value of START field.                                */
  #define RADIOACC_TASKS_DMAA_START_START_Trigger (0x1UL) /*!< Trigger task                                                    */


/* RADIOACC_TASKS_DMAA_STOP: Start the Task Stop for DMA-A */
  #define RADIOACC_TASKS_DMAA_STOP_ResetValue (0x00000000UL) /*!< Reset value of STOP register.                                */

/* STOP @Bit 0 : Start the Task Stop for DMA-A */
  #define RADIOACC_TASKS_DMAA_STOP_STOP_Pos (0UL)    /*!< Position of STOP field.                                              */
  #define RADIOACC_TASKS_DMAA_STOP_STOP_Msk (0x1UL << RADIOACC_TASKS_DMAA_STOP_STOP_Pos) /*!< Bit mask of STOP field.          */
  #define RADIOACC_TASKS_DMAA_STOP_STOP_Min (0x1UL)  /*!< Min enumerator value of STOP field.                                  */
  #define RADIOACC_TASKS_DMAA_STOP_STOP_Max (0x1UL)  /*!< Max enumerator value of STOP field.                                  */
  #define RADIOACC_TASKS_DMAA_STOP_STOP_Trigger (0x1UL) /*!< Trigger task                                                      */


/* RADIOACC_TASKS_DMAA_RESET: Start the Task Reset for DMA-A */
  #define RADIOACC_TASKS_DMAA_RESET_ResetValue (0x00000000UL) /*!< Reset value of RESET register.                              */

/* RESET @Bit 0 : Start the Task Reset for DMA-A */
  #define RADIOACC_TASKS_DMAA_RESET_RESET_Pos (0UL)  /*!< Position of RESET field.                                             */
  #define RADIOACC_TASKS_DMAA_RESET_RESET_Msk (0x1UL << RADIOACC_TASKS_DMAA_RESET_RESET_Pos) /*!< Bit mask of RESET field.     */
  #define RADIOACC_TASKS_DMAA_RESET_RESET_Min (0x1UL) /*!< Min enumerator value of RESET field.                                */
  #define RADIOACC_TASKS_DMAA_RESET_RESET_Max (0x1UL) /*!< Max enumerator value of RESET field.                                */
  #define RADIOACC_TASKS_DMAA_RESET_RESET_Trigger (0x1UL) /*!< Trigger task                                                    */



/* =============================================== Struct RADIOACC_TASKS_DMAB ================================================ */
/**
  * @brief TASKS_DMAB [RADIOACC_TASKS_DMAB] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  START;                             /*!< (@ 0x00000000) Start the Task for DMA-B                              */
  __OM  uint32_t  STOP;                              /*!< (@ 0x00000004) Start the Task Stop for DMA-B                         */
  __OM  uint32_t  RESET;                             /*!< (@ 0x00000008) Start the Task Reset for DMA-B                        */
} NRF_RADIOACC_TASKS_DMAB_Type;                      /*!< Size = 12 (0x00C)                                                    */

/* RADIOACC_TASKS_DMAB_START: Start the Task for DMA-B */
  #define RADIOACC_TASKS_DMAB_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                              */

/* START @Bit 0 : Start the Task for DMA-B */
  #define RADIOACC_TASKS_DMAB_START_START_Pos (0UL)  /*!< Position of START field.                                             */
  #define RADIOACC_TASKS_DMAB_START_START_Msk (0x1UL << RADIOACC_TASKS_DMAB_START_START_Pos) /*!< Bit mask of START field.     */
  #define RADIOACC_TASKS_DMAB_START_START_Min (0x1UL) /*!< Min enumerator value of START field.                                */
  #define RADIOACC_TASKS_DMAB_START_START_Max (0x1UL) /*!< Max enumerator value of START field.                                */
  #define RADIOACC_TASKS_DMAB_START_START_Trigger (0x1UL) /*!< Trigger task                                                    */


/* RADIOACC_TASKS_DMAB_STOP: Start the Task Stop for DMA-B */
  #define RADIOACC_TASKS_DMAB_STOP_ResetValue (0x00000000UL) /*!< Reset value of STOP register.                                */

/* STOP @Bit 0 : Start the Task Stop for DMA-B */
  #define RADIOACC_TASKS_DMAB_STOP_STOP_Pos (0UL)    /*!< Position of STOP field.                                              */
  #define RADIOACC_TASKS_DMAB_STOP_STOP_Msk (0x1UL << RADIOACC_TASKS_DMAB_STOP_STOP_Pos) /*!< Bit mask of STOP field.          */
  #define RADIOACC_TASKS_DMAB_STOP_STOP_Min (0x1UL)  /*!< Min enumerator value of STOP field.                                  */
  #define RADIOACC_TASKS_DMAB_STOP_STOP_Max (0x1UL)  /*!< Max enumerator value of STOP field.                                  */
  #define RADIOACC_TASKS_DMAB_STOP_STOP_Trigger (0x1UL) /*!< Trigger task                                                      */


/* RADIOACC_TASKS_DMAB_RESET: Start the Task Reset for DMA-B */
  #define RADIOACC_TASKS_DMAB_RESET_ResetValue (0x00000000UL) /*!< Reset value of RESET register.                              */

/* RESET @Bit 0 : Start the Task Reset for DMA-B */
  #define RADIOACC_TASKS_DMAB_RESET_RESET_Pos (0UL)  /*!< Position of RESET field.                                             */
  #define RADIOACC_TASKS_DMAB_RESET_RESET_Msk (0x1UL << RADIOACC_TASKS_DMAB_RESET_RESET_Pos) /*!< Bit mask of RESET field.     */
  #define RADIOACC_TASKS_DMAB_RESET_RESET_Min (0x1UL) /*!< Min enumerator value of RESET field.                                */
  #define RADIOACC_TASKS_DMAB_RESET_RESET_Max (0x1UL) /*!< Max enumerator value of RESET field.                                */
  #define RADIOACC_TASKS_DMAB_RESET_RESET_Trigger (0x1UL) /*!< Trigger task                                                    */



/* ============================================= Struct RADIOACC_SUBSCRIBE_DMAA ============================================== */
/**
  * @brief SUBSCRIBE_DMAA [RADIOACC_SUBSCRIBE_DMAA] Subscribe configuration for tasks
  */
typedef struct {
  __IOM uint32_t  START;                             /*!< (@ 0x00000000) Subscribe configuration for task DMAA.START           */
  __IOM uint32_t  STOP;                              /*!< (@ 0x00000004) Subscribe configuration for task DMAA.STOP            */
  __IOM uint32_t  RESET;                             /*!< (@ 0x00000008) Subscribe configuration for task DMAA.RESET           */
} NRF_RADIOACC_SUBSCRIBE_DMAA_Type;                  /*!< Size = 12 (0x00C)                                                    */

/* RADIOACC_SUBSCRIBE_DMAA_START: Subscribe configuration for task DMAA.START */
  #define RADIOACC_SUBSCRIBE_DMAA_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task DMAA.START will subscribe to */
  #define RADIOACC_SUBSCRIBE_DMAA_START_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                          */
  #define RADIOACC_SUBSCRIBE_DMAA_START_CHIDX_Msk (0xFFUL << RADIOACC_SUBSCRIBE_DMAA_START_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIOACC_SUBSCRIBE_DMAA_START_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                       */
  #define RADIOACC_SUBSCRIBE_DMAA_START_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                       */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_SUBSCRIBE_DMAA_START_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define RADIOACC_SUBSCRIBE_DMAA_START_EN_Msk (0x1UL << RADIOACC_SUBSCRIBE_DMAA_START_EN_Pos) /*!< Bit mask of EN field.      */
  #define RADIOACC_SUBSCRIBE_DMAA_START_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define RADIOACC_SUBSCRIBE_DMAA_START_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define RADIOACC_SUBSCRIBE_DMAA_START_EN_Disabled (0x0UL) /*!< Disable subscription                                          */
  #define RADIOACC_SUBSCRIBE_DMAA_START_EN_Enabled (0x1UL) /*!< Enable subscription                                            */


/* RADIOACC_SUBSCRIBE_DMAA_STOP: Subscribe configuration for task DMAA.STOP */
  #define RADIOACC_SUBSCRIBE_DMAA_STOP_ResetValue (0x00000000UL) /*!< Reset value of STOP register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that task DMAA.STOP will subscribe to */
  #define RADIOACC_SUBSCRIBE_DMAA_STOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                           */
  #define RADIOACC_SUBSCRIBE_DMAA_STOP_CHIDX_Msk (0xFFUL << RADIOACC_SUBSCRIBE_DMAA_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIOACC_SUBSCRIBE_DMAA_STOP_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                        */
  #define RADIOACC_SUBSCRIBE_DMAA_STOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                        */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_SUBSCRIBE_DMAA_STOP_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define RADIOACC_SUBSCRIBE_DMAA_STOP_EN_Msk (0x1UL << RADIOACC_SUBSCRIBE_DMAA_STOP_EN_Pos) /*!< Bit mask of EN field.        */
  #define RADIOACC_SUBSCRIBE_DMAA_STOP_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define RADIOACC_SUBSCRIBE_DMAA_STOP_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define RADIOACC_SUBSCRIBE_DMAA_STOP_EN_Disabled (0x0UL) /*!< Disable subscription                                           */
  #define RADIOACC_SUBSCRIBE_DMAA_STOP_EN_Enabled (0x1UL) /*!< Enable subscription                                             */


