adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIOACC_SUBSCRIBE_DMAA_RESET: Subscribe configuration for task DMAA.RESET */
  #define RADIOACC_SUBSCRIBE_DMAA_RESET_ResetValue (0x00000000UL) /*!< Reset value of RESET register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task DMAA.RESET will subscribe to */
  #define RADIOACC_SUBSCRIBE_DMAA_RESET_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                          */
  #define RADIOACC_SUBSCRIBE_DMAA_RESET_CHIDX_Msk (0xFFUL << RADIOACC_SUBSCRIBE_DMAA_RESET_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIOACC_SUBSCRIBE_DMAA_RESET_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                       */
  #define RADIOACC_SUBSCRIBE_DMAA_RESET_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                       */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_SUBSCRIBE_DMAA_RESET_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define RADIOACC_SUBSCRIBE_DMAA_RESET_EN_Msk (0x1UL << RADIOACC_SUBSCRIBE_DMAA_RESET_EN_Pos) /*!< Bit mask of EN field.      */
  #define RADIOACC_SUBSCRIBE_DMAA_RESET_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define RADIOACC_SUBSCRIBE_DMAA_RESET_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define RADIOACC_SUBSCRIBE_DMAA_RESET_EN_Disabled (0x0UL) /*!< Disable subscription                                          */
  #define RADIOACC_SUBSCRIBE_DMAA_RESET_EN_Enabled (0x1UL) /*!< Enable subscription                                            */



/* ============================================= Struct RADIOACC_SUBSCRIBE_DMAB ============================================== */
/**
  * @brief SUBSCRIBE_DMAB [RADIOACC_SUBSCRIBE_DMAB] Subscribe configuration for tasks
  */
typedef struct {
  __IOM uint32_t  START;                             /*!< (@ 0x00000000) Subscribe configuration for task DMAB.START           */
  __IOM uint32_t  STOP;                              /*!< (@ 0x00000004) Subscribe configuration for task DMAB.STOP            */
  __IOM uint32_t  RESET;                             /*!< (@ 0x00000008) Subscribe configuration for task DMAB.RESET           */
} NRF_RADIOACC_SUBSCRIBE_DMAB_Type;                  /*!< Size = 12 (0x00C)                                                    */

/* RADIOACC_SUBSCRIBE_DMAB_START: Subscribe configuration for task DMAB.START */
  #define RADIOACC_SUBSCRIBE_DMAB_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task DMAB.START will subscribe to */
  #define RADIOACC_SUBSCRIBE_DMAB_START_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                          */
  #define RADIOACC_SUBSCRIBE_DMAB_START_CHIDX_Msk (0xFFUL << RADIOACC_SUBSCRIBE_DMAB_START_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIOACC_SUBSCRIBE_DMAB_START_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                       */
  #define RADIOACC_SUBSCRIBE_DMAB_START_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                       */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_SUBSCRIBE_DMAB_START_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define RADIOACC_SUBSCRIBE_DMAB_START_EN_Msk (0x1UL << RADIOACC_SUBSCRIBE_DMAB_START_EN_Pos) /*!< Bit mask of EN field.      */
  #define RADIOACC_SUBSCRIBE_DMAB_START_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define RADIOACC_SUBSCRIBE_DMAB_START_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define RADIOACC_SUBSCRIBE_DMAB_START_EN_Disabled (0x0UL) /*!< Disable subscription                                          */
  #define RADIOACC_SUBSCRIBE_DMAB_START_EN_Enabled (0x1UL) /*!< Enable subscription                                            */


/* RADIOACC_SUBSCRIBE_DMAB_STOP: Subscribe configuration for task DMAB.STOP */
  #define RADIOACC_SUBSCRIBE_DMAB_STOP_ResetValue (0x00000000UL) /*!< Reset value of STOP register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that task DMAB.STOP will subscribe to */
  #define RADIOACC_SUBSCRIBE_DMAB_STOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                           */
  #define RADIOACC_SUBSCRIBE_DMAB_STOP_CHIDX_Msk (0xFFUL << RADIOACC_SUBSCRIBE_DMAB_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIOACC_SUBSCRIBE_DMAB_STOP_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                        */
  #define RADIOACC_SUBSCRIBE_DMAB_STOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                        */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_SUBSCRIBE_DMAB_STOP_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define RADIOACC_SUBSCRIBE_DMAB_STOP_EN_Msk (0x1UL << RADIOACC_SUBSCRIBE_DMAB_STOP_EN_Pos) /*!< Bit mask of EN field.        */
  #define RADIOACC_SUBSCRIBE_DMAB_STOP_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define RADIOACC_SUBSCRIBE_DMAB_STOP_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define RADIOACC_SUBSCRIBE_DMAB_STOP_EN_Disabled (0x0UL) /*!< Disable subscription                                           */
  #define RADIOACC_SUBSCRIBE_DMAB_STOP_EN_Enabled (0x1UL) /*!< Enable subscription                                             */


/* RADIOACC_SUBSCRIBE_DMAB_RESET: Subscribe configuration for task DMAB.RESET */
  #define RADIOACC_SUBSCRIBE_DMAB_RESET_ResetValue (0x00000000UL) /*!< Reset value of RESET register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task DMAB.RESET will subscribe to */
  #define RADIOACC_SUBSCRIBE_DMAB_RESET_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                          */
  #define RADIOACC_SUBSCRIBE_DMAB_RESET_CHIDX_Msk (0xFFUL << RADIOACC_SUBSCRIBE_DMAB_RESET_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIOACC_SUBSCRIBE_DMAB_RESET_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                       */
  #define RADIOACC_SUBSCRIBE_DMAB_RESET_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                       */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_SUBSCRIBE_DMAB_RESET_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define RADIOACC_SUBSCRIBE_DMAB_RESET_EN_Msk (0x1UL << RADIOACC_SUBSCRIBE_DMAB_RESET_EN_Pos) /*!< Bit mask of EN field.      */
  #define RADIOACC_SUBSCRIBE_DMAB_RESET_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define RADIOACC_SUBSCRIBE_DMAB_RESET_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define RADIOACC_SUBSCRIBE_DMAB_RESET_EN_Disabled (0x0UL) /*!< Disable subscription                                          */
  #define RADIOACC_SUBSCRIBE_DMAB_RESET_EN_Enabled (0x1UL) /*!< Enable subscription                                            */



/* =============================================== Struct RADIOACC_EVENTS_DMAA =============================================== */
/**
  * @brief EVENTS_DMAA [RADIOACC_EVENTS_DMAA] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  LISTDONE;                          /*!< (@ 0x00000000) Event List Done DMA-A                                 */
  __IOM uint32_t  LISTPARTDONE;                      /*!< (@ 0x00000004) Event List Part Done DMA-A                            */
  __IOM uint32_t  SELECTJOBDONE;                     /*!< (@ 0x00000008) Event List Select Job Done DMA-A                      */
  __IOM uint32_t  DATADONE;                          /*!< (@ 0x0000000C) Event Data Done DMA-A                                 */
  __IOM uint32_t  JOBDONE;                           /*!< (@ 0x00000010) Event Job Done DMA-A                                  */
  __IOM uint32_t  ERROR;                             /*!< (@ 0x00000014) Event Error DMA-A                                     */
  __IOM uint32_t  STOP;                              /*!< (@ 0x00000018) Event Stop DMA-A                                      */
  __IOM uint32_t  RESET;                             /*!< (@ 0x0000001C) Event Reset DMA-A                                     */
} NRF_RADIOACC_EVENTS_DMAA_Type;                     /*!< Size = 32 (0x020)                                                    */

/* RADIOACC_EVENTS_DMAA_LISTDONE: Event List Done DMA-A */
  #define RADIOACC_EVENTS_DMAA_LISTDONE_ResetValue (0x00000000UL) /*!< Reset value of LISTDONE register.                       */

/* LISTDONE @Bit 0 : Event List Done DMA-A */
  #define RADIOACC_EVENTS_DMAA_LISTDONE_LISTDONE_Pos (0UL) /*!< Position of LISTDONE field.                                    */
  #define RADIOACC_EVENTS_DMAA_LISTDONE_LISTDONE_Msk (0x1UL << RADIOACC_EVENTS_DMAA_LISTDONE_LISTDONE_Pos) /*!< Bit mask of
                                                                            LISTDONE field.*/                                     
  #define RADIOACC_EVENTS_DMAA_LISTDONE_LISTDONE_Min (0x0UL) /*!< Min enumerator value of LISTDONE field.                      */
  #define RADIOACC_EVENTS_DMAA_LISTDONE_LISTDONE_Max (0x1UL) /*!< Max enumerator value of LISTDONE field.                      */
  #define RADIOACC_EVENTS_DMAA_LISTDONE_LISTDONE_NotGenerated (0x0UL) /*!< Event not generated                                 */
  #define RADIOACC_EVENTS_DMAA_LISTDONE_LISTDONE_Generated (0x1UL) /*!< Event generated                                        */


/* RADIOACC_EVENTS_DMAA_LISTPARTDONE: Event List Part Done DMA-A */
  #define RADIOACC_EVENTS_DMAA_LISTPARTDONE_ResetValue (0x00000000UL) /*!< Reset value of LISTPARTDONE register.               */

