adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LISTPARTDONE @Bit 0 : Event List Part Done DMA-A */
  #define RADIOACC_EVENTS_DMAA_LISTPARTDONE_LISTPARTDONE_Pos (0UL) /*!< Position of LISTPARTDONE field.                        */
  #define RADIOACC_EVENTS_DMAA_LISTPARTDONE_LISTPARTDONE_Msk (0x1UL << RADIOACC_EVENTS_DMAA_LISTPARTDONE_LISTPARTDONE_Pos) /*!<
                                                                            Bit mask of LISTPARTDONE field.*/                     
  #define RADIOACC_EVENTS_DMAA_LISTPARTDONE_LISTPARTDONE_Min (0x0UL) /*!< Min enumerator value of LISTPARTDONE field.          */
  #define RADIOACC_EVENTS_DMAA_LISTPARTDONE_LISTPARTDONE_Max (0x1UL) /*!< Max enumerator value of LISTPARTDONE field.          */
  #define RADIOACC_EVENTS_DMAA_LISTPARTDONE_LISTPARTDONE_NotGenerated (0x0UL) /*!< Event not generated                         */
  #define RADIOACC_EVENTS_DMAA_LISTPARTDONE_LISTPARTDONE_Generated (0x1UL) /*!< Event generated                                */


/* RADIOACC_EVENTS_DMAA_SELECTJOBDONE: Event List Select Job Done DMA-A */
  #define RADIOACC_EVENTS_DMAA_SELECTJOBDONE_ResetValue (0x00000000UL) /*!< Reset value of SELECTJOBDONE register.             */

/* SELECTJOBDONE @Bit 0 : Event List Select Job Done DMA-A */
  #define RADIOACC_EVENTS_DMAA_SELECTJOBDONE_SELECTJOBDONE_Pos (0UL) /*!< Position of SELECTJOBDONE field.                     */
  #define RADIOACC_EVENTS_DMAA_SELECTJOBDONE_SELECTJOBDONE_Msk (0x1UL << RADIOACC_EVENTS_DMAA_SELECTJOBDONE_SELECTJOBDONE_Pos)
                                                                            /*!< Bit mask of SELECTJOBDONE field.*/               
  #define RADIOACC_EVENTS_DMAA_SELECTJOBDONE_SELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SELECTJOBDONE field.       */
  #define RADIOACC_EVENTS_DMAA_SELECTJOBDONE_SELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SELECTJOBDONE field.       */
  #define RADIOACC_EVENTS_DMAA_SELECTJOBDONE_SELECTJOBDONE_NotGenerated (0x0UL) /*!< Event not generated                       */
  #define RADIOACC_EVENTS_DMAA_SELECTJOBDONE_SELECTJOBDONE_Generated (0x1UL) /*!< Event generated                              */


/* RADIOACC_EVENTS_DMAA_DATADONE: Event Data Done DMA-A */
  #define RADIOACC_EVENTS_DMAA_DATADONE_ResetValue (0x00000000UL) /*!< Reset value of DATADONE register.                       */

/* DATADONE @Bit 0 : Event Data Done DMA-A */
  #define RADIOACC_EVENTS_DMAA_DATADONE_DATADONE_Pos (0UL) /*!< Position of DATADONE field.                                    */
  #define RADIOACC_EVENTS_DMAA_DATADONE_DATADONE_Msk (0x1UL << RADIOACC_EVENTS_DMAA_DATADONE_DATADONE_Pos) /*!< Bit mask of
                                                                            DATADONE field.*/                                     
  #define RADIOACC_EVENTS_DMAA_DATADONE_DATADONE_Min (0x0UL) /*!< Min enumerator value of DATADONE field.                      */
  #define RADIOACC_EVENTS_DMAA_DATADONE_DATADONE_Max (0x1UL) /*!< Max enumerator value of DATADONE field.                      */
  #define RADIOACC_EVENTS_DMAA_DATADONE_DATADONE_NotGenerated (0x0UL) /*!< Event not generated                                 */
  #define RADIOACC_EVENTS_DMAA_DATADONE_DATADONE_Generated (0x1UL) /*!< Event generated                                        */


/* RADIOACC_EVENTS_DMAA_JOBDONE: Event Job Done DMA-A */
  #define RADIOACC_EVENTS_DMAA_JOBDONE_ResetValue (0x00000000UL) /*!< Reset value of JOBDONE register.                         */

/* JOBDONE @Bit 0 : Event Job Done DMA-A */
  #define RADIOACC_EVENTS_DMAA_JOBDONE_JOBDONE_Pos (0UL) /*!< Position of JOBDONE field.                                       */
  #define RADIOACC_EVENTS_DMAA_JOBDONE_JOBDONE_Msk (0x1UL << RADIOACC_EVENTS_DMAA_JOBDONE_JOBDONE_Pos) /*!< Bit mask of JOBDONE
                                                                            field.*/                                              
  #define RADIOACC_EVENTS_DMAA_JOBDONE_JOBDONE_Min (0x0UL) /*!< Min enumerator value of JOBDONE field.                         */
  #define RADIOACC_EVENTS_DMAA_JOBDONE_JOBDONE_Max (0x1UL) /*!< Max enumerator value of JOBDONE field.                         */
  #define RADIOACC_EVENTS_DMAA_JOBDONE_JOBDONE_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define RADIOACC_EVENTS_DMAA_JOBDONE_JOBDONE_Generated (0x1UL) /*!< Event generated                                          */


/* RADIOACC_EVENTS_DMAA_ERROR: Event Error DMA-A */
  #define RADIOACC_EVENTS_DMAA_ERROR_ResetValue (0x00000000UL) /*!< Reset value of ERROR register.                             */

/* ERROR @Bit 0 : Event Error DMA-A */
  #define RADIOACC_EVENTS_DMAA_ERROR_ERROR_Pos (0UL) /*!< Position of ERROR field.                                             */
  #define RADIOACC_EVENTS_DMAA_ERROR_ERROR_Msk (0x1UL << RADIOACC_EVENTS_DMAA_ERROR_ERROR_Pos) /*!< Bit mask of ERROR field.   */
  #define RADIOACC_EVENTS_DMAA_ERROR_ERROR_Min (0x0UL) /*!< Min enumerator value of ERROR field.                               */
  #define RADIOACC_EVENTS_DMAA_ERROR_ERROR_Max (0x1UL) /*!< Max enumerator value of ERROR field.                               */
  #define RADIOACC_EVENTS_DMAA_ERROR_ERROR_NotGenerated (0x0UL) /*!< Event not generated                                       */
  #define RADIOACC_EVENTS_DMAA_ERROR_ERROR_Generated (0x1UL) /*!< Event generated                                              */


/* RADIOACC_EVENTS_DMAA_STOP: Event Stop DMA-A */
  #define RADIOACC_EVENTS_DMAA_STOP_ResetValue (0x00000000UL) /*!< Reset value of STOP register.                               */

/* STOP @Bit 0 : Event Stop DMA-A */
  #define RADIOACC_EVENTS_DMAA_STOP_STOP_Pos (0UL)   /*!< Position of STOP field.                                              */
  #define RADIOACC_EVENTS_DMAA_STOP_STOP_Msk (0x1UL << RADIOACC_EVENTS_DMAA_STOP_STOP_Pos) /*!< Bit mask of STOP field.        */
  #define RADIOACC_EVENTS_DMAA_STOP_STOP_Min (0x0UL) /*!< Min enumerator value of STOP field.                                  */
  #define RADIOACC_EVENTS_DMAA_STOP_STOP_Max (0x1UL) /*!< Max enumerator value of STOP field.                                  */
  #define RADIOACC_EVENTS_DMAA_STOP_STOP_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define RADIOACC_EVENTS_DMAA_STOP_STOP_Generated (0x1UL) /*!< Event generated                                                */


/* RADIOACC_EVENTS_DMAA_RESET: Event Reset DMA-A */
  #define RADIOACC_EVENTS_DMAA_RESET_ResetValue (0x00000000UL) /*!< Reset value of RESET register.                             */

