adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIOACC_PUBLISH_DMAA_LISTDONE: Publish configuration for event DMAA.LISTDONE */
  #define RADIOACC_PUBLISH_DMAA_LISTDONE_ResetValue (0x00000000UL) /*!< Reset value of LISTDONE register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that event DMAA.LISTDONE will publish to */
  #define RADIOACC_PUBLISH_DMAA_LISTDONE_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                         */
  #define RADIOACC_PUBLISH_DMAA_LISTDONE_CHIDX_Msk (0xFFUL << RADIOACC_PUBLISH_DMAA_LISTDONE_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIOACC_PUBLISH_DMAA_LISTDONE_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                      */
  #define RADIOACC_PUBLISH_DMAA_LISTDONE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                      */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_PUBLISH_DMAA_LISTDONE_EN_Pos (31UL) /*!< Position of EN field.                                              */
  #define RADIOACC_PUBLISH_DMAA_LISTDONE_EN_Msk (0x1UL << RADIOACC_PUBLISH_DMAA_LISTDONE_EN_Pos) /*!< Bit mask of EN field.    */
  #define RADIOACC_PUBLISH_DMAA_LISTDONE_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                 */
  #define RADIOACC_PUBLISH_DMAA_LISTDONE_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                 */
  #define RADIOACC_PUBLISH_DMAA_LISTDONE_EN_Disabled (0x0UL) /*!< Disable publishing                                           */
  #define RADIOACC_PUBLISH_DMAA_LISTDONE_EN_Enabled (0x1UL) /*!< Enable publishing                                             */


/* RADIOACC_PUBLISH_DMAA_LISTPARTDONE: Publish configuration for event DMAA.LISTPARTDONE */
  #define RADIOACC_PUBLISH_DMAA_LISTPARTDONE_ResetValue (0x00000000UL) /*!< Reset value of LISTPARTDONE register.              */

/* CHIDX @Bits 0..7 : DPPI channel that event DMAA.LISTPARTDONE will publish to */
  #define RADIOACC_PUBLISH_DMAA_LISTPARTDONE_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                     */
  #define RADIOACC_PUBLISH_DMAA_LISTPARTDONE_CHIDX_Msk (0xFFUL << RADIOACC_PUBLISH_DMAA_LISTPARTDONE_CHIDX_Pos) /*!< Bit mask of
                                                                            CHIDX field.*/                                        
  #define RADIOACC_PUBLISH_DMAA_LISTPARTDONE_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                  */
  #define RADIOACC_PUBLISH_DMAA_LISTPARTDONE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                  */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_PUBLISH_DMAA_LISTPARTDONE_EN_Pos (31UL) /*!< Position of EN field.                                          */
  #define RADIOACC_PUBLISH_DMAA_LISTPARTDONE_EN_Msk (0x1UL << RADIOACC_PUBLISH_DMAA_LISTPARTDONE_EN_Pos) /*!< Bit mask of EN
                                                                            field.*/                                              
  #define RADIOACC_PUBLISH_DMAA_LISTPARTDONE_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                             */
  #define RADIOACC_PUBLISH_DMAA_LISTPARTDONE_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                             */
  #define RADIOACC_PUBLISH_DMAA_LISTPARTDONE_EN_Disabled (0x0UL) /*!< Disable publishing                                       */
  #define RADIOACC_PUBLISH_DMAA_LISTPARTDONE_EN_Enabled (0x1UL) /*!< Enable publishing                                         */


/* RADIOACC_PUBLISH_DMAA_SELECTJOBDONE: Publish configuration for event DMAA.SELECTJOBDONE */
  #define RADIOACC_PUBLISH_DMAA_SELECTJOBDONE_ResetValue (0x00000000UL) /*!< Reset value of SELECTJOBDONE register.            */

/* CHIDX @Bits 0..7 : DPPI channel that event DMAA.SELECTJOBDONE will publish to */
  #define RADIOACC_PUBLISH_DMAA_SELECTJOBDONE_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                    */
  #define RADIOACC_PUBLISH_DMAA_SELECTJOBDONE_CHIDX_Msk (0xFFUL << RADIOACC_PUBLISH_DMAA_SELECTJOBDONE_CHIDX_Pos) /*!< Bit mask
                                                                            of CHIDX field.*/                                     
  #define RADIOACC_PUBLISH_DMAA_SELECTJOBDONE_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                 */
  #define RADIOACC_PUBLISH_DMAA_SELECTJOBDONE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                 */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_PUBLISH_DMAA_SELECTJOBDONE_EN_Pos (31UL) /*!< Position of EN field.                                         */
  #define RADIOACC_PUBLISH_DMAA_SELECTJOBDONE_EN_Msk (0x1UL << RADIOACC_PUBLISH_DMAA_SELECTJOBDONE_EN_Pos) /*!< Bit mask of EN
                                                                            field.*/                                              
  #define RADIOACC_PUBLISH_DMAA_SELECTJOBDONE_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                            */
  #define RADIOACC_PUBLISH_DMAA_SELECTJOBDONE_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                            */
  #define RADIOACC_PUBLISH_DMAA_SELECTJOBDONE_EN_Disabled (0x0UL) /*!< Disable publishing                                      */
  #define RADIOACC_PUBLISH_DMAA_SELECTJOBDONE_EN_Enabled (0x1UL) /*!< Enable publishing                                        */


/* RADIOACC_PUBLISH_DMAA_DATADONE: Publish configuration for event DMAA.DATADONE */
  #define RADIOACC_PUBLISH_DMAA_DATADONE_ResetValue (0x00000000UL) /*!< Reset value of DATADONE register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that event DMAA.DATADONE will publish to */
  #define RADIOACC_PUBLISH_DMAA_DATADONE_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                         */
  #define RADIOACC_PUBLISH_DMAA_DATADONE_CHIDX_Msk (0xFFUL << RADIOACC_PUBLISH_DMAA_DATADONE_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIOACC_PUBLISH_DMAA_DATADONE_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                      */
  #define RADIOACC_PUBLISH_DMAA_DATADONE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                      */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_PUBLISH_DMAA_DATADONE_EN_Pos (31UL) /*!< Position of EN field.                                              */
  #define RADIOACC_PUBLISH_DMAA_DATADONE_EN_Msk (0x1UL << RADIOACC_PUBLISH_DMAA_DATADONE_EN_Pos) /*!< Bit mask of EN field.    */
  #define RADIOACC_PUBLISH_DMAA_DATADONE_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                 */
  #define RADIOACC_PUBLISH_DMAA_DATADONE_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                 */
  #define RADIOACC_PUBLISH_DMAA_DATADONE_EN_Disabled (0x0UL) /*!< Disable publishing                                           */
  #define RADIOACC_PUBLISH_DMAA_DATADONE_EN_Enabled (0x1UL) /*!< Enable publishing                                             */


