adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIOACC_PUBLISH_DMAB_ERROR: Publish configuration for event DMAB.ERROR */
  #define RADIOACC_PUBLISH_DMAB_ERROR_ResetValue (0x00000000UL) /*!< Reset value of ERROR register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that event DMAB.ERROR will publish to */
  #define RADIOACC_PUBLISH_DMAB_ERROR_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define RADIOACC_PUBLISH_DMAB_ERROR_CHIDX_Msk (0xFFUL << RADIOACC_PUBLISH_DMAB_ERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define RADIOACC_PUBLISH_DMAB_ERROR_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                         */
  #define RADIOACC_PUBLISH_DMAB_ERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_PUBLISH_DMAB_ERROR_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define RADIOACC_PUBLISH_DMAB_ERROR_EN_Msk (0x1UL << RADIOACC_PUBLISH_DMAB_ERROR_EN_Pos) /*!< Bit mask of EN field.          */
  #define RADIOACC_PUBLISH_DMAB_ERROR_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define RADIOACC_PUBLISH_DMAB_ERROR_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define RADIOACC_PUBLISH_DMAB_ERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                              */
  #define RADIOACC_PUBLISH_DMAB_ERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                                */


/* RADIOACC_PUBLISH_DMAB_STOP: Publish configuration for event DMAB.STOP */
  #define RADIOACC_PUBLISH_DMAB_STOP_ResetValue (0x00000000UL) /*!< Reset value of STOP register.                              */

/* CHIDX @Bits 0..7 : DPPI channel that event DMAB.STOP will publish to */
  #define RADIOACC_PUBLISH_DMAB_STOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define RADIOACC_PUBLISH_DMAB_STOP_CHIDX_Msk (0xFFUL << RADIOACC_PUBLISH_DMAB_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define RADIOACC_PUBLISH_DMAB_STOP_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                          */
  #define RADIOACC_PUBLISH_DMAB_STOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_PUBLISH_DMAB_STOP_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define RADIOACC_PUBLISH_DMAB_STOP_EN_Msk (0x1UL << RADIOACC_PUBLISH_DMAB_STOP_EN_Pos) /*!< Bit mask of EN field.            */
  #define RADIOACC_PUBLISH_DMAB_STOP_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define RADIOACC_PUBLISH_DMAB_STOP_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define RADIOACC_PUBLISH_DMAB_STOP_EN_Disabled (0x0UL) /*!< Disable publishing                                               */
  #define RADIOACC_PUBLISH_DMAB_STOP_EN_Enabled (0x1UL) /*!< Enable publishing                                                 */


/* RADIOACC_PUBLISH_DMAB_RESET: Publish configuration for event DMAB.RESET */
  #define RADIOACC_PUBLISH_DMAB_RESET_ResetValue (0x00000000UL) /*!< Reset value of RESET register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that event DMAB.RESET will publish to */
  #define RADIOACC_PUBLISH_DMAB_RESET_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define RADIOACC_PUBLISH_DMAB_RESET_CHIDX_Msk (0xFFUL << RADIOACC_PUBLISH_DMAB_RESET_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define RADIOACC_PUBLISH_DMAB_RESET_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                         */
  #define RADIOACC_PUBLISH_DMAB_RESET_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_PUBLISH_DMAB_RESET_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define RADIOACC_PUBLISH_DMAB_RESET_EN_Msk (0x1UL << RADIOACC_PUBLISH_DMAB_RESET_EN_Pos) /*!< Bit mask of EN field.          */
  #define RADIOACC_PUBLISH_DMAB_RESET_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define RADIOACC_PUBLISH_DMAB_RESET_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define RADIOACC_PUBLISH_DMAB_RESET_EN_Disabled (0x0UL) /*!< Disable publishing                                              */
  #define RADIOACC_PUBLISH_DMAB_RESET_EN_Enabled (0x1UL) /*!< Enable publishing                                                */



/* ================================================ Struct RADIOACC_CTRLWORD ================================================= */
/**
  * @brief CTRLWORD [RADIOACC_CTRLWORD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CYCACC;                            /*!< (@ 0x00000000) Bit fields required for Cycle Accurate processing,
                                                                         i.e., Write Stalls and Cell Array Latency*/              
  __IOM uint32_t  DMA;                               /*!< (@ 0x00000004) Bit fields required for cycle accurate processing.    */
  __IOM uint32_t  CTX;                               /*!< (@ 0x00000008) The register address points to Control Word FIFO in the
                                                                         PAR block. It contains bit fields required for cycle
                                                                         accurate processing.*/                                   
} NRF_RADIOACC_CTRLWORD_Type;                        /*!< Size = 12 (0x00C)                                                    */

/* RADIOACC_CTRLWORD_CYCACC: Bit fields required for Cycle Accurate processing, i.e., Write Stalls and Cell Array Latency */
  #define RADIOACC_CTRLWORD_CYCACC_ResetValue (0x00000000UL) /*!< Reset value of CYCACC register.                              */

/* PEARRAYLATENCY @Bits 0..3 : Latency of the cell array */
  #define RADIOACC_CTRLWORD_CYCACC_PEARRAYLATENCY_Pos (0UL) /*!< Position of PEARRAYLATENCY field.                             */
  #define RADIOACC_CTRLWORD_CYCACC_PEARRAYLATENCY_Msk (0xFUL << RADIOACC_CTRLWORD_CYCACC_PEARRAYLATENCY_Pos) /*!< Bit mask of
                                                                            PEARRAYLATENCY field.*/                               
  #define RADIOACC_CTRLWORD_CYCACC_PEARRAYLATENCY_Min (0x0UL) /*!< Min value of PEARRAYLATENCY field.                          */
  #define RADIOACC_CTRLWORD_CYCACC_PEARRAYLATENCY_Max (0xFUL) /*!< Max size of PEARRAYLATENCY field.                           */

/* WRSTALLS @Bits 4..9 : Write Stalls */
  #define RADIOACC_CTRLWORD_CYCACC_WRSTALLS_Pos (4UL) /*!< Position of WRSTALLS field.                                         */
  #define RADIOACC_CTRLWORD_CYCACC_WRSTALLS_Msk (0x3FUL << RADIOACC_CTRLWORD_CYCACC_WRSTALLS_Pos) /*!< Bit mask of WRSTALLS
                                                                            field.*/                                              
  #define RADIOACC_CTRLWORD_CYCACC_WRSTALLS_Min (0x0UL) /*!< Min value of WRSTALLS field.                                      */
  #define RADIOACC_CTRLWORD_CYCACC_WRSTALLS_Max (0x3FUL) /*!< Max size of WRSTALLS field.                                      */


/* RADIOACC_CTRLWORD_DMA: Bit fields required for cycle accurate processing. */
  #define RADIOACC_CTRLWORD_DMA_ResetValue (0x00000000UL) /*!< Reset value of DMA register.                                    */

/* RDC @Bits 17..21 : Active Cycles of DMA for data to be Written/Read from the CR of a Data Buffer. */
  #define RADIOACC_CTRLWORD_DMA_RDC_Pos (17UL)       /*!< Position of RDC field.                                               */
  #define RADIOACC_CTRLWORD_DMA_RDC_Msk (0x1FUL << RADIOACC_CTRLWORD_DMA_RDC_Pos) /*!< Bit mask of RDC field.                  */
  #define RADIOACC_CTRLWORD_DMA_RDC_Min (0x0UL)      /*!< Min value of RDC field.                                              */
  #define RADIOACC_CTRLWORD_DMA_RDC_Max (0x1FUL)     /*!< Max size of RDC field.                                               */

/* CSHIFTDIR @Bit 28 : Cyclic Shift Direction in the Data Buffer */
  #define RADIOACC_CTRLWORD_DMA_CSHIFTDIR_Pos (28UL) /*!< Position of CSHIFTDIR field.                                         */
  #define RADIOACC_CTRLWORD_DMA_CSHIFTDIR_Msk (0x1UL << RADIOACC_CTRLWORD_DMA_CSHIFTDIR_Pos) /*!< Bit mask of CSHIFTDIR field. */
  #define RADIOACC_CTRLWORD_DMA_CSHIFTDIR_Min (0x0UL) /*!< Min enumerator value of CSHIFTDIR field.                            */
  #define RADIOACC_CTRLWORD_DMA_CSHIFTDIR_Max (0x1UL) /*!< Max enumerator value of CSHIFTDIR field.                            */
  #define RADIOACC_CTRLWORD_DMA_CSHIFTDIR_CyclicDownwards (0x0UL) /*!< Cyclic downwards                                        */
  #define RADIOACC_CTRLWORD_DMA_CSHIFTDIR_CyclicUpwards (0x1UL) /*!< Cyclic upwards                                            */

/* BUFFDMAPAIRSEL @Bit 30 : Buffer and DMA Pairing Selection */
  #define RADIOACC_CTRLWORD_DMA_BUFFDMAPAIRSEL_Pos (30UL) /*!< Position of BUFFDMAPAIRSEL field.                               */
  #define RADIOACC_CTRLWORD_DMA_BUFFDMAPAIRSEL_Msk (0x1UL << RADIOACC_CTRLWORD_DMA_BUFFDMAPAIRSEL_Pos) /*!< Bit mask of
                                                                            BUFFDMAPAIRSEL field.*/                               
  #define RADIOACC_CTRLWORD_DMA_BUFFDMAPAIRSEL_Min (0x0UL) /*!< Min enumerator value of BUFFDMAPAIRSEL field.                  */
  #define RADIOACC_CTRLWORD_DMA_BUFFDMAPAIRSEL_Max (0x1UL) /*!< Max enumerator value of BUFFDMAPAIRSEL field.                  */
  #define RADIOACC_CTRLWORD_DMA_BUFFDMAPAIRSEL_PairSelectNormal (0x0UL) /*!< DMA-A Writes to Buffer 0 and DMA-B Reads from
                                                                            Buffer 1*/                                            
  #define RADIOACC_CTRLWORD_DMA_BUFFDMAPAIRSEL_PairSelectFlip (0x1UL) /*!< DMA-A Writes to Buffer 1 and DMA-B Reads from Buffer
                                                                           0*/                                                    


