adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* BUFFENABLEB6 @Bit 6 : Enable Bit for CR6 in HW Data Buffer B */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB6_Pos (6UL) /*!< Position of BUFFENABLEB6 field.                                    */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB6_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEB6_Pos) /*!< Bit mask of BUFFENABLEB6
                                                                            field.*/                                              
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB6_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEB6 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB6_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEB6 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB6_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB6_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEB7 @Bit 7 : Enable Bit for CR7 in HW Data Buffer B */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB7_Pos (7UL) /*!< Position of BUFFENABLEB7 field.                                    */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB7_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEB7_Pos) /*!< Bit mask of BUFFENABLEB7
                                                                            field.*/                                              
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB7_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEB7 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB7_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEB7 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB7_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEB7_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEA0 @Bit 8 : Enable Bit for CR0 in HW Data Buffer A */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA0_Pos (8UL) /*!< Position of BUFFENABLEA0 field.                                    */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA0_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEA0_Pos) /*!< Bit mask of BUFFENABLEA0
                                                                            field.*/                                              
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA0_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEA0 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA0_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEA0 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA0_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA0_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEA1 @Bit 9 : Enable Bit for CR1 in HW Data Buffer A */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA1_Pos (9UL) /*!< Position of BUFFENABLEA1 field.                                    */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA1_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEA1_Pos) /*!< Bit mask of BUFFENABLEA1
                                                                            field.*/                                              
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA1_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEA1 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA1_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEA1 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA1_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA1_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEA2 @Bit 10 : Enable Bit for CR2 in HW Data Buffer A */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA2_Pos (10UL) /*!< Position of BUFFENABLEA2 field.                                   */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA2_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEA2_Pos) /*!< Bit mask of BUFFENABLEA2
                                                                            field.*/                                              
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA2_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEA2 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA2_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEA2 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA2_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA2_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEA3 @Bit 11 : Enable Bit for CR3 in HW Data Buffer A */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA3_Pos (11UL) /*!< Position of BUFFENABLEA3 field.                                   */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA3_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEA3_Pos) /*!< Bit mask of BUFFENABLEA3
                                                                            field.*/                                              
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA3_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEA3 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA3_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEA3 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA3_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA3_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEA4 @Bit 12 : Enable Bit for CR4 in HW Data Buffer A */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA4_Pos (12UL) /*!< Position of BUFFENABLEA4 field.                                   */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA4_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEA4_Pos) /*!< Bit mask of BUFFENABLEA4
                                                                            field.*/                                              
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA4_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEA4 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA4_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEA4 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA4_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA4_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEA5 @Bit 13 : Enable Bit for CR5 in HW Data Buffer A */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA5_Pos (13UL) /*!< Position of BUFFENABLEA5 field.                                   */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA5_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEA5_Pos) /*!< Bit mask of BUFFENABLEA5
                                                                            field.*/                                              
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA5_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEA5 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA5_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEA5 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA5_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA5_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEA6 @Bit 14 : Enable Bit for CR6 in HW Data Buffer A */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA6_Pos (14UL) /*!< Position of BUFFENABLEA6 field.                                   */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA6_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEA6_Pos) /*!< Bit mask of BUFFENABLEA6
                                                                            field.*/                                              
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA6_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEA6 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA6_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEA6 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA6_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA6_Enable (0x1UL) /*!< Enable                                                        */

/* BUFFENABLEA7 @Bit 15 : Enable Bit for CR7 in HW Data Buffer A */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA7_Pos (15UL) /*!< Position of BUFFENABLEA7 field.                                   */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA7_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_BUFFENABLEA7_Pos) /*!< Bit mask of BUFFENABLEA7
                                                                            field.*/                                              
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA7_Min (0x0UL) /*!< Min enumerator value of BUFFENABLEA7 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA7_Max (0x1UL) /*!< Max enumerator value of BUFFENABLEA7 field.                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA7_Disable (0x0UL) /*!< Disable                                                      */
  #define RADIOACC_CTRLWORD_CTX_BUFFENABLEA7_Enable (0x1UL) /*!< Enable                                                        */

/* DATAFLOWDIR @Bit 16 : Direction of Data Flow over the Cell Array */
  #define RADIOACC_CTRLWORD_CTX_DATAFLOWDIR_Pos (16UL) /*!< Position of DATAFLOWDIR field.                                     */
  #define RADIOACC_CTRLWORD_CTX_DATAFLOWDIR_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_DATAFLOWDIR_Pos) /*!< Bit mask of DATAFLOWDIR
                                                                            field.*/                                              
  #define RADIOACC_CTRLWORD_CTX_DATAFLOWDIR_Min (0x0UL) /*!< Min enumerator value of DATAFLOWDIR field.                        */
  #define RADIOACC_CTRLWORD_CTX_DATAFLOWDIR_Max (0x1UL) /*!< Max enumerator value of DATAFLOWDIR field.                        */
  #define RADIOACC_CTRLWORD_CTX_DATAFLOWDIR_TopToBottom (0x0UL) /*!< From top to bottom                                        */
  #define RADIOACC_CTRLWORD_CTX_DATAFLOWDIR_BottomToTop (0x1UL) /*!< From bottom to top                                        */

/* COMPRDC @Bits 17..21 : Cycles required for the computation. */
  #define RADIOACC_CTRLWORD_CTX_COMPRDC_Pos (17UL)   /*!< Position of COMPRDC field.                                           */
  #define RADIOACC_CTRLWORD_CTX_COMPRDC_Msk (0x1FUL << RADIOACC_CTRLWORD_CTX_COMPRDC_Pos) /*!< Bit mask of COMPRDC field.      */
  #define RADIOACC_CTRLWORD_CTX_COMPRDC_Min (0x0UL)  /*!< Min value of COMPRDC field.                                          */
  #define RADIOACC_CTRLWORD_CTX_COMPRDC_Max (0x1FUL) /*!< Max size of COMPRDC field.                                           */

/* CTXSEL @Bits 22..25 : Context Select */
  #define RADIOACC_CTRLWORD_CTX_CTXSEL_Pos (22UL)    /*!< Position of CTXSEL field.                                            */
  #define RADIOACC_CTRLWORD_CTX_CTXSEL_Msk (0xFUL << RADIOACC_CTRLWORD_CTX_CTXSEL_Pos) /*!< Bit mask of CTXSEL field.          */
  #define RADIOACC_CTRLWORD_CTX_CTXSEL_Min (0x0UL)   /*!< Min value of CTXSEL field.                                           */
  #define RADIOACC_CTRLWORD_CTX_CTXSEL_Max (0xFUL)   /*!< Max size of CTXSEL field.                                            */

/* CSHIFTDIR @Bit 28 : Cyclic Shift Direction in the Data Buffer */
  #define RADIOACC_CTRLWORD_CTX_CSHIFTDIR_Pos (28UL) /*!< Position of CSHIFTDIR field.                                         */
  #define RADIOACC_CTRLWORD_CTX_CSHIFTDIR_Msk (0x1UL << RADIOACC_CTRLWORD_CTX_CSHIFTDIR_Pos) /*!< Bit mask of CSHIFTDIR field. */
  #define RADIOACC_CTRLWORD_CTX_CSHIFTDIR_Min (0x0UL) /*!< Min enumerator value of CSHIFTDIR field.                            */
  #define RADIOACC_CTRLWORD_CTX_CSHIFTDIR_Max (0x1UL) /*!< Max enumerator value of CSHIFTDIR field.                            */
  #define RADIOACC_CTRLWORD_CTX_CSHIFTDIR_CyclicDownwards (0x0UL) /*!< Cyclic downwards                                        */
  #define RADIOACC_CTRLWORD_CTX_CSHIFTDIR_CyclicUpwards (0x1UL) /*!< Cyclic upwards                                            */



/* ================================================== Struct RADIOACC_DMAA =================================================== */
/**
  * @brief DMAA [RADIOACC_DMAA] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LISTPTR;                           /*!< (@ 0x00000000) Register address to store the Data Pointer of the Job
                                                                         List for DMA-A*/                                         
  __IOM uint32_t  LISTPARTTHRESH;                    /*!< (@ 0x00000004) Threshold value for generating event
                                                                         EVENTS_DMMA.LISTPARTDONE when descriptor list is
                                                                         partially completed. Value is number of jobs.*/          
} NRF_RADIOACC_DMAA_Type;                            /*!< Size = 8 (0x008)                                                     */

/* RADIOACC_DMAA_LISTPTR: Register address to store the Data Pointer of the Job List for DMA-A */
  #define RADIOACC_DMAA_LISTPTR_ResetValue (0x00000000UL) /*!< Reset value of LISTPTR register.                                */

