adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RADIOACC_EVENTS_CTXFIFOEMPTY: Event Context Fifo Empty */
  #define RADIOACC_EVENTS_CTXFIFOEMPTY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CTXFIFOEMPTY register.             */

/* EVENTS_CTXFIFOEMPTY @Bit 0 : Event Context Fifo Empty */
  #define RADIOACC_EVENTS_CTXFIFOEMPTY_EVENTS_CTXFIFOEMPTY_Pos (0UL) /*!< Position of EVENTS_CTXFIFOEMPTY field.               */
  #define RADIOACC_EVENTS_CTXFIFOEMPTY_EVENTS_CTXFIFOEMPTY_Msk (0x1UL << RADIOACC_EVENTS_CTXFIFOEMPTY_EVENTS_CTXFIFOEMPTY_Pos)
                                                                            /*!< Bit mask of EVENTS_CTXFIFOEMPTY field.*/         
  #define RADIOACC_EVENTS_CTXFIFOEMPTY_EVENTS_CTXFIFOEMPTY_Min (0x0UL) /*!< Min enumerator value of EVENTS_CTXFIFOEMPTY field. */
  #define RADIOACC_EVENTS_CTXFIFOEMPTY_EVENTS_CTXFIFOEMPTY_Max (0x1UL) /*!< Max enumerator value of EVENTS_CTXFIFOEMPTY field. */
  #define RADIOACC_EVENTS_CTXFIFOEMPTY_EVENTS_CTXFIFOEMPTY_NotGenerated (0x0UL) /*!< Event not generated                       */
  #define RADIOACC_EVENTS_CTXFIFOEMPTY_EVENTS_CTXFIFOEMPTY_Generated (0x1UL) /*!< Event generated                              */


/* RADIOACC_EVENTS_ALLTASKSSTOP: Event All Running Tasks Stop */
  #define RADIOACC_EVENTS_ALLTASKSSTOP_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ALLTASKSSTOP register.             */

/* EVENTS_ALLTASKSSTOP @Bit 0 : Event All Running Tasks Stop */
  #define RADIOACC_EVENTS_ALLTASKSSTOP_EVENTS_ALLTASKSSTOP_Pos (0UL) /*!< Position of EVENTS_ALLTASKSSTOP field.               */
  #define RADIOACC_EVENTS_ALLTASKSSTOP_EVENTS_ALLTASKSSTOP_Msk (0x1UL << RADIOACC_EVENTS_ALLTASKSSTOP_EVENTS_ALLTASKSSTOP_Pos)
                                                                            /*!< Bit mask of EVENTS_ALLTASKSSTOP field.*/         
  #define RADIOACC_EVENTS_ALLTASKSSTOP_EVENTS_ALLTASKSSTOP_Min (0x0UL) /*!< Min enumerator value of EVENTS_ALLTASKSSTOP field. */
  #define RADIOACC_EVENTS_ALLTASKSSTOP_EVENTS_ALLTASKSSTOP_Max (0x1UL) /*!< Max enumerator value of EVENTS_ALLTASKSSTOP field. */
  #define RADIOACC_EVENTS_ALLTASKSSTOP_EVENTS_ALLTASKSSTOP_NotGenerated (0x0UL) /*!< Event not generated                       */
  #define RADIOACC_EVENTS_ALLTASKSSTOP_EVENTS_ALLTASKSSTOP_Generated (0x1UL) /*!< Event generated                              */


/* RADIOACC_PUBLISH_COMPUTEEND: Publish configuration for event COMPUTEEND */
  #define RADIOACC_PUBLISH_COMPUTEEND_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_COMPUTEEND register.               */

/* CHIDX @Bits 0..7 : DPPI channel that event COMPUTEEND will publish to */
  #define RADIOACC_PUBLISH_COMPUTEEND_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define RADIOACC_PUBLISH_COMPUTEEND_CHIDX_Msk (0xFFUL << RADIOACC_PUBLISH_COMPUTEEND_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define RADIOACC_PUBLISH_COMPUTEEND_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                         */
  #define RADIOACC_PUBLISH_COMPUTEEND_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_PUBLISH_COMPUTEEND_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define RADIOACC_PUBLISH_COMPUTEEND_EN_Msk (0x1UL << RADIOACC_PUBLISH_COMPUTEEND_EN_Pos) /*!< Bit mask of EN field.          */
  #define RADIOACC_PUBLISH_COMPUTEEND_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define RADIOACC_PUBLISH_COMPUTEEND_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define RADIOACC_PUBLISH_COMPUTEEND_EN_Disabled (0x0UL) /*!< Disable publishing                                              */
  #define RADIOACC_PUBLISH_COMPUTEEND_EN_Enabled (0x1UL) /*!< Enable publishing                                                */


/* RADIOACC_PUBLISH_CTXFIFOEMPTY: Publish configuration for event CTXFIFOEMPTY */
  #define RADIOACC_PUBLISH_CTXFIFOEMPTY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_CTXFIFOEMPTY register.           */

/* CHIDX @Bits 0..7 : DPPI channel that event CTXFIFOEMPTY will publish to */
  #define RADIOACC_PUBLISH_CTXFIFOEMPTY_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                          */
  #define RADIOACC_PUBLISH_CTXFIFOEMPTY_CHIDX_Msk (0xFFUL << RADIOACC_PUBLISH_CTXFIFOEMPTY_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIOACC_PUBLISH_CTXFIFOEMPTY_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                       */
  #define RADIOACC_PUBLISH_CTXFIFOEMPTY_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                       */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_PUBLISH_CTXFIFOEMPTY_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define RADIOACC_PUBLISH_CTXFIFOEMPTY_EN_Msk (0x1UL << RADIOACC_PUBLISH_CTXFIFOEMPTY_EN_Pos) /*!< Bit mask of EN field.      */
  #define RADIOACC_PUBLISH_CTXFIFOEMPTY_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define RADIOACC_PUBLISH_CTXFIFOEMPTY_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define RADIOACC_PUBLISH_CTXFIFOEMPTY_EN_Disabled (0x0UL) /*!< Disable publishing                                            */
  #define RADIOACC_PUBLISH_CTXFIFOEMPTY_EN_Enabled (0x1UL) /*!< Enable publishing                                              */


/* RADIOACC_PUBLISH_ALLTASKSSTOP: Publish configuration for event ALLTASKSSTOP */
  #define RADIOACC_PUBLISH_ALLTASKSSTOP_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ALLTASKSSTOP register.           */

/* CHIDX @Bits 0..7 : DPPI channel that event ALLTASKSSTOP will publish to */
  #define RADIOACC_PUBLISH_ALLTASKSSTOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                          */
  #define RADIOACC_PUBLISH_ALLTASKSSTOP_CHIDX_Msk (0xFFUL << RADIOACC_PUBLISH_ALLTASKSSTOP_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/                                              
  #define RADIOACC_PUBLISH_ALLTASKSSTOP_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                       */
  #define RADIOACC_PUBLISH_ALLTASKSSTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                       */

/* EN @Bit 31 : (unspecified) */
  #define RADIOACC_PUBLISH_ALLTASKSSTOP_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define RADIOACC_PUBLISH_ALLTASKSSTOP_EN_Msk (0x1UL << RADIOACC_PUBLISH_ALLTASKSSTOP_EN_Pos) /*!< Bit mask of EN field.      */
  #define RADIOACC_PUBLISH_ALLTASKSSTOP_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define RADIOACC_PUBLISH_ALLTASKSSTOP_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define RADIOACC_PUBLISH_ALLTASKSSTOP_EN_Disabled (0x0UL) /*!< Disable publishing                                            */
  #define RADIOACC_PUBLISH_ALLTASKSSTOP_EN_Enabled (0x1UL) /*!< Enable publishing                                              */


/* RADIOACC_INTEN: Enable or disable interrupt */
  #define RADIOACC_INTEN_ResetValue (0x00000000UL)   /*!< Reset value of INTEN register.                                       */

/* DMAALISTDONE @Bit 0 : Enable or disable interrupt for event DMAALISTDONE */
  #define RADIOACC_INTEN_DMAALISTDONE_Pos (0UL)      /*!< Position of DMAALISTDONE field.                                      */
  #define RADIOACC_INTEN_DMAALISTDONE_Msk (0x1UL << RADIOACC_INTEN_DMAALISTDONE_Pos) /*!< Bit mask of DMAALISTDONE field.      */
  #define RADIOACC_INTEN_DMAALISTDONE_Min (0x0UL)    /*!< Min enumerator value of DMAALISTDONE field.                          */
  #define RADIOACC_INTEN_DMAALISTDONE_Max (0x1UL)    /*!< Max enumerator value of DMAALISTDONE field.                          */
  #define RADIOACC_INTEN_DMAALISTDONE_Disabled (0x0UL) /*!< Disable                                                            */
  #define RADIOACC_INTEN_DMAALISTDONE_Enabled (0x1UL) /*!< Enable                                                              */

