adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DMAAERROR @Bit 5 : Write '1' to disable interrupt for event DMAAERROR */
  #define RADIOACC_INTENCLR_DMAAERROR_Pos (5UL)      /*!< Position of DMAAERROR field.                                         */
  #define RADIOACC_INTENCLR_DMAAERROR_Msk (0x1UL << RADIOACC_INTENCLR_DMAAERROR_Pos) /*!< Bit mask of DMAAERROR field.         */
  #define RADIOACC_INTENCLR_DMAAERROR_Min (0x0UL)    /*!< Min enumerator value of DMAAERROR field.                             */
  #define RADIOACC_INTENCLR_DMAAERROR_Max (0x1UL)    /*!< Max enumerator value of DMAAERROR field.                             */
  #define RADIOACC_INTENCLR_DMAAERROR_Clear (0x1UL)  /*!< Disable                                                              */
  #define RADIOACC_INTENCLR_DMAAERROR_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIOACC_INTENCLR_DMAAERROR_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* DMAASTOP @Bit 6 : Write '1' to disable interrupt for event DMAASTOP */
  #define RADIOACC_INTENCLR_DMAASTOP_Pos (6UL)       /*!< Position of DMAASTOP field.                                          */
  #define RADIOACC_INTENCLR_DMAASTOP_Msk (0x1UL << RADIOACC_INTENCLR_DMAASTOP_Pos) /*!< Bit mask of DMAASTOP field.            */
  #define RADIOACC_INTENCLR_DMAASTOP_Min (0x0UL)     /*!< Min enumerator value of DMAASTOP field.                              */
  #define RADIOACC_INTENCLR_DMAASTOP_Max (0x1UL)     /*!< Max enumerator value of DMAASTOP field.                              */
  #define RADIOACC_INTENCLR_DMAASTOP_Clear (0x1UL)   /*!< Disable                                                              */
  #define RADIOACC_INTENCLR_DMAASTOP_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIOACC_INTENCLR_DMAASTOP_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* DMAARESET @Bit 7 : Write '1' to disable interrupt for event DMAARESET */
  #define RADIOACC_INTENCLR_DMAARESET_Pos (7UL)      /*!< Position of DMAARESET field.                                         */
  #define RADIOACC_INTENCLR_DMAARESET_Msk (0x1UL << RADIOACC_INTENCLR_DMAARESET_Pos) /*!< Bit mask of DMAARESET field.         */
  #define RADIOACC_INTENCLR_DMAARESET_Min (0x0UL)    /*!< Min enumerator value of DMAARESET field.                             */
  #define RADIOACC_INTENCLR_DMAARESET_Max (0x1UL)    /*!< Max enumerator value of DMAARESET field.                             */
  #define RADIOACC_INTENCLR_DMAARESET_Clear (0x1UL)  /*!< Disable                                                              */
  #define RADIOACC_INTENCLR_DMAARESET_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIOACC_INTENCLR_DMAARESET_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* DMABLISTDONE @Bit 8 : Write '1' to disable interrupt for event DMABLISTDONE */
  #define RADIOACC_INTENCLR_DMABLISTDONE_Pos (8UL)   /*!< Position of DMABLISTDONE field.                                      */
  #define RADIOACC_INTENCLR_DMABLISTDONE_Msk (0x1UL << RADIOACC_INTENCLR_DMABLISTDONE_Pos) /*!< Bit mask of DMABLISTDONE field.*/
  #define RADIOACC_INTENCLR_DMABLISTDONE_Min (0x0UL) /*!< Min enumerator value of DMABLISTDONE field.                          */
  #define RADIOACC_INTENCLR_DMABLISTDONE_Max (0x1UL) /*!< Max enumerator value of DMABLISTDONE field.                          */
  #define RADIOACC_INTENCLR_DMABLISTDONE_Clear (0x1UL) /*!< Disable                                                            */
  #define RADIOACC_INTENCLR_DMABLISTDONE_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIOACC_INTENCLR_DMABLISTDONE_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DMABLISTPARTDONE @Bit 9 : Write '1' to disable interrupt for event DMABLISTPARTDONE */
  #define RADIOACC_INTENCLR_DMABLISTPARTDONE_Pos (9UL) /*!< Position of DMABLISTPARTDONE field.                                */
  #define RADIOACC_INTENCLR_DMABLISTPARTDONE_Msk (0x1UL << RADIOACC_INTENCLR_DMABLISTPARTDONE_Pos) /*!< Bit mask of
                                                                            DMABLISTPARTDONE field.*/                             
  #define RADIOACC_INTENCLR_DMABLISTPARTDONE_Min (0x0UL) /*!< Min enumerator value of DMABLISTPARTDONE field.                  */
  #define RADIOACC_INTENCLR_DMABLISTPARTDONE_Max (0x1UL) /*!< Max enumerator value of DMABLISTPARTDONE field.                  */
  #define RADIOACC_INTENCLR_DMABLISTPARTDONE_Clear (0x1UL) /*!< Disable                                                        */
  #define RADIOACC_INTENCLR_DMABLISTPARTDONE_Disabled (0x0UL) /*!< Read: Disabled                                              */
  #define RADIOACC_INTENCLR_DMABLISTPARTDONE_Enabled (0x1UL) /*!< Read: Enabled                                                */

/* DMABSELECTJOBDONE @Bit 10 : Write '1' to disable interrupt for event DMABSELECTJOBDONE */
  #define RADIOACC_INTENCLR_DMABSELECTJOBDONE_Pos (10UL) /*!< Position of DMABSELECTJOBDONE field.                             */
  #define RADIOACC_INTENCLR_DMABSELECTJOBDONE_Msk (0x1UL << RADIOACC_INTENCLR_DMABSELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            DMABSELECTJOBDONE field.*/                            
  #define RADIOACC_INTENCLR_DMABSELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of DMABSELECTJOBDONE field.                */
  #define RADIOACC_INTENCLR_DMABSELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of DMABSELECTJOBDONE field.                */
  #define RADIOACC_INTENCLR_DMABSELECTJOBDONE_Clear (0x1UL) /*!< Disable                                                       */
  #define RADIOACC_INTENCLR_DMABSELECTJOBDONE_Disabled (0x0UL) /*!< Read: Disabled                                             */
  #define RADIOACC_INTENCLR_DMABSELECTJOBDONE_Enabled (0x1UL) /*!< Read: Enabled                                               */

/* DMABDATADONE @Bit 11 : Write '1' to disable interrupt for event DMABDATADONE */
  #define RADIOACC_INTENCLR_DMABDATADONE_Pos (11UL)  /*!< Position of DMABDATADONE field.                                      */
  #define RADIOACC_INTENCLR_DMABDATADONE_Msk (0x1UL << RADIOACC_INTENCLR_DMABDATADONE_Pos) /*!< Bit mask of DMABDATADONE field.*/
  #define RADIOACC_INTENCLR_DMABDATADONE_Min (0x0UL) /*!< Min enumerator value of DMABDATADONE field.                          */
  #define RADIOACC_INTENCLR_DMABDATADONE_Max (0x1UL) /*!< Max enumerator value of DMABDATADONE field.                          */
  #define RADIOACC_INTENCLR_DMABDATADONE_Clear (0x1UL) /*!< Disable                                                            */
  #define RADIOACC_INTENCLR_DMABDATADONE_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIOACC_INTENCLR_DMABDATADONE_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DMABJOBDONE @Bit 12 : Write '1' to disable interrupt for event DMABJOBDONE */
  #define RADIOACC_INTENCLR_DMABJOBDONE_Pos (12UL)   /*!< Position of DMABJOBDONE field.                                       */
  #define RADIOACC_INTENCLR_DMABJOBDONE_Msk (0x1UL << RADIOACC_INTENCLR_DMABJOBDONE_Pos) /*!< Bit mask of DMABJOBDONE field.   */
  #define RADIOACC_INTENCLR_DMABJOBDONE_Min (0x0UL)  /*!< Min enumerator value of DMABJOBDONE field.                           */
  #define RADIOACC_INTENCLR_DMABJOBDONE_Max (0x1UL)  /*!< Max enumerator value of DMABJOBDONE field.                           */
  #define RADIOACC_INTENCLR_DMABJOBDONE_Clear (0x1UL) /*!< Disable                                                             */
  #define RADIOACC_INTENCLR_DMABJOBDONE_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define RADIOACC_INTENCLR_DMABJOBDONE_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* DMABERROR @Bit 13 : Write '1' to disable interrupt for event DMABERROR */
  #define RADIOACC_INTENCLR_DMABERROR_Pos (13UL)     /*!< Position of DMABERROR field.                                         */
  #define RADIOACC_INTENCLR_DMABERROR_Msk (0x1UL << RADIOACC_INTENCLR_DMABERROR_Pos) /*!< Bit mask of DMABERROR field.         */
  #define RADIOACC_INTENCLR_DMABERROR_Min (0x0UL)    /*!< Min enumerator value of DMABERROR field.                             */
  #define RADIOACC_INTENCLR_DMABERROR_Max (0x1UL)    /*!< Max enumerator value of DMABERROR field.                             */
  #define RADIOACC_INTENCLR_DMABERROR_Clear (0x1UL)  /*!< Disable                                                              */
  #define RADIOACC_INTENCLR_DMABERROR_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIOACC_INTENCLR_DMABERROR_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* DMABSTOP @Bit 14 : Write '1' to disable interrupt for event DMABSTOP */
  #define RADIOACC_INTENCLR_DMABSTOP_Pos (14UL)      /*!< Position of DMABSTOP field.                                          */
  #define RADIOACC_INTENCLR_DMABSTOP_Msk (0x1UL << RADIOACC_INTENCLR_DMABSTOP_Pos) /*!< Bit mask of DMABSTOP field.            */
  #define RADIOACC_INTENCLR_DMABSTOP_Min (0x0UL)     /*!< Min enumerator value of DMABSTOP field.                              */
  #define RADIOACC_INTENCLR_DMABSTOP_Max (0x1UL)     /*!< Max enumerator value of DMABSTOP field.                              */
  #define RADIOACC_INTENCLR_DMABSTOP_Clear (0x1UL)   /*!< Disable                                                              */
  #define RADIOACC_INTENCLR_DMABSTOP_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIOACC_INTENCLR_DMABSTOP_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* DMABRESET @Bit 15 : Write '1' to disable interrupt for event DMABRESET */
  #define RADIOACC_INTENCLR_DMABRESET_Pos (15UL)     /*!< Position of DMABRESET field.                                         */
  #define RADIOACC_INTENCLR_DMABRESET_Msk (0x1UL << RADIOACC_INTENCLR_DMABRESET_Pos) /*!< Bit mask of DMABRESET field.         */
  #define RADIOACC_INTENCLR_DMABRESET_Min (0x0UL)    /*!< Min enumerator value of DMABRESET field.                             */
  #define RADIOACC_INTENCLR_DMABRESET_Max (0x1UL)    /*!< Max enumerator value of DMABRESET field.                             */
  #define RADIOACC_INTENCLR_DMABRESET_Clear (0x1UL)  /*!< Disable                                                              */
  #define RADIOACC_INTENCLR_DMABRESET_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIOACC_INTENCLR_DMABRESET_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* COMPUTEEND @Bit 16 : Write '1' to disable interrupt for event COMPUTEEND */
  #define RADIOACC_INTENCLR_COMPUTEEND_Pos (16UL)    /*!< Position of COMPUTEEND field.                                        */
  #define RADIOACC_INTENCLR_COMPUTEEND_Msk (0x1UL << RADIOACC_INTENCLR_COMPUTEEND_Pos) /*!< Bit mask of COMPUTEEND field.      */
  #define RADIOACC_INTENCLR_COMPUTEEND_Min (0x0UL)   /*!< Min enumerator value of COMPUTEEND field.                            */
  #define RADIOACC_INTENCLR_COMPUTEEND_Max (0x1UL)   /*!< Max enumerator value of COMPUTEEND field.                            */
  #define RADIOACC_INTENCLR_COMPUTEEND_Clear (0x1UL) /*!< Disable                                                              */
  #define RADIOACC_INTENCLR_COMPUTEEND_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define RADIOACC_INTENCLR_COMPUTEEND_Enabled (0x1UL) /*!< Read: Enabled                                                      */

