adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CTXFIFOEMPTY @Bit 17 : Write '1' to disable interrupt for event CTXFIFOEMPTY */
  #define RADIOACC_INTENCLR_CTXFIFOEMPTY_Pos (17UL)  /*!< Position of CTXFIFOEMPTY field.                                      */
  #define RADIOACC_INTENCLR_CTXFIFOEMPTY_Msk (0x1UL << RADIOACC_INTENCLR_CTXFIFOEMPTY_Pos) /*!< Bit mask of CTXFIFOEMPTY field.*/
  #define RADIOACC_INTENCLR_CTXFIFOEMPTY_Min (0x0UL) /*!< Min enumerator value of CTXFIFOEMPTY field.                          */
  #define RADIOACC_INTENCLR_CTXFIFOEMPTY_Max (0x1UL) /*!< Max enumerator value of CTXFIFOEMPTY field.                          */
  #define RADIOACC_INTENCLR_CTXFIFOEMPTY_Clear (0x1UL) /*!< Disable                                                            */
  #define RADIOACC_INTENCLR_CTXFIFOEMPTY_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIOACC_INTENCLR_CTXFIFOEMPTY_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* ALLTASKSSTOP @Bit 18 : Write '1' to disable interrupt for event ALLTASKSSTOP */
  #define RADIOACC_INTENCLR_ALLTASKSSTOP_Pos (18UL)  /*!< Position of ALLTASKSSTOP field.                                      */
  #define RADIOACC_INTENCLR_ALLTASKSSTOP_Msk (0x1UL << RADIOACC_INTENCLR_ALLTASKSSTOP_Pos) /*!< Bit mask of ALLTASKSSTOP field.*/
  #define RADIOACC_INTENCLR_ALLTASKSSTOP_Min (0x0UL) /*!< Min enumerator value of ALLTASKSSTOP field.                          */
  #define RADIOACC_INTENCLR_ALLTASKSSTOP_Max (0x1UL) /*!< Max enumerator value of ALLTASKSSTOP field.                          */
  #define RADIOACC_INTENCLR_ALLTASKSSTOP_Clear (0x1UL) /*!< Disable                                                            */
  #define RADIOACC_INTENCLR_ALLTASKSSTOP_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIOACC_INTENCLR_ALLTASKSSTOP_Enabled (0x1UL) /*!< Read: Enabled                                                    */


/* RADIOACC_SWRST: Software-based Reset */
  #define RADIOACC_SWRST_ResetValue (0x00000000UL)   /*!< Reset value of SWRST register.                                       */

/* State @Bit 0 : (unspecified) */
  #define RADIOACC_SWRST_State_Pos (0UL)             /*!< Position of State field.                                             */
  #define RADIOACC_SWRST_State_Msk (0x1UL << RADIOACC_SWRST_State_Pos) /*!< Bit mask of State field.                           */
  #define RADIOACC_SWRST_State_Min (0x0UL)           /*!< Min enumerator value of State field.                                 */
  #define RADIOACC_SWRST_State_Max (0x1UL)           /*!< Max enumerator value of State field.                                 */
  #define RADIOACC_SWRST_State_ActiveLow (0x0UL)     /*!< Active Low State                                                     */
  #define RADIOACC_SWRST_State_ActiveHigh (0x1UL)    /*!< Active High State                                                    */


/* RADIOACC_AUTO: Mode of Computation */
  #define RADIOACC_AUTO_ResetValue (0x00000000UL)    /*!< Reset value of AUTO register.                                        */

/* MODE @Bit 0 : (unspecified) */
  #define RADIOACC_AUTO_MODE_Pos (0UL)               /*!< Position of MODE field.                                              */
  #define RADIOACC_AUTO_MODE_Msk (0x1UL << RADIOACC_AUTO_MODE_Pos) /*!< Bit mask of MODE field.                                */
  #define RADIOACC_AUTO_MODE_Min (0x0UL)             /*!< Min enumerator value of MODE field.                                  */
  #define RADIOACC_AUTO_MODE_Max (0x1UL)             /*!< Max enumerator value of MODE field.                                  */
  #define RADIOACC_AUTO_MODE_NonActive (0x0UL)       /*!< Non Active Mode of Computation                                       */
  #define RADIOACC_AUTO_MODE_Active (0x1UL)          /*!< Active Mode of Computation                                           */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           RAMC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct RAMC ======================================================= */
/**
  * @brief RAM Controller
  */
  typedef struct {                                   /*!< RAMC Structure                                                       */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_ERRORFIX;                  /*!< (@ 0x00000100) ECC detected fixable (one bit) error in read data from
                                                                         RAM.*/                                                   
    __IOM uint32_t EVENTS_ERRORNONFIX;               /*!< (@ 0x00000104) ECC detected non-fixable (multiple bits) error in read
                                                                         data from RAM.*/                                         
    __IM uint32_t RESERVED1[190];
    __IM uint32_t FIXADDR;                           /*!< (@ 0x00000400) Address of the last fixable error detected by the ECC.*/
    __IM uint32_t NONFIXADDR;                        /*!< (@ 0x00000404) Address of the last non-fixable error detected by the
                                                                         ECC.*/                                                   
    __IM uint32_t RESERVED2[62];
    __IOM uint32_t WAITSTATES;                       /*!< (@ 0x00000500) Waitstates for read operations.                       */
    __IM uint32_t RESERVED3[63];
    __IOM uint32_t SECBASE;                          /*!< (@ 0x00000600) Base address for secure access area.                  */
    __IOM uint32_t SECENABLE;                        /*!< (@ 0x00000604) Enable secure access restrictions.                    */
  } NRF_RAMC_Type;                                   /*!< Size = 1544 (0x608)                                                  */

/* RAMC_EVENTS_ERRORFIX: ECC detected fixable (one bit) error in read data from RAM. */
  #define RAMC_EVENTS_ERRORFIX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERRORFIX register.                         */

/* EVENTS_ERRORFIX @Bit 0 : ECC detected fixable (one bit) error in read data from RAM. */
  #define RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_Pos (0UL) /*!< Position of EVENTS_ERRORFIX field.                               */
  #define RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_Msk (0x1UL << RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_Pos) /*!< Bit mask of
                                                                            EVENTS_ERRORFIX field.*/                              
  #define RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERRORFIX field.                 */
  #define RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERRORFIX field.                 */
  #define RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_Generated (0x1UL) /*!< Event generated                                          */


