adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LOCKUP @Bit 3 : Reset from local CPU lockup detected */
  #define RESETHUB_RESETREAS_DOMAIN_LOCKUP_Pos (3UL) /*!< Position of LOCKUP field.                                            */
  #define RESETHUB_RESETREAS_DOMAIN_LOCKUP_Msk (0x1UL << RESETHUB_RESETREAS_DOMAIN_LOCKUP_Pos) /*!< Bit mask of LOCKUP field.  */
  #define RESETHUB_RESETREAS_DOMAIN_LOCKUP_Min (0x0UL) /*!< Min enumerator value of LOCKUP field.                              */
  #define RESETHUB_RESETREAS_DOMAIN_LOCKUP_Max (0x1UL) /*!< Max enumerator value of LOCKUP field.                              */
  #define RESETHUB_RESETREAS_DOMAIN_LOCKUP_NotDetected (0x0UL) /*!< Not detected                                               */
  #define RESETHUB_RESETREAS_DOMAIN_LOCKUP_Detected (0x1UL) /*!< Detected                                                      */

/* CROSSDOMAIN @Bit 4 : Reset due to cross domain reset source. */
  #define RESETHUB_RESETREAS_DOMAIN_CROSSDOMAIN_Pos (4UL) /*!< Position of CROSSDOMAIN field.                                  */
  #define RESETHUB_RESETREAS_DOMAIN_CROSSDOMAIN_Msk (0x1UL << RESETHUB_RESETREAS_DOMAIN_CROSSDOMAIN_Pos) /*!< Bit mask of
                                                                            CROSSDOMAIN field.*/                                  
  #define RESETHUB_RESETREAS_DOMAIN_CROSSDOMAIN_Min (0x0UL) /*!< Min enumerator value of CROSSDOMAIN field.                    */
  #define RESETHUB_RESETREAS_DOMAIN_CROSSDOMAIN_Max (0x1UL) /*!< Max enumerator value of CROSSDOMAIN field.                    */
  #define RESETHUB_RESETREAS_DOMAIN_CROSSDOMAIN_NotDetected (0x0UL) /*!< Not detected                                          */
  #define RESETHUB_RESETREAS_DOMAIN_CROSSDOMAIN_Detected (0x1UL) /*!< Detected                                                 */


/* ===================================================== Struct RESETHUB ===================================================== */
/**
  * @brief Reset hub
  */
  typedef struct {                                   /*!< RESETHUB Structure                                                   */
    __OM uint32_t TASKS_RESETDOMAIN[16];             /*!< (@ 0x00000000) Reset the domain [n], where n is domain id.           */
    __IM uint32_t RESERVED[48];
    __IOM uint32_t EVENTS_DOMAINRESET[16];           /*!< (@ 0x00000100) Domain [n] was reset, where n is domain id.           */
    __IM uint32_t RESERVED1[112];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IOM NRF_RESETHUB_RESETREAS_Type RESETREAS;     /*!< (@ 0x00000400) (unspecified)                                         */
    __IM uint32_t RESERVED3[47];
    __IOM uint32_t RESETMASK;                        /*!< (@ 0x00000500) Mask the reset request for a domain by itself.        */
    __IOM uint32_t CROSSDOMAINRESET;                 /*!< (@ 0x00000504) Enable cross domain resets.                           */
    __IOM uint32_t GPREGRET;                         /*!< (@ 0x00000508) General purpose retention register.                   */
  } NRF_RESETHUB_Type;                               /*!< Size = 1292 (0x50C)                                                  */

/* RESETHUB_TASKS_RESETDOMAIN: Reset the domain [n], where n is domain id. */
  #define RESETHUB_TASKS_RESETDOMAIN_MaxCount (16UL) /*!< Max size of TASKS_RESETDOMAIN[16] array.                             */
  #define RESETHUB_TASKS_RESETDOMAIN_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RESETDOMAIN[16] register.             */

/* TASKS_RESETDOMAIN @Bit 0 : Reset the domain [n], where n is domain id. */
  #define RESETHUB_TASKS_RESETDOMAIN_TASKS_RESETDOMAIN_Pos (0UL) /*!< Position of TASKS_RESETDOMAIN field.                     */
  #define RESETHUB_TASKS_RESETDOMAIN_TASKS_RESETDOMAIN_Msk (0x1UL << RESETHUB_TASKS_RESETDOMAIN_TASKS_RESETDOMAIN_Pos) /*!< Bit
                                                                            mask of TASKS_RESETDOMAIN field.*/                    
  #define RESETHUB_TASKS_RESETDOMAIN_TASKS_RESETDOMAIN_Min (0x1UL) /*!< Min enumerator value of TASKS_RESETDOMAIN field.       */
  #define RESETHUB_TASKS_RESETDOMAIN_TASKS_RESETDOMAIN_Max (0x1UL) /*!< Max enumerator value of TASKS_RESETDOMAIN field.       */
  #define RESETHUB_TASKS_RESETDOMAIN_TASKS_RESETDOMAIN_Trigger (0x1UL) /*!< Trigger task                                       */


/* RESETHUB_EVENTS_DOMAINRESET: Domain [n] was reset, where n is domain id. */
  #define RESETHUB_EVENTS_DOMAINRESET_MaxCount (16UL) /*!< Max size of EVENTS_DOMAINRESET[16] array.                           */
  #define RESETHUB_EVENTS_DOMAINRESET_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_DOMAINRESET[16] register.           */

/* EVENTS_DOMAINRESET @Bit 0 : Domain [n] was reset, where n is domain id. */
  #define RESETHUB_EVENTS_DOMAINRESET_EVENTS_DOMAINRESET_Pos (0UL) /*!< Position of EVENTS_DOMAINRESET field.                  */
  #define RESETHUB_EVENTS_DOMAINRESET_EVENTS_DOMAINRESET_Msk (0x1UL << RESETHUB_EVENTS_DOMAINRESET_EVENTS_DOMAINRESET_Pos) /*!<
                                                                            Bit mask of EVENTS_DOMAINRESET field.*/               
  #define RESETHUB_EVENTS_DOMAINRESET_EVENTS_DOMAINRESET_Min (0x0UL) /*!< Min enumerator value of EVENTS_DOMAINRESET field.    */
  #define RESETHUB_EVENTS_DOMAINRESET_EVENTS_DOMAINRESET_Max (0x1UL) /*!< Max enumerator value of EVENTS_DOMAINRESET field.    */
  #define RESETHUB_EVENTS_DOMAINRESET_EVENTS_DOMAINRESET_NotGenerated (0x0UL) /*!< Event not generated                         */
  #define RESETHUB_EVENTS_DOMAINRESET_EVENTS_DOMAINRESET_Generated (0x1UL) /*!< Event generated                                */


/* RESETHUB_INTEN: Enable or disable interrupt */
  #define RESETHUB_INTEN_ResetValue (0x00000000UL)   /*!< Reset value of INTEN register.                                       */

/* DOMAINRESET0 @Bit 0 : Enable or disable interrupt for event DOMAINRESET[0] */
  #define RESETHUB_INTEN_DOMAINRESET0_Pos (0UL)      /*!< Position of DOMAINRESET0 field.                                      */
  #define RESETHUB_INTEN_DOMAINRESET0_Msk (0x1UL << RESETHUB_INTEN_DOMAINRESET0_Pos) /*!< Bit mask of DOMAINRESET0 field.      */
  #define RESETHUB_INTEN_DOMAINRESET0_Min (0x0UL)    /*!< Min enumerator value of DOMAINRESET0 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET0_Max (0x1UL)    /*!< Max enumerator value of DOMAINRESET0 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET0_Disabled (0x0UL) /*!< Disable                                                            */
  #define RESETHUB_INTEN_DOMAINRESET0_Enabled (0x1UL) /*!< Enable                                                              */

