adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DOMAINRESET1 @Bit 1 : Enable or disable interrupt for event DOMAINRESET[1] */
  #define RESETHUB_INTEN_DOMAINRESET1_Pos (1UL)      /*!< Position of DOMAINRESET1 field.                                      */
  #define RESETHUB_INTEN_DOMAINRESET1_Msk (0x1UL << RESETHUB_INTEN_DOMAINRESET1_Pos) /*!< Bit mask of DOMAINRESET1 field.      */
  #define RESETHUB_INTEN_DOMAINRESET1_Min (0x0UL)    /*!< Min enumerator value of DOMAINRESET1 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET1_Max (0x1UL)    /*!< Max enumerator value of DOMAINRESET1 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET1_Disabled (0x0UL) /*!< Disable                                                            */
  #define RESETHUB_INTEN_DOMAINRESET1_Enabled (0x1UL) /*!< Enable                                                              */

/* DOMAINRESET2 @Bit 2 : Enable or disable interrupt for event DOMAINRESET[2] */
  #define RESETHUB_INTEN_DOMAINRESET2_Pos (2UL)      /*!< Position of DOMAINRESET2 field.                                      */
  #define RESETHUB_INTEN_DOMAINRESET2_Msk (0x1UL << RESETHUB_INTEN_DOMAINRESET2_Pos) /*!< Bit mask of DOMAINRESET2 field.      */
  #define RESETHUB_INTEN_DOMAINRESET2_Min (0x0UL)    /*!< Min enumerator value of DOMAINRESET2 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET2_Max (0x1UL)    /*!< Max enumerator value of DOMAINRESET2 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET2_Disabled (0x0UL) /*!< Disable                                                            */
  #define RESETHUB_INTEN_DOMAINRESET2_Enabled (0x1UL) /*!< Enable                                                              */

/* DOMAINRESET3 @Bit 3 : Enable or disable interrupt for event DOMAINRESET[3] */
  #define RESETHUB_INTEN_DOMAINRESET3_Pos (3UL)      /*!< Position of DOMAINRESET3 field.                                      */
  #define RESETHUB_INTEN_DOMAINRESET3_Msk (0x1UL << RESETHUB_INTEN_DOMAINRESET3_Pos) /*!< Bit mask of DOMAINRESET3 field.      */
  #define RESETHUB_INTEN_DOMAINRESET3_Min (0x0UL)    /*!< Min enumerator value of DOMAINRESET3 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET3_Max (0x1UL)    /*!< Max enumerator value of DOMAINRESET3 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET3_Disabled (0x0UL) /*!< Disable                                                            */
  #define RESETHUB_INTEN_DOMAINRESET3_Enabled (0x1UL) /*!< Enable                                                              */

/* DOMAINRESET4 @Bit 4 : Enable or disable interrupt for event DOMAINRESET[4] */
  #define RESETHUB_INTEN_DOMAINRESET4_Pos (4UL)      /*!< Position of DOMAINRESET4 field.                                      */
  #define RESETHUB_INTEN_DOMAINRESET4_Msk (0x1UL << RESETHUB_INTEN_DOMAINRESET4_Pos) /*!< Bit mask of DOMAINRESET4 field.      */
  #define RESETHUB_INTEN_DOMAINRESET4_Min (0x0UL)    /*!< Min enumerator value of DOMAINRESET4 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET4_Max (0x1UL)    /*!< Max enumerator value of DOMAINRESET4 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET4_Disabled (0x0UL) /*!< Disable                                                            */
  #define RESETHUB_INTEN_DOMAINRESET4_Enabled (0x1UL) /*!< Enable                                                              */

/* DOMAINRESET5 @Bit 5 : Enable or disable interrupt for event DOMAINRESET[5] */
  #define RESETHUB_INTEN_DOMAINRESET5_Pos (5UL)      /*!< Position of DOMAINRESET5 field.                                      */
  #define RESETHUB_INTEN_DOMAINRESET5_Msk (0x1UL << RESETHUB_INTEN_DOMAINRESET5_Pos) /*!< Bit mask of DOMAINRESET5 field.      */
  #define RESETHUB_INTEN_DOMAINRESET5_Min (0x0UL)    /*!< Min enumerator value of DOMAINRESET5 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET5_Max (0x1UL)    /*!< Max enumerator value of DOMAINRESET5 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET5_Disabled (0x0UL) /*!< Disable                                                            */
  #define RESETHUB_INTEN_DOMAINRESET5_Enabled (0x1UL) /*!< Enable                                                              */

/* DOMAINRESET6 @Bit 6 : Enable or disable interrupt for event DOMAINRESET[6] */
  #define RESETHUB_INTEN_DOMAINRESET6_Pos (6UL)      /*!< Position of DOMAINRESET6 field.                                      */
  #define RESETHUB_INTEN_DOMAINRESET6_Msk (0x1UL << RESETHUB_INTEN_DOMAINRESET6_Pos) /*!< Bit mask of DOMAINRESET6 field.      */
  #define RESETHUB_INTEN_DOMAINRESET6_Min (0x0UL)    /*!< Min enumerator value of DOMAINRESET6 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET6_Max (0x1UL)    /*!< Max enumerator value of DOMAINRESET6 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET6_Disabled (0x0UL) /*!< Disable                                                            */
  #define RESETHUB_INTEN_DOMAINRESET6_Enabled (0x1UL) /*!< Enable                                                              */

/* DOMAINRESET7 @Bit 7 : Enable or disable interrupt for event DOMAINRESET[7] */
  #define RESETHUB_INTEN_DOMAINRESET7_Pos (7UL)      /*!< Position of DOMAINRESET7 field.                                      */
  #define RESETHUB_INTEN_DOMAINRESET7_Msk (0x1UL << RESETHUB_INTEN_DOMAINRESET7_Pos) /*!< Bit mask of DOMAINRESET7 field.      */
  #define RESETHUB_INTEN_DOMAINRESET7_Min (0x0UL)    /*!< Min enumerator value of DOMAINRESET7 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET7_Max (0x1UL)    /*!< Max enumerator value of DOMAINRESET7 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET7_Disabled (0x0UL) /*!< Disable                                                            */
  #define RESETHUB_INTEN_DOMAINRESET7_Enabled (0x1UL) /*!< Enable                                                              */

/* DOMAINRESET8 @Bit 8 : Enable or disable interrupt for event DOMAINRESET[8] */
  #define RESETHUB_INTEN_DOMAINRESET8_Pos (8UL)      /*!< Position of DOMAINRESET8 field.                                      */
  #define RESETHUB_INTEN_DOMAINRESET8_Msk (0x1UL << RESETHUB_INTEN_DOMAINRESET8_Pos) /*!< Bit mask of DOMAINRESET8 field.      */
  #define RESETHUB_INTEN_DOMAINRESET8_Min (0x0UL)    /*!< Min enumerator value of DOMAINRESET8 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET8_Max (0x1UL)    /*!< Max enumerator value of DOMAINRESET8 field.                          */
  #define RESETHUB_INTEN_DOMAINRESET8_Disabled (0x0UL) /*!< Disable                                                            */
  #define RESETHUB_INTEN_DOMAINRESET8_Enabled (0x1UL) /*!< Enable                                                              */

