adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DOMAINRESET3 @Bit 3 : Write '1' to enable interrupt for event DOMAINRESET[3] */
  #define RESETHUB_INTENSET_DOMAINRESET3_Pos (3UL)   /*!< Position of DOMAINRESET3 field.                                      */
  #define RESETHUB_INTENSET_DOMAINRESET3_Msk (0x1UL << RESETHUB_INTENSET_DOMAINRESET3_Pos) /*!< Bit mask of DOMAINRESET3 field.*/
  #define RESETHUB_INTENSET_DOMAINRESET3_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET3 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET3_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET3 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET3_Set (0x1UL) /*!< Enable                                                               */
  #define RESETHUB_INTENSET_DOMAINRESET3_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENSET_DOMAINRESET3_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET4 @Bit 4 : Write '1' to enable interrupt for event DOMAINRESET[4] */
  #define RESETHUB_INTENSET_DOMAINRESET4_Pos (4UL)   /*!< Position of DOMAINRESET4 field.                                      */
  #define RESETHUB_INTENSET_DOMAINRESET4_Msk (0x1UL << RESETHUB_INTENSET_DOMAINRESET4_Pos) /*!< Bit mask of DOMAINRESET4 field.*/
  #define RESETHUB_INTENSET_DOMAINRESET4_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET4 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET4_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET4 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET4_Set (0x1UL) /*!< Enable                                                               */
  #define RESETHUB_INTENSET_DOMAINRESET4_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENSET_DOMAINRESET4_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET5 @Bit 5 : Write '1' to enable interrupt for event DOMAINRESET[5] */
  #define RESETHUB_INTENSET_DOMAINRESET5_Pos (5UL)   /*!< Position of DOMAINRESET5 field.                                      */
  #define RESETHUB_INTENSET_DOMAINRESET5_Msk (0x1UL << RESETHUB_INTENSET_DOMAINRESET5_Pos) /*!< Bit mask of DOMAINRESET5 field.*/
  #define RESETHUB_INTENSET_DOMAINRESET5_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET5 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET5_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET5 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET5_Set (0x1UL) /*!< Enable                                                               */
  #define RESETHUB_INTENSET_DOMAINRESET5_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENSET_DOMAINRESET5_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET6 @Bit 6 : Write '1' to enable interrupt for event DOMAINRESET[6] */
  #define RESETHUB_INTENSET_DOMAINRESET6_Pos (6UL)   /*!< Position of DOMAINRESET6 field.                                      */
  #define RESETHUB_INTENSET_DOMAINRESET6_Msk (0x1UL << RESETHUB_INTENSET_DOMAINRESET6_Pos) /*!< Bit mask of DOMAINRESET6 field.*/
  #define RESETHUB_INTENSET_DOMAINRESET6_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET6 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET6_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET6 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET6_Set (0x1UL) /*!< Enable                                                               */
  #define RESETHUB_INTENSET_DOMAINRESET6_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENSET_DOMAINRESET6_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET7 @Bit 7 : Write '1' to enable interrupt for event DOMAINRESET[7] */
  #define RESETHUB_INTENSET_DOMAINRESET7_Pos (7UL)   /*!< Position of DOMAINRESET7 field.                                      */
  #define RESETHUB_INTENSET_DOMAINRESET7_Msk (0x1UL << RESETHUB_INTENSET_DOMAINRESET7_Pos) /*!< Bit mask of DOMAINRESET7 field.*/
  #define RESETHUB_INTENSET_DOMAINRESET7_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET7 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET7_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET7 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET7_Set (0x1UL) /*!< Enable                                                               */
  #define RESETHUB_INTENSET_DOMAINRESET7_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENSET_DOMAINRESET7_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET8 @Bit 8 : Write '1' to enable interrupt for event DOMAINRESET[8] */
  #define RESETHUB_INTENSET_DOMAINRESET8_Pos (8UL)   /*!< Position of DOMAINRESET8 field.                                      */
  #define RESETHUB_INTENSET_DOMAINRESET8_Msk (0x1UL << RESETHUB_INTENSET_DOMAINRESET8_Pos) /*!< Bit mask of DOMAINRESET8 field.*/
  #define RESETHUB_INTENSET_DOMAINRESET8_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET8 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET8_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET8 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET8_Set (0x1UL) /*!< Enable                                                               */
  #define RESETHUB_INTENSET_DOMAINRESET8_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENSET_DOMAINRESET8_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET9 @Bit 9 : Write '1' to enable interrupt for event DOMAINRESET[9] */
  #define RESETHUB_INTENSET_DOMAINRESET9_Pos (9UL)   /*!< Position of DOMAINRESET9 field.                                      */
  #define RESETHUB_INTENSET_DOMAINRESET9_Msk (0x1UL << RESETHUB_INTENSET_DOMAINRESET9_Pos) /*!< Bit mask of DOMAINRESET9 field.*/
  #define RESETHUB_INTENSET_DOMAINRESET9_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET9 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET9_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET9 field.                          */
  #define RESETHUB_INTENSET_DOMAINRESET9_Set (0x1UL) /*!< Enable                                                               */
  #define RESETHUB_INTENSET_DOMAINRESET9_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENSET_DOMAINRESET9_Enabled (0x1UL) /*!< Read: Enabled                                                    */

