adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DOMAINRESET10 @Bit 10 : Write '1' to enable interrupt for event DOMAINRESET[10] */
  #define RESETHUB_INTENSET_DOMAINRESET10_Pos (10UL) /*!< Position of DOMAINRESET10 field.                                     */
  #define RESETHUB_INTENSET_DOMAINRESET10_Msk (0x1UL << RESETHUB_INTENSET_DOMAINRESET10_Pos) /*!< Bit mask of DOMAINRESET10
                                                                            field.*/                                              
  #define RESETHUB_INTENSET_DOMAINRESET10_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET10 field.                        */
  #define RESETHUB_INTENSET_DOMAINRESET10_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET10 field.                        */
  #define RESETHUB_INTENSET_DOMAINRESET10_Set (0x1UL) /*!< Enable                                                              */
  #define RESETHUB_INTENSET_DOMAINRESET10_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define RESETHUB_INTENSET_DOMAINRESET10_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* DOMAINRESET11 @Bit 11 : Write '1' to enable interrupt for event DOMAINRESET[11] */
  #define RESETHUB_INTENSET_DOMAINRESET11_Pos (11UL) /*!< Position of DOMAINRESET11 field.                                     */
  #define RESETHUB_INTENSET_DOMAINRESET11_Msk (0x1UL << RESETHUB_INTENSET_DOMAINRESET11_Pos) /*!< Bit mask of DOMAINRESET11
                                                                            field.*/                                              
  #define RESETHUB_INTENSET_DOMAINRESET11_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET11 field.                        */
  #define RESETHUB_INTENSET_DOMAINRESET11_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET11 field.                        */
  #define RESETHUB_INTENSET_DOMAINRESET11_Set (0x1UL) /*!< Enable                                                              */
  #define RESETHUB_INTENSET_DOMAINRESET11_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define RESETHUB_INTENSET_DOMAINRESET11_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* DOMAINRESET12 @Bit 12 : Write '1' to enable interrupt for event DOMAINRESET[12] */
  #define RESETHUB_INTENSET_DOMAINRESET12_Pos (12UL) /*!< Position of DOMAINRESET12 field.                                     */
  #define RESETHUB_INTENSET_DOMAINRESET12_Msk (0x1UL << RESETHUB_INTENSET_DOMAINRESET12_Pos) /*!< Bit mask of DOMAINRESET12
                                                                            field.*/                                              
  #define RESETHUB_INTENSET_DOMAINRESET12_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET12 field.                        */
  #define RESETHUB_INTENSET_DOMAINRESET12_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET12 field.                        */
  #define RESETHUB_INTENSET_DOMAINRESET12_Set (0x1UL) /*!< Enable                                                              */
  #define RESETHUB_INTENSET_DOMAINRESET12_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define RESETHUB_INTENSET_DOMAINRESET12_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* DOMAINRESET13 @Bit 13 : Write '1' to enable interrupt for event DOMAINRESET[13] */
  #define RESETHUB_INTENSET_DOMAINRESET13_Pos (13UL) /*!< Position of DOMAINRESET13 field.                                     */
  #define RESETHUB_INTENSET_DOMAINRESET13_Msk (0x1UL << RESETHUB_INTENSET_DOMAINRESET13_Pos) /*!< Bit mask of DOMAINRESET13
                                                                            field.*/                                              
  #define RESETHUB_INTENSET_DOMAINRESET13_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET13 field.                        */
  #define RESETHUB_INTENSET_DOMAINRESET13_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET13 field.                        */
  #define RESETHUB_INTENSET_DOMAINRESET13_Set (0x1UL) /*!< Enable                                                              */
  #define RESETHUB_INTENSET_DOMAINRESET13_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define RESETHUB_INTENSET_DOMAINRESET13_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* DOMAINRESET14 @Bit 14 : Write '1' to enable interrupt for event DOMAINRESET[14] */
  #define RESETHUB_INTENSET_DOMAINRESET14_Pos (14UL) /*!< Position of DOMAINRESET14 field.                                     */
  #define RESETHUB_INTENSET_DOMAINRESET14_Msk (0x1UL << RESETHUB_INTENSET_DOMAINRESET14_Pos) /*!< Bit mask of DOMAINRESET14
                                                                            field.*/                                              
  #define RESETHUB_INTENSET_DOMAINRESET14_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET14 field.                        */
  #define RESETHUB_INTENSET_DOMAINRESET14_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET14 field.                        */
  #define RESETHUB_INTENSET_DOMAINRESET14_Set (0x1UL) /*!< Enable                                                              */
  #define RESETHUB_INTENSET_DOMAINRESET14_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define RESETHUB_INTENSET_DOMAINRESET14_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* DOMAINRESET15 @Bit 15 : Write '1' to enable interrupt for event DOMAINRESET[15] */
  #define RESETHUB_INTENSET_DOMAINRESET15_Pos (15UL) /*!< Position of DOMAINRESET15 field.                                     */
  #define RESETHUB_INTENSET_DOMAINRESET15_Msk (0x1UL << RESETHUB_INTENSET_DOMAINRESET15_Pos) /*!< Bit mask of DOMAINRESET15
                                                                            field.*/                                              
  #define RESETHUB_INTENSET_DOMAINRESET15_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET15 field.                        */
  #define RESETHUB_INTENSET_DOMAINRESET15_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET15 field.                        */
  #define RESETHUB_INTENSET_DOMAINRESET15_Set (0x1UL) /*!< Enable                                                              */
  #define RESETHUB_INTENSET_DOMAINRESET15_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define RESETHUB_INTENSET_DOMAINRESET15_Enabled (0x1UL) /*!< Read: Enabled                                                   */


/* RESETHUB_INTENCLR: Disable interrupt */
  #define RESETHUB_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                   */

/* DOMAINRESET0 @Bit 0 : Write '1' to disable interrupt for event DOMAINRESET[0] */
  #define RESETHUB_INTENCLR_DOMAINRESET0_Pos (0UL)   /*!< Position of DOMAINRESET0 field.                                      */
  #define RESETHUB_INTENCLR_DOMAINRESET0_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET0_Pos) /*!< Bit mask of DOMAINRESET0 field.*/
  #define RESETHUB_INTENCLR_DOMAINRESET0_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET0 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET0_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET0 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET0_Clear (0x1UL) /*!< Disable                                                            */
  #define RESETHUB_INTENCLR_DOMAINRESET0_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENCLR_DOMAINRESET0_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET1 @Bit 1 : Write '1' to disable interrupt for event DOMAINRESET[1] */
  #define RESETHUB_INTENCLR_DOMAINRESET1_Pos (1UL)   /*!< Position of DOMAINRESET1 field.                                      */
  #define RESETHUB_INTENCLR_DOMAINRESET1_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET1_Pos) /*!< Bit mask of DOMAINRESET1 field.*/
  #define RESETHUB_INTENCLR_DOMAINRESET1_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET1 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET1_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET1 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET1_Clear (0x1UL) /*!< Disable                                                            */
  #define RESETHUB_INTENCLR_DOMAINRESET1_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENCLR_DOMAINRESET1_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET2 @Bit 2 : Write '1' to disable interrupt for event DOMAINRESET[2] */
  #define RESETHUB_INTENCLR_DOMAINRESET2_Pos (2UL)   /*!< Position of DOMAINRESET2 field.                                      */
  #define RESETHUB_INTENCLR_DOMAINRESET2_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET2_Pos) /*!< Bit mask of DOMAINRESET2 field.*/
  #define RESETHUB_INTENCLR_DOMAINRESET2_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET2 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET2_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET2 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET2_Clear (0x1UL) /*!< Disable                                                            */
  #define RESETHUB_INTENCLR_DOMAINRESET2_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENCLR_DOMAINRESET2_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET3 @Bit 3 : Write '1' to disable interrupt for event DOMAINRESET[3] */
  #define RESETHUB_INTENCLR_DOMAINRESET3_Pos (3UL)   /*!< Position of DOMAINRESET3 field.                                      */
  #define RESETHUB_INTENCLR_DOMAINRESET3_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET3_Pos) /*!< Bit mask of DOMAINRESET3 field.*/
  #define RESETHUB_INTENCLR_DOMAINRESET3_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET3 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET3_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET3 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET3_Clear (0x1UL) /*!< Disable                                                            */
  #define RESETHUB_INTENCLR_DOMAINRESET3_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENCLR_DOMAINRESET3_Enabled (0x1UL) /*!< Read: Enabled                                                    */

