adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DOMAINRESET4 @Bit 4 : Write '1' to disable interrupt for event DOMAINRESET[4] */
  #define RESETHUB_INTENCLR_DOMAINRESET4_Pos (4UL)   /*!< Position of DOMAINRESET4 field.                                      */
  #define RESETHUB_INTENCLR_DOMAINRESET4_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET4_Pos) /*!< Bit mask of DOMAINRESET4 field.*/
  #define RESETHUB_INTENCLR_DOMAINRESET4_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET4 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET4_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET4 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET4_Clear (0x1UL) /*!< Disable                                                            */
  #define RESETHUB_INTENCLR_DOMAINRESET4_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENCLR_DOMAINRESET4_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET5 @Bit 5 : Write '1' to disable interrupt for event DOMAINRESET[5] */
  #define RESETHUB_INTENCLR_DOMAINRESET5_Pos (5UL)   /*!< Position of DOMAINRESET5 field.                                      */
  #define RESETHUB_INTENCLR_DOMAINRESET5_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET5_Pos) /*!< Bit mask of DOMAINRESET5 field.*/
  #define RESETHUB_INTENCLR_DOMAINRESET5_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET5 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET5_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET5 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET5_Clear (0x1UL) /*!< Disable                                                            */
  #define RESETHUB_INTENCLR_DOMAINRESET5_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENCLR_DOMAINRESET5_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET6 @Bit 6 : Write '1' to disable interrupt for event DOMAINRESET[6] */
  #define RESETHUB_INTENCLR_DOMAINRESET6_Pos (6UL)   /*!< Position of DOMAINRESET6 field.                                      */
  #define RESETHUB_INTENCLR_DOMAINRESET6_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET6_Pos) /*!< Bit mask of DOMAINRESET6 field.*/
  #define RESETHUB_INTENCLR_DOMAINRESET6_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET6 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET6_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET6 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET6_Clear (0x1UL) /*!< Disable                                                            */
  #define RESETHUB_INTENCLR_DOMAINRESET6_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENCLR_DOMAINRESET6_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET7 @Bit 7 : Write '1' to disable interrupt for event DOMAINRESET[7] */
  #define RESETHUB_INTENCLR_DOMAINRESET7_Pos (7UL)   /*!< Position of DOMAINRESET7 field.                                      */
  #define RESETHUB_INTENCLR_DOMAINRESET7_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET7_Pos) /*!< Bit mask of DOMAINRESET7 field.*/
  #define RESETHUB_INTENCLR_DOMAINRESET7_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET7 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET7_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET7 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET7_Clear (0x1UL) /*!< Disable                                                            */
  #define RESETHUB_INTENCLR_DOMAINRESET7_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENCLR_DOMAINRESET7_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET8 @Bit 8 : Write '1' to disable interrupt for event DOMAINRESET[8] */
  #define RESETHUB_INTENCLR_DOMAINRESET8_Pos (8UL)   /*!< Position of DOMAINRESET8 field.                                      */
  #define RESETHUB_INTENCLR_DOMAINRESET8_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET8_Pos) /*!< Bit mask of DOMAINRESET8 field.*/
  #define RESETHUB_INTENCLR_DOMAINRESET8_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET8 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET8_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET8 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET8_Clear (0x1UL) /*!< Disable                                                            */
  #define RESETHUB_INTENCLR_DOMAINRESET8_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENCLR_DOMAINRESET8_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET9 @Bit 9 : Write '1' to disable interrupt for event DOMAINRESET[9] */
  #define RESETHUB_INTENCLR_DOMAINRESET9_Pos (9UL)   /*!< Position of DOMAINRESET9 field.                                      */
  #define RESETHUB_INTENCLR_DOMAINRESET9_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET9_Pos) /*!< Bit mask of DOMAINRESET9 field.*/
  #define RESETHUB_INTENCLR_DOMAINRESET9_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET9 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET9_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET9 field.                          */
  #define RESETHUB_INTENCLR_DOMAINRESET9_Clear (0x1UL) /*!< Disable                                                            */
  #define RESETHUB_INTENCLR_DOMAINRESET9_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RESETHUB_INTENCLR_DOMAINRESET9_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DOMAINRESET10 @Bit 10 : Write '1' to disable interrupt for event DOMAINRESET[10] */
  #define RESETHUB_INTENCLR_DOMAINRESET10_Pos (10UL) /*!< Position of DOMAINRESET10 field.                                     */
  #define RESETHUB_INTENCLR_DOMAINRESET10_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET10_Pos) /*!< Bit mask of DOMAINRESET10
                                                                            field.*/                                              
  #define RESETHUB_INTENCLR_DOMAINRESET10_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET10 field.                        */
  #define RESETHUB_INTENCLR_DOMAINRESET10_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET10 field.                        */
  #define RESETHUB_INTENCLR_DOMAINRESET10_Clear (0x1UL) /*!< Disable                                                           */
  #define RESETHUB_INTENCLR_DOMAINRESET10_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define RESETHUB_INTENCLR_DOMAINRESET10_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* DOMAINRESET11 @Bit 11 : Write '1' to disable interrupt for event DOMAINRESET[11] */
  #define RESETHUB_INTENCLR_DOMAINRESET11_Pos (11UL) /*!< Position of DOMAINRESET11 field.                                     */
  #define RESETHUB_INTENCLR_DOMAINRESET11_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET11_Pos) /*!< Bit mask of DOMAINRESET11
                                                                            field.*/                                              
  #define RESETHUB_INTENCLR_DOMAINRESET11_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET11 field.                        */
  #define RESETHUB_INTENCLR_DOMAINRESET11_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET11 field.                        */
  #define RESETHUB_INTENCLR_DOMAINRESET11_Clear (0x1UL) /*!< Disable                                                           */
  #define RESETHUB_INTENCLR_DOMAINRESET11_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define RESETHUB_INTENCLR_DOMAINRESET11_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* DOMAINRESET12 @Bit 12 : Write '1' to disable interrupt for event DOMAINRESET[12] */
  #define RESETHUB_INTENCLR_DOMAINRESET12_Pos (12UL) /*!< Position of DOMAINRESET12 field.                                     */
  #define RESETHUB_INTENCLR_DOMAINRESET12_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET12_Pos) /*!< Bit mask of DOMAINRESET12
                                                                            field.*/                                              
  #define RESETHUB_INTENCLR_DOMAINRESET12_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET12 field.                        */
  #define RESETHUB_INTENCLR_DOMAINRESET12_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET12 field.                        */
  #define RESETHUB_INTENCLR_DOMAINRESET12_Clear (0x1UL) /*!< Disable                                                           */
  #define RESETHUB_INTENCLR_DOMAINRESET12_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define RESETHUB_INTENCLR_DOMAINRESET12_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* DOMAINRESET13 @Bit 13 : Write '1' to disable interrupt for event DOMAINRESET[13] */
  #define RESETHUB_INTENCLR_DOMAINRESET13_Pos (13UL) /*!< Position of DOMAINRESET13 field.                                     */
  #define RESETHUB_INTENCLR_DOMAINRESET13_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET13_Pos) /*!< Bit mask of DOMAINRESET13
                                                                            field.*/                                              
  #define RESETHUB_INTENCLR_DOMAINRESET13_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET13 field.                        */
  #define RESETHUB_INTENCLR_DOMAINRESET13_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET13 field.                        */
  #define RESETHUB_INTENCLR_DOMAINRESET13_Clear (0x1UL) /*!< Disable                                                           */
  #define RESETHUB_INTENCLR_DOMAINRESET13_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define RESETHUB_INTENCLR_DOMAINRESET13_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* DOMAINRESET14 @Bit 14 : Write '1' to disable interrupt for event DOMAINRESET[14] */
  #define RESETHUB_INTENCLR_DOMAINRESET14_Pos (14UL) /*!< Position of DOMAINRESET14 field.                                     */
  #define RESETHUB_INTENCLR_DOMAINRESET14_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET14_Pos) /*!< Bit mask of DOMAINRESET14
                                                                            field.*/                                              
  #define RESETHUB_INTENCLR_DOMAINRESET14_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET14 field.                        */
  #define RESETHUB_INTENCLR_DOMAINRESET14_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET14 field.                        */
  #define RESETHUB_INTENCLR_DOMAINRESET14_Clear (0x1UL) /*!< Disable                                                           */
  #define RESETHUB_INTENCLR_DOMAINRESET14_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define RESETHUB_INTENCLR_DOMAINRESET14_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* DOMAINRESET15 @Bit 15 : Write '1' to disable interrupt for event DOMAINRESET[15] */
  #define RESETHUB_INTENCLR_DOMAINRESET15_Pos (15UL) /*!< Position of DOMAINRESET15 field.                                     */
  #define RESETHUB_INTENCLR_DOMAINRESET15_Msk (0x1UL << RESETHUB_INTENCLR_DOMAINRESET15_Pos) /*!< Bit mask of DOMAINRESET15
                                                                            field.*/                                              
  #define RESETHUB_INTENCLR_DOMAINRESET15_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET15 field.                        */
  #define RESETHUB_INTENCLR_DOMAINRESET15_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET15 field.                        */
  #define RESETHUB_INTENCLR_DOMAINRESET15_Clear (0x1UL) /*!< Disable                                                           */
  #define RESETHUB_INTENCLR_DOMAINRESET15_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define RESETHUB_INTENCLR_DOMAINRESET15_Enabled (0x1UL) /*!< Read: Enabled                                                   */


/* RESETHUB_INTPEND: Pending interrupts */
  #define RESETHUB_INTPEND_ResetValue (0x00000000UL) /*!< Reset value of INTPEND register.                                     */

/* DOMAINRESET0 @Bit 0 : Read pending status of interrupt for event DOMAINRESET[0] */
  #define RESETHUB_INTPEND_DOMAINRESET0_Pos (0UL)    /*!< Position of DOMAINRESET0 field.                                      */
  #define RESETHUB_INTPEND_DOMAINRESET0_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET0_Pos) /*!< Bit mask of DOMAINRESET0 field.  */
  #define RESETHUB_INTPEND_DOMAINRESET0_Min (0x0UL)  /*!< Min enumerator value of DOMAINRESET0 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET0_Max (0x1UL)  /*!< Max enumerator value of DOMAINRESET0 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET0_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RESETHUB_INTPEND_DOMAINRESET0_Pending (0x1UL) /*!< Read: Pending                                                     */

/* DOMAINRESET1 @Bit 1 : Read pending status of interrupt for event DOMAINRESET[1] */
  #define RESETHUB_INTPEND_DOMAINRESET1_Pos (1UL)    /*!< Position of DOMAINRESET1 field.                                      */
  #define RESETHUB_INTPEND_DOMAINRESET1_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET1_Pos) /*!< Bit mask of DOMAINRESET1 field.  */
  #define RESETHUB_INTPEND_DOMAINRESET1_Min (0x0UL)  /*!< Min enumerator value of DOMAINRESET1 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET1_Max (0x1UL)  /*!< Max enumerator value of DOMAINRESET1 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET1_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RESETHUB_INTPEND_DOMAINRESET1_Pending (0x1UL) /*!< Read: Pending                                                     */

/* DOMAINRESET2 @Bit 2 : Read pending status of interrupt for event DOMAINRESET[2] */
  #define RESETHUB_INTPEND_DOMAINRESET2_Pos (2UL)    /*!< Position of DOMAINRESET2 field.                                      */
  #define RESETHUB_INTPEND_DOMAINRESET2_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET2_Pos) /*!< Bit mask of DOMAINRESET2 field.  */
  #define RESETHUB_INTPEND_DOMAINRESET2_Min (0x0UL)  /*!< Min enumerator value of DOMAINRESET2 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET2_Max (0x1UL)  /*!< Max enumerator value of DOMAINRESET2 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET2_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RESETHUB_INTPEND_DOMAINRESET2_Pending (0x1UL) /*!< Read: Pending                                                     */

