adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DOMAINRESET3 @Bit 3 : Read pending status of interrupt for event DOMAINRESET[3] */
  #define RESETHUB_INTPEND_DOMAINRESET3_Pos (3UL)    /*!< Position of DOMAINRESET3 field.                                      */
  #define RESETHUB_INTPEND_DOMAINRESET3_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET3_Pos) /*!< Bit mask of DOMAINRESET3 field.  */
  #define RESETHUB_INTPEND_DOMAINRESET3_Min (0x0UL)  /*!< Min enumerator value of DOMAINRESET3 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET3_Max (0x1UL)  /*!< Max enumerator value of DOMAINRESET3 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET3_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RESETHUB_INTPEND_DOMAINRESET3_Pending (0x1UL) /*!< Read: Pending                                                     */

/* DOMAINRESET4 @Bit 4 : Read pending status of interrupt for event DOMAINRESET[4] */
  #define RESETHUB_INTPEND_DOMAINRESET4_Pos (4UL)    /*!< Position of DOMAINRESET4 field.                                      */
  #define RESETHUB_INTPEND_DOMAINRESET4_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET4_Pos) /*!< Bit mask of DOMAINRESET4 field.  */
  #define RESETHUB_INTPEND_DOMAINRESET4_Min (0x0UL)  /*!< Min enumerator value of DOMAINRESET4 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET4_Max (0x1UL)  /*!< Max enumerator value of DOMAINRESET4 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET4_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RESETHUB_INTPEND_DOMAINRESET4_Pending (0x1UL) /*!< Read: Pending                                                     */

/* DOMAINRESET5 @Bit 5 : Read pending status of interrupt for event DOMAINRESET[5] */
  #define RESETHUB_INTPEND_DOMAINRESET5_Pos (5UL)    /*!< Position of DOMAINRESET5 field.                                      */
  #define RESETHUB_INTPEND_DOMAINRESET5_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET5_Pos) /*!< Bit mask of DOMAINRESET5 field.  */
  #define RESETHUB_INTPEND_DOMAINRESET5_Min (0x0UL)  /*!< Min enumerator value of DOMAINRESET5 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET5_Max (0x1UL)  /*!< Max enumerator value of DOMAINRESET5 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET5_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RESETHUB_INTPEND_DOMAINRESET5_Pending (0x1UL) /*!< Read: Pending                                                     */

/* DOMAINRESET6 @Bit 6 : Read pending status of interrupt for event DOMAINRESET[6] */
  #define RESETHUB_INTPEND_DOMAINRESET6_Pos (6UL)    /*!< Position of DOMAINRESET6 field.                                      */
  #define RESETHUB_INTPEND_DOMAINRESET6_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET6_Pos) /*!< Bit mask of DOMAINRESET6 field.  */
  #define RESETHUB_INTPEND_DOMAINRESET6_Min (0x0UL)  /*!< Min enumerator value of DOMAINRESET6 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET6_Max (0x1UL)  /*!< Max enumerator value of DOMAINRESET6 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET6_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RESETHUB_INTPEND_DOMAINRESET6_Pending (0x1UL) /*!< Read: Pending                                                     */

/* DOMAINRESET7 @Bit 7 : Read pending status of interrupt for event DOMAINRESET[7] */
  #define RESETHUB_INTPEND_DOMAINRESET7_Pos (7UL)    /*!< Position of DOMAINRESET7 field.                                      */
  #define RESETHUB_INTPEND_DOMAINRESET7_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET7_Pos) /*!< Bit mask of DOMAINRESET7 field.  */
  #define RESETHUB_INTPEND_DOMAINRESET7_Min (0x0UL)  /*!< Min enumerator value of DOMAINRESET7 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET7_Max (0x1UL)  /*!< Max enumerator value of DOMAINRESET7 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET7_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RESETHUB_INTPEND_DOMAINRESET7_Pending (0x1UL) /*!< Read: Pending                                                     */

/* DOMAINRESET8 @Bit 8 : Read pending status of interrupt for event DOMAINRESET[8] */
  #define RESETHUB_INTPEND_DOMAINRESET8_Pos (8UL)    /*!< Position of DOMAINRESET8 field.                                      */
  #define RESETHUB_INTPEND_DOMAINRESET8_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET8_Pos) /*!< Bit mask of DOMAINRESET8 field.  */
  #define RESETHUB_INTPEND_DOMAINRESET8_Min (0x0UL)  /*!< Min enumerator value of DOMAINRESET8 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET8_Max (0x1UL)  /*!< Max enumerator value of DOMAINRESET8 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET8_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RESETHUB_INTPEND_DOMAINRESET8_Pending (0x1UL) /*!< Read: Pending                                                     */

/* DOMAINRESET9 @Bit 9 : Read pending status of interrupt for event DOMAINRESET[9] */
  #define RESETHUB_INTPEND_DOMAINRESET9_Pos (9UL)    /*!< Position of DOMAINRESET9 field.                                      */
  #define RESETHUB_INTPEND_DOMAINRESET9_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET9_Pos) /*!< Bit mask of DOMAINRESET9 field.  */
  #define RESETHUB_INTPEND_DOMAINRESET9_Min (0x0UL)  /*!< Min enumerator value of DOMAINRESET9 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET9_Max (0x1UL)  /*!< Max enumerator value of DOMAINRESET9 field.                          */
  #define RESETHUB_INTPEND_DOMAINRESET9_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define RESETHUB_INTPEND_DOMAINRESET9_Pending (0x1UL) /*!< Read: Pending                                                     */

/* DOMAINRESET10 @Bit 10 : Read pending status of interrupt for event DOMAINRESET[10] */
  #define RESETHUB_INTPEND_DOMAINRESET10_Pos (10UL)  /*!< Position of DOMAINRESET10 field.                                     */
  #define RESETHUB_INTPEND_DOMAINRESET10_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET10_Pos) /*!< Bit mask of DOMAINRESET10
                                                                            field.*/                                              
  #define RESETHUB_INTPEND_DOMAINRESET10_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET10 field.                         */
  #define RESETHUB_INTPEND_DOMAINRESET10_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET10 field.                         */
  #define RESETHUB_INTPEND_DOMAINRESET10_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define RESETHUB_INTPEND_DOMAINRESET10_Pending (0x1UL) /*!< Read: Pending                                                    */

/* DOMAINRESET11 @Bit 11 : Read pending status of interrupt for event DOMAINRESET[11] */
  #define RESETHUB_INTPEND_DOMAINRESET11_Pos (11UL)  /*!< Position of DOMAINRESET11 field.                                     */
  #define RESETHUB_INTPEND_DOMAINRESET11_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET11_Pos) /*!< Bit mask of DOMAINRESET11
                                                                            field.*/                                              
  #define RESETHUB_INTPEND_DOMAINRESET11_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET11 field.                         */
  #define RESETHUB_INTPEND_DOMAINRESET11_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET11 field.                         */
  #define RESETHUB_INTPEND_DOMAINRESET11_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define RESETHUB_INTPEND_DOMAINRESET11_Pending (0x1UL) /*!< Read: Pending                                                    */

/* DOMAINRESET12 @Bit 12 : Read pending status of interrupt for event DOMAINRESET[12] */
  #define RESETHUB_INTPEND_DOMAINRESET12_Pos (12UL)  /*!< Position of DOMAINRESET12 field.                                     */
  #define RESETHUB_INTPEND_DOMAINRESET12_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET12_Pos) /*!< Bit mask of DOMAINRESET12
                                                                            field.*/                                              
  #define RESETHUB_INTPEND_DOMAINRESET12_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET12 field.                         */
  #define RESETHUB_INTPEND_DOMAINRESET12_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET12 field.                         */
  #define RESETHUB_INTPEND_DOMAINRESET12_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define RESETHUB_INTPEND_DOMAINRESET12_Pending (0x1UL) /*!< Read: Pending                                                    */

/* DOMAINRESET13 @Bit 13 : Read pending status of interrupt for event DOMAINRESET[13] */
  #define RESETHUB_INTPEND_DOMAINRESET13_Pos (13UL)  /*!< Position of DOMAINRESET13 field.                                     */
  #define RESETHUB_INTPEND_DOMAINRESET13_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET13_Pos) /*!< Bit mask of DOMAINRESET13
                                                                            field.*/                                              
  #define RESETHUB_INTPEND_DOMAINRESET13_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET13 field.                         */
  #define RESETHUB_INTPEND_DOMAINRESET13_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET13 field.                         */
  #define RESETHUB_INTPEND_DOMAINRESET13_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define RESETHUB_INTPEND_DOMAINRESET13_Pending (0x1UL) /*!< Read: Pending                                                    */

/* DOMAINRESET14 @Bit 14 : Read pending status of interrupt for event DOMAINRESET[14] */
  #define RESETHUB_INTPEND_DOMAINRESET14_Pos (14UL)  /*!< Position of DOMAINRESET14 field.                                     */
  #define RESETHUB_INTPEND_DOMAINRESET14_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET14_Pos) /*!< Bit mask of DOMAINRESET14
                                                                            field.*/                                              
  #define RESETHUB_INTPEND_DOMAINRESET14_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET14 field.                         */
  #define RESETHUB_INTPEND_DOMAINRESET14_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET14 field.                         */
  #define RESETHUB_INTPEND_DOMAINRESET14_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define RESETHUB_INTPEND_DOMAINRESET14_Pending (0x1UL) /*!< Read: Pending                                                    */

/* DOMAINRESET15 @Bit 15 : Read pending status of interrupt for event DOMAINRESET[15] */
  #define RESETHUB_INTPEND_DOMAINRESET15_Pos (15UL)  /*!< Position of DOMAINRESET15 field.                                     */
  #define RESETHUB_INTPEND_DOMAINRESET15_Msk (0x1UL << RESETHUB_INTPEND_DOMAINRESET15_Pos) /*!< Bit mask of DOMAINRESET15
                                                                            field.*/                                              
  #define RESETHUB_INTPEND_DOMAINRESET15_Min (0x0UL) /*!< Min enumerator value of DOMAINRESET15 field.                         */
  #define RESETHUB_INTPEND_DOMAINRESET15_Max (0x1UL) /*!< Max enumerator value of DOMAINRESET15 field.                         */
  #define RESETHUB_INTPEND_DOMAINRESET15_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define RESETHUB_INTPEND_DOMAINRESET15_Pending (0x1UL) /*!< Read: Pending                                                    */


/* RESETHUB_RESETMASK: Mask the reset request for a domain by itself. */
  #define RESETHUB_RESETMASK_ResetValue (0x0000FFFFUL) /*!< Reset value of RESETMASK register.                                 */

/* DOMAIN0 @Bit 0 : Mask the reset request for the domain[0], where [0] is domain id. */
  #define RESETHUB_RESETMASK_DOMAIN0_Pos (0UL)       /*!< Position of DOMAIN0 field.                                           */
  #define RESETHUB_RESETMASK_DOMAIN0_Msk (0x1UL << RESETHUB_RESETMASK_DOMAIN0_Pos) /*!< Bit mask of DOMAIN0 field.             */
  #define RESETHUB_RESETMASK_DOMAIN0_Min (0x0UL)     /*!< Min enumerator value of DOMAIN0 field.                               */
  #define RESETHUB_RESETMASK_DOMAIN0_Max (0x1UL)     /*!< Max enumerator value of DOMAIN0 field.                               */
  #define RESETHUB_RESETMASK_DOMAIN0_Mask (0x0UL)    /*!< Mask the reset request.                                              */
  #define RESETHUB_RESETMASK_DOMAIN0_Unmask (0x1UL)  /*!< Unmask the reset request.                                            */

