adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DOMAIN9 @Bit 9 : Mask the reset request for the domain[9], where [9] is domain id. */
  #define RESETHUB_RESETMASK_DOMAIN9_Pos (9UL)       /*!< Position of DOMAIN9 field.                                           */
  #define RESETHUB_RESETMASK_DOMAIN9_Msk (0x1UL << RESETHUB_RESETMASK_DOMAIN9_Pos) /*!< Bit mask of DOMAIN9 field.             */
  #define RESETHUB_RESETMASK_DOMAIN9_Min (0x0UL)     /*!< Min enumerator value of DOMAIN9 field.                               */
  #define RESETHUB_RESETMASK_DOMAIN9_Max (0x1UL)     /*!< Max enumerator value of DOMAIN9 field.                               */
  #define RESETHUB_RESETMASK_DOMAIN9_Mask (0x0UL)    /*!< Mask the reset request.                                              */
  #define RESETHUB_RESETMASK_DOMAIN9_Unmask (0x1UL)  /*!< Unmask the reset request.                                            */

/* DOMAIN10 @Bit 10 : Mask the reset request for the domain[10], where [10] is domain id. */
  #define RESETHUB_RESETMASK_DOMAIN10_Pos (10UL)     /*!< Position of DOMAIN10 field.                                          */
  #define RESETHUB_RESETMASK_DOMAIN10_Msk (0x1UL << RESETHUB_RESETMASK_DOMAIN10_Pos) /*!< Bit mask of DOMAIN10 field.          */
  #define RESETHUB_RESETMASK_DOMAIN10_Min (0x0UL)    /*!< Min enumerator value of DOMAIN10 field.                              */
  #define RESETHUB_RESETMASK_DOMAIN10_Max (0x1UL)    /*!< Max enumerator value of DOMAIN10 field.                              */
  #define RESETHUB_RESETMASK_DOMAIN10_Mask (0x0UL)   /*!< Mask the reset request.                                              */
  #define RESETHUB_RESETMASK_DOMAIN10_Unmask (0x1UL) /*!< Unmask the reset request.                                            */

/* DOMAIN11 @Bit 11 : Mask the reset request for the domain[11], where [11] is domain id. */
  #define RESETHUB_RESETMASK_DOMAIN11_Pos (11UL)     /*!< Position of DOMAIN11 field.                                          */
  #define RESETHUB_RESETMASK_DOMAIN11_Msk (0x1UL << RESETHUB_RESETMASK_DOMAIN11_Pos) /*!< Bit mask of DOMAIN11 field.          */
  #define RESETHUB_RESETMASK_DOMAIN11_Min (0x0UL)    /*!< Min enumerator value of DOMAIN11 field.                              */
  #define RESETHUB_RESETMASK_DOMAIN11_Max (0x1UL)    /*!< Max enumerator value of DOMAIN11 field.                              */
  #define RESETHUB_RESETMASK_DOMAIN11_Mask (0x0UL)   /*!< Mask the reset request.                                              */
  #define RESETHUB_RESETMASK_DOMAIN11_Unmask (0x1UL) /*!< Unmask the reset request.                                            */

/* DOMAIN12 @Bit 12 : Mask the reset request for the domain[12], where [12] is domain id. */
  #define RESETHUB_RESETMASK_DOMAIN12_Pos (12UL)     /*!< Position of DOMAIN12 field.                                          */
  #define RESETHUB_RESETMASK_DOMAIN12_Msk (0x1UL << RESETHUB_RESETMASK_DOMAIN12_Pos) /*!< Bit mask of DOMAIN12 field.          */
  #define RESETHUB_RESETMASK_DOMAIN12_Min (0x0UL)    /*!< Min enumerator value of DOMAIN12 field.                              */
  #define RESETHUB_RESETMASK_DOMAIN12_Max (0x1UL)    /*!< Max enumerator value of DOMAIN12 field.                              */
  #define RESETHUB_RESETMASK_DOMAIN12_Mask (0x0UL)   /*!< Mask the reset request.                                              */
  #define RESETHUB_RESETMASK_DOMAIN12_Unmask (0x1UL) /*!< Unmask the reset request.                                            */

/* DOMAIN13 @Bit 13 : Mask the reset request for the domain[13], where [13] is domain id. */
  #define RESETHUB_RESETMASK_DOMAIN13_Pos (13UL)     /*!< Position of DOMAIN13 field.                                          */
  #define RESETHUB_RESETMASK_DOMAIN13_Msk (0x1UL << RESETHUB_RESETMASK_DOMAIN13_Pos) /*!< Bit mask of DOMAIN13 field.          */
  #define RESETHUB_RESETMASK_DOMAIN13_Min (0x0UL)    /*!< Min enumerator value of DOMAIN13 field.                              */
  #define RESETHUB_RESETMASK_DOMAIN13_Max (0x1UL)    /*!< Max enumerator value of DOMAIN13 field.                              */
  #define RESETHUB_RESETMASK_DOMAIN13_Mask (0x0UL)   /*!< Mask the reset request.                                              */
  #define RESETHUB_RESETMASK_DOMAIN13_Unmask (0x1UL) /*!< Unmask the reset request.                                            */

/* DOMAIN14 @Bit 14 : Mask the reset request for the domain[14], where [14] is domain id. */
  #define RESETHUB_RESETMASK_DOMAIN14_Pos (14UL)     /*!< Position of DOMAIN14 field.                                          */
  #define RESETHUB_RESETMASK_DOMAIN14_Msk (0x1UL << RESETHUB_RESETMASK_DOMAIN14_Pos) /*!< Bit mask of DOMAIN14 field.          */
  #define RESETHUB_RESETMASK_DOMAIN14_Min (0x0UL)    /*!< Min enumerator value of DOMAIN14 field.                              */
  #define RESETHUB_RESETMASK_DOMAIN14_Max (0x1UL)    /*!< Max enumerator value of DOMAIN14 field.                              */
  #define RESETHUB_RESETMASK_DOMAIN14_Mask (0x0UL)   /*!< Mask the reset request.                                              */
  #define RESETHUB_RESETMASK_DOMAIN14_Unmask (0x1UL) /*!< Unmask the reset request.                                            */

/* DOMAIN15 @Bit 15 : Mask the reset request for the domain[15], where [15] is domain id. */
  #define RESETHUB_RESETMASK_DOMAIN15_Pos (15UL)     /*!< Position of DOMAIN15 field.                                          */
  #define RESETHUB_RESETMASK_DOMAIN15_Msk (0x1UL << RESETHUB_RESETMASK_DOMAIN15_Pos) /*!< Bit mask of DOMAIN15 field.          */
  #define RESETHUB_RESETMASK_DOMAIN15_Min (0x0UL)    /*!< Min enumerator value of DOMAIN15 field.                              */
  #define RESETHUB_RESETMASK_DOMAIN15_Max (0x1UL)    /*!< Max enumerator value of DOMAIN15 field.                              */
  #define RESETHUB_RESETMASK_DOMAIN15_Mask (0x0UL)   /*!< Mask the reset request.                                              */
  #define RESETHUB_RESETMASK_DOMAIN15_Unmask (0x1UL) /*!< Unmask the reset request.                                            */


/* RESETHUB_CROSSDOMAINRESET: Enable cross domain resets. */
  #define RESETHUB_CROSSDOMAINRESET_ResetValue (0x0000FFFFUL) /*!< Reset value of CROSSDOMAINRESET register.                   */

/* DOMAIN0 @Bit 0 : Cross domain reset enaable for DOMAIN[0], where [0] is domain id. */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN0_Pos (0UL) /*!< Position of DOMAIN0 field.                                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN0_Msk (0x1UL << RESETHUB_CROSSDOMAINRESET_DOMAIN0_Pos) /*!< Bit mask of DOMAIN0
                                                                            field.*/                                              
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN0_Min (0x0UL) /*!< Min enumerator value of DOMAIN0 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN0_Max (0x1UL) /*!< Max enumerator value of DOMAIN0 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN0_Disabled (0x0UL) /*!< Cross domain reset disabled                                  */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN0_Enabled (0x1UL) /*!< Cross domain reset enabled                                    */

