adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DOMAIN1 @Bit 1 : Cross domain reset enaable for DOMAIN[1], where [1] is domain id. */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN1_Pos (1UL) /*!< Position of DOMAIN1 field.                                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN1_Msk (0x1UL << RESETHUB_CROSSDOMAINRESET_DOMAIN1_Pos) /*!< Bit mask of DOMAIN1
                                                                            field.*/                                              
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN1_Min (0x0UL) /*!< Min enumerator value of DOMAIN1 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN1_Max (0x1UL) /*!< Max enumerator value of DOMAIN1 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN1_Disabled (0x0UL) /*!< Cross domain reset disabled                                  */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN1_Enabled (0x1UL) /*!< Cross domain reset enabled                                    */

/* DOMAIN2 @Bit 2 : Cross domain reset enaable for DOMAIN[2], where [2] is domain id. */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN2_Pos (2UL) /*!< Position of DOMAIN2 field.                                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN2_Msk (0x1UL << RESETHUB_CROSSDOMAINRESET_DOMAIN2_Pos) /*!< Bit mask of DOMAIN2
                                                                            field.*/                                              
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN2_Min (0x0UL) /*!< Min enumerator value of DOMAIN2 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN2_Max (0x1UL) /*!< Max enumerator value of DOMAIN2 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN2_Disabled (0x0UL) /*!< Cross domain reset disabled                                  */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN2_Enabled (0x1UL) /*!< Cross domain reset enabled                                    */

/* DOMAIN3 @Bit 3 : Cross domain reset enaable for DOMAIN[3], where [3] is domain id. */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN3_Pos (3UL) /*!< Position of DOMAIN3 field.                                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN3_Msk (0x1UL << RESETHUB_CROSSDOMAINRESET_DOMAIN3_Pos) /*!< Bit mask of DOMAIN3
                                                                            field.*/                                              
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN3_Min (0x0UL) /*!< Min enumerator value of DOMAIN3 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN3_Max (0x1UL) /*!< Max enumerator value of DOMAIN3 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN3_Disabled (0x0UL) /*!< Cross domain reset disabled                                  */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN3_Enabled (0x1UL) /*!< Cross domain reset enabled                                    */

/* DOMAIN4 @Bit 4 : Cross domain reset enaable for DOMAIN[4], where [4] is domain id. */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN4_Pos (4UL) /*!< Position of DOMAIN4 field.                                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN4_Msk (0x1UL << RESETHUB_CROSSDOMAINRESET_DOMAIN4_Pos) /*!< Bit mask of DOMAIN4
                                                                            field.*/                                              
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN4_Min (0x0UL) /*!< Min enumerator value of DOMAIN4 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN4_Max (0x1UL) /*!< Max enumerator value of DOMAIN4 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN4_Disabled (0x0UL) /*!< Cross domain reset disabled                                  */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN4_Enabled (0x1UL) /*!< Cross domain reset enabled                                    */

/* DOMAIN5 @Bit 5 : Cross domain reset enaable for DOMAIN[5], where [5] is domain id. */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN5_Pos (5UL) /*!< Position of DOMAIN5 field.                                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN5_Msk (0x1UL << RESETHUB_CROSSDOMAINRESET_DOMAIN5_Pos) /*!< Bit mask of DOMAIN5
                                                                            field.*/                                              
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN5_Min (0x0UL) /*!< Min enumerator value of DOMAIN5 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN5_Max (0x1UL) /*!< Max enumerator value of DOMAIN5 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN5_Disabled (0x0UL) /*!< Cross domain reset disabled                                  */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN5_Enabled (0x1UL) /*!< Cross domain reset enabled                                    */

/* DOMAIN6 @Bit 6 : Cross domain reset enaable for DOMAIN[6], where [6] is domain id. */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN6_Pos (6UL) /*!< Position of DOMAIN6 field.                                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN6_Msk (0x1UL << RESETHUB_CROSSDOMAINRESET_DOMAIN6_Pos) /*!< Bit mask of DOMAIN6
                                                                            field.*/                                              
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN6_Min (0x0UL) /*!< Min enumerator value of DOMAIN6 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN6_Max (0x1UL) /*!< Max enumerator value of DOMAIN6 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN6_Disabled (0x0UL) /*!< Cross domain reset disabled                                  */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN6_Enabled (0x1UL) /*!< Cross domain reset enabled                                    */

/* DOMAIN7 @Bit 7 : Cross domain reset enaable for DOMAIN[7], where [7] is domain id. */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN7_Pos (7UL) /*!< Position of DOMAIN7 field.                                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN7_Msk (0x1UL << RESETHUB_CROSSDOMAINRESET_DOMAIN7_Pos) /*!< Bit mask of DOMAIN7
                                                                            field.*/                                              
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN7_Min (0x0UL) /*!< Min enumerator value of DOMAIN7 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN7_Max (0x1UL) /*!< Max enumerator value of DOMAIN7 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN7_Disabled (0x0UL) /*!< Cross domain reset disabled                                  */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN7_Enabled (0x1UL) /*!< Cross domain reset enabled                                    */

/* DOMAIN8 @Bit 8 : Cross domain reset enaable for DOMAIN[8], where [8] is domain id. */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN8_Pos (8UL) /*!< Position of DOMAIN8 field.                                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN8_Msk (0x1UL << RESETHUB_CROSSDOMAINRESET_DOMAIN8_Pos) /*!< Bit mask of DOMAIN8
                                                                            field.*/                                              
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN8_Min (0x0UL) /*!< Min enumerator value of DOMAIN8 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN8_Max (0x1UL) /*!< Max enumerator value of DOMAIN8 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN8_Disabled (0x0UL) /*!< Cross domain reset disabled                                  */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN8_Enabled (0x1UL) /*!< Cross domain reset enabled                                    */

