adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DOMAIN9 @Bit 9 : Cross domain reset enaable for DOMAIN[9], where [9] is domain id. */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN9_Pos (9UL) /*!< Position of DOMAIN9 field.                                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN9_Msk (0x1UL << RESETHUB_CROSSDOMAINRESET_DOMAIN9_Pos) /*!< Bit mask of DOMAIN9
                                                                            field.*/                                              
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN9_Min (0x0UL) /*!< Min enumerator value of DOMAIN9 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN9_Max (0x1UL) /*!< Max enumerator value of DOMAIN9 field.                            */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN9_Disabled (0x0UL) /*!< Cross domain reset disabled                                  */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN9_Enabled (0x1UL) /*!< Cross domain reset enabled                                    */

/* DOMAIN10 @Bit 10 : Cross domain reset enaable for DOMAIN[10], where [10] is domain id. */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN10_Pos (10UL) /*!< Position of DOMAIN10 field.                                       */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN10_Msk (0x1UL << RESETHUB_CROSSDOMAINRESET_DOMAIN10_Pos) /*!< Bit mask of DOMAIN10
                                                                            field.*/                                              
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN10_Min (0x0UL) /*!< Min enumerator value of DOMAIN10 field.                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN10_Max (0x1UL) /*!< Max enumerator value of DOMAIN10 field.                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN10_Disabled (0x0UL) /*!< Cross domain reset disabled                                 */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN10_Enabled (0x1UL) /*!< Cross domain reset enabled                                   */

/* DOMAIN11 @Bit 11 : Cross domain reset enaable for DOMAIN[11], where [11] is domain id. */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN11_Pos (11UL) /*!< Position of DOMAIN11 field.                                       */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN11_Msk (0x1UL << RESETHUB_CROSSDOMAINRESET_DOMAIN11_Pos) /*!< Bit mask of DOMAIN11
                                                                            field.*/                                              
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN11_Min (0x0UL) /*!< Min enumerator value of DOMAIN11 field.                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN11_Max (0x1UL) /*!< Max enumerator value of DOMAIN11 field.                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN11_Disabled (0x0UL) /*!< Cross domain reset disabled                                 */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN11_Enabled (0x1UL) /*!< Cross domain reset enabled                                   */

/* DOMAIN12 @Bit 12 : Cross domain reset enaable for DOMAIN[12], where [12] is domain id. */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN12_Pos (12UL) /*!< Position of DOMAIN12 field.                                       */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN12_Msk (0x1UL << RESETHUB_CROSSDOMAINRESET_DOMAIN12_Pos) /*!< Bit mask of DOMAIN12
                                                                            field.*/                                              
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN12_Min (0x0UL) /*!< Min enumerator value of DOMAIN12 field.                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN12_Max (0x1UL) /*!< Max enumerator value of DOMAIN12 field.                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN12_Disabled (0x0UL) /*!< Cross domain reset disabled                                 */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN12_Enabled (0x1UL) /*!< Cross domain reset enabled                                   */

/* DOMAIN13 @Bit 13 : Cross domain reset enaable for DOMAIN[13], where [13] is domain id. */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN13_Pos (13UL) /*!< Position of DOMAIN13 field.                                       */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN13_Msk (0x1UL << RESETHUB_CROSSDOMAINRESET_DOMAIN13_Pos) /*!< Bit mask of DOMAIN13
                                                                            field.*/                                              
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN13_Min (0x0UL) /*!< Min enumerator value of DOMAIN13 field.                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN13_Max (0x1UL) /*!< Max enumerator value of DOMAIN13 field.                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN13_Disabled (0x0UL) /*!< Cross domain reset disabled                                 */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN13_Enabled (0x1UL) /*!< Cross domain reset enabled                                   */

/* DOMAIN14 @Bit 14 : Cross domain reset enaable for DOMAIN[14], where [14] is domain id. */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN14_Pos (14UL) /*!< Position of DOMAIN14 field.                                       */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN14_Msk (0x1UL << RESETHUB_CROSSDOMAINRESET_DOMAIN14_Pos) /*!< Bit mask of DOMAIN14
                                                                            field.*/                                              
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN14_Min (0x0UL) /*!< Min enumerator value of DOMAIN14 field.                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN14_Max (0x1UL) /*!< Max enumerator value of DOMAIN14 field.                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN14_Disabled (0x0UL) /*!< Cross domain reset disabled                                 */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN14_Enabled (0x1UL) /*!< Cross domain reset enabled                                   */

/* DOMAIN15 @Bit 15 : Cross domain reset enaable for DOMAIN[15], where [15] is domain id. */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN15_Pos (15UL) /*!< Position of DOMAIN15 field.                                       */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN15_Msk (0x1UL << RESETHUB_CROSSDOMAINRESET_DOMAIN15_Pos) /*!< Bit mask of DOMAIN15
                                                                            field.*/                                              
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN15_Min (0x0UL) /*!< Min enumerator value of DOMAIN15 field.                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN15_Max (0x1UL) /*!< Max enumerator value of DOMAIN15 field.                          */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN15_Disabled (0x0UL) /*!< Cross domain reset disabled                                 */
  #define RESETHUB_CROSSDOMAINRESET_DOMAIN15_Enabled (0x1UL) /*!< Cross domain reset enabled                                   */


