adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RESETHUB_GPREGRET: General purpose retention register. */
  #define RESETHUB_GPREGRET_ResetValue (0x00000000UL) /*!< Reset value of GPREGRET register.                                   */

/* GPREGRET @Bits 0..7 : General purpose retention register. */
  #define RESETHUB_GPREGRET_GPREGRET_Pos (0UL)       /*!< Position of GPREGRET field.                                          */
  #define RESETHUB_GPREGRET_GPREGRET_Msk (0xFFUL << RESETHUB_GPREGRET_GPREGRET_Pos) /*!< Bit mask of GPREGRET field.           */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         RESETINFO                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================ Struct RESETINFO_RESETREAS_ERROR ============================================= */
/**
  * @brief ERROR [RESETINFO_RESETREAS_ERROR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000000) Reset error status.                                   */
  __IOM uint32_t  ADDRESS;                           /*!< (@ 0x00000004) Reset error address.                                  */
} NRF_RESETINFO_RESETREAS_ERROR_Type;                /*!< Size = 8 (0x008)                                                     */

/* RESETINFO_RESETREAS_ERROR_STATUS: Reset error status. */
  #define RESETINFO_RESETREAS_ERROR_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                      */

/* ERRORSTATUS @Bits 0..3 : Error status */
  #define RESETINFO_RESETREAS_ERROR_STATUS_ERRORSTATUS_Pos (0UL) /*!< Position of ERRORSTATUS field.                           */
  #define RESETINFO_RESETREAS_ERROR_STATUS_ERRORSTATUS_Msk (0xFUL << RESETINFO_RESETREAS_ERROR_STATUS_ERRORSTATUS_Pos) /*!< Bit
                                                                            mask of ERRORSTATUS field.*/                          


/* RESETINFO_RESETREAS_ERROR_ADDRESS: Reset error address. */
  #define RESETINFO_RESETREAS_ERROR_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                    */

/* ERRORADDRESS @Bits 0..31 : Error address */
  #define RESETINFO_RESETREAS_ERROR_ADDRESS_ERRORADDRESS_Pos (0UL) /*!< Position of ERRORADDRESS field.                        */
  #define RESETINFO_RESETREAS_ERROR_ADDRESS_ERRORADDRESS_Msk (0xFFFFFFFFUL << RESETINFO_RESETREAS_ERROR_ADDRESS_ERRORADDRESS_Pos)
                                                                            /*!< Bit mask of ERRORADDRESS field.*/                



/* =============================================== Struct RESETINFO_RESETREAS ================================================ */
/**
  * @brief RESETREAS [RESETINFO_RESETREAS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  GLOBAL;                            /*!< (@ 0x00000000) Global reset reason.                                  */
  __IOM uint32_t  LOCAL;                             /*!< (@ 0x00000004) Local reset reason.                                   */
  __IOM NRF_RESETINFO_RESETREAS_ERROR_Type ERROR;    /*!< (@ 0x00000008) (unspecified)                                         */
} NRF_RESETINFO_RESETREAS_Type;                      /*!< Size = 16 (0x010)                                                    */

/* RESETINFO_RESETREAS_GLOBAL: Global reset reason. */
  #define RESETINFO_RESETREAS_GLOBAL_ResetValue (0x00000000UL) /*!< Reset value of GLOBAL register.                            */

/* RESETPOR @Bit 0 : Reset from power on reset. */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Pos (0UL) /*!< Position of RESETPOR field.                                       */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_RESETPOR_Pos) /*!< Bit mask of RESETPOR
                                                                            field.*/                                              
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Min (0x0UL) /*!< Min enumerator value of RESETPOR field.                         */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Max (0x1UL) /*!< Max enumerator value of RESETPOR field.                         */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_NotDetected (0x0UL) /*!< Not detected                                            */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Detected (0x1UL) /*!< Detected                                                   */

/* RESETPIN @Bit 1 : Reset from pin reset detected. */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Pos (1UL) /*!< Position of RESETPIN field.                                       */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_RESETPIN_Pos) /*!< Bit mask of RESETPIN
                                                                            field.*/                                              
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Min (0x0UL) /*!< Min enumerator value of RESETPIN field.                         */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Max (0x1UL) /*!< Max enumerator value of RESETPIN field.                         */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_NotDetected (0x0UL) /*!< Not detected                                            */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Detected (0x1UL) /*!< Detected                                                   */

/* DOG @Bit 2 : Reset from the SysCtrl watchdog timer detected. */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Pos (2UL)   /*!< Position of DOG field.                                               */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_DOG_Pos) /*!< Bit mask of DOG field.         */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Min (0x0UL) /*!< Min enumerator value of DOG field.                                   */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Max (0x1UL) /*!< Max enumerator value of DOG field.                                   */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_NotDetected (0x0UL) /*!< Not detected                                                 */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Detected (0x1UL) /*!< Detected                                                        */

