adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RESETINFO_RESETREAS_LOCAL: Local reset reason. */
  #define RESETINFO_RESETREAS_LOCAL_ResetValue (0x00000000UL) /*!< Reset value of LOCAL register.                              */

/* DOG @Bit 0 : Reset from the local watchdog timer detected */
  #define RESETINFO_RESETREAS_LOCAL_DOG_Pos (0UL)    /*!< Position of DOG field.                                               */
  #define RESETINFO_RESETREAS_LOCAL_DOG_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_DOG_Pos) /*!< Bit mask of DOG field.           */
  #define RESETINFO_RESETREAS_LOCAL_DOG_Min (0x0UL)  /*!< Min enumerator value of DOG field.                                   */
  #define RESETINFO_RESETREAS_LOCAL_DOG_Max (0x1UL)  /*!< Max enumerator value of DOG field.                                   */
  #define RESETINFO_RESETREAS_LOCAL_DOG_NotDetected (0x0UL) /*!< Not detected                                                  */
  #define RESETINFO_RESETREAS_LOCAL_DOG_Detected (0x1UL) /*!< Detected                                                         */

/* DOGNS @Bit 1 : Reset from the local non-secure watchdog timer detected */
  #define RESETINFO_RESETREAS_LOCAL_DOGNS_Pos (1UL)  /*!< Position of DOGNS field.                                             */
  #define RESETINFO_RESETREAS_LOCAL_DOGNS_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_DOGNS_Pos) /*!< Bit mask of DOGNS field.     */
  #define RESETINFO_RESETREAS_LOCAL_DOGNS_Min (0x0UL) /*!< Min enumerator value of DOGNS field.                                */
  #define RESETINFO_RESETREAS_LOCAL_DOGNS_Max (0x1UL) /*!< Max enumerator value of DOGNS field.                                */
  #define RESETINFO_RESETREAS_LOCAL_DOGNS_NotDetected (0x0UL) /*!< Not detected                                                */
  #define RESETINFO_RESETREAS_LOCAL_DOGNS_Detected (0x1UL) /*!< Detected                                                       */

/* SREQ @Bit 2 : Reset from the local soft reset request detected. */
  #define RESETINFO_RESETREAS_LOCAL_SREQ_Pos (2UL)   /*!< Position of SREQ field.                                              */
  #define RESETINFO_RESETREAS_LOCAL_SREQ_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_SREQ_Pos) /*!< Bit mask of SREQ field.        */
  #define RESETINFO_RESETREAS_LOCAL_SREQ_Min (0x0UL) /*!< Min enumerator value of SREQ field.                                  */
  #define RESETINFO_RESETREAS_LOCAL_SREQ_Max (0x1UL) /*!< Max enumerator value of SREQ field.                                  */
  #define RESETINFO_RESETREAS_LOCAL_SREQ_NotDetected (0x0UL) /*!< Not detected                                                 */
  #define RESETINFO_RESETREAS_LOCAL_SREQ_Detected (0x1UL) /*!< Detected                                                        */

/* LOCKUP @Bit 3 : Reset from local CPU lockup detected */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Pos (3UL) /*!< Position of LOCKUP field.                                            */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_LOCKUP_Pos) /*!< Bit mask of LOCKUP field.  */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Min (0x0UL) /*!< Min enumerator value of LOCKUP field.                              */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Max (0x1UL) /*!< Max enumerator value of LOCKUP field.                              */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_NotDetected (0x0UL) /*!< Not detected                                               */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Detected (0x1UL) /*!< Detected                                                      */

/* CROSSDOMAIN @Bit 4 : Reset due to cross domain reset source. */
  #define RESETINFO_RESETREAS_LOCAL_CROSSDOMAIN_Pos (4UL) /*!< Position of CROSSDOMAIN field.                                  */
  #define RESETINFO_RESETREAS_LOCAL_CROSSDOMAIN_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_CROSSDOMAIN_Pos) /*!< Bit mask of
                                                                            CROSSDOMAIN field.*/                                  
  #define RESETINFO_RESETREAS_LOCAL_CROSSDOMAIN_Min (0x0UL) /*!< Min enumerator value of CROSSDOMAIN field.                    */
  #define RESETINFO_RESETREAS_LOCAL_CROSSDOMAIN_Max (0x1UL) /*!< Max enumerator value of CROSSDOMAIN field.                    */
  #define RESETINFO_RESETREAS_LOCAL_CROSSDOMAIN_NotDetected (0x0UL) /*!< Not detected                                          */
  #define RESETINFO_RESETREAS_LOCAL_CROSSDOMAIN_Detected (0x1UL) /*!< Detected                                                 */

/* UNRETAINEDWAKE @Bit 5 : Reset due to wake from unretained state. */
  #define RESETINFO_RESETREAS_LOCAL_UNRETAINEDWAKE_Pos (5UL) /*!< Position of UNRETAINEDWAKE field.                            */
  #define RESETINFO_RESETREAS_LOCAL_UNRETAINEDWAKE_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_UNRETAINEDWAKE_Pos) /*!< Bit mask of
                                                                            UNRETAINEDWAKE field.*/                               


/* ==================================================== Struct RESETINFO ===================================================== */
/**
  * @brief RESETINFO
  */
  typedef struct {                                   /*!< RESETINFO Structure                                                  */
    __IM uint32_t RESERVED[296];
    __IOM NRF_RESETINFO_RESETREAS_Type RESETREAS;    /*!< (@ 0x000004A0) (unspecified)                                         */
    __IM uint32_t RESERVED1[4];
    __IOM uint32_t RESTOREVALID;                     /*!< (@ 0x000004C0) Valid restore image is present in RAM.                */
    __IOM uint32_t MASKLOCKUP;                       /*!< (@ 0x000004C4) Mask CPU lockup signal.                               */
  } NRF_RESETINFO_Type;                              /*!< Size = 1224 (0x4C8)                                                  */

/* RESETINFO_RESTOREVALID: Valid restore image is present in RAM. */
  #define RESETINFO_RESTOREVALID_ResetValue (0x00000000UL) /*!< Reset value of RESTOREVALID register.                          */

