adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RESTOREVALID @Bit 0 : Valid restore image is present in RAM. */
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Pos (0UL) /*!< Position of RESTOREVALID field.                                   */
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Msk (0x1UL << RESETINFO_RESTOREVALID_RESTOREVALID_Pos) /*!< Bit mask of
                                                                            RESTOREVALID field.*/                                 
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Min (0x0UL) /*!< Min enumerator value of RESTOREVALID field.                     */
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Max (0x1UL) /*!< Max enumerator value of RESTOREVALID field.                     */
  #define RESETINFO_RESTOREVALID_RESTOREVALID_NotPreset (0x0UL) /*!< Not present                                               */
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Present (0x1UL) /*!< Present                                                     */


/* RESETINFO_MASKLOCKUP: Mask CPU lockup signal. */
  #define RESETINFO_MASKLOCKUP_ResetValue (0x00000000UL) /*!< Reset value of MASKLOCKUP register.                              */

/* MASK @Bit 0 : Mask lockup signal */
  #define RESETINFO_MASKLOCKUP_MASK_Pos (0UL)        /*!< Position of MASK field.                                              */
  #define RESETINFO_MASKLOCKUP_MASK_Msk (0x1UL << RESETINFO_MASKLOCKUP_MASK_Pos) /*!< Bit mask of MASK field.                  */
  #define RESETINFO_MASKLOCKUP_MASK_Min (0x0UL)      /*!< Min enumerator value of MASK field.                                  */
  #define RESETINFO_MASKLOCKUP_MASK_Max (0x1UL)      /*!< Max enumerator value of MASK field.                                  */
  #define RESETINFO_MASKLOCKUP_MASK_NotMask (0x0UL)  /*!< Do not mask lockup signal                                            */
  #define RESETINFO_MASKLOCKUP_MASK_Mask (0x1UL)     /*!< Mask lockup signal                                                   */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           RICR                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct RICR_LCS ===================================================== */
/**
  * @brief LCS [RICR_LCS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SIGNATURE[4];                      /*!< (@ 0x00000000) Signature to determine the re-entrant device life-cycle
                                                                         state (LCS).*/                                           
} NRF_RICR_LCS_Type;                                 /*!< Size = 16 (0x010)                                                    */

/* RICR_LCS_SIGNATURE: Signature to determine the re-entrant device life-cycle state (LCS). */
  #define RICR_LCS_SIGNATURE_MaxCount (4UL)          /*!< Max size of SIGNATURE[4] array.                                      */
  #define RICR_LCS_SIGNATURE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of SIGNATURE[4] register.                              */

/* VALUE @Bits 0..31 : Uninitialized when freshly out of factory, esle PUF-derived LCS signature. */
  #define RICR_LCS_SIGNATURE_VALUE_Pos (0UL)         /*!< Position of VALUE field.                                             */
  #define RICR_LCS_SIGNATURE_VALUE_Msk (0xFFFFFFFFUL << RICR_LCS_SIGNATURE_VALUE_Pos) /*!< Bit mask of VALUE field.            */
  #define RICR_LCS_SIGNATURE_VALUE_Min (0xFFFFFFFFUL) /*!< Min enumerator value of VALUE field.                                */
  #define RICR_LCS_SIGNATURE_VALUE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of VALUE field.                                */
  #define RICR_LCS_SIGNATURE_VALUE_UNINITIALIZED (0xFFFFFFFFUL) /*!< Value of LCS registers when the device is freshly
                                                                     manufactured (LCS state FFF), and the MRAM and the info
                                                                     pages including RICR are uninitialized.*/                    



/* ============================================= Struct RICR_UROT_SM_TBS_PUBKEY ============================================== */
/**
  * @brief PUBKEY [RICR_UROT_SM_TBS_PUBKEY] Raw public key used to verify the signed manifest.
  */
typedef struct {
  __IOM uint32_t  SIZE;                              /*!< (@ 0x00000000) The size of the raw public key(in bytes).             */
  __IOM uint32_t  ADDR;                              /*!< (@ 0x00000004) Address of the raw public key.                        */
} NRF_RICR_UROT_SM_TBS_PUBKEY_Type;                  /*!< Size = 8 (0x008)                                                     */

/* RICR_UROT_SM_TBS_PUBKEY_SIZE: The size of the raw public key(in bytes). */

/* SIZE @Bits 0..31 : Key size */
  #define RICR_UROT_SM_TBS_PUBKEY_SIZE_SIZE_Pos (0UL) /*!< Position of SIZE field.                                             */
  #define RICR_UROT_SM_TBS_PUBKEY_SIZE_SIZE_Msk (0xFFFFFFFFUL << RICR_UROT_SM_TBS_PUBKEY_SIZE_SIZE_Pos) /*!< Bit mask of SIZE
                                                                            field.*/                                              
  #define RICR_UROT_SM_TBS_PUBKEY_SIZE_SIZE_Min (0x20UL) /*!< Min enumerator value of SIZE field.                              */
  #define RICR_UROT_SM_TBS_PUBKEY_SIZE_SIZE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of SIZE field.                        */
  #define RICR_UROT_SM_TBS_PUBKEY_SIZE_SIZE_Unprogrammed (0xFFFFFFFFUL) /*!< The key is not programmed.                        */
  #define RICR_UROT_SM_TBS_PUBKEY_SIZE_SIZE_SizeEd25519 (0x00000020UL) /*!< The size of the raw Ed25519 public key. Currently
                                                                            this is the only size supported by the secure domain
                                                                            ROM code.*/                                           


/* RICR_UROT_SM_TBS_PUBKEY_ADDR: Address of the raw public key. */

