adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ============================================== Struct RICR_UROT_RECOVERY_SM =============================================== */
/**
  * @brief SM [RICR_UROT_RECOVERY_SM] Signed Manifest verified by the Secure Domain ROM Code to establish the primary RoT.
  */
typedef struct {
  __IOM NRF_RICR_UROT_RECOVERY_SM_TBS_Type TBS;      /*!< (@ 0x00000000) Manifest describing the secure domain firmware. The
                                                                         secure domain ROM code verifies the signature on the
                                                                         digest of this register.*/                               
  __IOM NRF_RICR_UROT_RECOVERY_SM_SIGNATURE_Type SIGNATURE; /*!< (@ 0x000000F4) Signature on the manifest defined in
                                                                            SICR.UROT.SM.TBS*/                                    
} NRF_RICR_UROT_RECOVERY_SM_Type;                    /*!< Size = 256 (0x100)                                                   */


/* ================================================ Struct RICR_UROT_RECOVERY ================================================ */
/**
  * @brief RECOVERY [RICR_UROT_RECOVERY] (unspecified)
  */
typedef struct {
  __IOM NRF_RICR_UROT_RECOVERY_SM_Type SM;           /*!< (@ 0x00000000) Signed Manifest verified by the Secure Domain ROM Code
                                                                         to establish the primary RoT.*/                          
} NRF_RICR_UROT_RECOVERY_Type;                       /*!< Size = 256 (0x100)                                                   */


/* ================================================= Struct RICR_UROT_UPDATE ================================================= */
/**
  * @brief UPDATE [RICR_UROT_UPDATE] Internal information maintained by the secure domain ROM code on the state of update.
  */
typedef struct {
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000000) ROM code maintains the status of update here.         */
} NRF_RICR_UROT_UPDATE_Type;                         /*!< Size = 4 (0x004)                                                     */

/* RICR_UROT_UPDATE_STATUS: ROM code maintains the status of update here. */

/* CODE @Bits 0..31 : Status code. */
  #define RICR_UROT_UPDATE_STATUS_CODE_Pos (0UL)     /*!< Position of CODE field.                                              */
  #define RICR_UROT_UPDATE_STATUS_CODE_Msk (0xFFFFFFFFUL << RICR_UROT_UPDATE_STATUS_CODE_Pos) /*!< Bit mask of CODE field.     */
  #define RICR_UROT_UPDATE_STATUS_CODE_Min (0xF0000009UL) /*!< Min enumerator value of CODE field.                             */
  #define RICR_UROT_UPDATE_STATUS_CODE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of CODE field.                             */
  #define RICR_UROT_UPDATE_STATUS_CODE_None (0xFFFFFFFFUL) /*!< No operation pending to indicate any status.                   */
  #define RICR_UROT_UPDATE_STATUS_CODE_UROTUnconfirmed (0xF0000009UL) /*!< The firmware update is applied, but is pending
                                                                           confirmation from the updated firmware.*/              
  #define RICR_UROT_UPDATE_STATUS_CODE_RecoveryUnconfirmed (0xF000000AUL) /*!< The firmware update is applied, but is pending
                                                                            confirmation from the updated firmware.*/             
  #define RICR_UROT_UPDATE_STATUS_CODE_SafeMode (0xF000000CUL) /*!< Recovery image is booted in safe mode as the UROT firmware
                                                                    update failed and the ROM could not restore any previous
                                                                    UROT firmware.*/                                              
  #define RICR_UROT_UPDATE_STATUS_CODE_AROTRecovery (0xF000000DUL) /*!< Recovery image is booted so that the recovery image can
                                                                        download a AROT image that ROM does not verify.*/         
  #define RICR_UROT_UPDATE_STATUS_CODE_UROTUpdateDisabled (0xF000000EUL) /*!< No valid recovery image is present and hence UROT
                                                                            firmware update is disabled.*/                        



/* ==================================================== Struct RICR_UROT ===================================================== */
/**
  * @brief UROT [RICR_UROT] (unspecified)
  */
typedef struct {
  __IOM NRF_RICR_UROT_SM_Type SM;                    /*!< (@ 0x00000000) Signed Manifest verified by the Secure Domain ROM Code
                                                                         to establish the primary RoT.*/                          
  __IOM NRF_RICR_UROT_RECOVERY_Type RECOVERY;        /*!< (@ 0x00000100) (unspecified)                                         */
  __IOM NRF_RICR_UROT_UPDATE_Type UPDATE;            /*!< (@ 0x00000200) Internal information maintained by the secure domain
                                                                         ROM code on the state of update.*/                       
} NRF_RICR_UROT_Type;                                /*!< Size = 516 (0x204)                                                   */

/* ======================================================= Struct RICR ======================================================= */
/**
  * @brief ROM Information Configuration Registers
  */
  typedef struct {                                   /*!< RICR Structure                                                       */
    __IOM NRF_RICR_LCS_Type LCS;                     /*!< (@ 0x00000000) (unspecified)                                         */
    __IOM NRF_RICR_UROT_Type UROT;                   /*!< (@ 0x00000010) (unspecified)                                         */
  } NRF_RICR_Type;                                   /*!< Size = 532 (0x214)                                                   */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           ROMC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

