adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* COMPARE0 @Bit 16 : Enable or disable interrupt for event COMPARE[0] */
  #define RTC_INTEN_COMPARE0_Pos (16UL)              /*!< Position of COMPARE0 field.                                          */
  #define RTC_INTEN_COMPARE0_Msk (0x1UL << RTC_INTEN_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                            */
  #define RTC_INTEN_COMPARE0_Min (0x0UL)             /*!< Min enumerator value of COMPARE0 field.                              */
  #define RTC_INTEN_COMPARE0_Max (0x1UL)             /*!< Max enumerator value of COMPARE0 field.                              */
  #define RTC_INTEN_COMPARE0_Disabled (0x0UL)        /*!< Disable                                                              */
  #define RTC_INTEN_COMPARE0_Enabled (0x1UL)         /*!< Enable                                                               */

/* COMPARE1 @Bit 17 : Enable or disable interrupt for event COMPARE[1] */
  #define RTC_INTEN_COMPARE1_Pos (17UL)              /*!< Position of COMPARE1 field.                                          */
  #define RTC_INTEN_COMPARE1_Msk (0x1UL << RTC_INTEN_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                            */
  #define RTC_INTEN_COMPARE1_Min (0x0UL)             /*!< Min enumerator value of COMPARE1 field.                              */
  #define RTC_INTEN_COMPARE1_Max (0x1UL)             /*!< Max enumerator value of COMPARE1 field.                              */
  #define RTC_INTEN_COMPARE1_Disabled (0x0UL)        /*!< Disable                                                              */
  #define RTC_INTEN_COMPARE1_Enabled (0x1UL)         /*!< Enable                                                               */

/* COMPARE2 @Bit 18 : Enable or disable interrupt for event COMPARE[2] */
  #define RTC_INTEN_COMPARE2_Pos (18UL)              /*!< Position of COMPARE2 field.                                          */
  #define RTC_INTEN_COMPARE2_Msk (0x1UL << RTC_INTEN_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field.                            */
  #define RTC_INTEN_COMPARE2_Min (0x0UL)             /*!< Min enumerator value of COMPARE2 field.                              */
  #define RTC_INTEN_COMPARE2_Max (0x1UL)             /*!< Max enumerator value of COMPARE2 field.                              */
  #define RTC_INTEN_COMPARE2_Disabled (0x0UL)        /*!< Disable                                                              */
  #define RTC_INTEN_COMPARE2_Enabled (0x1UL)         /*!< Enable                                                               */

/* COMPARE3 @Bit 19 : Enable or disable interrupt for event COMPARE[3] */
  #define RTC_INTEN_COMPARE3_Pos (19UL)              /*!< Position of COMPARE3 field.                                          */
  #define RTC_INTEN_COMPARE3_Msk (0x1UL << RTC_INTEN_COMPARE3_Pos) /*!< Bit mask of COMPARE3 field.                            */
  #define RTC_INTEN_COMPARE3_Min (0x0UL)             /*!< Min enumerator value of COMPARE3 field.                              */
  #define RTC_INTEN_COMPARE3_Max (0x1UL)             /*!< Max enumerator value of COMPARE3 field.                              */
  #define RTC_INTEN_COMPARE3_Disabled (0x0UL)        /*!< Disable                                                              */
  #define RTC_INTEN_COMPARE3_Enabled (0x1UL)         /*!< Enable                                                               */

/* COMPARE4 @Bit 20 : Enable or disable interrupt for event COMPARE[4] */
  #define RTC_INTEN_COMPARE4_Pos (20UL)              /*!< Position of COMPARE4 field.                                          */
  #define RTC_INTEN_COMPARE4_Msk (0x1UL << RTC_INTEN_COMPARE4_Pos) /*!< Bit mask of COMPARE4 field.                            */
  #define RTC_INTEN_COMPARE4_Min (0x0UL)             /*!< Min enumerator value of COMPARE4 field.                              */
  #define RTC_INTEN_COMPARE4_Max (0x1UL)             /*!< Max enumerator value of COMPARE4 field.                              */
  #define RTC_INTEN_COMPARE4_Disabled (0x0UL)        /*!< Disable                                                              */
  #define RTC_INTEN_COMPARE4_Enabled (0x1UL)         /*!< Enable                                                               */

/* COMPARE5 @Bit 21 : Enable or disable interrupt for event COMPARE[5] */
  #define RTC_INTEN_COMPARE5_Pos (21UL)              /*!< Position of COMPARE5 field.                                          */
  #define RTC_INTEN_COMPARE5_Msk (0x1UL << RTC_INTEN_COMPARE5_Pos) /*!< Bit mask of COMPARE5 field.                            */
  #define RTC_INTEN_COMPARE5_Min (0x0UL)             /*!< Min enumerator value of COMPARE5 field.                              */
  #define RTC_INTEN_COMPARE5_Max (0x1UL)             /*!< Max enumerator value of COMPARE5 field.                              */
  #define RTC_INTEN_COMPARE5_Disabled (0x0UL)        /*!< Disable                                                              */
  #define RTC_INTEN_COMPARE5_Enabled (0x1UL)         /*!< Enable                                                               */

/* COMPARE6 @Bit 22 : Enable or disable interrupt for event COMPARE[6] */
  #define RTC_INTEN_COMPARE6_Pos (22UL)              /*!< Position of COMPARE6 field.                                          */
  #define RTC_INTEN_COMPARE6_Msk (0x1UL << RTC_INTEN_COMPARE6_Pos) /*!< Bit mask of COMPARE6 field.                            */
  #define RTC_INTEN_COMPARE6_Min (0x0UL)             /*!< Min enumerator value of COMPARE6 field.                              */
  #define RTC_INTEN_COMPARE6_Max (0x1UL)             /*!< Max enumerator value of COMPARE6 field.                              */
  #define RTC_INTEN_COMPARE6_Disabled (0x0UL)        /*!< Disable                                                              */
  #define RTC_INTEN_COMPARE6_Enabled (0x1UL)         /*!< Enable                                                               */

/* COMPARE7 @Bit 23 : Enable or disable interrupt for event COMPARE[7] */
  #define RTC_INTEN_COMPARE7_Pos (23UL)              /*!< Position of COMPARE7 field.                                          */
  #define RTC_INTEN_COMPARE7_Msk (0x1UL << RTC_INTEN_COMPARE7_Pos) /*!< Bit mask of COMPARE7 field.                            */
  #define RTC_INTEN_COMPARE7_Min (0x0UL)             /*!< Min enumerator value of COMPARE7 field.                              */
  #define RTC_INTEN_COMPARE7_Max (0x1UL)             /*!< Max enumerator value of COMPARE7 field.                              */
  #define RTC_INTEN_COMPARE7_Disabled (0x0UL)        /*!< Disable                                                              */
  #define RTC_INTEN_COMPARE7_Enabled (0x1UL)         /*!< Enable                                                               */


/* RTC_INTENSET: Enable interrupt */
  #define RTC_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* TICK @Bit 0 : Write '1' to enable interrupt for event TICK */
  #define RTC_INTENSET_TICK_Pos (0UL)                /*!< Position of TICK field.                                              */
  #define RTC_INTENSET_TICK_Msk (0x1UL << RTC_INTENSET_TICK_Pos) /*!< Bit mask of TICK field.                                  */
  #define RTC_INTENSET_TICK_Min (0x0UL)              /*!< Min enumerator value of TICK field.                                  */
  #define RTC_INTENSET_TICK_Max (0x1UL)              /*!< Max enumerator value of TICK field.                                  */
  #define RTC_INTENSET_TICK_Set (0x1UL)              /*!< Enable                                                               */
  #define RTC_INTENSET_TICK_Disabled (0x0UL)         /*!< Read: Disabled                                                       */
  #define RTC_INTENSET_TICK_Enabled (0x1UL)          /*!< Read: Enabled                                                        */

