adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* HIGH @Bits 16..31 : High level limit */
  #define SAADC_CH_LIMIT_HIGH_Pos (16UL)             /*!< Position of HIGH field.                                              */
  #define SAADC_CH_LIMIT_HIGH_Msk (0xFFFFUL << SAADC_CH_LIMIT_HIGH_Pos) /*!< Bit mask of HIGH field.                           */
  #define SAADC_CH_LIMIT_HIGH_Min (0xFFFFFFFFUL)     /*!< Min value of HIGH field.                                             */
  #define SAADC_CH_LIMIT_HIGH_Max (0xFFFFFFFFUL)     /*!< Max size of HIGH field.                                              */



/* =================================================== Struct SAADC_RESULT =================================================== */
/**
  * @brief RESULT [SAADC_RESULT] RESULT EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Data pointer                                          */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000004) Maximum number of buffer bytes to transfer            */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x00000008) Number of buffer bytes transferred since last START   */
  __IM  uint32_t  RESERVED;
} NRF_SAADC_RESULT_Type;                             /*!< Size = 16 (0x010)                                                    */

/* SAADC_RESULT_PTR: Data pointer */
  #define SAADC_RESULT_PTR_ResetValue (0x00000000UL) /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : Data pointer */
  #define SAADC_RESULT_PTR_PTR_Pos (0UL)             /*!< Position of PTR field.                                               */
  #define SAADC_RESULT_PTR_PTR_Msk (0xFFFFFFFFUL << SAADC_RESULT_PTR_PTR_Pos) /*!< Bit mask of PTR field.                      */


/* SAADC_RESULT_MAXCNT: Maximum number of buffer bytes to transfer */
  #define SAADC_RESULT_MAXCNT_ResetValue (0x00000000UL) /*!< Reset value of MAXCNT register.                                   */

/* MAXCNT @Bits 0..14 : Maximum number of buffer bytes to transfer */
  #define SAADC_RESULT_MAXCNT_MAXCNT_Pos (0UL)       /*!< Position of MAXCNT field.                                            */
  #define SAADC_RESULT_MAXCNT_MAXCNT_Msk (0x7FFFUL << SAADC_RESULT_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.           */


/* SAADC_RESULT_AMOUNT: Number of buffer bytes transferred since last START */
  #define SAADC_RESULT_AMOUNT_ResetValue (0x00000000UL) /*!< Reset value of AMOUNT register.                                   */

/* AMOUNT @Bits 0..14 : Number of buffer bytes transferred since last START. This register can be read after an END or STOPPED
                        event. */                                                                                                 
                                                                                                                                  
  #define SAADC_RESULT_AMOUNT_AMOUNT_Pos (0UL)       /*!< Position of AMOUNT field.                                            */
  #define SAADC_RESULT_AMOUNT_AMOUNT_Msk (0x7FFFUL << SAADC_RESULT_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.           */



/* ================================================== Struct SAADC_OVERRIDE ================================================== */
/**
  * @brief OVERRIDE [SAADC_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  CALCDAC;                           /*!< (@ 0x00000004) Override the CAL_CDAC signal to the analog module     */
} NRF_SAADC_OVERRIDE_Type;                           /*!< Size = 8 (0x008)                                                     */

/* SAADC_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define SAADC_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                   */

/* VAL @Bit 0 : Override value for the signal */
  #define SAADC_OVERRIDE_PWRUP_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define SAADC_OVERRIDE_PWRUP_VAL_Msk (0x1UL << SAADC_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define SAADC_OVERRIDE_PWRUP_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define SAADC_OVERRIDE_PWRUP_EN_Msk (0x1UL << SAADC_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                        */
  #define SAADC_OVERRIDE_PWRUP_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define SAADC_OVERRIDE_PWRUP_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define SAADC_OVERRIDE_PWRUP_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define SAADC_OVERRIDE_PWRUP_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */


/* SAADC_OVERRIDE_CALCDAC: Override the CAL_CDAC signal to the analog module */
  #define SAADC_OVERRIDE_CALCDAC_ResetValue (0x00000000UL) /*!< Reset value of CALCDAC register.                               */

/* VAL @Bits 0..6 : Override value for the signal */
  #define SAADC_OVERRIDE_CALCDAC_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define SAADC_OVERRIDE_CALCDAC_VAL_Msk (0x7FUL << SAADC_OVERRIDE_CALCDAC_VAL_Pos) /*!< Bit mask of VAL field.                */

/* EN @Bit 31 : Enable the override */
  #define SAADC_OVERRIDE_CALCDAC_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define SAADC_OVERRIDE_CALCDAC_EN_Msk (0x1UL << SAADC_OVERRIDE_CALCDAC_EN_Pos) /*!< Bit mask of EN field.                    */
  #define SAADC_OVERRIDE_CALCDAC_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define SAADC_OVERRIDE_CALCDAC_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define SAADC_OVERRIDE_CALCDAC_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define SAADC_OVERRIDE_CALCDAC_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */



/* ==================================================== Struct SAADC_DFT ===================================================== */
/**
  * @brief DFT [SAADC_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IOM uint32_t  ATB2CONFIG;                        /*!< (@ 0x00000008) Analog Test Bus 2 (ATB2) configuration                */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
} NRF_SAADC_DFT_Type;                                /*!< Size = 24 (0x018)                                                    */

/* SAADC_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define SAADC_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                              */

/* SELMUX @Bits 0..2 : Select multiplexer for ATB0 */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_Msk (0x7UL << SAADC_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_Max (0x7UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_INMUX (0x0UL)  /*!< ATB0 connected to PADC_INMUX, available on PADC_IN                   */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_VREF (0x1UL)   /*!< ATB0 connected to VREF                                               */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_VREFBUFF (0x2UL) /*!< ATB0 connected to VREF_BUFF                                        */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_VREFIBPSR10U (0x3UL) /*!< ATB0 connected to ATB_PADC_VREF_IBPSR_10U for current
                                                                measurement*/                                                     
  #define SAADC_DFT_ATB0CONFIG_SELMUX_VREFIBPS3U (0x4UL) /*!< ATB0 connected to ATB_PADC_VREF_IBPS_3U                          */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_Spare0 (0x5UL) /*!< Spare pin                                                            */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_Spare1 (0x6UL) /*!< Spare pin                                                            */
  #define SAADC_DFT_ATB0CONFIG_SELMUX_Spare2 (0x7UL) /*!< Spare pin                                                            */

