adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EN @Bit 31 : Enable the analog test bus */
  #define SAADC_DFT_ATB0CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define SAADC_DFT_ATB0CONFIG_EN_Msk (0x1UL << SAADC_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define SAADC_DFT_ATB0CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define SAADC_DFT_ATB0CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define SAADC_DFT_ATB0CONFIG_EN_Disabled (0x0UL)   /*!< Analog test bus is disabled                                          */
  #define SAADC_DFT_ATB0CONFIG_EN_Enabled (0x1UL)    /*!< Analog test bus is enabled                                           */


/* SAADC_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define SAADC_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                              */

/* SELMUX @Bits 0..3 : Select multiplexer for ATB1 */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_Msk (0xFUL << SAADC_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_Max (0x7UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_INMUX (0x0UL)  /*!< ATB1 connected to PADC_INMUX, available on both PADC_IP and PADC_IN  */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_VREFviaATBBUF (0x1UL) /*!< ATB1 connected to VREF via ATBBUF                             */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_VREFBUFFviaATBUF (0x2UL) /*!< ATB1 connected to VREF_BUFF via ATBUF                      */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_LDO (0x3UL)    /*!< ATB1 connected to PADC_LDO resistive divider to measure 1.5V/2 via
                                                          ATBUF*/                                                                 
  #define SAADC_DFT_ATB1CONFIG_SELMUX_VREFIBPS3U (0x4UL) /*!< SATB1 connected to ATB_PADC_VREF_IBPS_3U                         */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_Spare0 (0x5UL) /*!< Spare pin                                                            */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_Spare1 (0x6UL) /*!< Spare pin                                                            */
  #define SAADC_DFT_ATB1CONFIG_SELMUX_Spare2 (0x7UL) /*!< Spare pin                                                            */

/* EN @Bit 31 : Enable the analog test bus */
  #define SAADC_DFT_ATB1CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define SAADC_DFT_ATB1CONFIG_EN_Msk (0x1UL << SAADC_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define SAADC_DFT_ATB1CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define SAADC_DFT_ATB1CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define SAADC_DFT_ATB1CONFIG_EN_Disabled (0x0UL)   /*!< Analog test bus is disabled                                          */
  #define SAADC_DFT_ATB1CONFIG_EN_Enabled (0x1UL)    /*!< Analog test bus is enabled                                           */


/* SAADC_DFT_ATB2CONFIG: Analog Test Bus 2 (ATB2) configuration */
  #define SAADC_DFT_ATB2CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB2CONFIG register.                              */

/* EN @Bit 31 : Enable the analog test bus */
  #define SAADC_DFT_ATB2CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define SAADC_DFT_ATB2CONFIG_EN_Msk (0x1UL << SAADC_DFT_ATB2CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define SAADC_DFT_ATB2CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define SAADC_DFT_ATB2CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define SAADC_DFT_ATB2CONFIG_EN_Disabled (0x0UL)   /*!< Analog test bus is disabled                                          */
  #define SAADC_DFT_ATB2CONFIG_EN_Enabled (0x1UL)    /*!< Analog test bus is enabled and connected to PADC_INMUX available on
                                                          PADC_IP*/                                                               


/* SAADC_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define SAADC_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                              */

/* SELMUX @Bits 0..2 : Select multiplexer for DTB0 */
  #define SAADC_DFT_DTB0CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define SAADC_DFT_DTB0CONFIG_SELMUX_Msk (0x7UL << SAADC_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define SAADC_DFT_DTB0CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define SAADC_DFT_DTB0CONFIG_SELMUX_Max (0x7UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define SAADC_DFT_DTB0CONFIG_SELMUX_READY (0x0UL)  /*!< READY_PADC_AO_0V8                                                    */
  #define SAADC_DFT_DTB0CONFIG_SELMUX_READYVREF (0x1UL) /*!< READY_PADC_VREF_AO_0V8                                            */
  #define SAADC_DFT_DTB0CONFIG_SELMUX_SETTLED (0x2UL) /*!< SETTLED_VDD_INT_AO_0V8                                              */
  #define SAADC_DFT_DTB0CONFIG_SELMUX_INTCONVERT (0x3UL) /*!< INT_CONVERT_0V8                                                  */
  #define SAADC_DFT_DTB0CONFIG_SELMUX_INTDONE (0x4UL) /*!< INT_DONE_0V8                                                        */
  #define SAADC_DFT_DTB0CONFIG_SELMUX_INTAMPLFIY (0x5UL) /*!< INT_AMPLFIY_0V8                                                  */
  #define SAADC_DFT_DTB0CONFIG_SELMUX_Spare0 (0x6UL) /*!< Spare pin                                                            */
  #define SAADC_DFT_DTB0CONFIG_SELMUX_Spare1 (0x7UL) /*!< Spare pin                                                            */

