adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EN @Bit 31 : Enable the digital test bus */
  #define SAADC_DFT_DTB0CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define SAADC_DFT_DTB0CONFIG_EN_Msk (0x1UL << SAADC_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define SAADC_DFT_DTB0CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define SAADC_DFT_DTB0CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define SAADC_DFT_DTB0CONFIG_EN_Disabled (0x0UL)   /*!< Digital test bus is disabled                                         */
  #define SAADC_DFT_DTB0CONFIG_EN_Enabled (0x1UL)    /*!< Digital test bus is enabled                                          */


/* SAADC_DFT_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define SAADC_DFT_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                              */

/* SELMUX @Bits 0..2 : Select multiplexer for DTB1 */
  #define SAADC_DFT_DTB1CONFIG_SELMUX_Pos (0UL)      /*!< Position of SELMUX field.                                            */
  #define SAADC_DFT_DTB1CONFIG_SELMUX_Msk (0x7UL << SAADC_DFT_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.            */
  #define SAADC_DFT_DTB1CONFIG_SELMUX_Min (0x0UL)    /*!< Min enumerator value of SELMUX field.                                */
  #define SAADC_DFT_DTB1CONFIG_SELMUX_Max (0x7UL)    /*!< Max enumerator value of SELMUX field.                                */
  #define SAADC_DFT_DTB1CONFIG_SELMUX_INTIDLE (0x0UL) /*!< INT_IDLE_0V8                                                        */
  #define SAADC_DFT_DTB1CONFIG_SELMUX_INTSAMPLE (0x1UL) /*!< INT_SAMPLE_0V8                                                    */
  #define SAADC_DFT_DTB1CONFIG_SELMUX_INTAMPLFIY (0x2UL) /*!< INT_AMPLFIY_0V8                                                  */
  #define SAADC_DFT_DTB1CONFIG_SELMUX_INTCONVERT (0x3UL) /*!< INT_CONVERT_0V8                                                  */
  #define SAADC_DFT_DTB1CONFIG_SELMUX_INTDONE (0x4UL) /*!< INT_DONE_0V8                                                        */
  #define SAADC_DFT_DTB1CONFIG_SELMUX_ENNSERRFEEDBACK (0x5UL) /*!< EN_NS_ERR_FEEDBACK_0V8                                      */
  #define SAADC_DFT_DTB1CONFIG_SELMUX_Spare0 (0x6UL) /*!< Spare pin                                                            */
  #define SAADC_DFT_DTB1CONFIG_SELMUX_Spare1 (0x7UL) /*!< Spare pin                                                            */

/* EN @Bit 31 : Enable the digital test bus */
  #define SAADC_DFT_DTB1CONFIG_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define SAADC_DFT_DTB1CONFIG_EN_Msk (0x1UL << SAADC_DFT_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                        */
  #define SAADC_DFT_DTB1CONFIG_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define SAADC_DFT_DTB1CONFIG_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define SAADC_DFT_DTB1CONFIG_EN_Disabled (0x0UL)   /*!< Digital test bus is disabled                                         */
  #define SAADC_DFT_DTB1CONFIG_EN_Enabled (0x1UL)    /*!< Digital test bus is enabled                                          */


/* ====================================================== Struct SAADC ======================================================= */
/**
  * @brief Analog to Digital Converter
  */
  typedef struct {                                   /*!< SAADC Structure                                                      */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start the ADC and prepare the result buffer in RAM    */
    __OM uint32_t TASKS_SAMPLE;                      /*!< (@ 0x00000004) Take one ADC sample, if scan is enabled all channels
                                                                         are sampled*/                                            
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000008) Stop the ADC and terminate any on-going conversion    */
    __OM uint32_t TASKS_CALIBRATEOFFSET;             /*!< (@ 0x0000000C) Starts offset auto-calibration                        */
    __OM uint32_t TASKS_CALIBRATEGAIN;               /*!< (@ 0x00000010) Starts gain auto-calibration                          */
    __IM uint32_t RESERVED[27];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_SAMPLE;                 /*!< (@ 0x00000084) Subscribe configuration for task SAMPLE               */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000088) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_CALIBRATEOFFSET;        /*!< (@ 0x0000008C) Subscribe configuration for task CALIBRATEOFFSET      */
    __IOM uint32_t SUBSCRIBE_CALIBRATEGAIN;          /*!< (@ 0x00000090) Subscribe configuration for task CALIBRATEGAIN        */
    __IM uint32_t RESERVED1[27];
    __IOM uint32_t EVENTS_STARTED;                   /*!< (@ 0x00000100) The ADC has started                                   */
    __IOM uint32_t EVENTS_END;                       /*!< (@ 0x00000104) The ADC has filled up the Result buffer               */
    __IOM uint32_t EVENTS_DONE;                      /*!< (@ 0x00000108) A conversion task has been completed. Depending on the
                                                                         mode, multiple conversions might be needed for a result
                                                                         to be transferred to RAM.*/                              
    __IOM uint32_t EVENTS_RESULTDONE;                /*!< (@ 0x0000010C) A result is ready to get transferred to RAM. Result is
                                                                         available in REGRESULT register*/                        
    __IOM uint32_t EVENTS_CALIBRATEDONE;             /*!< (@ 0x00000110) Calibration is complete                               */
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000114) The ADC has stopped                                   */
    __IOM NRF_SAADC_EVENTS_CH_Type EVENTS_CH[8];     /*!< (@ 0x00000118) Peripheral events.                                    */
    __IOM uint32_t EVENTS_AHBERROR;                  /*!< (@ 0x00000158) EasyDMA encountered AHB error.                        */
    __IM uint32_t RESERVED2[9];
    __IOM uint32_t PUBLISH_STARTED;                  /*!< (@ 0x00000180) Publish configuration for event STARTED               */
    __IOM uint32_t PUBLISH_END;                      /*!< (@ 0x00000184) Publish configuration for event END                   */
    __IOM uint32_t PUBLISH_DONE;                     /*!< (@ 0x00000188) Publish configuration for event DONE                  */
    __IOM uint32_t PUBLISH_RESULTDONE;               /*!< (@ 0x0000018C) Publish configuration for event RESULTDONE            */
    __IOM uint32_t PUBLISH_CALIBRATEDONE;            /*!< (@ 0x00000190) Publish configuration for event CALIBRATEDONE         */
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000194) Publish configuration for event STOPPED               */
    __IOM NRF_SAADC_PUBLISH_CH_Type PUBLISH_CH[8];   /*!< (@ 0x00000198) Publish configuration for events                      */
    __IOM uint32_t PUBLISH_AHBERROR;                 /*!< (@ 0x000001D8) Publish configuration for event AHBERROR              */
    __IM uint32_t RESERVED3[9];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED4[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED5[61];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) Status                                                */
    __IM uint32_t PCRMSTATUS;                        /*!< (@ 0x00000404) PCRM Status                                           */
    __IM uint32_t RESERVED6[14];
    __IOM NRF_SAADC_TRIM_Type TRIM;                  /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED7[42];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable or disable ADC                                 */
    __IM uint32_t RESERVED8[3];
    __IOM NRF_SAADC_CH_Type CH[8];                   /*!< (@ 0x00000510) (unspecified)                                         */
    __IM uint32_t RESERVED9[23];
    __IM uint32_t REGRESULT;                         /*!< (@ 0x000005EC) Last conversion result                                */
    __IOM uint32_t RESOLUTION;                       /*!< (@ 0x000005F0) Resolution configuration                              */
    __IOM uint32_t OVERSAMPLE;                       /*!< (@ 0x000005F4) Oversampling configuration. OVERSAMPLE should not be
                                                                         combined with SCAN. The RESOLUTION is applied before
                                                                         averaging, thus for high OVERSAMPLE a higher RESOLUTION
                                                                         should be used.*/                                        
    __IOM uint32_t SAMPLERATE;                       /*!< (@ 0x000005F8) Controls normal or continuous sample rate             */
    __IOM uint32_t PCRMREQ;                          /*!< (@ 0x000005FC) PCRM request for clean power                          */
    __IM uint32_t RESERVED10[11];
    __IOM NRF_SAADC_RESULT_Type RESULT;              /*!< (@ 0x0000062C) RESULT EasyDMA channel                                */
    __IOM uint32_t TESTCTRL;                         /*!< (@ 0x0000063C) Control signals used during test of ADC               */
    __IOM uint32_t CALOFFSET;                        /*!< (@ 0x00000640) Calibration control for offset error                  */
    __IOM uint32_t CALGAIN;                          /*!< (@ 0x00000644) Calibration control for gain error                    */
    __IOM uint32_t CALVREF;                          /*!< (@ 0x00000648) Calibration control for reference voltage             */
    __IOM uint32_t CALIREF;                          /*!< (@ 0x0000064C) Calibration control for reference current             */
    __IOM uint32_t CALVREFTC;                        /*!< (@ 0x00000650) Calibration code for reference temperature coefficient*/
    __IOM uint32_t NOISESHAPE;                       /*!< (@ 0x00000654) Enable noise shaping                                  */
    __IOM uint32_t EASYDMAMODE;                      /*!< (@ 0x00000658) Configure EasyDMA mode.                               */
    __IM uint32_t RESERVED11;
    __IOM uint32_t TERMINATEONAHBERROR;              /*!< (@ 0x00000660) Enable EasyDMA termination on AHB error               */
    __IOM uint32_t AHBERRORADDRESS;                  /*!< (@ 0x00000664) Address of the last AHB error transaction             */
    __IM uint32_t RESERVED12[6];
    __IOM NRF_SAADC_OVERRIDE_Type OVERRIDE;          /*!< (@ 0x00000680) (unspecified)                                         */
    __IM uint32_t RESERVED13[94];
    __IOM NRF_SAADC_DFT_Type DFT;                    /*!< (@ 0x00000800) (unspecified)                                         */
  } NRF_SAADC_Type;                                  /*!< Size = 2072 (0x818)                                                  */

/* SAADC_TASKS_START: Start the ADC and prepare the result buffer in RAM */
  #define SAADC_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                */

/* TASKS_START @Bit 0 : Start the ADC and prepare the result buffer in RAM */
  #define SAADC_TASKS_START_TASKS_START_Pos (0UL)    /*!< Position of TASKS_START field.                                       */
  #define SAADC_TASKS_START_TASKS_START_Msk (0x1UL << SAADC_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.   */
  #define SAADC_TASKS_START_TASKS_START_Min (0x1UL)  /*!< Min enumerator value of TASKS_START field.                           */
  #define SAADC_TASKS_START_TASKS_START_Max (0x1UL)  /*!< Max enumerator value of TASKS_START field.                           */
  #define SAADC_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* SAADC_TASKS_SAMPLE: Take one ADC sample, if scan is enabled all channels are sampled */
  #define SAADC_TASKS_SAMPLE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SAMPLE register.                              */

/* TASKS_SAMPLE @Bit 0 : Take one ADC sample, if scan is enabled all channels are sampled */
  #define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Pos (0UL)  /*!< Position of TASKS_SAMPLE field.                                      */
  #define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Msk (0x1UL << SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Pos) /*!< Bit mask of TASKS_SAMPLE
                                                                            field.*/                                              
  #define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Min (0x1UL) /*!< Min enumerator value of TASKS_SAMPLE field.                         */
  #define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Max (0x1UL) /*!< Max enumerator value of TASKS_SAMPLE field.                         */
  #define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Trigger (0x1UL) /*!< Trigger task                                                    */


/* SAADC_TASKS_STOP: Stop the ADC and terminate any on-going conversion */
  #define SAADC_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop the ADC and terminate any on-going conversion */
  #define SAADC_TASKS_STOP_TASKS_STOP_Pos (0UL)      /*!< Position of TASKS_STOP field.                                        */
  #define SAADC_TASKS_STOP_TASKS_STOP_Msk (0x1UL << SAADC_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.        */
  #define SAADC_TASKS_STOP_TASKS_STOP_Min (0x1UL)    /*!< Min enumerator value of TASKS_STOP field.                            */
  #define SAADC_TASKS_STOP_TASKS_STOP_Max (0x1UL)    /*!< Max enumerator value of TASKS_STOP field.                            */
  #define SAADC_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* SAADC_TASKS_CALIBRATEOFFSET: Starts offset auto-calibration */
  #define SAADC_TASKS_CALIBRATEOFFSET_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CALIBRATEOFFSET register.            */

