adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EVENTS_RESULTDONE @Bit 0 : A result is ready to get transferred to RAM. Result is available in REGRESULT register */
  #define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_Pos (0UL) /*!< Position of EVENTS_RESULTDONE field.                        */
  #define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_Msk (0x1UL << SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_Pos) /*!< Bit mask
                                                                            of EVENTS_RESULTDONE field.*/                         
  #define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_Min (0x0UL) /*!< Min enumerator value of EVENTS_RESULTDONE field.          */
  #define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_Max (0x1UL) /*!< Max enumerator value of EVENTS_RESULTDONE field.          */
  #define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_Generated (0x1UL) /*!< Event generated                                     */


/* SAADC_EVENTS_CALIBRATEDONE: Calibration is complete */
  #define SAADC_EVENTS_CALIBRATEDONE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CALIBRATEDONE register.              */

/* EVENTS_CALIBRATEDONE @Bit 0 : Calibration is complete */
  #define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_Pos (0UL) /*!< Position of EVENTS_CALIBRATEDONE field.               */
  #define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_Msk (0x1UL << SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_Pos)
                                                                            /*!< Bit mask of EVENTS_CALIBRATEDONE field.*/        
  #define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_Min (0x0UL) /*!< Min enumerator value of EVENTS_CALIBRATEDONE field. */
  #define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_Max (0x1UL) /*!< Max enumerator value of EVENTS_CALIBRATEDONE field. */
  #define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_NotGenerated (0x0UL) /*!< Event not generated                        */
  #define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_Generated (0x1UL) /*!< Event generated                               */


/* SAADC_EVENTS_STOPPED: The ADC has stopped */
  #define SAADC_EVENTS_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STOPPED register.                          */

/* EVENTS_STOPPED @Bit 0 : The ADC has stopped */
  #define SAADC_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL) /*!< Position of EVENTS_STOPPED field.                                 */
  #define SAADC_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << SAADC_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_STOPPED field.*/                               
  #define SAADC_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STOPPED field.                   */
  #define SAADC_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STOPPED field.                   */
  #define SAADC_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define SAADC_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL) /*!< Event generated                                           */


/* SAADC_EVENTS_AHBERROR: EasyDMA encountered AHB error. */
  #define SAADC_EVENTS_AHBERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_AHBERROR register.                        */

/* EVENTS_AHBERROR @Bit 0 : EasyDMA encountered AHB error. */
  #define SAADC_EVENTS_AHBERROR_EVENTS_AHBERROR_Pos (0UL) /*!< Position of EVENTS_AHBERROR field.                              */
  #define SAADC_EVENTS_AHBERROR_EVENTS_AHBERROR_Msk (0x1UL << SAADC_EVENTS_AHBERROR_EVENTS_AHBERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_AHBERROR field.*/                              
  #define SAADC_EVENTS_AHBERROR_EVENTS_AHBERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_AHBERROR field.                */
  #define SAADC_EVENTS_AHBERROR_EVENTS_AHBERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_AHBERROR field.                */
  #define SAADC_EVENTS_AHBERROR_EVENTS_AHBERROR_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define SAADC_EVENTS_AHBERROR_EVENTS_AHBERROR_Generated (0x1UL) /*!< Event generated                                         */


/* SAADC_PUBLISH_STARTED: Publish configuration for event STARTED */
  #define SAADC_PUBLISH_STARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STARTED register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event STARTED will publish to */
  #define SAADC_PUBLISH_STARTED_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define SAADC_PUBLISH_STARTED_CHIDX_Msk (0xFFUL << SAADC_PUBLISH_STARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define SAADC_PUBLISH_STARTED_CHIDX_Min (0x0UL)    /*!< Min value of CHIDX field.                                            */
  #define SAADC_PUBLISH_STARTED_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SAADC_PUBLISH_STARTED_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define SAADC_PUBLISH_STARTED_EN_Msk (0x1UL << SAADC_PUBLISH_STARTED_EN_Pos) /*!< Bit mask of EN field.                      */
  #define SAADC_PUBLISH_STARTED_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define SAADC_PUBLISH_STARTED_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define SAADC_PUBLISH_STARTED_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define SAADC_PUBLISH_STARTED_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* SAADC_PUBLISH_END: Publish configuration for event END */
  #define SAADC_PUBLISH_END_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_END register.                                */

