adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DONE_SAMPLE @Bit 0 : Shortcut between event DONE and task SAMPLE */
  #define SAADC_SHORTS_DONE_SAMPLE_Pos (0UL)         /*!< Position of DONE_SAMPLE field.                                       */
  #define SAADC_SHORTS_DONE_SAMPLE_Msk (0x1UL << SAADC_SHORTS_DONE_SAMPLE_Pos) /*!< Bit mask of DONE_SAMPLE field.             */
  #define SAADC_SHORTS_DONE_SAMPLE_Min (0x0UL)       /*!< Min enumerator value of DONE_SAMPLE field.                           */
  #define SAADC_SHORTS_DONE_SAMPLE_Max (0x1UL)       /*!< Max enumerator value of DONE_SAMPLE field.                           */
  #define SAADC_SHORTS_DONE_SAMPLE_Disabled (0x0UL)  /*!< Disable shortcut                                                     */
  #define SAADC_SHORTS_DONE_SAMPLE_Enabled (0x1UL)   /*!< Enable shortcut                                                      */

/* END_START @Bit 1 : Shortcut between event END and task START */
  #define SAADC_SHORTS_END_START_Pos (1UL)           /*!< Position of END_START field.                                         */
  #define SAADC_SHORTS_END_START_Msk (0x1UL << SAADC_SHORTS_END_START_Pos) /*!< Bit mask of END_START field.                   */
  #define SAADC_SHORTS_END_START_Min (0x0UL)         /*!< Min enumerator value of END_START field.                             */
  #define SAADC_SHORTS_END_START_Max (0x1UL)         /*!< Max enumerator value of END_START field.                             */
  #define SAADC_SHORTS_END_START_Disabled (0x0UL)    /*!< Disable shortcut                                                     */
  #define SAADC_SHORTS_END_START_Enabled (0x1UL)     /*!< Enable shortcut                                                      */


/* SAADC_INTEN: Enable or disable interrupt */
  #define SAADC_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* STARTED @Bit 0 : Enable or disable interrupt for event STARTED */
  #define SAADC_INTEN_STARTED_Pos (0UL)              /*!< Position of STARTED field.                                           */
  #define SAADC_INTEN_STARTED_Msk (0x1UL << SAADC_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field.                           */
  #define SAADC_INTEN_STARTED_Min (0x0UL)            /*!< Min enumerator value of STARTED field.                               */
  #define SAADC_INTEN_STARTED_Max (0x1UL)            /*!< Max enumerator value of STARTED field.                               */
  #define SAADC_INTEN_STARTED_Disabled (0x0UL)       /*!< Disable                                                              */
  #define SAADC_INTEN_STARTED_Enabled (0x1UL)        /*!< Enable                                                               */

/* END @Bit 1 : Enable or disable interrupt for event END */
  #define SAADC_INTEN_END_Pos (1UL)                  /*!< Position of END field.                                               */
  #define SAADC_INTEN_END_Msk (0x1UL << SAADC_INTEN_END_Pos) /*!< Bit mask of END field.                                       */
  #define SAADC_INTEN_END_Min (0x0UL)                /*!< Min enumerator value of END field.                                   */
  #define SAADC_INTEN_END_Max (0x1UL)                /*!< Max enumerator value of END field.                                   */
  #define SAADC_INTEN_END_Disabled (0x0UL)           /*!< Disable                                                              */
  #define SAADC_INTEN_END_Enabled (0x1UL)            /*!< Enable                                                               */

/* DONE @Bit 2 : Enable or disable interrupt for event DONE */
  #define SAADC_INTEN_DONE_Pos (2UL)                 /*!< Position of DONE field.                                              */
  #define SAADC_INTEN_DONE_Msk (0x1UL << SAADC_INTEN_DONE_Pos) /*!< Bit mask of DONE field.                                    */
  #define SAADC_INTEN_DONE_Min (0x0UL)               /*!< Min enumerator value of DONE field.                                  */
  #define SAADC_INTEN_DONE_Max (0x1UL)               /*!< Max enumerator value of DONE field.                                  */
  #define SAADC_INTEN_DONE_Disabled (0x0UL)          /*!< Disable                                                              */
  #define SAADC_INTEN_DONE_Enabled (0x1UL)           /*!< Enable                                                               */

/* RESULTDONE @Bit 3 : Enable or disable interrupt for event RESULTDONE */
  #define SAADC_INTEN_RESULTDONE_Pos (3UL)           /*!< Position of RESULTDONE field.                                        */
  #define SAADC_INTEN_RESULTDONE_Msk (0x1UL << SAADC_INTEN_RESULTDONE_Pos) /*!< Bit mask of RESULTDONE field.                  */
  #define SAADC_INTEN_RESULTDONE_Min (0x0UL)         /*!< Min enumerator value of RESULTDONE field.                            */
  #define SAADC_INTEN_RESULTDONE_Max (0x1UL)         /*!< Max enumerator value of RESULTDONE field.                            */
  #define SAADC_INTEN_RESULTDONE_Disabled (0x0UL)    /*!< Disable                                                              */
  #define SAADC_INTEN_RESULTDONE_Enabled (0x1UL)     /*!< Enable                                                               */

/* CALIBRATEDONE @Bit 4 : Enable or disable interrupt for event CALIBRATEDONE */
  #define SAADC_INTEN_CALIBRATEDONE_Pos (4UL)        /*!< Position of CALIBRATEDONE field.                                     */
  #define SAADC_INTEN_CALIBRATEDONE_Msk (0x1UL << SAADC_INTEN_CALIBRATEDONE_Pos) /*!< Bit mask of CALIBRATEDONE field.         */
  #define SAADC_INTEN_CALIBRATEDONE_Min (0x0UL)      /*!< Min enumerator value of CALIBRATEDONE field.                         */
  #define SAADC_INTEN_CALIBRATEDONE_Max (0x1UL)      /*!< Max enumerator value of CALIBRATEDONE field.                         */
  #define SAADC_INTEN_CALIBRATEDONE_Disabled (0x0UL) /*!< Disable                                                              */
  #define SAADC_INTEN_CALIBRATEDONE_Enabled (0x1UL)  /*!< Enable                                                               */

/* STOPPED @Bit 5 : Enable or disable interrupt for event STOPPED */
  #define SAADC_INTEN_STOPPED_Pos (5UL)              /*!< Position of STOPPED field.                                           */
  #define SAADC_INTEN_STOPPED_Msk (0x1UL << SAADC_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                           */
  #define SAADC_INTEN_STOPPED_Min (0x0UL)            /*!< Min enumerator value of STOPPED field.                               */
  #define SAADC_INTEN_STOPPED_Max (0x1UL)            /*!< Max enumerator value of STOPPED field.                               */
  #define SAADC_INTEN_STOPPED_Disabled (0x0UL)       /*!< Disable                                                              */
  #define SAADC_INTEN_STOPPED_Enabled (0x1UL)        /*!< Enable                                                               */

/* CH0LIMITH @Bit 6 : Enable or disable interrupt for event CH0LIMITH */
  #define SAADC_INTEN_CH0LIMITH_Pos (6UL)            /*!< Position of CH0LIMITH field.                                         */
  #define SAADC_INTEN_CH0LIMITH_Msk (0x1UL << SAADC_INTEN_CH0LIMITH_Pos) /*!< Bit mask of CH0LIMITH field.                     */
  #define SAADC_INTEN_CH0LIMITH_Min (0x0UL)          /*!< Min enumerator value of CH0LIMITH field.                             */
  #define SAADC_INTEN_CH0LIMITH_Max (0x1UL)          /*!< Max enumerator value of CH0LIMITH field.                             */
  #define SAADC_INTEN_CH0LIMITH_Disabled (0x0UL)     /*!< Disable                                                              */
  #define SAADC_INTEN_CH0LIMITH_Enabled (0x1UL)      /*!< Enable                                                               */

/* CH0LIMITL @Bit 7 : Enable or disable interrupt for event CH0LIMITL */
  #define SAADC_INTEN_CH0LIMITL_Pos (7UL)            /*!< Position of CH0LIMITL field.                                         */
  #define SAADC_INTEN_CH0LIMITL_Msk (0x1UL << SAADC_INTEN_CH0LIMITL_Pos) /*!< Bit mask of CH0LIMITL field.                     */
  #define SAADC_INTEN_CH0LIMITL_Min (0x0UL)          /*!< Min enumerator value of CH0LIMITL field.                             */
  #define SAADC_INTEN_CH0LIMITL_Max (0x1UL)          /*!< Max enumerator value of CH0LIMITL field.                             */
  #define SAADC_INTEN_CH0LIMITL_Disabled (0x0UL)     /*!< Disable                                                              */
  #define SAADC_INTEN_CH0LIMITL_Enabled (0x1UL)      /*!< Enable                                                               */

