adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* REQ @Bit 0 : Request */
  #define SAADC_PCRMREQ_REQ_Pos (0UL)                /*!< Position of REQ field.                                               */
  #define SAADC_PCRMREQ_REQ_Msk (0x1UL << SAADC_PCRMREQ_REQ_Pos) /*!< Bit mask of REQ field.                                   */
  #define SAADC_PCRMREQ_REQ_Min (0x0UL)              /*!< Min enumerator value of REQ field.                                   */
  #define SAADC_PCRMREQ_REQ_Max (0x1UL)              /*!< Max enumerator value of REQ field.                                   */
  #define SAADC_PCRMREQ_REQ_Disabled (0x0UL)         /*!< Request disabled.                                                    */
  #define SAADC_PCRMREQ_REQ_Enabled (0x1UL)          /*!< Request enabled.                                                     */


/* SAADC_TESTCTRL: Control signals used during test of ADC */
  #define SAADC_TESTCTRL_ResetValue (0x10000000UL)   /*!< Reset value of TESTCTRL register.                                    */

/* ICTRL @Bits 0..3 : Current control. See design description for coding */
  #define SAADC_TESTCTRL_ICTRL_Pos (0UL)             /*!< Position of ICTRL field.                                             */
  #define SAADC_TESTCTRL_ICTRL_Msk (0xFUL << SAADC_TESTCTRL_ICTRL_Pos) /*!< Bit mask of ICTRL field.                           */

/* SWITCH @Bit 4 : Swap positive and negative input. See design description for coding */
  #define SAADC_TESTCTRL_SWITCH_Pos (4UL)            /*!< Position of SWITCH field.                                            */
  #define SAADC_TESTCTRL_SWITCH_Msk (0x1UL << SAADC_TESTCTRL_SWITCH_Pos) /*!< Bit mask of SWITCH field.                        */

/* SHORT @Bit 8 : Short input. Used to measure offset of ADC. See design description for coding */
  #define SAADC_TESTCTRL_SHORT_Pos (8UL)             /*!< Position of SHORT field.                                             */
  #define SAADC_TESTCTRL_SHORT_Msk (0x1UL << SAADC_TESTCTRL_SHORT_Pos) /*!< Bit mask of SHORT field.                           */

/* TST @Bits 12..16 : Test bus for ADC core. See design description for coding */
  #define SAADC_TESTCTRL_TST_Pos (12UL)              /*!< Position of TST field.                                               */
  #define SAADC_TESTCTRL_TST_Msk (0x1FUL << SAADC_TESTCTRL_TST_Pos) /*!< Bit mask of TST field.                                */

/* ENINMUX @Bit 24 : Will enable the input mux in the ADC, so the resistor strings can be connected even when the analog core is
                     powered down. See design description for coding */                                                           
                                                                                                                                  
  #define SAADC_TESTCTRL_ENINMUX_Pos (24UL)          /*!< Position of ENINMUX field.                                           */
  #define SAADC_TESTCTRL_ENINMUX_Msk (0x1UL << SAADC_TESTCTRL_ENINMUX_Pos) /*!< Bit mask of ENINMUX field.                     */

/* PWRUP @Bits 28..29 : Power-up time */
  #define SAADC_TESTCTRL_PWRUP_Pos (28UL)            /*!< Position of PWRUP field.                                             */
  #define SAADC_TESTCTRL_PWRUP_Msk (0x3UL << SAADC_TESTCTRL_PWRUP_Pos) /*!< Bit mask of PWRUP field.                           */
  #define SAADC_TESTCTRL_PWRUP_Min (0x0UL)           /*!< Min enumerator value of PWRUP field.                                 */
  #define SAADC_TESTCTRL_PWRUP_Max (0x3UL)           /*!< Max enumerator value of PWRUP field.                                 */
  #define SAADC_TESTCTRL_PWRUP_6us (0x0UL)           /*!< 6 us                                                                 */
  #define SAADC_TESTCTRL_PWRUP_10us (0x1UL)          /*!< 10 us                                                                */
  #define SAADC_TESTCTRL_PWRUP_15us (0x2UL)          /*!< 15 us                                                                */
  #define SAADC_TESTCTRL_PWRUP_20us (0x3UL)          /*!< 20 us                                                                */


/* SAADC_CALOFFSET: Calibration control for offset error */
  #define SAADC_CALOFFSET_ResetValue (0x00000000UL)  /*!< Reset value of CALOFFSET register.                                   */

/* CALOFFSET @Bits 0..5 : Sign-magnitude coding */
  #define SAADC_CALOFFSET_CALOFFSET_Pos (0UL)        /*!< Position of CALOFFSET field.                                         */
  #define SAADC_CALOFFSET_CALOFFSET_Msk (0x3FUL << SAADC_CALOFFSET_CALOFFSET_Pos) /*!< Bit mask of CALOFFSET field.            */
  #define SAADC_CALOFFSET_CALOFFSET_Min (0x0UL)      /*!< Min enumerator value of CALOFFSET field.                             */
  #define SAADC_CALOFFSET_CALOFFSET_Max (0x20UL)     /*!< Max enumerator value of CALOFFSET field.                             */
  #define SAADC_CALOFFSET_CALOFFSET_Default (0x00UL) /*!< Default setting                                                      */
  #define SAADC_CALOFFSET_CALOFFSET_MaxPos (0x1FUL)  /*!< Maximum positive offset                                              */
  #define SAADC_CALOFFSET_CALOFFSET_MaxNeg (0x20UL)  /*!< maximum negative offset                                              */


/* SAADC_CALGAIN: Calibration control for gain error */
  #define SAADC_CALGAIN_ResetValue (0x00000000UL)    /*!< Reset value of CALGAIN register.                                     */

/* CALGAIN @Bits 0..6 : Offset binary coding */
  #define SAADC_CALGAIN_CALGAIN_Pos (0UL)            /*!< Position of CALGAIN field.                                           */
  #define SAADC_CALGAIN_CALGAIN_Msk (0x7FUL << SAADC_CALGAIN_CALGAIN_Pos) /*!< Bit mask of CALGAIN field.                      */
  #define SAADC_CALGAIN_CALGAIN_Min (0x0UL)          /*!< Min enumerator value of CALGAIN field.                               */
  #define SAADC_CALGAIN_CALGAIN_Max (0x40UL)         /*!< Max enumerator value of CALGAIN field.                               */
  #define SAADC_CALGAIN_CALGAIN_Default (0x00UL)     /*!< Default gain, for +1/2 input (assume full-scale = +-1) the output will
                                                          be 1024*/                                                               
  #define SAADC_CALGAIN_CALGAIN_High (0x3FUL)        /*!< High gain setting                                                    */
  #define SAADC_CALGAIN_CALGAIN_Low (0x40UL)         /*!< Low gain setting                                                     */


/* SAADC_CALVREF: Calibration control for reference voltage */
  #define SAADC_CALVREF_ResetValue (0x00000000UL)    /*!< Reset value of CALVREF register.                                     */

/* CALVREF @Bits 0..6 : Offset binary coding */
  #define SAADC_CALVREF_CALVREF_Pos (0UL)            /*!< Position of CALVREF field.                                           */
  #define SAADC_CALVREF_CALVREF_Msk (0x7FUL << SAADC_CALVREF_CALVREF_Pos) /*!< Bit mask of CALVREF field.                      */
  #define SAADC_CALVREF_CALVREF_Min (0x0UL)          /*!< Min enumerator value of CALVREF field.                               */
  #define SAADC_CALVREF_CALVREF_Max (0x40UL)         /*!< Max enumerator value of CALVREF field.                               */
  #define SAADC_CALVREF_CALVREF_Default (0x00UL)     /*!< Default vref, in typical corner VREF=1.2V                            */
  #define SAADC_CALVREF_CALVREF_High (0x3FUL)        /*!< Low output code (high reference voltage)                             */
  #define SAADC_CALVREF_CALVREF_Low (0x40UL)         /*!< High output code (low reference voltage)                             */


/* SAADC_CALIREF: Calibration control for reference current */
  #define SAADC_CALIREF_ResetValue (0x00000000UL)    /*!< Reset value of CALIREF register.                                     */

