adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CALIREF @Bits 0..3 : Calibration control for reference current. See design description for coding */
  #define SAADC_CALIREF_CALIREF_Pos (0UL)            /*!< Position of CALIREF field.                                           */
  #define SAADC_CALIREF_CALIREF_Msk (0xFUL << SAADC_CALIREF_CALIREF_Pos) /*!< Bit mask of CALIREF field.                       */


/* SAADC_CALVREFTC: Calibration code for reference temperature coefficient */
  #define SAADC_CALVREFTC_ResetValue (0x00000000UL)  /*!< Reset value of CALVREFTC register.                                   */

/* CALVREFTC @Bits 0..2 : Calibration code for reference temperature coefficient. See design description for coding */
  #define SAADC_CALVREFTC_CALVREFTC_Pos (0UL)        /*!< Position of CALVREFTC field.                                         */
  #define SAADC_CALVREFTC_CALVREFTC_Msk (0x7UL << SAADC_CALVREFTC_CALVREFTC_Pos) /*!< Bit mask of CALVREFTC field.             */


/* SAADC_NOISESHAPE: Enable noise shaping */
  #define SAADC_NOISESHAPE_ResetValue (0x00000000UL) /*!< Reset value of NOISESHAPE register.                                  */

/* NOISESHAPE @Bits 0..1 : Enable noise shaping */
  #define SAADC_NOISESHAPE_NOISESHAPE_Pos (0UL)      /*!< Position of NOISESHAPE field.                                        */
  #define SAADC_NOISESHAPE_NOISESHAPE_Msk (0x3UL << SAADC_NOISESHAPE_NOISESHAPE_Pos) /*!< Bit mask of NOISESHAPE field.        */
  #define SAADC_NOISESHAPE_NOISESHAPE_Min (0x0UL)    /*!< Min enumerator value of NOISESHAPE field.                            */
  #define SAADC_NOISESHAPE_NOISESHAPE_Max (0x1UL)    /*!< Max enumerator value of NOISESHAPE field.                            */
  #define SAADC_NOISESHAPE_NOISESHAPE_Disable (0x0UL) /*!< Oversampling based on accumulate and average. Used in high-speed mode
                                                           (10-bit)*/                                                             
  #define SAADC_NOISESHAPE_NOISESHAPE_Enable (0x1UL) /*!< Oversampling based on noise shaping. Used in high-accuracy modes
                                                          (12-bit and 14-bit)*/                                                   


/* SAADC_EASYDMAMODE: Configure EasyDMA mode. */
  #define SAADC_EASYDMAMODE_ResetValue (0x00000001UL) /*!< Reset value of EASYDMAMODE register.                                */

/* LPOP @Bit 0 : Enable low-power operation, or use low-latency */
  #define SAADC_EASYDMAMODE_LPOP_Pos (0UL)           /*!< Position of LPOP field.                                              */
  #define SAADC_EASYDMAMODE_LPOP_Msk (0x1UL << SAADC_EASYDMAMODE_LPOP_Pos) /*!< Bit mask of LPOP field.                        */
  #define SAADC_EASYDMAMODE_LPOP_Min (0x0UL)         /*!< Min enumerator value of LPOP field.                                  */
  #define SAADC_EASYDMAMODE_LPOP_Max (0x1UL)         /*!< Max enumerator value of LPOP field.                                  */
  #define SAADC_EASYDMAMODE_LPOP_LowLat (0x0UL)      /*!< Low-latency operation                                                */
  #define SAADC_EASYDMAMODE_LPOP_LowPower (0x1UL)    /*!< Low-power operation                                                  */


/* SAADC_TERMINATEONAHBERROR: Enable EasyDMA termination on AHB error */
  #define SAADC_TERMINATEONAHBERROR_ResetValue (0x00000000UL) /*!< Reset value of TERMINATEONAHBERROR register.                */

/* ENABLE @Bit 0 : Enable termination on AHB error */
  #define SAADC_TERMINATEONAHBERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                            */
  #define SAADC_TERMINATEONAHBERROR_ENABLE_Msk (0x1UL << SAADC_TERMINATEONAHBERROR_ENABLE_Pos) /*!< Bit mask of ENABLE field.  */
  #define SAADC_TERMINATEONAHBERROR_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                              */
  #define SAADC_TERMINATEONAHBERROR_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                              */
  #define SAADC_TERMINATEONAHBERROR_ENABLE_Disabled (0x0UL) /*!< Termination on AHB error disabled                             */
  #define SAADC_TERMINATEONAHBERROR_ENABLE_Enabled (0x1UL) /*!< Termination on AHB error enabled                               */


/* SAADC_AHBERRORADDRESS: Address of the last AHB error transaction */
  #define SAADC_AHBERRORADDRESS_ResetValue (0x00000000UL) /*!< Reset value of AHBERRORADDRESS register.                        */

/* ADDRESS @Bits 0..31 : Address */
  #define SAADC_AHBERRORADDRESS_ADDRESS_Pos (0UL)    /*!< Position of ADDRESS field.                                           */
  #define SAADC_AHBERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << SAADC_AHBERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           SICR                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct SICR_IROT_SYSROM ================================================= */
/**
  * @brief SYSROM [SICR_IROT_SYSROM] 32-bit base revision of SysCtrl ROM and upto eight patch revisions.
  */
typedef struct {
  __IOM uint32_t  BASE;                              /*!< (@ 0x00000000) 32-bit revision of base revision of SysCtrl ROM.      */
  __IOM uint32_t  PATCH[8];                          /*!< (@ 0x00000004) 32-bit revision of utpo n patches.                    */
} NRF_SICR_IROT_SYSROM_Type;                         /*!< Size = 36 (0x024)                                                    */

/* SICR_IROT_SYSROM_BASE: 32-bit revision of base revision of SysCtrl ROM. */

/* VERSION @Bits 0..31 : Base revision. */
  #define SICR_IROT_SYSROM_BASE_VERSION_Pos (0UL)    /*!< Position of VERSION field.                                           */
  #define SICR_IROT_SYSROM_BASE_VERSION_Msk (0xFFFFFFFFUL << SICR_IROT_SYSROM_BASE_VERSION_Pos) /*!< Bit mask of VERSION field.*/


/* SICR_IROT_SYSROM_PATCH: 32-bit revision of utpo n patches. */
  #define SICR_IROT_SYSROM_PATCH_MaxCount (8UL)      /*!< Max size of PATCH[8] array.                                          */

/* VERSION @Bits 0..31 : nth patch revision. */
  #define SICR_IROT_SYSROM_PATCH_VERSION_Pos (0UL)   /*!< Position of VERSION field.                                           */
  #define SICR_IROT_SYSROM_PATCH_VERSION_Msk (0xFFFFFFFFUL << SICR_IROT_SYSROM_PATCH_VERSION_Pos) /*!< Bit mask of VERSION
                                                                            field.*/                                              
  #define SICR_IROT_SYSROM_PATCH_VERSION_Min (0xFFFFFFFFUL) /*!< Min enumerator value of VERSION field.                        */
  #define SICR_IROT_SYSROM_PATCH_VERSION_Max (0xFFFFFFFFUL) /*!< Max enumerator value of VERSION field.                        */
  #define SICR_IROT_SYSROM_PATCH_VERSION_UnPatched (0xFFFFFFFFUL) /*!< No patch applied.                                       */



/* ================================================= Struct SICR_IROT_SECROM ================================================= */
/**
  * @brief SECROM [SICR_IROT_SECROM] 32-bit revision of Secure Domain ROM base version and utpo sixteen patch versions.
  */
typedef struct {
  __IOM uint32_t  BASE;                              /*!< (@ 0x00000000) 32-bit revision of base revision of Secure domain ROM.*/
  __IOM uint32_t  PATCH[16];                         /*!< (@ 0x00000004) 32-bit revision of utpo n patches.                    */
} NRF_SICR_IROT_SECROM_Type;                         /*!< Size = 68 (0x044)                                                    */

/* SICR_IROT_SECROM_BASE: 32-bit revision of base revision of Secure domain ROM. */

/* VERSION @Bits 0..31 : Base revision. */
  #define SICR_IROT_SECROM_BASE_VERSION_Pos (0UL)    /*!< Position of VERSION field.                                           */
  #define SICR_IROT_SECROM_BASE_VERSION_Msk (0xFFFFFFFFUL << SICR_IROT_SECROM_BASE_VERSION_Pos) /*!< Bit mask of VERSION field.*/


