adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SICR_IROT_SECROM_PATCH: 32-bit revision of utpo n patches. */
  #define SICR_IROT_SECROM_PATCH_MaxCount (16UL)     /*!< Max size of PATCH[16] array.                                         */

/* VERSION @Bits 0..31 : nth patch revision. */
  #define SICR_IROT_SECROM_PATCH_VERSION_Pos (0UL)   /*!< Position of VERSION field.                                           */
  #define SICR_IROT_SECROM_PATCH_VERSION_Msk (0xFFFFFFFFUL << SICR_IROT_SECROM_PATCH_VERSION_Pos) /*!< Bit mask of VERSION
                                                                            field.*/                                              
  #define SICR_IROT_SECROM_PATCH_VERSION_Min (0xFFFFFFFFUL) /*!< Min enumerator value of VERSION field.                        */
  #define SICR_IROT_SECROM_PATCH_VERSION_Max (0xFFFFFFFFUL) /*!< Max enumerator value of VERSION field.                        */
  #define SICR_IROT_SECROM_PATCH_VERSION_UnPatched (0xFFFFFFFFUL) /*!< No patch applied.                                       */



/* ================================================== Struct SICR_IROT_LCS1 ================================================== */
/**
  * @brief LCS1 [SICR_IROT_LCS1] LCS reported here shall be indentical to the oe in LCS2.
  */
typedef struct {
  __IOM uint32_t  LCS;                               /*!< (@ 0x00000000) The device lifecycle state as determined by the secure
                                                                         domain ROM code.*/                                       
} NRF_SICR_IROT_LCS1_Type;                           /*!< Size = 4 (0x004)                                                     */

/* SICR_IROT_LCS1_LCS: The device lifecycle state as determined by the secure domain ROM code. */

/* STATE @Bits 0..31 : The device lifecycle state. */
  #define SICR_IROT_LCS1_LCS_STATE_Pos (0UL)         /*!< Position of STATE field.                                             */
  #define SICR_IROT_LCS1_LCS_STATE_Msk (0xFFFFFFFFUL << SICR_IROT_LCS1_LCS_STATE_Pos) /*!< Bit mask of STATE field.            */
  #define SICR_IROT_LCS1_LCS_STATE_Min (0x1000UL)    /*!< Min enumerator value of STATE field.                                 */
  #define SICR_IROT_LCS1_LCS_STATE_Max (0x3000UL)    /*!< Max enumerator value of STATE field.                                 */
  #define SICR_IROT_LCS1_LCS_STATE_Empty (0x00001000UL) /*!< LCS is EMPTY, device assets are installed in this state.          */
  #define SICR_IROT_LCS1_LCS_STATE_RoT (0x00002000UL) /*!< Updatable RoT is installed and is verified by the immutable RoT.    */
  #define SICR_IROT_LCS1_LCS_STATE_Deployed (0x00003000UL) /*!< Similar to LCS RoT, with device certificate installed.         */



/* ================================================== Struct SICR_IROT_LCS2 ================================================== */
/**
  * @brief LCS2 [SICR_IROT_LCS2] LCS reported here shall be indentical to the oe in LCS1.
  */
typedef struct {
  __IOM uint32_t  LCS;                               /*!< (@ 0x00000000) The device lifecycle state as determined by the secure
                                                                         domain ROM code.*/                                       
} NRF_SICR_IROT_LCS2_Type;                           /*!< Size = 4 (0x004)                                                     */

/* SICR_IROT_LCS2_LCS: The device lifecycle state as determined by the secure domain ROM code. */

/* STATE @Bits 0..31 : The device lifecycle state. */
  #define SICR_IROT_LCS2_LCS_STATE_Pos (0UL)         /*!< Position of STATE field.                                             */
  #define SICR_IROT_LCS2_LCS_STATE_Msk (0xFFFFFFFFUL << SICR_IROT_LCS2_LCS_STATE_Pos) /*!< Bit mask of STATE field.            */
  #define SICR_IROT_LCS2_LCS_STATE_Min (0x1000UL)    /*!< Min enumerator value of STATE field.                                 */
  #define SICR_IROT_LCS2_LCS_STATE_Max (0x3000UL)    /*!< Max enumerator value of STATE field.                                 */
  #define SICR_IROT_LCS2_LCS_STATE_Empty (0x00001000UL) /*!< LCS is EMPTY, device assets are installed in this state.          */
  #define SICR_IROT_LCS2_LCS_STATE_RoT (0x00002000UL) /*!< Updatable RoT is installed and is verified by the immutable RoT.    */
  #define SICR_IROT_LCS2_LCS_STATE_Deployed (0x00003000UL) /*!< Similar to LCS RoT, with device certificate installed.         */



/* ==================================================== Struct SICR_IROT ===================================================== */
/**
  * @brief IROT [SICR_IROT] Information on immutable Root of Trust. Secure domain ROM writes these registers only in LCS Empty,
            RoT and DEPLOYED.                                                                                                     
                                                                                                                                  
  */
typedef struct {
  __IOM NRF_SICR_IROT_SYSROM_Type SYSROM;            /*!< (@ 0x00000000) 32-bit base revision of SysCtrl ROM and upto eight
                                                                         patch revisions.*/                                       
  __IOM NRF_SICR_IROT_SECROM_Type SECROM;            /*!< (@ 0x00000024) 32-bit revision of Secure Domain ROM base version and
                                                                         utpo sixteen patch versions.*/                           
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DEVICEID[4];                       /*!< (@ 0x00000070) 128-bit UUID as Device Id.                            */
  __IOM uint32_t  UCODE;                             /*!< (@ 0x00000080) 32-bit revision of the CRACEN uCode.                  */
  __IOM NRF_SICR_IROT_LCS1_Type LCS1;                /*!< (@ 0x00000084) LCS reported here shall be indentical to the oe in
                                                                         LCS2.*/                                                  
  __IOM NRF_SICR_IROT_LCS2_Type LCS2;                /*!< (@ 0x00000088) LCS reported here shall be indentical to the oe in
                                                                         LCS1.*/                                                  
  __IOM uint32_t  BOOTSTATUS;                        /*!< (@ 0x0000008C) Status of boot when the secure domain firmware starts
                                                                         execution, or the secure domain firmware is not started
                                                                         in LCS RoT and DEPLOYED by secure domain ROM code.*/     
} NRF_SICR_IROT_Type;                                /*!< Size = 144 (0x090)                                                   */

/* SICR_IROT_DEVICEID: 128-bit UUID as Device Id. */
  #define SICR_IROT_DEVICEID_MaxCount (4UL)          /*!< Max size of DEVICEID[4] array.                                       */

/* UUID @Bit 0 : Device UUID [n]. The DEVICE.UUID[0] contains the least significant bits of the device identifier. */
  #define SICR_IROT_DEVICEID_UUID_Pos (0UL)          /*!< Position of UUID field.                                              */
  #define SICR_IROT_DEVICEID_UUID_Msk (0x1UL << SICR_IROT_DEVICEID_UUID_Pos) /*!< Bit mask of UUID field.                      */


/* SICR_IROT_UCODE: 32-bit revision of the CRACEN uCode. */

/* VALUE @Bit 0 : 32-bit revision of CRACEN uCode. */
  #define SICR_IROT_UCODE_VALUE_Pos (0UL)            /*!< Position of VALUE field.                                             */
  #define SICR_IROT_UCODE_VALUE_Msk (0x1UL << SICR_IROT_UCODE_VALUE_Pos) /*!< Bit mask of VALUE field.                         */


