adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SICR_UROT_RECOVERY_SM_TBS_PUBKEY_ADDR: Address of the raw public key. */

/* ADDR @Bits 0..31 : Public key address. */
  #define SICR_UROT_RECOVERY_SM_TBS_PUBKEY_ADDR_ADDR_Pos (0UL) /*!< Position of ADDR field.                                    */
  #define SICR_UROT_RECOVERY_SM_TBS_PUBKEY_ADDR_ADDR_Msk (0xFFFFFFFFUL << SICR_UROT_RECOVERY_SM_TBS_PUBKEY_ADDR_ADDR_Pos) /*!<
                                                                            Bit mask of ADDR field.*/                             
  #define SICR_UROT_RECOVERY_SM_TBS_PUBKEY_ADDR_ADDR_Min (0xE003000UL) /*!< Min value of ADDR field.                           */
  #define SICR_UROT_RECOVERY_SM_TBS_PUBKEY_ADDR_ADDR_Max (0xE100000UL) /*!< Max size of ADDR field.                            */
  #define SICR_UROT_RECOVERY_SM_TBS_PUBKEY_ADDR_ADDR_Unprogrammed (0xFFFFFFFFUL) /*!< The key is not programmed.               */



/* ====================================== Struct SICR_UROT_RECOVERY_SM_TBS_LAYOUT_USLOT ====================================== */
/**
  * @brief USLOT [SICR_UROT_RECOVERY_SM_TBS_LAYOUT_USLOT] Start adddress and max size of UROT slot (USLOT), Shall remain the
            same for firmware updates once programmed or unless transitioned back to LCS Empty.                                   
                                                                                                                                  
  */
typedef struct {
  __IOM uint32_t  START;                             /*!< (@ 0x00000000) Start address of the UROT firmware. Shall not overlap
                                                                         with the recovery slot (RSLOT).*/                        
  __IOM uint32_t  MAX;                               /*!< (@ 0x00000004) Maximum size of the UROT firmware in bytes.           */
} NRF_SICR_UROT_RECOVERY_SM_TBS_LAYOUT_USLOT_Type;   /*!< Size = 8 (0x008)                                                     */

/* SICR_UROT_RECOVERY_SM_TBS_LAYOUT_USLOT_START: Start address of the UROT firmware. Shall not overlap with the recovery slot
                                                  (RSLOT). */                                                                     
                                                                                                                                  

/* ADDR @Bits 0..31 : (unspecified) */
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_USLOT_START_ADDR_Pos (0UL) /*!< Position of ADDR field.                             */
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_USLOT_START_ADDR_Msk (0xFFFFFFFFUL << SICR_UROT_RECOVERY_SM_TBS_LAYOUT_USLOT_START_ADDR_Pos)
                                                                            /*!< Bit mask of ADDR field.*/                        
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_USLOT_START_ADDR_Min (0xE003000UL) /*!< Min value of ADDR field.                    */
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_USLOT_START_ADDR_Max (0xE100000UL) /*!< Max size of ADDR field.                     */
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_USLOT_START_ADDR_Undefined (0xFFFFFFFFUL) /*!< The slot is not defined.             */


/* SICR_UROT_RECOVERY_SM_TBS_LAYOUT_USLOT_MAX: Maximum size of the UROT firmware in bytes. */

/* SIZE @Bits 0..31 : (unspecified) */
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_USLOT_MAX_SIZE_Pos (0UL) /*!< Position of SIZE field.                               */
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_USLOT_MAX_SIZE_Msk (0xFFFFFFFFUL << SICR_UROT_RECOVERY_SM_TBS_LAYOUT_USLOT_MAX_SIZE_Pos)
                                                                            /*!< Bit mask of SIZE field.*/                        
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_USLOT_MAX_SIZE_Min (0x80UL) /*!< Min value of SIZE field.                           */
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_USLOT_MAX_SIZE_Max (0xFD000UL) /*!< Max size of SIZE field.                         */
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_USLOT_MAX_SIZE_Undefined (0xFFFFFFFFUL) /*!< The slot is not defined.               */



/* ====================================== Struct SICR_UROT_RECOVERY_SM_TBS_LAYOUT_RSLOT ====================================== */
/**
  * @brief RSLOT [SICR_UROT_RECOVERY_SM_TBS_LAYOUT_RSLOT] Start adddress and max size of recovery slot (RSLOT), Shall remain the
            same for firmware updates once programmed or unless transitioned back to LCS Empty.                                   
                                                                                                                                  
  */
typedef struct {
  __IOM uint32_t  START;                             /*!< (@ 0x00000000) Start address of the recovery firmware. Shall not
                                                                         overlap with the UROT slot(USLOT).*/                     
  __IOM uint32_t  MAX;                               /*!< (@ 0x00000004) Maximum size of the recovery image in bytes.          */
} NRF_SICR_UROT_RECOVERY_SM_TBS_LAYOUT_RSLOT_Type;   /*!< Size = 8 (0x008)                                                     */

/* SICR_UROT_RECOVERY_SM_TBS_LAYOUT_RSLOT_START: Start address of the recovery firmware. Shall not overlap with the UROT
                                                  slot(USLOT). */                                                                 
                                                                                                                                  

/* ADDR @Bits 0..31 : (unspecified) */
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_RSLOT_START_ADDR_Pos (0UL) /*!< Position of ADDR field.                             */
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_RSLOT_START_ADDR_Msk (0xFFFFFFFFUL << SICR_UROT_RECOVERY_SM_TBS_LAYOUT_RSLOT_START_ADDR_Pos)
                                                                            /*!< Bit mask of ADDR field.*/                        
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_RSLOT_START_ADDR_Min (0xE003000UL) /*!< Min value of ADDR field.                    */
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_RSLOT_START_ADDR_Max (0xE100000UL) /*!< Max size of ADDR field.                     */
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_RSLOT_START_ADDR_Undefined (0xFFFFFFFFUL) /*!< The slot is not defined.             */


/* SICR_UROT_RECOVERY_SM_TBS_LAYOUT_RSLOT_MAX: Maximum size of the recovery image in bytes. */

/* SIZE @Bits 0..31 : (unspecified) */
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_RSLOT_MAX_SIZE_Pos (0UL) /*!< Position of SIZE field.                               */
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_RSLOT_MAX_SIZE_Msk (0xFFFFFFFFUL << SICR_UROT_RECOVERY_SM_TBS_LAYOUT_RSLOT_MAX_SIZE_Pos)
                                                                            /*!< Bit mask of SIZE field.*/                        
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_RSLOT_MAX_SIZE_Min (0x80UL) /*!< Min value of SIZE field.                           */
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_RSLOT_MAX_SIZE_Max (0xFD000UL) /*!< Max size of SIZE field.                         */
  #define SICR_UROT_RECOVERY_SM_TBS_LAYOUT_RSLOT_MAX_SIZE_Undefined (0xFFFFFFFFUL) /*!< The slot is not defined.               */



/* ========================================= Struct SICR_UROT_RECOVERY_SM_TBS_LAYOUT ========================================= */
/**
  * @brief LAYOUT [SICR_UROT_RECOVERY_SM_TBS_LAYOUT] The MRAM layout of UROT firmware and the recovery image.
  */
typedef struct {
  __IOM NRF_SICR_UROT_RECOVERY_SM_TBS_LAYOUT_USLOT_Type USLOT; /*!< (@ 0x00000000) Start adddress and max size of UROT slot
                                                                            (USLOT), Shall remain the same for firmware updates
                                                                            once programmed or unless transitioned back to LCS
                                                                            Empty.*/                                              
  __IOM NRF_SICR_UROT_RECOVERY_SM_TBS_LAYOUT_RSLOT_Type RSLOT; /*!< (@ 0x00000008) Start adddress and max size of recovery slot
                                                                            (RSLOT), Shall remain the same for firmware updates
                                                                            once programmed or unless transitioned back to LCS
                                                                            Empty.*/                                              
} NRF_SICR_UROT_RECOVERY_SM_TBS_LAYOUT_Type;         /*!< Size = 16 (0x010)                                                    */


/* =========================================== Struct SICR_UROT_RECOVERY_SM_TBS_FW =========================================== */
/**
  * @brief FW [SICR_UROT_RECOVERY_SM_TBS_FW] FW verified by the secure domain ROM code.
  */
typedef struct {
  __IOM uint32_t  SIZE;                              /*!< (@ 0x00000000) The firmware size (in bytes). Shall not exceed the max
                                                                         defined limits for USLOT in case of UROT firmware.Shall
                                                                         not exceed the max defined limits for USLOT in case of
                                                                         UROT firmware.*/                                         
  __IOM uint32_t  ADDR;                              /*!< (@ 0x00000004) Address of the firmware verified by the secure domain
                                                                         ROM code.*/                                              
  __IOM uint32_t  DIGEST[16];                        /*!< (@ 0x00000008) SHA2-512 digest of the firmware.                      */
  __IOM uint32_t  VERSION[4];                        /*!< (@ 0x00000048) 128-bit revision of the firmware; can be left
                                                                         Unprogrammed.*/                                          
  __IOM uint32_t  TIMESTAMP;                         /*!< (@ 0x00000058) Timestamp of the firmware in Unix time used to prevent
                                                                         downgrade of firmware on firmware update.*/              
} NRF_SICR_UROT_RECOVERY_SM_TBS_FW_Type;             /*!< Size = 92 (0x05C)                                                    */

