adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SICR_UROT_RECOVERY_SM_TBS_POLICY_REVOKE: Configure key revocation policy. */

/* ENABLE @Bits 0..31 : Possible values for this register */
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_REVOKE_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                              */
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_REVOKE_ENABLE_Msk (0xFFFFFFFFUL << SICR_UROT_RECOVERY_SM_TBS_POLICY_REVOKE_ENABLE_Pos)
                                                                            /*!< Bit mask of ENABLE field.*/                      
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_REVOKE_ENABLE_Min (0x47D13CA5UL) /*!< Min enumerator value of ENABLE field.         */
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_REVOKE_ENABLE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ENABLE field.         */
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_REVOKE_ENABLE_Unprogrammed (0xFFFFFFFFUL) /*!< The policy is not programmed, hence
                                                                            any existing policy on auto-revocation is left
                                                                            unchanged.*/                                          
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_REVOKE_ENABLE_Enabled (0xC3965A5AUL) /*!< Enable auto-revocation of keys.           */
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_REVOKE_ENABLE_Disabled (0x47D13CA5UL) /*!< Disable auto-revocation of keys used to
                                                                            verify firmware.*/                                    


/* SICR_UROT_RECOVERY_SM_TBS_POLICY_DGPREV: Configure the downgrade prevention policy. */

/* ENABLE @Bits 0..31 : Possible values for this register */
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_DGPREV_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                              */
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_DGPREV_ENABLE_Msk (0xFFFFFFFFUL << SICR_UROT_RECOVERY_SM_TBS_POLICY_DGPREV_ENABLE_Pos)
                                                                            /*!< Bit mask of ENABLE field.*/                      
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_DGPREV_ENABLE_Min (0x47D13CA5UL) /*!< Min enumerator value of ENABLE field.         */
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_DGPREV_ENABLE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ENABLE field.         */
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_DGPREV_ENABLE_Unprogrammed (0xFFFFFFFFUL) /*!< The policy is not programmed, hence
                                                                            any existing policy on downgrade prevention is
                                                                            unaltered.*/                                          
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_DGPREV_ENABLE_Enabled (0xC3965A5AUL) /*!< Enable downgrade protection on firmware
                                                                            update. If Enabled, the SICR.UROT.SM.TIMESTAMP
                                                                            register cannot be left Unprogrammed.*/               
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_DGPREV_ENABLE_Disabled (0x47D13CA5UL) /*!< Disable downgrade protection on firmware
                                                                            updates. If Disabled, the SICR.UROT.SM.TIMESTAMP
                                                                            register shall be left Unprogrammed.*/                


/* SICR_UROT_RECOVERY_SM_TBS_POLICY_RFU: These registers are included when generating signature of the TBS content of SICR. */
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_RFU_MaxCount (29UL) /*!< Max size of RFU[29] array.                                 */

/* RFU @Bits 0..31 : (unspecified) */
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_RFU_RFU_Pos (0UL) /*!< Position of RFU field.                                       */
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_RFU_RFU_Msk (0xFFFFFFFFUL << SICR_UROT_RECOVERY_SM_TBS_POLICY_RFU_RFU_Pos) /*!< Bit
                                                                            mask of RFU field.*/                                  
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_RFU_RFU_Min (0xFFFFFFFFUL) /*!< Min enumerator value of RFU field.                  */
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_RFU_RFU_Max (0xFFFFFFFFUL) /*!< Max enumerator value of RFU field.                  */
  #define SICR_UROT_RECOVERY_SM_TBS_POLICY_RFU_RFU_Unprogrammed (0xFFFFFFFFUL) /*!< The register is not programmed.            */



/* ============================================ Struct SICR_UROT_RECOVERY_SM_TBS ============================================= */
/**
  * @brief TBS [SICR_UROT_RECOVERY_SM_TBS] Manifest describing the secure domain firmware. The secure domain ROM code verifies
            the signature on the digest of this register.                                                                         
                                                                                                                                  
  */
typedef struct {
  __IOM NRF_SICR_UROT_RECOVERY_SM_TBS_PUBKEY_Type PUBKEY; /*!< (@ 0x00000000) Raw public key used to verify the signed
                                                                            manifest.*/                                           
  __IOM NRF_SICR_UROT_RECOVERY_SM_TBS_LAYOUT_Type LAYOUT; /*!< (@ 0x00000008) The MRAM layout of UROT firmware and the recovery
                                                                            image.*/                                              
  __IOM NRF_SICR_UROT_RECOVERY_SM_TBS_FW_Type FW;    /*!< (@ 0x00000018) FW verified by the secure domain ROM code.            */
  __IOM NRF_SICR_UROT_RECOVERY_SM_TBS_POLICY_Type POLICY; /*!< (@ 0x00000074) Set various policies on related to the firmware
                                                                            verification and update.*/                            
} NRF_SICR_UROT_RECOVERY_SM_TBS_Type;                /*!< Size = 244 (0x0F4)                                                   */


