adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ========================================= Struct SICR_UROT_RECOVERY_SM_SIGNATURE ========================================== */
/**
  * @brief SIGNATURE [SICR_UROT_RECOVERY_SM_SIGNATURE] Signature on the manifest defined in SICR.UROT.SM.TBS
  */
typedef struct {
  __IOM uint32_t  ALG;                               /*!< (@ 0x00000000) The signature algorithm identifier as defined in
                                                                         RFC8152.*/                                               
  __IOM uint32_t  SIZE;                              /*!< (@ 0x00000004) Size of the raw signature in bytes.                   */
  __IOM uint32_t  ADDR;                              /*!< (@ 0x00000008) Address of the signature on the firmware manifest.    */
} NRF_SICR_UROT_RECOVERY_SM_SIGNATURE_Type;          /*!< Size = 12 (0x00C)                                                    */

/* SICR_UROT_RECOVERY_SM_SIGNATURE_ALG: The signature algorithm identifier as defined in RFC8152. */

/* ID @Bits 0..31 : Algorithm identifier */
  #define SICR_UROT_RECOVERY_SM_SIGNATURE_ALG_ID_Pos (0UL) /*!< Position of ID field.                                          */
  #define SICR_UROT_RECOVERY_SM_SIGNATURE_ALG_ID_Msk (0xFFFFFFFFUL << SICR_UROT_RECOVERY_SM_SIGNATURE_ALG_ID_Pos) /*!< Bit mask
                                                                            of ID field.*/                                        
  #define SICR_UROT_RECOVERY_SM_SIGNATURE_ALG_ID_Min (0x5UL) /*!< Min enumerator value of ID field.                            */
  #define SICR_UROT_RECOVERY_SM_SIGNATURE_ALG_ID_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ID field.                     */
  #define SICR_UROT_RECOVERY_SM_SIGNATURE_ALG_ID_Unprogrammed (0xFFFFFFFFUL) /*!< The signature algorithm identifier is not
                                                                            programmed.*/                                         
  #define SICR_UROT_RECOVERY_SM_SIGNATURE_ALG_ID_AlgIdEd25519 (0x00000005UL) /*!< ARM ADAC-defined identifier for Ed25519. The
                                                                            use of ARM ADAC-defined identifier ensures
                                                                            consistent user interface on CTRL-AP and SICR. Only
                                                                            Ed25519 curve is supported.*/                         


/* SICR_UROT_RECOVERY_SM_SIGNATURE_SIZE: Size of the raw signature in bytes. */

/* SIZE @Bits 0..31 : Signature size */
  #define SICR_UROT_RECOVERY_SM_SIGNATURE_SIZE_SIZE_Pos (0UL) /*!< Position of SIZE field.                                     */
  #define SICR_UROT_RECOVERY_SM_SIGNATURE_SIZE_SIZE_Msk (0xFFFFFFFFUL << SICR_UROT_RECOVERY_SM_SIGNATURE_SIZE_SIZE_Pos) /*!< Bit
                                                                            mask of SIZE field.*/                                 
  #define SICR_UROT_RECOVERY_SM_SIGNATURE_SIZE_SIZE_Min (0x40UL) /*!< Min enumerator value of SIZE field.                      */
  #define SICR_UROT_RECOVERY_SM_SIGNATURE_SIZE_SIZE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of SIZE field.                */
  #define SICR_UROT_RECOVERY_SM_SIGNATURE_SIZE_SIZE_Unprogrammed (0xFFFFFFFFUL) /*!< The signature is not programmed.          */
  #define SICR_UROT_RECOVERY_SM_SIGNATURE_SIZE_SIZE_SizeEd25519 (0x00000040UL) /*!< Size of Ed25519 signature bytestring.      */
  #define SICR_UROT_RECOVERY_SM_SIGNATURE_SIZE_SIZE_MaxSize (0x00000040UL) /*!< Currently, the secure domain ROM code supports
                                                                            only Ed25519 (and only Ed25519 curve) signature
                                                                            scheme, and hence the MaxSize is the same as the
                                                                            Ed25519 signature size.*/                             


/* SICR_UROT_RECOVERY_SM_SIGNATURE_ADDR: Address of the signature on the firmware manifest. */

/* ADDR @Bits 0..31 : Signature address. */
  #define SICR_UROT_RECOVERY_SM_SIGNATURE_ADDR_ADDR_Pos (0UL) /*!< Position of ADDR field.                                     */
  #define SICR_UROT_RECOVERY_SM_SIGNATURE_ADDR_ADDR_Msk (0xFFFFFFFFUL << SICR_UROT_RECOVERY_SM_SIGNATURE_ADDR_ADDR_Pos) /*!< Bit
                                                                            mask of ADDR field.*/                                 
  #define SICR_UROT_RECOVERY_SM_SIGNATURE_ADDR_ADDR_Min (0xE003000UL) /*!< Min value of ADDR field.                            */
  #define SICR_UROT_RECOVERY_SM_SIGNATURE_ADDR_ADDR_Max (0xE100000UL) /*!< Max size of ADDR field.                             */
  #define SICR_UROT_RECOVERY_SM_SIGNATURE_ADDR_ADDR_Unprogrammed (0xFFFFFFFFUL) /*!< The signature is not programmed.          */



/* ============================================== Struct SICR_UROT_RECOVERY_SM =============================================== */
/**
  * @brief SM [SICR_UROT_RECOVERY_SM] Signed Manifest verified by the Secure Domain ROM Code to establish the primary RoT.
  */
typedef struct {
  __IOM NRF_SICR_UROT_RECOVERY_SM_TBS_Type TBS;      /*!< (@ 0x00000000) Manifest describing the secure domain firmware. The
                                                                         secure domain ROM code verifies the signature on the
                                                                         digest of this register.*/                               
  __IOM NRF_SICR_UROT_RECOVERY_SM_SIGNATURE_Type SIGNATURE; /*!< (@ 0x000000F4) Signature on the manifest defined in
                                                                            SICR.UROT.SM.TBS*/                                    
} NRF_SICR_UROT_RECOVERY_SM_Type;                    /*!< Size = 256 (0x100)                                                   */


/* ================================================ Struct SICR_UROT_RECOVERY ================================================ */
/**
  * @brief RECOVERY [SICR_UROT_RECOVERY] Signed manifest of the recovery firmware.
  */
typedef struct {
  __IOM NRF_SICR_UROT_RECOVERY_SM_Type SM;           /*!< (@ 0x00000000) Signed Manifest verified by the Secure Domain ROM Code
                                                                         to establish the primary RoT.*/                          
} NRF_SICR_UROT_RECOVERY_Type;                       /*!< Size = 256 (0x100)                                                   */


/* ============================================ Struct SICR_UROT_UPDATE_DOWNLOAD ============================================= */
/**
  * @brief DOWNLOAD [SICR_UROT_UPDATE_DOWNLOAD] Information about downloaded firmware update. The addresses described here are
            the location of the update and not the location they must be installed. The installation information is described in
            the signed manifest.                                                                                                  
                                                                                                                                  
  */
typedef struct {
  __IOM uint32_t  FW;                                /*!< (@ 0x00000000) Location for the firmware update to be installed.     */
  __IOM uint32_t  PUBKEY;                            /*!< (@ 0x00000004) Location of the public key to verify the signature on
                                                                         the firmware update.*/                                   
  __IOM uint32_t  SIGNATURE;                         /*!< (@ 0x00000008) Location for the signature on the firmware update to be
                                                                         verified before the update is installed.*/               
  __IOM uint32_t  MAX;                               /*!< (@ 0x0000000C) Max Size of the download.                             */
} NRF_SICR_UROT_UPDATE_DOWNLOAD_Type;                /*!< Size = 16 (0x010)                                                    */

/* SICR_UROT_UPDATE_DOWNLOAD_FW: Location for the firmware update to be installed. */

/* ADDR @Bits 0..31 : The MRAM Location of the firmware to be installed. This is not the same as the address in the signed
                      manifest. The signed manifest contains the target location where the firmware must be installed, not the
                      current location where it is downloaded. */                                                                 
                                                                                                                                  
  #define SICR_UROT_UPDATE_DOWNLOAD_FW_ADDR_Pos (0UL) /*!< Position of ADDR field.                                             */
  #define SICR_UROT_UPDATE_DOWNLOAD_FW_ADDR_Msk (0xFFFFFFFFUL << SICR_UROT_UPDATE_DOWNLOAD_FW_ADDR_Pos) /*!< Bit mask of ADDR
                                                                            field.*/                                              
  #define SICR_UROT_UPDATE_DOWNLOAD_FW_ADDR_Min (0xFFFFFFFFUL) /*!< Min enumerator value of ADDR field.                        */
  #define SICR_UROT_UPDATE_DOWNLOAD_FW_ADDR_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ADDR field.                        */
  #define SICR_UROT_UPDATE_DOWNLOAD_FW_ADDR_Unprogrammed (0xFFFFFFFFUL) /*!< The signature is not programmed.                  */


/* SICR_UROT_UPDATE_DOWNLOAD_PUBKEY: Location of the public key to verify the signature on the firmware update. */

/* ADDR @Bits 0..31 : MRAM Location for the signature on the firmware update. This is not the same as the address in the signed
                      manifest. The signed manifest contains the target location where the public key must be kept once the
                      update is installed, not the current location where it is downloaded. */                                    
                                                                                                                                  
  #define SICR_UROT_UPDATE_DOWNLOAD_PUBKEY_ADDR_Pos (0UL) /*!< Position of ADDR field.                                         */
  #define SICR_UROT_UPDATE_DOWNLOAD_PUBKEY_ADDR_Msk (0xFFFFFFFFUL << SICR_UROT_UPDATE_DOWNLOAD_PUBKEY_ADDR_Pos) /*!< Bit mask of
                                                                            ADDR field.*/                                         
  #define SICR_UROT_UPDATE_DOWNLOAD_PUBKEY_ADDR_Min (0xFFFFFFFFUL) /*!< Min enumerator value of ADDR field.                    */
  #define SICR_UROT_UPDATE_DOWNLOAD_PUBKEY_ADDR_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ADDR field.                    */
  #define SICR_UROT_UPDATE_DOWNLOAD_PUBKEY_ADDR_Unprogrammed (0xFFFFFFFFUL) /*!< The signature is not programmed.              */


/* SICR_UROT_UPDATE_DOWNLOAD_SIGNATURE: Location for the signature on the firmware update to be verified before the update is
                                         installed. */                                                                            
                                                                                                                                  

/* ADDR @Bits 0..31 : MRAM Location for the signature on the firmware update. This is not the same as the address in the signed
                      manifest. The signed manifest contains the target location where the signature must be kept once the
                      update is installed, not the current location where it is downloaded. */                                    
                                                                                                                                  
