adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VALUE @Bits 0..31 : SHA2-512 Digest value */
  #define SICR_UROT_UPDATE_SM_TBS_FW_DIGEST_VALUE_Pos (0UL) /*!< Position of VALUE field.                                      */
  #define SICR_UROT_UPDATE_SM_TBS_FW_DIGEST_VALUE_Msk (0xFFFFFFFFUL << SICR_UROT_UPDATE_SM_TBS_FW_DIGEST_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                
  #define SICR_UROT_UPDATE_SM_TBS_FW_DIGEST_VALUE_Min (0xFFFFFFFFUL) /*!< Min enumerator value of VALUE field.                 */
  #define SICR_UROT_UPDATE_SM_TBS_FW_DIGEST_VALUE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of VALUE field.                 */
  #define SICR_UROT_UPDATE_SM_TBS_FW_DIGEST_VALUE_Unprogrammed (0xFFFFFFFFUL) /*!< The FW digest, and hence the FW is not
                                                                            programmed.*/                                         


/* SICR_UROT_UPDATE_SM_TBS_FW_VERSION: 128-bit revision of the firmware; can be left Unprogrammed. */
  #define SICR_UROT_UPDATE_SM_TBS_FW_VERSION_MaxCount (4UL) /*!< Max size of VERSION[4] array.                                 */

/* VALUE @Bit 0 : nth word of the version. */
  #define SICR_UROT_UPDATE_SM_TBS_FW_VERSION_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define SICR_UROT_UPDATE_SM_TBS_FW_VERSION_VALUE_Msk (0x1UL << SICR_UROT_UPDATE_SM_TBS_FW_VERSION_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/                                        


/* SICR_UROT_UPDATE_SM_TBS_FW_TIMESTAMP: Timestamp of the firmware in Unix time used to prevent downgrade of firmware on
                                          firmware update. */                                                                     
                                                                                                                                  

/* VALUE @Bits 0..31 : Unix-time timestamp of the firmware */
  #define SICR_UROT_UPDATE_SM_TBS_FW_TIMESTAMP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
  #define SICR_UROT_UPDATE_SM_TBS_FW_TIMESTAMP_VALUE_Msk (0xFFFFFFFFUL << SICR_UROT_UPDATE_SM_TBS_FW_TIMESTAMP_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/                            
  #define SICR_UROT_UPDATE_SM_TBS_FW_TIMESTAMP_VALUE_Min (0xFFFFFFFFUL) /*!< Min enumerator value of VALUE field.              */
  #define SICR_UROT_UPDATE_SM_TBS_FW_TIMESTAMP_VALUE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of VALUE field.              */
  #define SICR_UROT_UPDATE_SM_TBS_FW_TIMESTAMP_VALUE_Unprogrammed (0xFFFFFFFFUL) /*!< The FW timestamp is not programmed.      */



/* ========================================== Struct SICR_UROT_UPDATE_SM_TBS_POLICY ========================================== */
/**
  * @brief POLICY [SICR_UROT_UPDATE_SM_TBS_POLICY] Set various policies on related to the firmware verification and update.
  */
typedef struct {
  __IOM uint32_t  UPDATE;                            /*!< (@ 0x00000000) Enable or Disable firmware update.                    */
  __IOM uint32_t  REVOKE;                            /*!< (@ 0x00000004) Configure key revocation policy.                      */
  __IOM uint32_t  DGPREV;                            /*!< (@ 0x00000008) Configure the downgrade prevention policy.            */
  __IOM uint32_t  RFU[29];                           /*!< (@ 0x0000000C) These registers are included when generating signature
                                                                         of the TBS content of SICR.*/                            
} NRF_SICR_UROT_UPDATE_SM_TBS_POLICY_Type;           /*!< Size = 128 (0x080)                                                   */

/* SICR_UROT_UPDATE_SM_TBS_POLICY_UPDATE: Enable or Disable firmware update. */

/* ENABLE @Bits 0..31 : Possible values for this register. */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_UPDATE_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_UPDATE_ENABLE_Msk (0xFFFFFFFFUL << SICR_UROT_UPDATE_SM_TBS_POLICY_UPDATE_ENABLE_Pos)
                                                                            /*!< Bit mask of ENABLE field.*/                      
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_UPDATE_ENABLE_Min (0x47D13CA5UL) /*!< Min enumerator value of ENABLE field.           */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_UPDATE_ENABLE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ENABLE field.           */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_UPDATE_ENABLE_Unprogrammed (0xFFFFFFFFUL) /*!< The policy is not programmed, hence any
                                                                            existing policy on update is left unchanged.*/        
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_UPDATE_ENABLE_Enabled (0xC3965A5AUL) /*!< Enable firmware update.                     */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_UPDATE_ENABLE_Disabled (0x47D13CA5UL) /*!< Disable firmware update.                   */


/* SICR_UROT_UPDATE_SM_TBS_POLICY_REVOKE: Configure key revocation policy. */

/* ENABLE @Bits 0..31 : Possible values for this register */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_REVOKE_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_REVOKE_ENABLE_Msk (0xFFFFFFFFUL << SICR_UROT_UPDATE_SM_TBS_POLICY_REVOKE_ENABLE_Pos)
                                                                            /*!< Bit mask of ENABLE field.*/                      
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_REVOKE_ENABLE_Min (0x47D13CA5UL) /*!< Min enumerator value of ENABLE field.           */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_REVOKE_ENABLE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ENABLE field.           */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_REVOKE_ENABLE_Unprogrammed (0xFFFFFFFFUL) /*!< The policy is not programmed, hence any
                                                                            existing policy on auto-revocation is left
                                                                            unchanged.*/                                          
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_REVOKE_ENABLE_Enabled (0xC3965A5AUL) /*!< Enable auto-revocation of keys.             */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_REVOKE_ENABLE_Disabled (0x47D13CA5UL) /*!< Disable auto-revocation of keys used to
                                                                            verify firmware.*/                                    


