adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SICR_UROT_UPDATE_SM_TBS_POLICY_DGPREV: Configure the downgrade prevention policy. */

/* ENABLE @Bits 0..31 : Possible values for this register */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_DGPREV_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_DGPREV_ENABLE_Msk (0xFFFFFFFFUL << SICR_UROT_UPDATE_SM_TBS_POLICY_DGPREV_ENABLE_Pos)
                                                                            /*!< Bit mask of ENABLE field.*/                      
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_DGPREV_ENABLE_Min (0x47D13CA5UL) /*!< Min enumerator value of ENABLE field.           */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_DGPREV_ENABLE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ENABLE field.           */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_DGPREV_ENABLE_Unprogrammed (0xFFFFFFFFUL) /*!< The policy is not programmed, hence any
                                                                            existing policy on downgrade prevention is
                                                                            unaltered.*/                                          
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_DGPREV_ENABLE_Enabled (0xC3965A5AUL) /*!< Enable downgrade protection on firmware
                                                                            update. If Enabled, the SICR.UROT.SM.TIMESTAMP
                                                                            register cannot be left Unprogrammed.*/               
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_DGPREV_ENABLE_Disabled (0x47D13CA5UL) /*!< Disable downgrade protection on firmware
                                                                            updates. If Disabled, the SICR.UROT.SM.TIMESTAMP
                                                                            register shall be left Unprogrammed.*/                


/* SICR_UROT_UPDATE_SM_TBS_POLICY_RFU: These registers are included when generating signature of the TBS content of SICR. */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_RFU_MaxCount (29UL) /*!< Max size of RFU[29] array.                                   */

/* RFU @Bits 0..31 : (unspecified) */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_RFU_RFU_Pos (0UL) /*!< Position of RFU field.                                         */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_RFU_RFU_Msk (0xFFFFFFFFUL << SICR_UROT_UPDATE_SM_TBS_POLICY_RFU_RFU_Pos) /*!< Bit mask
                                                                            of RFU field.*/                                       
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_RFU_RFU_Min (0xFFFFFFFFUL) /*!< Min enumerator value of RFU field.                    */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_RFU_RFU_Max (0xFFFFFFFFUL) /*!< Max enumerator value of RFU field.                    */
  #define SICR_UROT_UPDATE_SM_TBS_POLICY_RFU_RFU_Unprogrammed (0xFFFFFFFFUL) /*!< The register is not programmed.              */



/* ============================================= Struct SICR_UROT_UPDATE_SM_TBS ============================================== */
/**
  * @brief TBS [SICR_UROT_UPDATE_SM_TBS] Manifest describing the secure domain firmware. The secure domain ROM code verifies the
            signature on the digest of this register.                                                                             
                                                                                                                                  
  */
typedef struct {
  __IOM NRF_SICR_UROT_UPDATE_SM_TBS_PUBKEY_Type PUBKEY; /*!< (@ 0x00000000) Raw public key used to verify the signed manifest. */
  __IOM NRF_SICR_UROT_UPDATE_SM_TBS_LAYOUT_Type LAYOUT; /*!< (@ 0x00000008) The MRAM layout of UROT firmware and the recovery
                                                                            image.*/                                              
  __IOM NRF_SICR_UROT_UPDATE_SM_TBS_FW_Type FW;      /*!< (@ 0x00000018) FW verified by the secure domain ROM code.            */
  __IOM NRF_SICR_UROT_UPDATE_SM_TBS_POLICY_Type POLICY; /*!< (@ 0x00000074) Set various policies on related to the firmware
                                                                            verification and update.*/                            
} NRF_SICR_UROT_UPDATE_SM_TBS_Type;                  /*!< Size = 244 (0x0F4)                                                   */


/* ========================================== Struct SICR_UROT_UPDATE_SM_SIGNATURE =========================================== */
/**
  * @brief SIGNATURE [SICR_UROT_UPDATE_SM_SIGNATURE] Signature on the manifest defined in SICR.UROT.SM.TBS
  */
typedef struct {
  __IOM uint32_t  ALG;                               /*!< (@ 0x00000000) The signature algorithm identifier as defined in
                                                                         RFC8152.*/                                               
  __IOM uint32_t  SIZE;                              /*!< (@ 0x00000004) Size of the raw signature in bytes.                   */
  __IOM uint32_t  ADDR;                              /*!< (@ 0x00000008) Address of the signature on the firmware manifest.    */
} NRF_SICR_UROT_UPDATE_SM_SIGNATURE_Type;            /*!< Size = 12 (0x00C)                                                    */

/* SICR_UROT_UPDATE_SM_SIGNATURE_ALG: The signature algorithm identifier as defined in RFC8152. */

/* ID @Bits 0..31 : Algorithm identifier */
  #define SICR_UROT_UPDATE_SM_SIGNATURE_ALG_ID_Pos (0UL) /*!< Position of ID field.                                            */
  #define SICR_UROT_UPDATE_SM_SIGNATURE_ALG_ID_Msk (0xFFFFFFFFUL << SICR_UROT_UPDATE_SM_SIGNATURE_ALG_ID_Pos) /*!< Bit mask of
                                                                            ID field.*/                                           
  #define SICR_UROT_UPDATE_SM_SIGNATURE_ALG_ID_Min (0x5UL) /*!< Min enumerator value of ID field.                              */
  #define SICR_UROT_UPDATE_SM_SIGNATURE_ALG_ID_Max (0xFFFFFFFFUL) /*!< Max enumerator value of ID field.                       */
  #define SICR_UROT_UPDATE_SM_SIGNATURE_ALG_ID_Unprogrammed (0xFFFFFFFFUL) /*!< The signature algorithm identifier is not
                                                                            programmed.*/                                         
  #define SICR_UROT_UPDATE_SM_SIGNATURE_ALG_ID_AlgIdEd25519 (0x00000005UL) /*!< ARM ADAC-defined identifier for Ed25519. The use
                                                                            of ARM ADAC-defined identifier ensures consistent
                                                                            user interface on CTRL-AP and SICR. Only Ed25519
                                                                            curve is supported.*/                                 


/* SICR_UROT_UPDATE_SM_SIGNATURE_SIZE: Size of the raw signature in bytes. */

/* SIZE @Bits 0..31 : Signature size */
  #define SICR_UROT_UPDATE_SM_SIGNATURE_SIZE_SIZE_Pos (0UL) /*!< Position of SIZE field.                                       */
  #define SICR_UROT_UPDATE_SM_SIGNATURE_SIZE_SIZE_Msk (0xFFFFFFFFUL << SICR_UROT_UPDATE_SM_SIGNATURE_SIZE_SIZE_Pos) /*!< Bit
                                                                            mask of SIZE field.*/                                 
  #define SICR_UROT_UPDATE_SM_SIGNATURE_SIZE_SIZE_Min (0x40UL) /*!< Min enumerator value of SIZE field.                        */
  #define SICR_UROT_UPDATE_SM_SIGNATURE_SIZE_SIZE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of SIZE field.                  */
  #define SICR_UROT_UPDATE_SM_SIGNATURE_SIZE_SIZE_Unprogrammed (0xFFFFFFFFUL) /*!< The signature is not programmed.            */
  #define SICR_UROT_UPDATE_SM_SIGNATURE_SIZE_SIZE_SizeEd25519 (0x00000040UL) /*!< Size of Ed25519 signature bytestring.        */
  #define SICR_UROT_UPDATE_SM_SIGNATURE_SIZE_SIZE_MaxSize (0x00000040UL) /*!< Currently, the secure domain ROM code supports
                                                                            only Ed25519 (and only Ed25519 curve) signature
                                                                            scheme, and hence the MaxSize is the same as the
                                                                            Ed25519 signature size.*/                             


/* SICR_UROT_UPDATE_SM_SIGNATURE_ADDR: Address of the signature on the firmware manifest. */

/* ADDR @Bits 0..31 : Signature address. */
  #define SICR_UROT_UPDATE_SM_SIGNATURE_ADDR_ADDR_Pos (0UL) /*!< Position of ADDR field.                                       */
  #define SICR_UROT_UPDATE_SM_SIGNATURE_ADDR_ADDR_Msk (0xFFFFFFFFUL << SICR_UROT_UPDATE_SM_SIGNATURE_ADDR_ADDR_Pos) /*!< Bit
                                                                            mask of ADDR field.*/                                 
  #define SICR_UROT_UPDATE_SM_SIGNATURE_ADDR_ADDR_Min (0xE003000UL) /*!< Min value of ADDR field.                              */
  #define SICR_UROT_UPDATE_SM_SIGNATURE_ADDR_ADDR_Max (0xE100000UL) /*!< Max size of ADDR field.                               */
  #define SICR_UROT_UPDATE_SM_SIGNATURE_ADDR_ADDR_Unprogrammed (0xFFFFFFFFUL) /*!< The signature is not programmed.            */



