adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* =============================================== Struct SICR_UROT_UPDATE_SM ================================================ */
/**
  * @brief SM [SICR_UROT_UPDATE_SM] Signed Manifest verified by the Secure Domain ROM Code to establish the primary RoT.
  */
typedef struct {
  __IOM NRF_SICR_UROT_UPDATE_SM_TBS_Type TBS;        /*!< (@ 0x00000000) Manifest describing the secure domain firmware. The
                                                                         secure domain ROM code verifies the signature on the
                                                                         digest of this register.*/                               
  __IOM NRF_SICR_UROT_UPDATE_SM_SIGNATURE_Type SIGNATURE; /*!< (@ 0x000000F4) Signature on the manifest defined in
                                                                            SICR.UROT.SM.TBS*/                                    
} NRF_SICR_UROT_UPDATE_SM_Type;                      /*!< Size = 256 (0x100)                                                   */


/* ================================================= Struct SICR_UROT_UPDATE ================================================= */
/**
  * @brief UPDATE [SICR_UROT_UPDATE] Description of FW Updates, if any. In case, SICR.UROT.TBS.POLICY.UPDATE is set to Disabled,
            these registers are ignored by the secure domain ROM code.                                                            
                                                                                                                                  
  */
typedef struct {
  __IOM uint32_t  OPERATION;                         /*!< (@ 0x00000000) Command from the secure domain firmware to the secure
                                                                         domain ROM code.*/                                       
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000004) ROM code indicates the status of update to the secure
                                                                         domain firmware via this register.*/                     
  __IOM NRF_SICR_UROT_UPDATE_DOWNLOAD_Type DOWNLOAD; /*!< (@ 0x00000008) Information about downloaded firmware update. The
                                                                         addresses described here are the location of the update
                                                                         and not the location they must be installed. The
                                                                         installation information is described in the signed
                                                                         manifest.*/                                              
  __IM  uint32_t  RESERVED[2];
  __IOM NRF_SICR_UROT_UPDATE_SM_Type SM;             /*!< (@ 0x00000020) Signed Manifest verified by the Secure Domain ROM Code
                                                                         to establish the primary RoT.*/                          
} NRF_SICR_UROT_UPDATE_Type;                         /*!< Size = 288 (0x120)                                                   */

/* SICR_UROT_UPDATE_OPERATION: Command from the secure domain firmware to the secure domain ROM code. */

/* OPCODE @Bits 0..31 : Opcode to identify the command. */
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_Pos (0UL) /*!< Position of OPCODE field.                                           */
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_Msk (0xFFFFFFFFUL << SICR_UROT_UPDATE_OPERATION_OPCODE_Pos) /*!< Bit mask of OPCODE
                                                                            field.*/                                              
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_Min (0x80000001UL) /*!< Min enumerator value of OPCODE field.                      */
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of OPCODE field.                      */
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_Nop (0xFFFFFFFFUL) /*!< No operation pending.                                      */
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_UROTVerify (0x80000001UL) /*!< This commands allows the firmware update to just be
                                                                           verified without applying it.*/                        
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_UROTActivate (0x80000002UL) /*!< This indicates the firmware update shall be
                                                                            (verified and) applied.*/                             
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_UROTConfirm (0x8F9AC403UL) /*!< The update image is expected to set this operation
                                                                            to indicate it booted correctly.*/                    
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_RecoveryVerify (0x80000003UL) /*!< This commands allows the firmware update to just
                                                                            be verified without applying it.*/                    
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_RecoveryActivate (0x80000004UL) /*!< This indicates the firmware update shall be
                                                                            (verified and) applied.*/                             
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_RecoveryConfirm (0xC4038F9AUL) /*!< The update image is expected to set this
                                                                            operation to indicate it booted correctly.*/          
  #define SICR_UROT_UPDATE_OPERATION_OPCODE_AROTRecovery (0xA0000001UL) /*!< Instructs the ROM code to boot the recovery image
                                                                            in safe mode to download a AROT image instead of a
                                                                            UROT image.*/                                         


