adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SICR_UROT_UPDATE_STATUS: ROM code indicates the status of update to the secure domain firmware via this register. */

/* CODE @Bits 0..31 : Status code. */
  #define SICR_UROT_UPDATE_STATUS_CODE_Pos (0UL)     /*!< Position of CODE field.                                              */
  #define SICR_UROT_UPDATE_STATUS_CODE_Msk (0xFFFFFFFFUL << SICR_UROT_UPDATE_STATUS_CODE_Pos) /*!< Bit mask of CODE field.     */
  #define SICR_UROT_UPDATE_STATUS_CODE_Min (0xF0000001UL) /*!< Min enumerator value of CODE field.                             */
  #define SICR_UROT_UPDATE_STATUS_CODE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of CODE field.                             */
  #define SICR_UROT_UPDATE_STATUS_CODE_None (0xFFFFFFFFUL) /*!< No operation pending to indicate any status.                   */
  #define SICR_UROT_UPDATE_STATUS_CODE_UnknownOperation (0xF0000001UL) /*!< Unknown OPCODE in SICR.UROT.UPDATE.OPERATION.      */
  #define SICR_UROT_UPDATE_STATUS_CODE_InvalidManifest (0xF0000002UL) /*!< The information in the manifest is invalid.         */
  #define SICR_UROT_UPDATE_STATUS_CODE_InvalidSignature (0xF0000003UL) /*!< The signature did not verify.                      */
  #define SICR_UROT_UPDATE_STATUS_CODE_UnknownPubKey (0xF0000004UL) /*!< The public key in SICR.UROT.UPDATE.SM.TBS.PUBKEY is
                                                                         unknown.*/                                               
  #define SICR_UROT_UPDATE_STATUS_CODE_RevokedPubKey (0xF0000005UL) /*!< The public key used to signature is already revoked on
                                                                         the device.*/                                            
  #define SICR_UROT_UPDATE_STATUS_CODE_StaleFW (0xF0000006UL) /*!< The timestamp on the firmware is older than the current one.*/
  #define SICR_UROT_UPDATE_STATUS_CODE_VerifyOK (0xF0000007UL) /*!< Signature verification is successful.                      */
  #define SICR_UROT_UPDATE_STATUS_CODE_InvalidLayout (0xF0000008UL) /*!< The firmware update is built for the wrong layout. Any
                                                                         update that overwrites the existing firmware is
                                                                         disallowed.*/                                            
  #define SICR_UROT_UPDATE_STATUS_CODE_UROTUnconfirmed (0xF0000009UL) /*!< The firmware update is applied, but is pending
                                                                           confirmation from the updated firmware.*/              
  #define SICR_UROT_UPDATE_STATUS_CODE_RecoveryUnconfirmed (0xF000000AUL) /*!< The firmware update is applied, but is pending
                                                                            confirmation from the updated firmware.*/             
  #define SICR_UROT_UPDATE_STATUS_CODE_Reverted (0xF000000BUL) /*!< The secure domain ROM code reverted the update as the update
                                                                    is not confirmed.*/                                           
  #define SICR_UROT_UPDATE_STATUS_CODE_SafeMode (0xF000000CUL) /*!< Recovery image is booted in safe mode as the firmware update
                                                                    failed and the ROM could not restore the previous UROT
                                                                    firmware.*/                                                   
  #define SICR_UROT_UPDATE_STATUS_CODE_AROTRecovery (0xF000000DUL) /*!< Recovery image is booted so that the recovery image can
                                                                        download a AROT image that ROM does not verify.*/         
  #define SICR_UROT_UPDATE_STATUS_CODE_UROTUpdateDisabled (0xF000000EUL) /*!< No valid recovery image is present and hence UROT
                                                                            firmware update is disabled.*/                        



/* ==================================================== Struct SICR_UROT ===================================================== */
/**
  * @brief UROT [SICR_UROT] Interface to store information related to the updateable RoT.
  */
typedef struct {
  __IOM NRF_SICR_UROT_SM_Type SM;                    /*!< (@ 0x00000000) Signed Manifest verified by the Secure Domain ROM Code
                                                                         to establish the primary RoT.*/                          
  __IOM NRF_SICR_UROT_RECOVERY_Type RECOVERY;        /*!< (@ 0x00000100) Signed manifest of the recovery firmware.             */
  __IOM NRF_SICR_UROT_UPDATE_Type UPDATE;            /*!< (@ 0x00000200) Description of FW Updates, if any. In case,
                                                                         SICR.UROT.TBS.POLICY.UPDATE is set to Disabled, these
                                                                         registers are ignored by the secure domain ROM code.*/   
  __IOM uint32_t  CERTIFICATE[1024];                 /*!< (@ 0x00000320) Device X.509 certificate.                             */
} NRF_SICR_UROT_Type;                                /*!< Size = 4896 (0x1320)                                                 */

/* SICR_UROT_CERTIFICATE: Device X.509 certificate. */
  #define SICR_UROT_CERTIFICATE_MaxCount (1024UL)    /*!< Max size of CERTIFICATE[1024] array.                                 */

/* CERT @Bit 0 : Device certificate. */
  #define SICR_UROT_CERTIFICATE_CERT_Pos (0UL)       /*!< Position of CERT field.                                              */
  #define SICR_UROT_CERTIFICATE_CERT_Msk (0x1UL << SICR_UROT_CERTIFICATE_CERT_Pos) /*!< Bit mask of CERT field.                */



/* ================================================= Struct SICR_AROT_SECURE ================================================= */
/**
  * @brief SECURE [SICR_AROT_SECURE] Any next-stage secure domain firmware related.
  */
typedef struct {
  __IM  uint32_t  TBD;                               /*!< (@ 0x00000000) To be added once the secure domain ROM-related
                                                                         interface is agreed.*/                                   
  __IM  uint32_t  RESERVED[255];
} NRF_SICR_AROT_SECURE_Type;                         /*!< Size = 1024 (0x400)                                                  */


/* ============================================== Struct SICR_AROT_APPLICATION =============================================== */
/**
  * @brief APPLICATION [SICR_AROT_APPLICATION] Extended RoT to the application core/domain.
  */
typedef struct {
  __IM  uint32_t  TBD;                               /*!< (@ 0x00000000) To be added once the secure domain ROM-related
                                                                         interface is agreed.*/                                   
  __IM  uint32_t  RESERVED[255];
} NRF_SICR_AROT_APPLICATION_Type;                    /*!< Size = 1024 (0x400)                                                  */


