adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ================================================= Struct SICR_AROT_RADIO ================================================== */
/**
  * @brief RADIO [SICR_AROT_RADIO] Interface to extend the RoT to the radio core/domain.
  */
typedef struct {
  __IM  uint32_t  TBD;                               /*!< (@ 0x00000000) To be added once the secure domain ROM-related
                                                                         interface is agreed.*/                                   
  __IM  uint32_t  RESERVED[255];
} NRF_SICR_AROT_RADIO_Type;                          /*!< Size = 1024 (0x400)                                                  */


/* ============================================== Struct SICR_AROT_CELLULARCORE ============================================== */
/**
  * @brief CELLULARCORE [SICR_AROT_CELLULARCORE] Interface to extend the RoT to the cellular core/domain.
  */
typedef struct {
  __IM  uint32_t  TBD;                               /*!< (@ 0x00000000) To be added once the secure domain ROM-related
                                                                         interface is agreed.*/                                   
  __IM  uint32_t  RESERVED[255];
} NRF_SICR_AROT_CELLULARCORE_Type;                   /*!< Size = 1024 (0x400)                                                  */


/* ==================================================== Struct SICR_AROT ===================================================== */
/**
  * @brief AROT [SICR_AROT] Interface used by the secure domain firmware to extend the RoT to the other local domains and store
            information on configuration of debug access ports, CTRL-AP methods, and other platfrom security related
            configurations per domain. These registers are only accessed the secure domain firmware. Any operations related to
            the local domains must be requested via the secure domain firmware API.                                               
                                                                                                                                  
  */
typedef struct {
  __IOM NRF_SICR_AROT_SECURE_Type SECURE;            /*!< (@ 0x00000000) Any next-stage secure domain firmware related.        */
  __IOM NRF_SICR_AROT_APPLICATION_Type APPLICATION;  /*!< (@ 0x00000400) Extended RoT to the application core/domain.          */
  __IOM NRF_SICR_AROT_RADIO_Type RADIO;              /*!< (@ 0x00000800) Interface to extend the RoT to the radio core/domain. */
  __IOM NRF_SICR_AROT_CELLULARCORE_Type CELLULARCORE; /*!< (@ 0x00000C00) Interface to extend the RoT to the cellular
                                                                          core/domain.*/                                          
} NRF_SICR_AROT_Type;                                /*!< Size = 4096 (0x1000)                                                 */

/* ======================================================= Struct SICR ======================================================= */
/**
  * @brief Secure Information Configuration Registers
  */
  typedef struct {                                   /*!< SICR Structure                                                       */
    __IOM NRF_SICR_IROT_Type IROT;                   /*!< (@ 0x00000000) Information on immutable Root of Trust. Secure domain
                                                                         ROM writes these registers only in LCS Empty, RoT and
                                                                         DEPLOYED.*/                                              
    __IM uint32_t RESERVED[24];
    __IOM NRF_SICR_UROT_Type UROT;                   /*!< (@ 0x000000F0) Interface to store information related to the
                                                                         updateable RoT.*/                                        
    __IM uint32_t RESERVED1[60];
    __IOM NRF_SICR_AROT_Type AROT;                   /*!< (@ 0x00001500) Interface used by the secure domain firmware to extend
                                                                         the RoT to the other local domains and store
                                                                         information on configuration of debug access ports,
                                                                         CTRL-AP methods, and other platfrom security related
                                                                         configurations per domain. These registers are only
                                                                         accessed the secure domain firmware. Any operations
                                                                         related to the local domains must be requested via the
                                                                         secure domain firmware API.*/                            
  } NRF_SICR_Type;                                   /*!< Size = 9472 (0x2500)                                                 */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           SIMIF                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct SIMIF_EVENTS_DMA ================================================= */
/**
  * @brief EVENTS_DMA [SIMIF_EVENTS_DMA] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  RXSTARTED;                         /*!< (@ 0x00000000) DMA Rx operation started                              */
  __IOM uint32_t  RXDONE;                            /*!< (@ 0x00000004) DMA Tx operation finished                             */
  __IOM uint32_t  TXSTARTED;                         /*!< (@ 0x00000008) DMA Tx operation started                              */
  __IOM uint32_t  TXDONE;                            /*!< (@ 0x0000000C) DMA Tx operation finished                             */
} NRF_SIMIF_EVENTS_DMA_Type;                         /*!< Size = 16 (0x010)                                                    */

/* SIMIF_EVENTS_DMA_RXSTARTED: DMA Rx operation started */
  #define SIMIF_EVENTS_DMA_RXSTARTED_ResetValue (0x00000000UL) /*!< Reset value of RXSTARTED register.                         */

/* RXSTARTED @Bit 0 : DMA Rx operation started */
  #define SIMIF_EVENTS_DMA_RXSTARTED_RXSTARTED_Pos (0UL) /*!< Position of RXSTARTED field.                                     */
  #define SIMIF_EVENTS_DMA_RXSTARTED_RXSTARTED_Msk (0x1UL << SIMIF_EVENTS_DMA_RXSTARTED_RXSTARTED_Pos) /*!< Bit mask of
                                                                            RXSTARTED field.*/                                    
  #define SIMIF_EVENTS_DMA_RXSTARTED_RXSTARTED_Min (0x0UL) /*!< Min enumerator value of RXSTARTED field.                       */
  #define SIMIF_EVENTS_DMA_RXSTARTED_RXSTARTED_Max (0x1UL) /*!< Max enumerator value of RXSTARTED field.                       */
  #define SIMIF_EVENTS_DMA_RXSTARTED_RXSTARTED_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define SIMIF_EVENTS_DMA_RXSTARTED_RXSTARTED_Generated (0x1UL) /*!< Event generated                                          */


/* SIMIF_EVENTS_DMA_RXDONE: DMA Tx operation finished */
  #define SIMIF_EVENTS_DMA_RXDONE_ResetValue (0x00000000UL) /*!< Reset value of RXDONE register.                               */

/* RXDONE @Bit 0 : DMA Tx operation finished */
  #define SIMIF_EVENTS_DMA_RXDONE_RXDONE_Pos (0UL)   /*!< Position of RXDONE field.                                            */
  #define SIMIF_EVENTS_DMA_RXDONE_RXDONE_Msk (0x1UL << SIMIF_EVENTS_DMA_RXDONE_RXDONE_Pos) /*!< Bit mask of RXDONE field.      */
  #define SIMIF_EVENTS_DMA_RXDONE_RXDONE_Min (0x0UL) /*!< Min enumerator value of RXDONE field.                                */
  #define SIMIF_EVENTS_DMA_RXDONE_RXDONE_Max (0x1UL) /*!< Max enumerator value of RXDONE field.                                */
  #define SIMIF_EVENTS_DMA_RXDONE_RXDONE_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define SIMIF_EVENTS_DMA_RXDONE_RXDONE_Generated (0x1UL) /*!< Event generated                                                */


/* SIMIF_EVENTS_DMA_TXSTARTED: DMA Tx operation started */
  #define SIMIF_EVENTS_DMA_TXSTARTED_ResetValue (0x00000000UL) /*!< Reset value of TXSTARTED register.                         */

