adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TXSTARTED @Bit 0 : DMA Tx operation started */
  #define SIMIF_EVENTS_DMA_TXSTARTED_TXSTARTED_Pos (0UL) /*!< Position of TXSTARTED field.                                     */
  #define SIMIF_EVENTS_DMA_TXSTARTED_TXSTARTED_Msk (0x1UL << SIMIF_EVENTS_DMA_TXSTARTED_TXSTARTED_Pos) /*!< Bit mask of
                                                                            TXSTARTED field.*/                                    
  #define SIMIF_EVENTS_DMA_TXSTARTED_TXSTARTED_Min (0x0UL) /*!< Min enumerator value of TXSTARTED field.                       */
  #define SIMIF_EVENTS_DMA_TXSTARTED_TXSTARTED_Max (0x1UL) /*!< Max enumerator value of TXSTARTED field.                       */
  #define SIMIF_EVENTS_DMA_TXSTARTED_TXSTARTED_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define SIMIF_EVENTS_DMA_TXSTARTED_TXSTARTED_Generated (0x1UL) /*!< Event generated                                          */


/* SIMIF_EVENTS_DMA_TXDONE: DMA Tx operation finished */
  #define SIMIF_EVENTS_DMA_TXDONE_ResetValue (0x00000000UL) /*!< Reset value of TXDONE register.                               */

/* TXDONE @Bit 0 : DMA Tx operation finished */
  #define SIMIF_EVENTS_DMA_TXDONE_TXDONE_Pos (0UL)   /*!< Position of TXDONE field.                                            */
  #define SIMIF_EVENTS_DMA_TXDONE_TXDONE_Msk (0x1UL << SIMIF_EVENTS_DMA_TXDONE_TXDONE_Pos) /*!< Bit mask of TXDONE field.      */
  #define SIMIF_EVENTS_DMA_TXDONE_TXDONE_Min (0x0UL) /*!< Min enumerator value of TXDONE field.                                */
  #define SIMIF_EVENTS_DMA_TXDONE_TXDONE_Max (0x1UL) /*!< Max enumerator value of TXDONE field.                                */
  #define SIMIF_EVENTS_DMA_TXDONE_TXDONE_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define SIMIF_EVENTS_DMA_TXDONE_TXDONE_Generated (0x1UL) /*!< Event generated                                                */


/* ====================================================== Struct SIMIF ======================================================= */
/**
  * @brief SIM card interface
  */
  typedef struct {                                   /*!< SIMIF Structure                                                      */
    __OM uint32_t TASKS_DMASTARTRX;                  /*!< (@ 0x00000000) start DMA transfer from SIM card to memory            */
    __OM uint32_t TASKS_DMASTOPRX;                   /*!< (@ 0x00000004) stop DMA transfer from SIM card to memory             */
    __OM uint32_t TASKS_DMASTARTTX;                  /*!< (@ 0x00000008) start DMA transfer from memory to SIM card            */
    __OM uint32_t TASKS_DMASTOPTX;                   /*!< (@ 0x0000000C) start DMA transfer from memory to SIM card            */
    __OM uint32_t TASKS_RSTSET;                      /*!< (@ 0x00000010) Set SIM card reset signal                             */
    __OM uint32_t TASKS_RSTCLEAR;                    /*!< (@ 0x00000014) Clear SIM card reset signal                           */
    __OM uint32_t TASKS_RESET;                       /*!< (@ 0x00000018) Reset everything                                      */
    __OM uint32_t TASKS_UARTRX;                      /*!< (@ 0x0000001C) Start Uart for Rx access                              */
    __OM uint32_t TASKS_UARTTX;                      /*!< (@ 0x00000020) Start Uart for Tx access                              */
    __OM uint32_t TASKS_STARTWRITEFROMREG;           /*!< (@ 0x00000024) Write test data from Ahb test reg to Ahb Rx bus       */
    __OM uint32_t TASKS_STARTREADTOREG;              /*!< (@ 0x00000028) Read data from Ahb Tx bus to Ahb test reg             */
    __OM uint32_t TASKS_PROTOCOLT0SET;               /*!< (@ 0x0000002C) Start using protocol T0                               */
    __OM uint32_t TASKS_PROTOCOLT1SET;               /*!< (@ 0x00000030) Start using protocol T1                               */
    __OM uint32_t TASKS_PROTOCOLNONSET;              /*!< (@ 0x00000034) Start using protocol none                             */
    __OM uint32_t TASKS_TIMECOUNTCLEAR;              /*!< (@ 0x00000038) Stop and clear time out counter                       */
    __IM uint32_t RESERVED[49];
    __IOM NRF_SIMIF_EVENTS_DMA_Type EVENTS_DMA;      /*!< (@ 0x00000100) Peripheral events.                                    */
    __IOM uint32_t EVENTS_INVALIDCONVENTION;         /*!< (@ 0x00000110) ATR.TS convention not recognized                      */
    __IOM uint32_t EVENTS_PARITYERROR;               /*!< (@ 0x00000114) Rx byte parity error                                  */
    __IOM uint32_t EVENTS_ATRTIMEOUT;                /*!< (@ 0x00000118) No ATR between 400 and 40000 sim clock cycles         */
    __IOM uint32_t EVENTS_CWTIMEOUT;                 /*!< (@ 0x0000011C) T=1 character wait timeout                            */
    __IOM uint32_t EVENTS_BWTIMEOUT;                 /*!< (@ 0x00000120) Block Wait timeout                                    */
    __IOM uint32_t EVENTS_SW1SW2;                    /*!< (@ 0x00000124) SW1 and SW2 bytes received                            */
    __IOM uint32_t EVENTS_RESET;                     /*!< (@ 0x00000128) Everything reset                                      */
    __IOM uint32_t EVENTS_INS;                       /*!< (@ 0x0000012C) T=0 procedure byte INS received                       */
    __IOM uint32_t EVENTS_NINS;                      /*!< (@ 0x00000130) T=0 procedure byte !INS received                      */
    __IOM uint32_t EVENTS_ERROR;                     /*!< (@ 0x00000134) Error response                                        */
    __IOM uint32_t EVENTS_READYTX;                   /*!< (@ 0x00000138) Byte sent after START_WRITE_FROM_REG                  */
    __IOM uint32_t EVENTS_RXDATAREADY;               /*!< (@ 0x0000013C) Byte received after START_READ_TO_REG                 */
    __IOM uint32_t EVENTS_T1RXOVERRUN;               /*!< (@ 0x00000140) Unexpected bytes received after DMA RX[0...N], SW1SW2
                                                                         in T=1*/                                                 
    __IOM uint32_t EVENTS_T1TXABORTED;               /*!< (@ 0x00000144) T=1 card responded with S(ABORT request)              */
    __IOM uint32_t EVENTS_T1NONIBLOCK;               /*!< (@ 0x00000148) T=1 unrecognized (S or R) block (with correct LRC)
                                                                         stored in RX_DATA*/                                      
    __IOM uint32_t EVENTS_T1LENERROR;                /*!< (@ 0x0000014C) T=1 LEN = 255                                         */
    __IOM uint32_t EVENTS_EDCERROR;                  /*!< (@ 0x00000150) T=1 EDC error                                         */
    __IOM uint32_t EVENTS_NADERROR;                  /*!< (@ 0x00000154) T=1 NAD error                                         */
    __IOM uint32_t EVENTS_ERRORCOUNTMAX;             /*!< (@ 0x00000158) number of unsuccessful rx or tx operations equals max
                                                                         value*/                                                  
    __IOM uint32_t EVENTS_T1RXMORE;                  /*!< (@ 0x0000015C) More bit high in PCB of Rx T=1 I block                */
    __IOM uint32_t EVENTS_T1RXFRAMEEND;              /*!< (@ 0x00000160) Len byte + 1 bytes of T1 Rx data received             */
    __IM uint32_t RESERVED1[39];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED2[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED3[60];
    __IOM uint32_t SW1SW2;                           /*!< (@ 0x00000400) Sw1 and Sw2 bytes received from Sim card in T=1 mode  */
    __IOM uint32_t CONVENTION;                       /*!< (@ 0x00000404) Data convention used in traffic between controller and
                                                                         SIM card*/                                               
    __IOM uint32_t LRCOUT;                           /*!< (@ 0x00000408) Latest generated LRC value                            */
    __IM uint32_t RXDATA;                            /*!< (@ 0x0000040C) NonDMA received data                                  */
    __IOM uint32_t T0SWXCOUNT;                       /*!< (@ 0x00000410) Number of SWx bytes received after T=0 Rx DMA finished*/
    __IM uint32_t RESERVED4[59];
    __IOM uint32_t CLKRATE;                          /*!< (@ 0x00000500) Divider value for setting the clock rate to the SIM
                                                                         card.*/                                                  
    __IOM uint32_t BAUDRATE;                         /*!< (@ 0x00000504) Divider value for setting the baud rate to the SIM
                                                                         card.*/                                                  
    __IOM uint32_t CHARACTERGUARDTIME;               /*!< (@ 0x00000508) Character Guard time                                  */
    __IOM uint32_t CHARACTERWAITTIME;                /*!< (@ 0x0000050C) Character Wait time                                   */
    __IOM uint32_t BLOCKWAITTIME;                    /*!< (@ 0x00000510) Block Wait time                                       */
    __IOM uint32_t PROTOCOL;                         /*!< (@ 0x00000514) Protocol selection                                    */
    __IOM uint32_t LOWIMPEDANCE;                     /*!< (@ 0x00000518) Low impedance driver use                              */
    __IOM uint32_t T1PCBCONTROL;                     /*!< (@ 0x0000051C) T=1 Tx PCB bits 5:6                                   */
    __IOM uint32_t CLOCKCONTROL;                     /*!< (@ 0x00000520) Clock Control                                         */
    __IOM uint32_t VOLTAGE;                          /*!< (@ 0x00000524) Sim card operating voltage                            */
    __IOM uint32_t LRCENABLE;                        /*!< (@ 0x00000528) LRC Calculation enable                                */
    __OM uint32_t TXDATA;                            /*!< (@ 0x0000052C) NonDMA data to be sent to the SIM card                */
    __IOM uint32_t UARTCONFIG;                       /*!< (@ 0x00000530) Uart configuration                                    */
    __IOM uint32_t WRITEMAXATT;                      /*!< (@ 0x00000534) Number of write attempts before error interrupt       */
    __IOM uint32_t READMAXATT;                       /*!< (@ 0x00000538) Number of read attempts before error interrupt        */
    __IOM uint32_t AHBTESTWRITE;                     /*!< (@ 0x0000053C) Test data to write through AHB RX bus                 */
    __IM uint32_t AHBTESTREAD;                       /*!< (@ 0x00000540) Test data to read through AHB TX bus                  */
    __IOM uint32_t RXPROLOGUEDATA;                   /*!< (@ 0x00000544) Four first Rx data bytes from card                    */
    __IM uint32_t RESERVED5[11];
    __IOM uint32_t UARTENABLE;                       /*!< (@ 0x00000574) UART Enable                                           */
    __OM uint32_t UARTRXENABLE;                      /*!< (@ 0x00000578) UART Rx Enable                                        */
    __OM uint32_t UARTTXENABLE;                      /*!< (@ 0x0000057C) UART Tx Enable                                        */
    __IM uint32_t RESERVED6[32];
    __IOM uint32_t DMARXADDR;                        /*!< (@ 0x00000600) DMA access buffer RAM start address                   */
    __IOM uint32_t DMARXBUFFERSIZE;                  /*!< (@ 0x00000604) Byte count to receive in Dma Rx operation             */
    __IM uint32_t DMARXBYTECOUNT;                    /*!< (@ 0x00000608) Byte count received in latest Dma Rx operation        */
    __IOM uint32_t DMARXENABLE;                      /*!< (@ 0x0000060C) Enable for rx dma                                     */
    __IM uint32_t DMARXSELECTLIST;                   /*!< (@ 0x00000610) Rx select address from list                           */
    __IM uint32_t RESERVED7[59];
    __IOM uint32_t DMATXADDR;                        /*!< (@ 0x00000700) Start address for DMA access in buffer RAM            */
    __IOM uint32_t DMATXBUFFERSIZE;                  /*!< (@ 0x00000704) Byte count to transmit in Dma Rx operation            */
    __IM uint32_t DMATXBYTECOUNT;                    /*!< (@ 0x00000708) Byte count transmitted in latest Dma Tx operation     */
    __IOM uint32_t DMATXENABLE;                      /*!< (@ 0x0000070C) Enable for rx dma                                     */
    __IM uint32_t DMATXSELECTLIST;                   /*!< (@ 0x00000710) Tx select address from list                           */
  } NRF_SIMIF_Type;                                  /*!< Size = 1812 (0x714)                                                  */

/* SIMIF_TASKS_DMASTARTRX: start DMA transfer from SIM card to memory */
  #define SIMIF_TASKS_DMASTARTRX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DMASTARTRX register.                      */

/* TASKS_DMASTARTRX @Bit 0 : start DMA transfer from SIM card to memory */
  #define SIMIF_TASKS_DMASTARTRX_TASKS_DMASTARTRX_Pos (0UL) /*!< Position of TASKS_DMASTARTRX field.                           */
  #define SIMIF_TASKS_DMASTARTRX_TASKS_DMASTARTRX_Msk (0x1UL << SIMIF_TASKS_DMASTARTRX_TASKS_DMASTARTRX_Pos) /*!< Bit mask of
                                                                            TASKS_DMASTARTRX field.*/                             
  #define SIMIF_TASKS_DMASTARTRX_TASKS_DMASTARTRX_Min (0x1UL) /*!< Min enumerator value of TASKS_DMASTARTRX field.             */
  #define SIMIF_TASKS_DMASTARTRX_TASKS_DMASTARTRX_Max (0x1UL) /*!< Max enumerator value of TASKS_DMASTARTRX field.             */
  #define SIMIF_TASKS_DMASTARTRX_TASKS_DMASTARTRX_Trigger (0x1UL) /*!< Trigger task                                            */


/* SIMIF_TASKS_DMASTOPRX: stop DMA transfer from SIM card to memory */
  #define SIMIF_TASKS_DMASTOPRX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DMASTOPRX register.                        */

/* TASKS_DMASTOPRX @Bit 0 : stop DMA transfer from SIM card to memory */
  #define SIMIF_TASKS_DMASTOPRX_TASKS_DMASTOPRX_Pos (0UL) /*!< Position of TASKS_DMASTOPRX field.                              */
  #define SIMIF_TASKS_DMASTOPRX_TASKS_DMASTOPRX_Msk (0x1UL << SIMIF_TASKS_DMASTOPRX_TASKS_DMASTOPRX_Pos) /*!< Bit mask of
                                                                            TASKS_DMASTOPRX field.*/                              
  #define SIMIF_TASKS_DMASTOPRX_TASKS_DMASTOPRX_Min (0x1UL) /*!< Min enumerator value of TASKS_DMASTOPRX field.                */
  #define SIMIF_TASKS_DMASTOPRX_TASKS_DMASTOPRX_Max (0x1UL) /*!< Max enumerator value of TASKS_DMASTOPRX field.                */
  #define SIMIF_TASKS_DMASTOPRX_TASKS_DMASTOPRX_Trigger (0x1UL) /*!< Trigger task                                              */


/* SIMIF_TASKS_DMASTARTTX: start DMA transfer from memory to SIM card */
  #define SIMIF_TASKS_DMASTARTTX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DMASTARTTX register.                      */

/* TASKS_DMASTARTTX @Bit 0 : start DMA transfer from memory to SIM card */
  #define SIMIF_TASKS_DMASTARTTX_TASKS_DMASTARTTX_Pos (0UL) /*!< Position of TASKS_DMASTARTTX field.                           */
  #define SIMIF_TASKS_DMASTARTTX_TASKS_DMASTARTTX_Msk (0x1UL << SIMIF_TASKS_DMASTARTTX_TASKS_DMASTARTTX_Pos) /*!< Bit mask of
                                                                            TASKS_DMASTARTTX field.*/                             
  #define SIMIF_TASKS_DMASTARTTX_TASKS_DMASTARTTX_Min (0x1UL) /*!< Min enumerator value of TASKS_DMASTARTTX field.             */
  #define SIMIF_TASKS_DMASTARTTX_TASKS_DMASTARTTX_Max (0x1UL) /*!< Max enumerator value of TASKS_DMASTARTTX field.             */
  #define SIMIF_TASKS_DMASTARTTX_TASKS_DMASTARTTX_Trigger (0x1UL) /*!< Trigger task                                            */


