adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SIMIF_TASKS_DMASTOPTX: start DMA transfer from memory to SIM card */
  #define SIMIF_TASKS_DMASTOPTX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DMASTOPTX register.                        */

/* TASKS_DMASTOPTX @Bit 0 : start DMA transfer from memory to SIM card */
  #define SIMIF_TASKS_DMASTOPTX_TASKS_DMASTOPTX_Pos (0UL) /*!< Position of TASKS_DMASTOPTX field.                              */
  #define SIMIF_TASKS_DMASTOPTX_TASKS_DMASTOPTX_Msk (0x1UL << SIMIF_TASKS_DMASTOPTX_TASKS_DMASTOPTX_Pos) /*!< Bit mask of
                                                                            TASKS_DMASTOPTX field.*/                              
  #define SIMIF_TASKS_DMASTOPTX_TASKS_DMASTOPTX_Min (0x1UL) /*!< Min enumerator value of TASKS_DMASTOPTX field.                */
  #define SIMIF_TASKS_DMASTOPTX_TASKS_DMASTOPTX_Max (0x1UL) /*!< Max enumerator value of TASKS_DMASTOPTX field.                */
  #define SIMIF_TASKS_DMASTOPTX_TASKS_DMASTOPTX_Trigger (0x1UL) /*!< Trigger task                                              */


/* SIMIF_TASKS_RSTSET: Set SIM card reset signal */
  #define SIMIF_TASKS_RSTSET_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RSTSET register.                              */

/* TASKS_RSTSET @Bit 0 : Set SIM card reset signal */
  #define SIMIF_TASKS_RSTSET_TASKS_RSTSET_Pos (0UL)  /*!< Position of TASKS_RSTSET field.                                      */
  #define SIMIF_TASKS_RSTSET_TASKS_RSTSET_Msk (0x1UL << SIMIF_TASKS_RSTSET_TASKS_RSTSET_Pos) /*!< Bit mask of TASKS_RSTSET
                                                                            field.*/                                              
  #define SIMIF_TASKS_RSTSET_TASKS_RSTSET_Min (0x1UL) /*!< Min enumerator value of TASKS_RSTSET field.                         */
  #define SIMIF_TASKS_RSTSET_TASKS_RSTSET_Max (0x1UL) /*!< Max enumerator value of TASKS_RSTSET field.                         */
  #define SIMIF_TASKS_RSTSET_TASKS_RSTSET_Trigger (0x1UL) /*!< Trigger task                                                    */


/* SIMIF_TASKS_RSTCLEAR: Clear SIM card reset signal */
  #define SIMIF_TASKS_RSTCLEAR_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RSTCLEAR register.                          */

/* TASKS_RSTCLEAR @Bit 0 : Clear SIM card reset signal */
  #define SIMIF_TASKS_RSTCLEAR_TASKS_RSTCLEAR_Pos (0UL) /*!< Position of TASKS_RSTCLEAR field.                                 */
  #define SIMIF_TASKS_RSTCLEAR_TASKS_RSTCLEAR_Msk (0x1UL << SIMIF_TASKS_RSTCLEAR_TASKS_RSTCLEAR_Pos) /*!< Bit mask of
                                                                            TASKS_RSTCLEAR field.*/                               
  #define SIMIF_TASKS_RSTCLEAR_TASKS_RSTCLEAR_Min (0x1UL) /*!< Min enumerator value of TASKS_RSTCLEAR field.                   */
  #define SIMIF_TASKS_RSTCLEAR_TASKS_RSTCLEAR_Max (0x1UL) /*!< Max enumerator value of TASKS_RSTCLEAR field.                   */
  #define SIMIF_TASKS_RSTCLEAR_TASKS_RSTCLEAR_Trigger (0x1UL) /*!< Trigger task                                                */


/* SIMIF_TASKS_RESET: Reset everything */
  #define SIMIF_TASKS_RESET_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RESET register.                                */

/* TASKS_RESET @Bit 0 : Reset everything */
  #define SIMIF_TASKS_RESET_TASKS_RESET_Pos (0UL)    /*!< Position of TASKS_RESET field.                                       */
  #define SIMIF_TASKS_RESET_TASKS_RESET_Msk (0x1UL << SIMIF_TASKS_RESET_TASKS_RESET_Pos) /*!< Bit mask of TASKS_RESET field.   */
  #define SIMIF_TASKS_RESET_TASKS_RESET_Min (0x1UL)  /*!< Min enumerator value of TASKS_RESET field.                           */
  #define SIMIF_TASKS_RESET_TASKS_RESET_Max (0x1UL)  /*!< Max enumerator value of TASKS_RESET field.                           */
  #define SIMIF_TASKS_RESET_TASKS_RESET_Trigger (0x1UL) /*!< Trigger task                                                      */


/* SIMIF_TASKS_UARTRX: Start Uart for Rx access */
  #define SIMIF_TASKS_UARTRX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_UARTRX register.                              */

/* TASKS_UARTRX @Bit 0 : Start Uart for Rx access */
  #define SIMIF_TASKS_UARTRX_TASKS_UARTRX_Pos (0UL)  /*!< Position of TASKS_UARTRX field.                                      */
  #define SIMIF_TASKS_UARTRX_TASKS_UARTRX_Msk (0x1UL << SIMIF_TASKS_UARTRX_TASKS_UARTRX_Pos) /*!< Bit mask of TASKS_UARTRX
                                                                            field.*/                                              
  #define SIMIF_TASKS_UARTRX_TASKS_UARTRX_Min (0x1UL) /*!< Min enumerator value of TASKS_UARTRX field.                         */
  #define SIMIF_TASKS_UARTRX_TASKS_UARTRX_Max (0x1UL) /*!< Max enumerator value of TASKS_UARTRX field.                         */
  #define SIMIF_TASKS_UARTRX_TASKS_UARTRX_Trigger (0x1UL) /*!< Trigger task                                                    */


/* SIMIF_TASKS_UARTTX: Start Uart for Tx access */
  #define SIMIF_TASKS_UARTTX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_UARTTX register.                              */

/* TASKS_UARTTX @Bit 0 : Start Uart for Tx access */
  #define SIMIF_TASKS_UARTTX_TASKS_UARTTX_Pos (0UL)  /*!< Position of TASKS_UARTTX field.                                      */
  #define SIMIF_TASKS_UARTTX_TASKS_UARTTX_Msk (0x1UL << SIMIF_TASKS_UARTTX_TASKS_UARTTX_Pos) /*!< Bit mask of TASKS_UARTTX
                                                                            field.*/                                              
  #define SIMIF_TASKS_UARTTX_TASKS_UARTTX_Min (0x1UL) /*!< Min enumerator value of TASKS_UARTTX field.                         */
  #define SIMIF_TASKS_UARTTX_TASKS_UARTTX_Max (0x1UL) /*!< Max enumerator value of TASKS_UARTTX field.                         */
  #define SIMIF_TASKS_UARTTX_TASKS_UARTTX_Trigger (0x1UL) /*!< Trigger task                                                    */


/* SIMIF_TASKS_STARTWRITEFROMREG: Write test data from Ahb test reg to Ahb Rx bus */
  #define SIMIF_TASKS_STARTWRITEFROMREG_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STARTWRITEFROMREG register.        */

/* TASKS_STARTWRITEFROMREG @Bit 0 : Write test data from Ahb test reg to Ahb Rx bus */
  #define SIMIF_TASKS_STARTWRITEFROMREG_TASKS_STARTWRITEFROMREG_Pos (0UL) /*!< Position of TASKS_STARTWRITEFROMREG field.      */
  #define SIMIF_TASKS_STARTWRITEFROMREG_TASKS_STARTWRITEFROMREG_Msk (0x1UL << SIMIF_TASKS_STARTWRITEFROMREG_TASKS_STARTWRITEFROMREG_Pos)
                                                                            /*!< Bit mask of TASKS_STARTWRITEFROMREG field.*/     
  #define SIMIF_TASKS_STARTWRITEFROMREG_TASKS_STARTWRITEFROMREG_Min (0x1UL) /*!< Min enumerator value of TASKS_STARTWRITEFROMREG
                                                                            field.*/                                              
  #define SIMIF_TASKS_STARTWRITEFROMREG_TASKS_STARTWRITEFROMREG_Max (0x1UL) /*!< Max enumerator value of TASKS_STARTWRITEFROMREG
                                                                            field.*/                                              
  #define SIMIF_TASKS_STARTWRITEFROMREG_TASKS_STARTWRITEFROMREG_Trigger (0x1UL) /*!< Trigger task                              */


/* SIMIF_TASKS_STARTREADTOREG: Read data from Ahb Tx bus to Ahb test reg */
  #define SIMIF_TASKS_STARTREADTOREG_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STARTREADTOREG register.              */

/* TASKS_STARTREADTOREG @Bit 0 : Read data from Ahb Tx bus to Ahb test reg */
  #define SIMIF_TASKS_STARTREADTOREG_TASKS_STARTREADTOREG_Pos (0UL) /*!< Position of TASKS_STARTREADTOREG field.               */
  #define SIMIF_TASKS_STARTREADTOREG_TASKS_STARTREADTOREG_Msk (0x1UL << SIMIF_TASKS_STARTREADTOREG_TASKS_STARTREADTOREG_Pos)
                                                                            /*!< Bit mask of TASKS_STARTREADTOREG field.*/        
  #define SIMIF_TASKS_STARTREADTOREG_TASKS_STARTREADTOREG_Min (0x1UL) /*!< Min enumerator value of TASKS_STARTREADTOREG field. */
  #define SIMIF_TASKS_STARTREADTOREG_TASKS_STARTREADTOREG_Max (0x1UL) /*!< Max enumerator value of TASKS_STARTREADTOREG field. */
  #define SIMIF_TASKS_STARTREADTOREG_TASKS_STARTREADTOREG_Trigger (0x1UL) /*!< Trigger task                                    */


