adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SIMIF_TASKS_PROTOCOLT0SET: Start using protocol T0 */
  #define SIMIF_TASKS_PROTOCOLT0SET_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PROTOCOLT0SET register.                */

/* TASKS_PROTOCOLT0SET @Bit 0 : Start using protocol T0 */
  #define SIMIF_TASKS_PROTOCOLT0SET_TASKS_PROTOCOLT0SET_Pos (0UL) /*!< Position of TASKS_PROTOCOLT0SET field.                  */
  #define SIMIF_TASKS_PROTOCOLT0SET_TASKS_PROTOCOLT0SET_Msk (0x1UL << SIMIF_TASKS_PROTOCOLT0SET_TASKS_PROTOCOLT0SET_Pos) /*!<
                                                                            Bit mask of TASKS_PROTOCOLT0SET field.*/              
  #define SIMIF_TASKS_PROTOCOLT0SET_TASKS_PROTOCOLT0SET_Min (0x1UL) /*!< Min enumerator value of TASKS_PROTOCOLT0SET field.    */
  #define SIMIF_TASKS_PROTOCOLT0SET_TASKS_PROTOCOLT0SET_Max (0x1UL) /*!< Max enumerator value of TASKS_PROTOCOLT0SET field.    */
  #define SIMIF_TASKS_PROTOCOLT0SET_TASKS_PROTOCOLT0SET_Trigger (0x1UL) /*!< Trigger task                                      */


/* SIMIF_TASKS_PROTOCOLT1SET: Start using protocol T1 */
  #define SIMIF_TASKS_PROTOCOLT1SET_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PROTOCOLT1SET register.                */

/* TASKS_PROTOCOLT1SET @Bit 0 : Start using protocol T1 */
  #define SIMIF_TASKS_PROTOCOLT1SET_TASKS_PROTOCOLT1SET_Pos (0UL) /*!< Position of TASKS_PROTOCOLT1SET field.                  */
  #define SIMIF_TASKS_PROTOCOLT1SET_TASKS_PROTOCOLT1SET_Msk (0x1UL << SIMIF_TASKS_PROTOCOLT1SET_TASKS_PROTOCOLT1SET_Pos) /*!<
                                                                            Bit mask of TASKS_PROTOCOLT1SET field.*/              
  #define SIMIF_TASKS_PROTOCOLT1SET_TASKS_PROTOCOLT1SET_Min (0x1UL) /*!< Min enumerator value of TASKS_PROTOCOLT1SET field.    */
  #define SIMIF_TASKS_PROTOCOLT1SET_TASKS_PROTOCOLT1SET_Max (0x1UL) /*!< Max enumerator value of TASKS_PROTOCOLT1SET field.    */
  #define SIMIF_TASKS_PROTOCOLT1SET_TASKS_PROTOCOLT1SET_Trigger (0x1UL) /*!< Trigger task                                      */


/* SIMIF_TASKS_PROTOCOLNONSET: Start using protocol none */
  #define SIMIF_TASKS_PROTOCOLNONSET_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PROTOCOLNONSET register.              */

/* TASKS_PROTOCOLNONSET @Bit 0 : Start using protocol none */
  #define SIMIF_TASKS_PROTOCOLNONSET_TASKS_PROTOCOLNONSET_Pos (0UL) /*!< Position of TASKS_PROTOCOLNONSET field.               */
  #define SIMIF_TASKS_PROTOCOLNONSET_TASKS_PROTOCOLNONSET_Msk (0x1UL << SIMIF_TASKS_PROTOCOLNONSET_TASKS_PROTOCOLNONSET_Pos)
                                                                            /*!< Bit mask of TASKS_PROTOCOLNONSET field.*/        
  #define SIMIF_TASKS_PROTOCOLNONSET_TASKS_PROTOCOLNONSET_Min (0x1UL) /*!< Min enumerator value of TASKS_PROTOCOLNONSET field. */
  #define SIMIF_TASKS_PROTOCOLNONSET_TASKS_PROTOCOLNONSET_Max (0x1UL) /*!< Max enumerator value of TASKS_PROTOCOLNONSET field. */
  #define SIMIF_TASKS_PROTOCOLNONSET_TASKS_PROTOCOLNONSET_Trigger (0x1UL) /*!< Trigger task                                    */


/* SIMIF_TASKS_TIMECOUNTCLEAR: Stop and clear time out counter */
  #define SIMIF_TASKS_TIMECOUNTCLEAR_ResetValue (0x00000000UL) /*!< Reset value of TASKS_TIMECOUNTCLEAR register.              */

/* TASKS_TIMECOUNTCLEAR @Bit 0 : Stop and clear time out counter */
  #define SIMIF_TASKS_TIMECOUNTCLEAR_TASKS_TIMECOUNTCLEAR_Pos (0UL) /*!< Position of TASKS_TIMECOUNTCLEAR field.               */
  #define SIMIF_TASKS_TIMECOUNTCLEAR_TASKS_TIMECOUNTCLEAR_Msk (0x1UL << SIMIF_TASKS_TIMECOUNTCLEAR_TASKS_TIMECOUNTCLEAR_Pos)
                                                                            /*!< Bit mask of TASKS_TIMECOUNTCLEAR field.*/        
  #define SIMIF_TASKS_TIMECOUNTCLEAR_TASKS_TIMECOUNTCLEAR_Min (0x1UL) /*!< Min enumerator value of TASKS_TIMECOUNTCLEAR field. */
  #define SIMIF_TASKS_TIMECOUNTCLEAR_TASKS_TIMECOUNTCLEAR_Max (0x1UL) /*!< Max enumerator value of TASKS_TIMECOUNTCLEAR field. */
  #define SIMIF_TASKS_TIMECOUNTCLEAR_TASKS_TIMECOUNTCLEAR_Trigger (0x1UL) /*!< Trigger task                                    */


/* SIMIF_EVENTS_INVALIDCONVENTION: ATR.TS convention not recognized */
  #define SIMIF_EVENTS_INVALIDCONVENTION_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_INVALIDCONVENTION register.      */

/* EVENTS_INVALIDCONVENTION @Bit 0 : ATR.TS convention not recognized */
  #define SIMIF_EVENTS_INVALIDCONVENTION_EVENTS_INVALIDCONVENTION_Pos (0UL) /*!< Position of EVENTS_INVALIDCONVENTION field.   */
  #define SIMIF_EVENTS_INVALIDCONVENTION_EVENTS_INVALIDCONVENTION_Msk (0x1UL << SIMIF_EVENTS_INVALIDCONVENTION_EVENTS_INVALIDCONVENTION_Pos)
                                                                            /*!< Bit mask of EVENTS_INVALIDCONVENTION field.*/    
  #define SIMIF_EVENTS_INVALIDCONVENTION_EVENTS_INVALIDCONVENTION_Min (0x0UL) /*!< Min enumerator value of
                                                                            EVENTS_INVALIDCONVENTION field.*/                     
  #define SIMIF_EVENTS_INVALIDCONVENTION_EVENTS_INVALIDCONVENTION_Max (0x1UL) /*!< Max enumerator value of
                                                                            EVENTS_INVALIDCONVENTION field.*/                     
  #define SIMIF_EVENTS_INVALIDCONVENTION_EVENTS_INVALIDCONVENTION_NotGenerated (0x0UL) /*!< Event not generated                */
  #define SIMIF_EVENTS_INVALIDCONVENTION_EVENTS_INVALIDCONVENTION_Generated (0x1UL) /*!< Event generated                       */


/* SIMIF_EVENTS_PARITYERROR: Rx byte parity error */
  #define SIMIF_EVENTS_PARITYERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PARITYERROR register.                  */

/* EVENTS_PARITYERROR @Bit 0 : Rx byte parity error */
  #define SIMIF_EVENTS_PARITYERROR_EVENTS_PARITYERROR_Pos (0UL) /*!< Position of EVENTS_PARITYERROR field.                     */
  #define SIMIF_EVENTS_PARITYERROR_EVENTS_PARITYERROR_Msk (0x1UL << SIMIF_EVENTS_PARITYERROR_EVENTS_PARITYERROR_Pos) /*!< Bit
                                                                            mask of EVENTS_PARITYERROR field.*/                   
  #define SIMIF_EVENTS_PARITYERROR_EVENTS_PARITYERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_PARITYERROR field.       */
  #define SIMIF_EVENTS_PARITYERROR_EVENTS_PARITYERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_PARITYERROR field.       */
  #define SIMIF_EVENTS_PARITYERROR_EVENTS_PARITYERROR_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define SIMIF_EVENTS_PARITYERROR_EVENTS_PARITYERROR_Generated (0x1UL) /*!< Event generated                                   */


/* SIMIF_EVENTS_ATRTIMEOUT: No ATR between 400 and 40000 sim clock cycles */
  #define SIMIF_EVENTS_ATRTIMEOUT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ATRTIMEOUT register.                    */

/* EVENTS_ATRTIMEOUT @Bit 0 : No ATR between 400 and 40000 sim clock cycles */
  #define SIMIF_EVENTS_ATRTIMEOUT_EVENTS_ATRTIMEOUT_Pos (0UL) /*!< Position of EVENTS_ATRTIMEOUT field.                        */
  #define SIMIF_EVENTS_ATRTIMEOUT_EVENTS_ATRTIMEOUT_Msk (0x1UL << SIMIF_EVENTS_ATRTIMEOUT_EVENTS_ATRTIMEOUT_Pos) /*!< Bit mask
                                                                            of EVENTS_ATRTIMEOUT field.*/                         
  #define SIMIF_EVENTS_ATRTIMEOUT_EVENTS_ATRTIMEOUT_Min (0x0UL) /*!< Min enumerator value of EVENTS_ATRTIMEOUT field.          */
  #define SIMIF_EVENTS_ATRTIMEOUT_EVENTS_ATRTIMEOUT_Max (0x1UL) /*!< Max enumerator value of EVENTS_ATRTIMEOUT field.          */
  #define SIMIF_EVENTS_ATRTIMEOUT_EVENTS_ATRTIMEOUT_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define SIMIF_EVENTS_ATRTIMEOUT_EVENTS_ATRTIMEOUT_Generated (0x1UL) /*!< Event generated                                     */


/* SIMIF_EVENTS_CWTIMEOUT: T=1 character wait timeout */
  #define SIMIF_EVENTS_CWTIMEOUT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CWTIMEOUT register.                      */

/* EVENTS_CWTIMEOUT @Bit 0 : T=1 character wait timeout */
  #define SIMIF_EVENTS_CWTIMEOUT_EVENTS_CWTIMEOUT_Pos (0UL) /*!< Position of EVENTS_CWTIMEOUT field.                           */
  #define SIMIF_EVENTS_CWTIMEOUT_EVENTS_CWTIMEOUT_Msk (0x1UL << SIMIF_EVENTS_CWTIMEOUT_EVENTS_CWTIMEOUT_Pos) /*!< Bit mask of
                                                                            EVENTS_CWTIMEOUT field.*/                             
  #define SIMIF_EVENTS_CWTIMEOUT_EVENTS_CWTIMEOUT_Min (0x0UL) /*!< Min enumerator value of EVENTS_CWTIMEOUT field.             */
  #define SIMIF_EVENTS_CWTIMEOUT_EVENTS_CWTIMEOUT_Max (0x1UL) /*!< Max enumerator value of EVENTS_CWTIMEOUT field.             */
  #define SIMIF_EVENTS_CWTIMEOUT_EVENTS_CWTIMEOUT_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define SIMIF_EVENTS_CWTIMEOUT_EVENTS_CWTIMEOUT_Generated (0x1UL) /*!< Event generated                                       */


/* SIMIF_EVENTS_BWTIMEOUT: Block Wait timeout */
  #define SIMIF_EVENTS_BWTIMEOUT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_BWTIMEOUT register.                      */

/* EVENTS_BWTIMEOUT @Bit 0 : Block Wait timeout */
  #define SIMIF_EVENTS_BWTIMEOUT_EVENTS_BWTIMEOUT_Pos (0UL) /*!< Position of EVENTS_BWTIMEOUT field.                           */
  #define SIMIF_EVENTS_BWTIMEOUT_EVENTS_BWTIMEOUT_Msk (0x1UL << SIMIF_EVENTS_BWTIMEOUT_EVENTS_BWTIMEOUT_Pos) /*!< Bit mask of
                                                                            EVENTS_BWTIMEOUT field.*/                             
  #define SIMIF_EVENTS_BWTIMEOUT_EVENTS_BWTIMEOUT_Min (0x0UL) /*!< Min enumerator value of EVENTS_BWTIMEOUT field.             */
  #define SIMIF_EVENTS_BWTIMEOUT_EVENTS_BWTIMEOUT_Max (0x1UL) /*!< Max enumerator value of EVENTS_BWTIMEOUT field.             */
  #define SIMIF_EVENTS_BWTIMEOUT_EVENTS_BWTIMEOUT_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define SIMIF_EVENTS_BWTIMEOUT_EVENTS_BWTIMEOUT_Generated (0x1UL) /*!< Event generated                                       */


