adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SIMIF_EVENTS_SW1SW2: SW1 and SW2 bytes received */
  #define SIMIF_EVENTS_SW1SW2_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SW1SW2 register.                            */

/* EVENTS_SW1SW2 @Bit 0 : SW1 and SW2 bytes received */
  #define SIMIF_EVENTS_SW1SW2_EVENTS_SW1SW2_Pos (0UL) /*!< Position of EVENTS_SW1SW2 field.                                    */
  #define SIMIF_EVENTS_SW1SW2_EVENTS_SW1SW2_Msk (0x1UL << SIMIF_EVENTS_SW1SW2_EVENTS_SW1SW2_Pos) /*!< Bit mask of EVENTS_SW1SW2
                                                                            field.*/                                              
  #define SIMIF_EVENTS_SW1SW2_EVENTS_SW1SW2_Min (0x0UL) /*!< Min enumerator value of EVENTS_SW1SW2 field.                      */
  #define SIMIF_EVENTS_SW1SW2_EVENTS_SW1SW2_Max (0x1UL) /*!< Max enumerator value of EVENTS_SW1SW2 field.                      */
  #define SIMIF_EVENTS_SW1SW2_EVENTS_SW1SW2_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define SIMIF_EVENTS_SW1SW2_EVENTS_SW1SW2_Generated (0x1UL) /*!< Event generated                                             */


/* SIMIF_EVENTS_RESET: Everything reset */
  #define SIMIF_EVENTS_RESET_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RESET register.                              */

/* EVENTS_RESET @Bit 0 : Everything reset */
  #define SIMIF_EVENTS_RESET_EVENTS_RESET_Pos (0UL)  /*!< Position of EVENTS_RESET field.                                      */
  #define SIMIF_EVENTS_RESET_EVENTS_RESET_Msk (0x1UL << SIMIF_EVENTS_RESET_EVENTS_RESET_Pos) /*!< Bit mask of EVENTS_RESET
                                                                            field.*/                                              
  #define SIMIF_EVENTS_RESET_EVENTS_RESET_Min (0x0UL) /*!< Min enumerator value of EVENTS_RESET field.                         */
  #define SIMIF_EVENTS_RESET_EVENTS_RESET_Max (0x1UL) /*!< Max enumerator value of EVENTS_RESET field.                         */
  #define SIMIF_EVENTS_RESET_EVENTS_RESET_NotGenerated (0x0UL) /*!< Event not generated                                        */
  #define SIMIF_EVENTS_RESET_EVENTS_RESET_Generated (0x1UL) /*!< Event generated                                               */


/* SIMIF_EVENTS_INS: T=0 procedure byte INS received */
  #define SIMIF_EVENTS_INS_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_INS register.                                  */

/* EVENTS_INS @Bit 0 : T=0 procedure byte INS received */
  #define SIMIF_EVENTS_INS_EVENTS_INS_Pos (0UL)      /*!< Position of EVENTS_INS field.                                        */
  #define SIMIF_EVENTS_INS_EVENTS_INS_Msk (0x1UL << SIMIF_EVENTS_INS_EVENTS_INS_Pos) /*!< Bit mask of EVENTS_INS field.        */
  #define SIMIF_EVENTS_INS_EVENTS_INS_Min (0x0UL)    /*!< Min enumerator value of EVENTS_INS field.                            */
  #define SIMIF_EVENTS_INS_EVENTS_INS_Max (0x1UL)    /*!< Max enumerator value of EVENTS_INS field.                            */
  #define SIMIF_EVENTS_INS_EVENTS_INS_NotGenerated (0x0UL) /*!< Event not generated                                            */
  #define SIMIF_EVENTS_INS_EVENTS_INS_Generated (0x1UL) /*!< Event generated                                                   */


/* SIMIF_EVENTS_NINS: T=0 procedure byte !INS received */
  #define SIMIF_EVENTS_NINS_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_NINS register.                                */

/* EVENTS_NINS @Bit 0 : T=0 procedure byte !INS received */
  #define SIMIF_EVENTS_NINS_EVENTS_NINS_Pos (0UL)    /*!< Position of EVENTS_NINS field.                                       */
  #define SIMIF_EVENTS_NINS_EVENTS_NINS_Msk (0x1UL << SIMIF_EVENTS_NINS_EVENTS_NINS_Pos) /*!< Bit mask of EVENTS_NINS field.   */
  #define SIMIF_EVENTS_NINS_EVENTS_NINS_Min (0x0UL)  /*!< Min enumerator value of EVENTS_NINS field.                           */
  #define SIMIF_EVENTS_NINS_EVENTS_NINS_Max (0x1UL)  /*!< Max enumerator value of EVENTS_NINS field.                           */
  #define SIMIF_EVENTS_NINS_EVENTS_NINS_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define SIMIF_EVENTS_NINS_EVENTS_NINS_Generated (0x1UL) /*!< Event generated                                                 */


/* SIMIF_EVENTS_ERROR: Error response */
  #define SIMIF_EVENTS_ERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERROR register.                              */

/* EVENTS_ERROR @Bit 0 : Error response */
  #define SIMIF_EVENTS_ERROR_EVENTS_ERROR_Pos (0UL)  /*!< Position of EVENTS_ERROR field.                                      */
  #define SIMIF_EVENTS_ERROR_EVENTS_ERROR_Msk (0x1UL << SIMIF_EVENTS_ERROR_EVENTS_ERROR_Pos) /*!< Bit mask of EVENTS_ERROR
                                                                            field.*/                                              
  #define SIMIF_EVENTS_ERROR_EVENTS_ERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERROR field.                         */
  #define SIMIF_EVENTS_ERROR_EVENTS_ERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERROR field.                         */
  #define SIMIF_EVENTS_ERROR_EVENTS_ERROR_NotGenerated (0x0UL) /*!< Event not generated                                        */
  #define SIMIF_EVENTS_ERROR_EVENTS_ERROR_Generated (0x1UL) /*!< Event generated                                               */


/* SIMIF_EVENTS_READYTX: Byte sent after START_WRITE_FROM_REG */
  #define SIMIF_EVENTS_READYTX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READYTX register.                          */

/* EVENTS_READYTX @Bit 0 : Byte sent after START_WRITE_FROM_REG */
  #define SIMIF_EVENTS_READYTX_EVENTS_READYTX_Pos (0UL) /*!< Position of EVENTS_READYTX field.                                 */
  #define SIMIF_EVENTS_READYTX_EVENTS_READYTX_Msk (0x1UL << SIMIF_EVENTS_READYTX_EVENTS_READYTX_Pos) /*!< Bit mask of
                                                                            EVENTS_READYTX field.*/                               
  #define SIMIF_EVENTS_READYTX_EVENTS_READYTX_Min (0x0UL) /*!< Min enumerator value of EVENTS_READYTX field.                   */
  #define SIMIF_EVENTS_READYTX_EVENTS_READYTX_Max (0x1UL) /*!< Max enumerator value of EVENTS_READYTX field.                   */
  #define SIMIF_EVENTS_READYTX_EVENTS_READYTX_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define SIMIF_EVENTS_READYTX_EVENTS_READYTX_Generated (0x1UL) /*!< Event generated                                           */


/* SIMIF_EVENTS_RXDATAREADY: Byte received after START_READ_TO_REG */
  #define SIMIF_EVENTS_RXDATAREADY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXDATAREADY register.                  */

/* EVENTS_RXDATAREADY @Bit 0 : Byte received after START_READ_TO_REG */
  #define SIMIF_EVENTS_RXDATAREADY_EVENTS_RXDATAREADY_Pos (0UL) /*!< Position of EVENTS_RXDATAREADY field.                     */
  #define SIMIF_EVENTS_RXDATAREADY_EVENTS_RXDATAREADY_Msk (0x1UL << SIMIF_EVENTS_RXDATAREADY_EVENTS_RXDATAREADY_Pos) /*!< Bit
                                                                            mask of EVENTS_RXDATAREADY field.*/                   
  #define SIMIF_EVENTS_RXDATAREADY_EVENTS_RXDATAREADY_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXDATAREADY field.       */
  #define SIMIF_EVENTS_RXDATAREADY_EVENTS_RXDATAREADY_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXDATAREADY field.       */
  #define SIMIF_EVENTS_RXDATAREADY_EVENTS_RXDATAREADY_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define SIMIF_EVENTS_RXDATAREADY_EVENTS_RXDATAREADY_Generated (0x1UL) /*!< Event generated                                   */


/* SIMIF_EVENTS_T1RXOVERRUN: Unexpected bytes received after DMA RX[0...N], SW1SW2 in T=1 */
  #define SIMIF_EVENTS_T1RXOVERRUN_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_T1RXOVERRUN register.                  */

/* EVENTS_T1RXOVERRUN @Bit 0 : Unexpected bytes received after DMA RX[0...N], SW1SW2 in T=1 */
  #define SIMIF_EVENTS_T1RXOVERRUN_EVENTS_T1RXOVERRUN_Pos (0UL) /*!< Position of EVENTS_T1RXOVERRUN field.                     */
  #define SIMIF_EVENTS_T1RXOVERRUN_EVENTS_T1RXOVERRUN_Msk (0x1UL << SIMIF_EVENTS_T1RXOVERRUN_EVENTS_T1RXOVERRUN_Pos) /*!< Bit
                                                                            mask of EVENTS_T1RXOVERRUN field.*/                   
  #define SIMIF_EVENTS_T1RXOVERRUN_EVENTS_T1RXOVERRUN_Min (0x0UL) /*!< Min enumerator value of EVENTS_T1RXOVERRUN field.       */
  #define SIMIF_EVENTS_T1RXOVERRUN_EVENTS_T1RXOVERRUN_Max (0x1UL) /*!< Max enumerator value of EVENTS_T1RXOVERRUN field.       */
  #define SIMIF_EVENTS_T1RXOVERRUN_EVENTS_T1RXOVERRUN_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define SIMIF_EVENTS_T1RXOVERRUN_EVENTS_T1RXOVERRUN_Generated (0x1UL) /*!< Event generated                                   */


