adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* T1RXOVERRUN @Bit 16 : Enable or disable interrupt for event T1RXOVERRUN */
  #define SIMIF_INTEN_T1RXOVERRUN_Pos (16UL)         /*!< Position of T1RXOVERRUN field.                                       */
  #define SIMIF_INTEN_T1RXOVERRUN_Msk (0x1UL << SIMIF_INTEN_T1RXOVERRUN_Pos) /*!< Bit mask of T1RXOVERRUN field.               */
  #define SIMIF_INTEN_T1RXOVERRUN_Min (0x0UL)        /*!< Min enumerator value of T1RXOVERRUN field.                           */
  #define SIMIF_INTEN_T1RXOVERRUN_Max (0x1UL)        /*!< Max enumerator value of T1RXOVERRUN field.                           */
  #define SIMIF_INTEN_T1RXOVERRUN_Disabled (0x0UL)   /*!< Disable                                                              */
  #define SIMIF_INTEN_T1RXOVERRUN_Enabled (0x1UL)    /*!< Enable                                                               */

/* T1TXABORTED @Bit 17 : Enable or disable interrupt for event T1TXABORTED */
  #define SIMIF_INTEN_T1TXABORTED_Pos (17UL)         /*!< Position of T1TXABORTED field.                                       */
  #define SIMIF_INTEN_T1TXABORTED_Msk (0x1UL << SIMIF_INTEN_T1TXABORTED_Pos) /*!< Bit mask of T1TXABORTED field.               */
  #define SIMIF_INTEN_T1TXABORTED_Min (0x0UL)        /*!< Min enumerator value of T1TXABORTED field.                           */
  #define SIMIF_INTEN_T1TXABORTED_Max (0x1UL)        /*!< Max enumerator value of T1TXABORTED field.                           */
  #define SIMIF_INTEN_T1TXABORTED_Disabled (0x0UL)   /*!< Disable                                                              */
  #define SIMIF_INTEN_T1TXABORTED_Enabled (0x1UL)    /*!< Enable                                                               */

/* T1NONIBLOCK @Bit 18 : Enable or disable interrupt for event T1NONIBLOCK */
  #define SIMIF_INTEN_T1NONIBLOCK_Pos (18UL)         /*!< Position of T1NONIBLOCK field.                                       */
  #define SIMIF_INTEN_T1NONIBLOCK_Msk (0x1UL << SIMIF_INTEN_T1NONIBLOCK_Pos) /*!< Bit mask of T1NONIBLOCK field.               */
  #define SIMIF_INTEN_T1NONIBLOCK_Min (0x0UL)        /*!< Min enumerator value of T1NONIBLOCK field.                           */
  #define SIMIF_INTEN_T1NONIBLOCK_Max (0x1UL)        /*!< Max enumerator value of T1NONIBLOCK field.                           */
  #define SIMIF_INTEN_T1NONIBLOCK_Disabled (0x0UL)   /*!< Disable                                                              */
  #define SIMIF_INTEN_T1NONIBLOCK_Enabled (0x1UL)    /*!< Enable                                                               */

/* T1LENERROR @Bit 19 : Enable or disable interrupt for event T1LENERROR */
  #define SIMIF_INTEN_T1LENERROR_Pos (19UL)          /*!< Position of T1LENERROR field.                                        */
  #define SIMIF_INTEN_T1LENERROR_Msk (0x1UL << SIMIF_INTEN_T1LENERROR_Pos) /*!< Bit mask of T1LENERROR field.                  */
  #define SIMIF_INTEN_T1LENERROR_Min (0x0UL)         /*!< Min enumerator value of T1LENERROR field.                            */
  #define SIMIF_INTEN_T1LENERROR_Max (0x1UL)         /*!< Max enumerator value of T1LENERROR field.                            */
  #define SIMIF_INTEN_T1LENERROR_Disabled (0x0UL)    /*!< Disable                                                              */
  #define SIMIF_INTEN_T1LENERROR_Enabled (0x1UL)     /*!< Enable                                                               */

/* EDCERROR @Bit 20 : Enable or disable interrupt for event EDCERROR */
  #define SIMIF_INTEN_EDCERROR_Pos (20UL)            /*!< Position of EDCERROR field.                                          */
  #define SIMIF_INTEN_EDCERROR_Msk (0x1UL << SIMIF_INTEN_EDCERROR_Pos) /*!< Bit mask of EDCERROR field.                        */
  #define SIMIF_INTEN_EDCERROR_Min (0x0UL)           /*!< Min enumerator value of EDCERROR field.                              */
  #define SIMIF_INTEN_EDCERROR_Max (0x1UL)           /*!< Max enumerator value of EDCERROR field.                              */
  #define SIMIF_INTEN_EDCERROR_Disabled (0x0UL)      /*!< Disable                                                              */
  #define SIMIF_INTEN_EDCERROR_Enabled (0x1UL)       /*!< Enable                                                               */

/* NADERROR @Bit 21 : Enable or disable interrupt for event NADERROR */
  #define SIMIF_INTEN_NADERROR_Pos (21UL)            /*!< Position of NADERROR field.                                          */
  #define SIMIF_INTEN_NADERROR_Msk (0x1UL << SIMIF_INTEN_NADERROR_Pos) /*!< Bit mask of NADERROR field.                        */
  #define SIMIF_INTEN_NADERROR_Min (0x0UL)           /*!< Min enumerator value of NADERROR field.                              */
  #define SIMIF_INTEN_NADERROR_Max (0x1UL)           /*!< Max enumerator value of NADERROR field.                              */
  #define SIMIF_INTEN_NADERROR_Disabled (0x0UL)      /*!< Disable                                                              */
  #define SIMIF_INTEN_NADERROR_Enabled (0x1UL)       /*!< Enable                                                               */

/* ERRORCOUNTMAX @Bit 22 : Enable or disable interrupt for event ERRORCOUNTMAX */
  #define SIMIF_INTEN_ERRORCOUNTMAX_Pos (22UL)       /*!< Position of ERRORCOUNTMAX field.                                     */
  #define SIMIF_INTEN_ERRORCOUNTMAX_Msk (0x1UL << SIMIF_INTEN_ERRORCOUNTMAX_Pos) /*!< Bit mask of ERRORCOUNTMAX field.         */
  #define SIMIF_INTEN_ERRORCOUNTMAX_Min (0x0UL)      /*!< Min enumerator value of ERRORCOUNTMAX field.                         */
  #define SIMIF_INTEN_ERRORCOUNTMAX_Max (0x1UL)      /*!< Max enumerator value of ERRORCOUNTMAX field.                         */
  #define SIMIF_INTEN_ERRORCOUNTMAX_Disabled (0x0UL) /*!< Disable                                                              */
  #define SIMIF_INTEN_ERRORCOUNTMAX_Enabled (0x1UL)  /*!< Enable                                                               */

/* T1RXMORE @Bit 23 : Enable or disable interrupt for event T1RXMORE */
  #define SIMIF_INTEN_T1RXMORE_Pos (23UL)            /*!< Position of T1RXMORE field.                                          */
  #define SIMIF_INTEN_T1RXMORE_Msk (0x1UL << SIMIF_INTEN_T1RXMORE_Pos) /*!< Bit mask of T1RXMORE field.                        */
  #define SIMIF_INTEN_T1RXMORE_Min (0x0UL)           /*!< Min enumerator value of T1RXMORE field.                              */
  #define SIMIF_INTEN_T1RXMORE_Max (0x1UL)           /*!< Max enumerator value of T1RXMORE field.                              */
  #define SIMIF_INTEN_T1RXMORE_Disabled (0x0UL)      /*!< Disable                                                              */
  #define SIMIF_INTEN_T1RXMORE_Enabled (0x1UL)       /*!< Enable                                                               */

/* T1RXFRAMEEND @Bit 24 : Enable or disable interrupt for event T1RXFRAMEEND */
  #define SIMIF_INTEN_T1RXFRAMEEND_Pos (24UL)        /*!< Position of T1RXFRAMEEND field.                                      */
  #define SIMIF_INTEN_T1RXFRAMEEND_Msk (0x1UL << SIMIF_INTEN_T1RXFRAMEEND_Pos) /*!< Bit mask of T1RXFRAMEEND field.            */
  #define SIMIF_INTEN_T1RXFRAMEEND_Min (0x0UL)       /*!< Min enumerator value of T1RXFRAMEEND field.                          */
  #define SIMIF_INTEN_T1RXFRAMEEND_Max (0x1UL)       /*!< Max enumerator value of T1RXFRAMEEND field.                          */
  #define SIMIF_INTEN_T1RXFRAMEEND_Disabled (0x0UL)  /*!< Disable                                                              */
  #define SIMIF_INTEN_T1RXFRAMEEND_Enabled (0x1UL)   /*!< Enable                                                               */


/* SIMIF_INTENSET: Enable interrupt */
  #define SIMIF_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

