adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* T1TXABORTED @Bit 17 : Write '1' to enable interrupt for event T1TXABORTED */
  #define SIMIF_INTENSET_T1TXABORTED_Pos (17UL)      /*!< Position of T1TXABORTED field.                                       */
  #define SIMIF_INTENSET_T1TXABORTED_Msk (0x1UL << SIMIF_INTENSET_T1TXABORTED_Pos) /*!< Bit mask of T1TXABORTED field.         */
  #define SIMIF_INTENSET_T1TXABORTED_Min (0x0UL)     /*!< Min enumerator value of T1TXABORTED field.                           */
  #define SIMIF_INTENSET_T1TXABORTED_Max (0x1UL)     /*!< Max enumerator value of T1TXABORTED field.                           */
  #define SIMIF_INTENSET_T1TXABORTED_Set (0x1UL)     /*!< Enable                                                               */
  #define SIMIF_INTENSET_T1TXABORTED_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define SIMIF_INTENSET_T1TXABORTED_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* T1NONIBLOCK @Bit 18 : Write '1' to enable interrupt for event T1NONIBLOCK */
  #define SIMIF_INTENSET_T1NONIBLOCK_Pos (18UL)      /*!< Position of T1NONIBLOCK field.                                       */
  #define SIMIF_INTENSET_T1NONIBLOCK_Msk (0x1UL << SIMIF_INTENSET_T1NONIBLOCK_Pos) /*!< Bit mask of T1NONIBLOCK field.         */
  #define SIMIF_INTENSET_T1NONIBLOCK_Min (0x0UL)     /*!< Min enumerator value of T1NONIBLOCK field.                           */
  #define SIMIF_INTENSET_T1NONIBLOCK_Max (0x1UL)     /*!< Max enumerator value of T1NONIBLOCK field.                           */
  #define SIMIF_INTENSET_T1NONIBLOCK_Set (0x1UL)     /*!< Enable                                                               */
  #define SIMIF_INTENSET_T1NONIBLOCK_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define SIMIF_INTENSET_T1NONIBLOCK_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* T1LENERROR @Bit 19 : Write '1' to enable interrupt for event T1LENERROR */
  #define SIMIF_INTENSET_T1LENERROR_Pos (19UL)       /*!< Position of T1LENERROR field.                                        */
  #define SIMIF_INTENSET_T1LENERROR_Msk (0x1UL << SIMIF_INTENSET_T1LENERROR_Pos) /*!< Bit mask of T1LENERROR field.            */
  #define SIMIF_INTENSET_T1LENERROR_Min (0x0UL)      /*!< Min enumerator value of T1LENERROR field.                            */
  #define SIMIF_INTENSET_T1LENERROR_Max (0x1UL)      /*!< Max enumerator value of T1LENERROR field.                            */
  #define SIMIF_INTENSET_T1LENERROR_Set (0x1UL)      /*!< Enable                                                               */
  #define SIMIF_INTENSET_T1LENERROR_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define SIMIF_INTENSET_T1LENERROR_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* EDCERROR @Bit 20 : Write '1' to enable interrupt for event EDCERROR */
  #define SIMIF_INTENSET_EDCERROR_Pos (20UL)         /*!< Position of EDCERROR field.                                          */
  #define SIMIF_INTENSET_EDCERROR_Msk (0x1UL << SIMIF_INTENSET_EDCERROR_Pos) /*!< Bit mask of EDCERROR field.                  */
  #define SIMIF_INTENSET_EDCERROR_Min (0x0UL)        /*!< Min enumerator value of EDCERROR field.                              */
  #define SIMIF_INTENSET_EDCERROR_Max (0x1UL)        /*!< Max enumerator value of EDCERROR field.                              */
  #define SIMIF_INTENSET_EDCERROR_Set (0x1UL)        /*!< Enable                                                               */
  #define SIMIF_INTENSET_EDCERROR_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define SIMIF_INTENSET_EDCERROR_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* NADERROR @Bit 21 : Write '1' to enable interrupt for event NADERROR */
  #define SIMIF_INTENSET_NADERROR_Pos (21UL)         /*!< Position of NADERROR field.                                          */
  #define SIMIF_INTENSET_NADERROR_Msk (0x1UL << SIMIF_INTENSET_NADERROR_Pos) /*!< Bit mask of NADERROR field.                  */
  #define SIMIF_INTENSET_NADERROR_Min (0x0UL)        /*!< Min enumerator value of NADERROR field.                              */
  #define SIMIF_INTENSET_NADERROR_Max (0x1UL)        /*!< Max enumerator value of NADERROR field.                              */
  #define SIMIF_INTENSET_NADERROR_Set (0x1UL)        /*!< Enable                                                               */
  #define SIMIF_INTENSET_NADERROR_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define SIMIF_INTENSET_NADERROR_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* ERRORCOUNTMAX @Bit 22 : Write '1' to enable interrupt for event ERRORCOUNTMAX */
  #define SIMIF_INTENSET_ERRORCOUNTMAX_Pos (22UL)    /*!< Position of ERRORCOUNTMAX field.                                     */
  #define SIMIF_INTENSET_ERRORCOUNTMAX_Msk (0x1UL << SIMIF_INTENSET_ERRORCOUNTMAX_Pos) /*!< Bit mask of ERRORCOUNTMAX field.   */
  #define SIMIF_INTENSET_ERRORCOUNTMAX_Min (0x0UL)   /*!< Min enumerator value of ERRORCOUNTMAX field.                         */
  #define SIMIF_INTENSET_ERRORCOUNTMAX_Max (0x1UL)   /*!< Max enumerator value of ERRORCOUNTMAX field.                         */
  #define SIMIF_INTENSET_ERRORCOUNTMAX_Set (0x1UL)   /*!< Enable                                                               */
  #define SIMIF_INTENSET_ERRORCOUNTMAX_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define SIMIF_INTENSET_ERRORCOUNTMAX_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* T1RXMORE @Bit 23 : Write '1' to enable interrupt for event T1RXMORE */
  #define SIMIF_INTENSET_T1RXMORE_Pos (23UL)         /*!< Position of T1RXMORE field.                                          */
  #define SIMIF_INTENSET_T1RXMORE_Msk (0x1UL << SIMIF_INTENSET_T1RXMORE_Pos) /*!< Bit mask of T1RXMORE field.                  */
  #define SIMIF_INTENSET_T1RXMORE_Min (0x0UL)        /*!< Min enumerator value of T1RXMORE field.                              */
  #define SIMIF_INTENSET_T1RXMORE_Max (0x1UL)        /*!< Max enumerator value of T1RXMORE field.                              */
  #define SIMIF_INTENSET_T1RXMORE_Set (0x1UL)        /*!< Enable                                                               */
  #define SIMIF_INTENSET_T1RXMORE_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define SIMIF_INTENSET_T1RXMORE_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* T1RXFRAMEEND @Bit 24 : Write '1' to enable interrupt for event T1RXFRAMEEND */
  #define SIMIF_INTENSET_T1RXFRAMEEND_Pos (24UL)     /*!< Position of T1RXFRAMEEND field.                                      */
  #define SIMIF_INTENSET_T1RXFRAMEEND_Msk (0x1UL << SIMIF_INTENSET_T1RXFRAMEEND_Pos) /*!< Bit mask of T1RXFRAMEEND field.      */
  #define SIMIF_INTENSET_T1RXFRAMEEND_Min (0x0UL)    /*!< Min enumerator value of T1RXFRAMEEND field.                          */
  #define SIMIF_INTENSET_T1RXFRAMEEND_Max (0x1UL)    /*!< Max enumerator value of T1RXFRAMEEND field.                          */
  #define SIMIF_INTENSET_T1RXFRAMEEND_Set (0x1UL)    /*!< Enable                                                               */
  #define SIMIF_INTENSET_T1RXFRAMEEND_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define SIMIF_INTENSET_T1RXFRAMEEND_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* SIMIF_INTENCLR: Disable interrupt */
  #define SIMIF_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* DMARXSTARTED @Bit 0 : Write '1' to disable interrupt for event DMARXSTARTED */
  #define SIMIF_INTENCLR_DMARXSTARTED_Pos (0UL)      /*!< Position of DMARXSTARTED field.                                      */
  #define SIMIF_INTENCLR_DMARXSTARTED_Msk (0x1UL << SIMIF_INTENCLR_DMARXSTARTED_Pos) /*!< Bit mask of DMARXSTARTED field.      */
  #define SIMIF_INTENCLR_DMARXSTARTED_Min (0x0UL)    /*!< Min enumerator value of DMARXSTARTED field.                          */
  #define SIMIF_INTENCLR_DMARXSTARTED_Max (0x1UL)    /*!< Max enumerator value of DMARXSTARTED field.                          */
  #define SIMIF_INTENCLR_DMARXSTARTED_Clear (0x1UL)  /*!< Disable                                                              */
  #define SIMIF_INTENCLR_DMARXSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define SIMIF_INTENCLR_DMARXSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

