adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DMARXDONE @Bit 1 : Write '1' to disable interrupt for event DMARXDONE */
  #define SIMIF_INTENCLR_DMARXDONE_Pos (1UL)         /*!< Position of DMARXDONE field.                                         */
  #define SIMIF_INTENCLR_DMARXDONE_Msk (0x1UL << SIMIF_INTENCLR_DMARXDONE_Pos) /*!< Bit mask of DMARXDONE field.               */
  #define SIMIF_INTENCLR_DMARXDONE_Min (0x0UL)       /*!< Min enumerator value of DMARXDONE field.                             */
  #define SIMIF_INTENCLR_DMARXDONE_Max (0x1UL)       /*!< Max enumerator value of DMARXDONE field.                             */
  #define SIMIF_INTENCLR_DMARXDONE_Clear (0x1UL)     /*!< Disable                                                              */
  #define SIMIF_INTENCLR_DMARXDONE_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SIMIF_INTENCLR_DMARXDONE_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* DMATXSTARTED @Bit 2 : Write '1' to disable interrupt for event DMATXSTARTED */
  #define SIMIF_INTENCLR_DMATXSTARTED_Pos (2UL)      /*!< Position of DMATXSTARTED field.                                      */
  #define SIMIF_INTENCLR_DMATXSTARTED_Msk (0x1UL << SIMIF_INTENCLR_DMATXSTARTED_Pos) /*!< Bit mask of DMATXSTARTED field.      */
  #define SIMIF_INTENCLR_DMATXSTARTED_Min (0x0UL)    /*!< Min enumerator value of DMATXSTARTED field.                          */
  #define SIMIF_INTENCLR_DMATXSTARTED_Max (0x1UL)    /*!< Max enumerator value of DMATXSTARTED field.                          */
  #define SIMIF_INTENCLR_DMATXSTARTED_Clear (0x1UL)  /*!< Disable                                                              */
  #define SIMIF_INTENCLR_DMATXSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define SIMIF_INTENCLR_DMATXSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* DMATXDONE @Bit 3 : Write '1' to disable interrupt for event DMATXDONE */
  #define SIMIF_INTENCLR_DMATXDONE_Pos (3UL)         /*!< Position of DMATXDONE field.                                         */
  #define SIMIF_INTENCLR_DMATXDONE_Msk (0x1UL << SIMIF_INTENCLR_DMATXDONE_Pos) /*!< Bit mask of DMATXDONE field.               */
  #define SIMIF_INTENCLR_DMATXDONE_Min (0x0UL)       /*!< Min enumerator value of DMATXDONE field.                             */
  #define SIMIF_INTENCLR_DMATXDONE_Max (0x1UL)       /*!< Max enumerator value of DMATXDONE field.                             */
  #define SIMIF_INTENCLR_DMATXDONE_Clear (0x1UL)     /*!< Disable                                                              */
  #define SIMIF_INTENCLR_DMATXDONE_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SIMIF_INTENCLR_DMATXDONE_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* INVALIDCONVENTION @Bit 4 : Write '1' to disable interrupt for event INVALIDCONVENTION */
  #define SIMIF_INTENCLR_INVALIDCONVENTION_Pos (4UL) /*!< Position of INVALIDCONVENTION field.                                 */
  #define SIMIF_INTENCLR_INVALIDCONVENTION_Msk (0x1UL << SIMIF_INTENCLR_INVALIDCONVENTION_Pos) /*!< Bit mask of
                                                                            INVALIDCONVENTION field.*/                            
  #define SIMIF_INTENCLR_INVALIDCONVENTION_Min (0x0UL) /*!< Min enumerator value of INVALIDCONVENTION field.                   */
  #define SIMIF_INTENCLR_INVALIDCONVENTION_Max (0x1UL) /*!< Max enumerator value of INVALIDCONVENTION field.                   */
  #define SIMIF_INTENCLR_INVALIDCONVENTION_Clear (0x1UL) /*!< Disable                                                          */
  #define SIMIF_INTENCLR_INVALIDCONVENTION_Disabled (0x0UL) /*!< Read: Disabled                                                */
  #define SIMIF_INTENCLR_INVALIDCONVENTION_Enabled (0x1UL) /*!< Read: Enabled                                                  */

/* PARITYERROR @Bit 5 : Write '1' to disable interrupt for event PARITYERROR */
  #define SIMIF_INTENCLR_PARITYERROR_Pos (5UL)       /*!< Position of PARITYERROR field.                                       */
  #define SIMIF_INTENCLR_PARITYERROR_Msk (0x1UL << SIMIF_INTENCLR_PARITYERROR_Pos) /*!< Bit mask of PARITYERROR field.         */
  #define SIMIF_INTENCLR_PARITYERROR_Min (0x0UL)     /*!< Min enumerator value of PARITYERROR field.                           */
  #define SIMIF_INTENCLR_PARITYERROR_Max (0x1UL)     /*!< Max enumerator value of PARITYERROR field.                           */
  #define SIMIF_INTENCLR_PARITYERROR_Clear (0x1UL)   /*!< Disable                                                              */
  #define SIMIF_INTENCLR_PARITYERROR_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define SIMIF_INTENCLR_PARITYERROR_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* ATRTIMEOUT @Bit 6 : Write '1' to disable interrupt for event ATRTIMEOUT */
  #define SIMIF_INTENCLR_ATRTIMEOUT_Pos (6UL)        /*!< Position of ATRTIMEOUT field.                                        */
  #define SIMIF_INTENCLR_ATRTIMEOUT_Msk (0x1UL << SIMIF_INTENCLR_ATRTIMEOUT_Pos) /*!< Bit mask of ATRTIMEOUT field.            */
  #define SIMIF_INTENCLR_ATRTIMEOUT_Min (0x0UL)      /*!< Min enumerator value of ATRTIMEOUT field.                            */
  #define SIMIF_INTENCLR_ATRTIMEOUT_Max (0x1UL)      /*!< Max enumerator value of ATRTIMEOUT field.                            */
  #define SIMIF_INTENCLR_ATRTIMEOUT_Clear (0x1UL)    /*!< Disable                                                              */
  #define SIMIF_INTENCLR_ATRTIMEOUT_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define SIMIF_INTENCLR_ATRTIMEOUT_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* CWTIMEOUT @Bit 7 : Write '1' to disable interrupt for event CWTIMEOUT */
  #define SIMIF_INTENCLR_CWTIMEOUT_Pos (7UL)         /*!< Position of CWTIMEOUT field.                                         */
  #define SIMIF_INTENCLR_CWTIMEOUT_Msk (0x1UL << SIMIF_INTENCLR_CWTIMEOUT_Pos) /*!< Bit mask of CWTIMEOUT field.               */
  #define SIMIF_INTENCLR_CWTIMEOUT_Min (0x0UL)       /*!< Min enumerator value of CWTIMEOUT field.                             */
  #define SIMIF_INTENCLR_CWTIMEOUT_Max (0x1UL)       /*!< Max enumerator value of CWTIMEOUT field.                             */
  #define SIMIF_INTENCLR_CWTIMEOUT_Clear (0x1UL)     /*!< Disable                                                              */
  #define SIMIF_INTENCLR_CWTIMEOUT_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SIMIF_INTENCLR_CWTIMEOUT_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

