adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* BWTIMEOUT @Bit 8 : Write '1' to disable interrupt for event BWTIMEOUT */
  #define SIMIF_INTENCLR_BWTIMEOUT_Pos (8UL)         /*!< Position of BWTIMEOUT field.                                         */
  #define SIMIF_INTENCLR_BWTIMEOUT_Msk (0x1UL << SIMIF_INTENCLR_BWTIMEOUT_Pos) /*!< Bit mask of BWTIMEOUT field.               */
  #define SIMIF_INTENCLR_BWTIMEOUT_Min (0x0UL)       /*!< Min enumerator value of BWTIMEOUT field.                             */
  #define SIMIF_INTENCLR_BWTIMEOUT_Max (0x1UL)       /*!< Max enumerator value of BWTIMEOUT field.                             */
  #define SIMIF_INTENCLR_BWTIMEOUT_Clear (0x1UL)     /*!< Disable                                                              */
  #define SIMIF_INTENCLR_BWTIMEOUT_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SIMIF_INTENCLR_BWTIMEOUT_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* SW1SW2 @Bit 9 : Write '1' to disable interrupt for event SW1SW2 */
  #define SIMIF_INTENCLR_SW1SW2_Pos (9UL)            /*!< Position of SW1SW2 field.                                            */
  #define SIMIF_INTENCLR_SW1SW2_Msk (0x1UL << SIMIF_INTENCLR_SW1SW2_Pos) /*!< Bit mask of SW1SW2 field.                        */
  #define SIMIF_INTENCLR_SW1SW2_Min (0x0UL)          /*!< Min enumerator value of SW1SW2 field.                                */
  #define SIMIF_INTENCLR_SW1SW2_Max (0x1UL)          /*!< Max enumerator value of SW1SW2 field.                                */
  #define SIMIF_INTENCLR_SW1SW2_Clear (0x1UL)        /*!< Disable                                                              */
  #define SIMIF_INTENCLR_SW1SW2_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define SIMIF_INTENCLR_SW1SW2_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* RESET @Bit 10 : Write '1' to disable interrupt for event RESET */
  #define SIMIF_INTENCLR_RESET_Pos (10UL)            /*!< Position of RESET field.                                             */
  #define SIMIF_INTENCLR_RESET_Msk (0x1UL << SIMIF_INTENCLR_RESET_Pos) /*!< Bit mask of RESET field.                           */
  #define SIMIF_INTENCLR_RESET_Min (0x0UL)           /*!< Min enumerator value of RESET field.                                 */
  #define SIMIF_INTENCLR_RESET_Max (0x1UL)           /*!< Max enumerator value of RESET field.                                 */
  #define SIMIF_INTENCLR_RESET_Clear (0x1UL)         /*!< Disable                                                              */
  #define SIMIF_INTENCLR_RESET_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define SIMIF_INTENCLR_RESET_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* INS @Bit 11 : Write '1' to disable interrupt for event INS */
  #define SIMIF_INTENCLR_INS_Pos (11UL)              /*!< Position of INS field.                                               */
  #define SIMIF_INTENCLR_INS_Msk (0x1UL << SIMIF_INTENCLR_INS_Pos) /*!< Bit mask of INS field.                                 */
  #define SIMIF_INTENCLR_INS_Min (0x0UL)             /*!< Min enumerator value of INS field.                                   */
  #define SIMIF_INTENCLR_INS_Max (0x1UL)             /*!< Max enumerator value of INS field.                                   */
  #define SIMIF_INTENCLR_INS_Clear (0x1UL)           /*!< Disable                                                              */
  #define SIMIF_INTENCLR_INS_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define SIMIF_INTENCLR_INS_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* NINS @Bit 12 : Write '1' to disable interrupt for event NINS */
  #define SIMIF_INTENCLR_NINS_Pos (12UL)             /*!< Position of NINS field.                                              */
  #define SIMIF_INTENCLR_NINS_Msk (0x1UL << SIMIF_INTENCLR_NINS_Pos) /*!< Bit mask of NINS field.                              */
  #define SIMIF_INTENCLR_NINS_Min (0x0UL)            /*!< Min enumerator value of NINS field.                                  */
  #define SIMIF_INTENCLR_NINS_Max (0x1UL)            /*!< Max enumerator value of NINS field.                                  */
  #define SIMIF_INTENCLR_NINS_Clear (0x1UL)          /*!< Disable                                                              */
  #define SIMIF_INTENCLR_NINS_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define SIMIF_INTENCLR_NINS_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* ERROR @Bit 13 : Write '1' to disable interrupt for event ERROR */
  #define SIMIF_INTENCLR_ERROR_Pos (13UL)            /*!< Position of ERROR field.                                             */
  #define SIMIF_INTENCLR_ERROR_Msk (0x1UL << SIMIF_INTENCLR_ERROR_Pos) /*!< Bit mask of ERROR field.                           */
  #define SIMIF_INTENCLR_ERROR_Min (0x0UL)           /*!< Min enumerator value of ERROR field.                                 */
  #define SIMIF_INTENCLR_ERROR_Max (0x1UL)           /*!< Max enumerator value of ERROR field.                                 */
  #define SIMIF_INTENCLR_ERROR_Clear (0x1UL)         /*!< Disable                                                              */
  #define SIMIF_INTENCLR_ERROR_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define SIMIF_INTENCLR_ERROR_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* READYTX @Bit 14 : Write '1' to disable interrupt for event READYTX */
  #define SIMIF_INTENCLR_READYTX_Pos (14UL)          /*!< Position of READYTX field.                                           */
  #define SIMIF_INTENCLR_READYTX_Msk (0x1UL << SIMIF_INTENCLR_READYTX_Pos) /*!< Bit mask of READYTX field.                     */
  #define SIMIF_INTENCLR_READYTX_Min (0x0UL)         /*!< Min enumerator value of READYTX field.                               */
  #define SIMIF_INTENCLR_READYTX_Max (0x1UL)         /*!< Max enumerator value of READYTX field.                               */
  #define SIMIF_INTENCLR_READYTX_Clear (0x1UL)       /*!< Disable                                                              */
  #define SIMIF_INTENCLR_READYTX_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define SIMIF_INTENCLR_READYTX_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* RXDATAREADY @Bit 15 : Write '1' to disable interrupt for event RXDATAREADY */
  #define SIMIF_INTENCLR_RXDATAREADY_Pos (15UL)      /*!< Position of RXDATAREADY field.                                       */
  #define SIMIF_INTENCLR_RXDATAREADY_Msk (0x1UL << SIMIF_INTENCLR_RXDATAREADY_Pos) /*!< Bit mask of RXDATAREADY field.         */
  #define SIMIF_INTENCLR_RXDATAREADY_Min (0x0UL)     /*!< Min enumerator value of RXDATAREADY field.                           */
  #define SIMIF_INTENCLR_RXDATAREADY_Max (0x1UL)     /*!< Max enumerator value of RXDATAREADY field.                           */
  #define SIMIF_INTENCLR_RXDATAREADY_Clear (0x1UL)   /*!< Disable                                                              */
  #define SIMIF_INTENCLR_RXDATAREADY_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define SIMIF_INTENCLR_RXDATAREADY_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* T1RXOVERRUN @Bit 16 : Write '1' to disable interrupt for event T1RXOVERRUN */
  #define SIMIF_INTENCLR_T1RXOVERRUN_Pos (16UL)      /*!< Position of T1RXOVERRUN field.                                       */
  #define SIMIF_INTENCLR_T1RXOVERRUN_Msk (0x1UL << SIMIF_INTENCLR_T1RXOVERRUN_Pos) /*!< Bit mask of T1RXOVERRUN field.         */
  #define SIMIF_INTENCLR_T1RXOVERRUN_Min (0x0UL)     /*!< Min enumerator value of T1RXOVERRUN field.                           */
  #define SIMIF_INTENCLR_T1RXOVERRUN_Max (0x1UL)     /*!< Max enumerator value of T1RXOVERRUN field.                           */
  #define SIMIF_INTENCLR_T1RXOVERRUN_Clear (0x1UL)   /*!< Disable                                                              */
  #define SIMIF_INTENCLR_T1RXOVERRUN_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define SIMIF_INTENCLR_T1RXOVERRUN_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* T1TXABORTED @Bit 17 : Write '1' to disable interrupt for event T1TXABORTED */
  #define SIMIF_INTENCLR_T1TXABORTED_Pos (17UL)      /*!< Position of T1TXABORTED field.                                       */
  #define SIMIF_INTENCLR_T1TXABORTED_Msk (0x1UL << SIMIF_INTENCLR_T1TXABORTED_Pos) /*!< Bit mask of T1TXABORTED field.         */
  #define SIMIF_INTENCLR_T1TXABORTED_Min (0x0UL)     /*!< Min enumerator value of T1TXABORTED field.                           */
  #define SIMIF_INTENCLR_T1TXABORTED_Max (0x1UL)     /*!< Max enumerator value of T1TXABORTED field.                           */
  #define SIMIF_INTENCLR_T1TXABORTED_Clear (0x1UL)   /*!< Disable                                                              */
  #define SIMIF_INTENCLR_T1TXABORTED_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define SIMIF_INTENCLR_T1TXABORTED_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* T1NONIBLOCK @Bit 18 : Write '1' to disable interrupt for event T1NONIBLOCK */
  #define SIMIF_INTENCLR_T1NONIBLOCK_Pos (18UL)      /*!< Position of T1NONIBLOCK field.                                       */
  #define SIMIF_INTENCLR_T1NONIBLOCK_Msk (0x1UL << SIMIF_INTENCLR_T1NONIBLOCK_Pos) /*!< Bit mask of T1NONIBLOCK field.         */
  #define SIMIF_INTENCLR_T1NONIBLOCK_Min (0x0UL)     /*!< Min enumerator value of T1NONIBLOCK field.                           */
  #define SIMIF_INTENCLR_T1NONIBLOCK_Max (0x1UL)     /*!< Max enumerator value of T1NONIBLOCK field.                           */
  #define SIMIF_INTENCLR_T1NONIBLOCK_Clear (0x1UL)   /*!< Disable                                                              */
  #define SIMIF_INTENCLR_T1NONIBLOCK_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define SIMIF_INTENCLR_T1NONIBLOCK_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* T1LENERROR @Bit 19 : Write '1' to disable interrupt for event T1LENERROR */
  #define SIMIF_INTENCLR_T1LENERROR_Pos (19UL)       /*!< Position of T1LENERROR field.                                        */
  #define SIMIF_INTENCLR_T1LENERROR_Msk (0x1UL << SIMIF_INTENCLR_T1LENERROR_Pos) /*!< Bit mask of T1LENERROR field.            */
  #define SIMIF_INTENCLR_T1LENERROR_Min (0x0UL)      /*!< Min enumerator value of T1LENERROR field.                            */
  #define SIMIF_INTENCLR_T1LENERROR_Max (0x1UL)      /*!< Max enumerator value of T1LENERROR field.                            */
  #define SIMIF_INTENCLR_T1LENERROR_Clear (0x1UL)    /*!< Disable                                                              */
  #define SIMIF_INTENCLR_T1LENERROR_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define SIMIF_INTENCLR_T1LENERROR_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

