adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EDCERROR @Bit 20 : Write '1' to disable interrupt for event EDCERROR */
  #define SIMIF_INTENCLR_EDCERROR_Pos (20UL)         /*!< Position of EDCERROR field.                                          */
  #define SIMIF_INTENCLR_EDCERROR_Msk (0x1UL << SIMIF_INTENCLR_EDCERROR_Pos) /*!< Bit mask of EDCERROR field.                  */
  #define SIMIF_INTENCLR_EDCERROR_Min (0x0UL)        /*!< Min enumerator value of EDCERROR field.                              */
  #define SIMIF_INTENCLR_EDCERROR_Max (0x1UL)        /*!< Max enumerator value of EDCERROR field.                              */
  #define SIMIF_INTENCLR_EDCERROR_Clear (0x1UL)      /*!< Disable                                                              */
  #define SIMIF_INTENCLR_EDCERROR_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define SIMIF_INTENCLR_EDCERROR_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* NADERROR @Bit 21 : Write '1' to disable interrupt for event NADERROR */
  #define SIMIF_INTENCLR_NADERROR_Pos (21UL)         /*!< Position of NADERROR field.                                          */
  #define SIMIF_INTENCLR_NADERROR_Msk (0x1UL << SIMIF_INTENCLR_NADERROR_Pos) /*!< Bit mask of NADERROR field.                  */
  #define SIMIF_INTENCLR_NADERROR_Min (0x0UL)        /*!< Min enumerator value of NADERROR field.                              */
  #define SIMIF_INTENCLR_NADERROR_Max (0x1UL)        /*!< Max enumerator value of NADERROR field.                              */
  #define SIMIF_INTENCLR_NADERROR_Clear (0x1UL)      /*!< Disable                                                              */
  #define SIMIF_INTENCLR_NADERROR_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define SIMIF_INTENCLR_NADERROR_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* ERRORCOUNTMAX @Bit 22 : Write '1' to disable interrupt for event ERRORCOUNTMAX */
  #define SIMIF_INTENCLR_ERRORCOUNTMAX_Pos (22UL)    /*!< Position of ERRORCOUNTMAX field.                                     */
  #define SIMIF_INTENCLR_ERRORCOUNTMAX_Msk (0x1UL << SIMIF_INTENCLR_ERRORCOUNTMAX_Pos) /*!< Bit mask of ERRORCOUNTMAX field.   */
  #define SIMIF_INTENCLR_ERRORCOUNTMAX_Min (0x0UL)   /*!< Min enumerator value of ERRORCOUNTMAX field.                         */
  #define SIMIF_INTENCLR_ERRORCOUNTMAX_Max (0x1UL)   /*!< Max enumerator value of ERRORCOUNTMAX field.                         */
  #define SIMIF_INTENCLR_ERRORCOUNTMAX_Clear (0x1UL) /*!< Disable                                                              */
  #define SIMIF_INTENCLR_ERRORCOUNTMAX_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define SIMIF_INTENCLR_ERRORCOUNTMAX_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* T1RXMORE @Bit 23 : Write '1' to disable interrupt for event T1RXMORE */
  #define SIMIF_INTENCLR_T1RXMORE_Pos (23UL)         /*!< Position of T1RXMORE field.                                          */
  #define SIMIF_INTENCLR_T1RXMORE_Msk (0x1UL << SIMIF_INTENCLR_T1RXMORE_Pos) /*!< Bit mask of T1RXMORE field.                  */
  #define SIMIF_INTENCLR_T1RXMORE_Min (0x0UL)        /*!< Min enumerator value of T1RXMORE field.                              */
  #define SIMIF_INTENCLR_T1RXMORE_Max (0x1UL)        /*!< Max enumerator value of T1RXMORE field.                              */
  #define SIMIF_INTENCLR_T1RXMORE_Clear (0x1UL)      /*!< Disable                                                              */
  #define SIMIF_INTENCLR_T1RXMORE_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define SIMIF_INTENCLR_T1RXMORE_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* T1RXFRAMEEND @Bit 24 : Write '1' to disable interrupt for event T1RXFRAMEEND */
  #define SIMIF_INTENCLR_T1RXFRAMEEND_Pos (24UL)     /*!< Position of T1RXFRAMEEND field.                                      */
  #define SIMIF_INTENCLR_T1RXFRAMEEND_Msk (0x1UL << SIMIF_INTENCLR_T1RXFRAMEEND_Pos) /*!< Bit mask of T1RXFRAMEEND field.      */
  #define SIMIF_INTENCLR_T1RXFRAMEEND_Min (0x0UL)    /*!< Min enumerator value of T1RXFRAMEEND field.                          */
  #define SIMIF_INTENCLR_T1RXFRAMEEND_Max (0x1UL)    /*!< Max enumerator value of T1RXFRAMEEND field.                          */
  #define SIMIF_INTENCLR_T1RXFRAMEEND_Clear (0x1UL)  /*!< Disable                                                              */
  #define SIMIF_INTENCLR_T1RXFRAMEEND_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define SIMIF_INTENCLR_T1RXFRAMEEND_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* SIMIF_INTPEND: Pending interrupts */
  #define SIMIF_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* DMARXSTARTED @Bit 0 : Read pending status of interrupt for event DMARXSTARTED */
  #define SIMIF_INTPEND_DMARXSTARTED_Pos (0UL)       /*!< Position of DMARXSTARTED field.                                      */
  #define SIMIF_INTPEND_DMARXSTARTED_Msk (0x1UL << SIMIF_INTPEND_DMARXSTARTED_Pos) /*!< Bit mask of DMARXSTARTED field.        */
  #define SIMIF_INTPEND_DMARXSTARTED_Min (0x0UL)     /*!< Min enumerator value of DMARXSTARTED field.                          */
  #define SIMIF_INTPEND_DMARXSTARTED_Max (0x1UL)     /*!< Max enumerator value of DMARXSTARTED field.                          */
  #define SIMIF_INTPEND_DMARXSTARTED_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define SIMIF_INTPEND_DMARXSTARTED_Pending (0x1UL) /*!< Read: Pending                                                        */

/* DMARXDONE @Bit 1 : Read pending status of interrupt for event DMARXDONE */
  #define SIMIF_INTPEND_DMARXDONE_Pos (1UL)          /*!< Position of DMARXDONE field.                                         */
  #define SIMIF_INTPEND_DMARXDONE_Msk (0x1UL << SIMIF_INTPEND_DMARXDONE_Pos) /*!< Bit mask of DMARXDONE field.                 */
  #define SIMIF_INTPEND_DMARXDONE_Min (0x0UL)        /*!< Min enumerator value of DMARXDONE field.                             */
  #define SIMIF_INTPEND_DMARXDONE_Max (0x1UL)        /*!< Max enumerator value of DMARXDONE field.                             */
  #define SIMIF_INTPEND_DMARXDONE_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define SIMIF_INTPEND_DMARXDONE_Pending (0x1UL)    /*!< Read: Pending                                                        */

