adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SIMIF_UARTCONFIG: Uart configuration */
  #define SIMIF_UARTCONFIG_ResetValue (0x00000000UL) /*!< Reset value of UARTCONFIG register.                                  */

/* UARTCONFIG @Bits 0..2 : Uart configuration, for details see Uart spec */
  #define SIMIF_UARTCONFIG_UARTCONFIG_Pos (0UL)      /*!< Position of UARTCONFIG field.                                        */
  #define SIMIF_UARTCONFIG_UARTCONFIG_Msk (0x7UL << SIMIF_UARTCONFIG_UARTCONFIG_Pos) /*!< Bit mask of UARTCONFIG field.        */


/* SIMIF_WRITEMAXATT: Number of write attempts before error interrupt */
  #define SIMIF_WRITEMAXATT_ResetValue (0x0000000AUL) /*!< Reset value of WRITEMAXATT register.                                */

/* WRITEMAXATT @Bits 0..7 : Number of write attempts before error interrupt */
  #define SIMIF_WRITEMAXATT_WRITEMAXATT_Pos (0UL)    /*!< Position of WRITEMAXATT field.                                       */
  #define SIMIF_WRITEMAXATT_WRITEMAXATT_Msk (0xFFUL << SIMIF_WRITEMAXATT_WRITEMAXATT_Pos) /*!< Bit mask of WRITEMAXATT field.  */


/* SIMIF_READMAXATT: Number of read attempts before error interrupt */
  #define SIMIF_READMAXATT_ResetValue (0x0000000AUL) /*!< Reset value of READMAXATT register.                                  */

/* READMAXATT @Bits 0..7 : Number of read attempts before error interrupt */
  #define SIMIF_READMAXATT_READMAXATT_Pos (0UL)      /*!< Position of READMAXATT field.                                        */
  #define SIMIF_READMAXATT_READMAXATT_Msk (0xFFUL << SIMIF_READMAXATT_READMAXATT_Pos) /*!< Bit mask of READMAXATT field.       */


/* SIMIF_AHBTESTWRITE: Test data to write through AHB RX bus */
  #define SIMIF_AHBTESTWRITE_ResetValue (0x00000000UL) /*!< Reset value of AHBTESTWRITE register.                              */

/* WRITETESTDATA @Bits 0..7 : Test data for Ahb write access for Ahb Rx bus */
  #define SIMIF_AHBTESTWRITE_WRITETESTDATA_Pos (0UL) /*!< Position of WRITETESTDATA field.                                     */
  #define SIMIF_AHBTESTWRITE_WRITETESTDATA_Msk (0xFFUL << SIMIF_AHBTESTWRITE_WRITETESTDATA_Pos) /*!< Bit mask of WRITETESTDATA
                                                                            field.*/                                              

/* AHBTESTENABLE @Bit 8 : Enable bit for Ahb testing, both read and write */
  #define SIMIF_AHBTESTWRITE_AHBTESTENABLE_Pos (8UL) /*!< Position of AHBTESTENABLE field.                                     */
  #define SIMIF_AHBTESTWRITE_AHBTESTENABLE_Msk (0x1UL << SIMIF_AHBTESTWRITE_AHBTESTENABLE_Pos) /*!< Bit mask of AHBTESTENABLE
                                                                            field.*/                                              


/* SIMIF_AHBTESTREAD: Test data to read through AHB TX bus */
  #define SIMIF_AHBTESTREAD_ResetValue (0x00000000UL) /*!< Reset value of AHBTESTREAD register.                                */

/* READTESTDATA @Bits 0..7 : Test data read through Ahb Tx bus */
  #define SIMIF_AHBTESTREAD_READTESTDATA_Pos (0UL)   /*!< Position of READTESTDATA field.                                      */
  #define SIMIF_AHBTESTREAD_READTESTDATA_Msk (0xFFUL << SIMIF_AHBTESTREAD_READTESTDATA_Pos) /*!< Bit mask of READTESTDATA
                                                                            field.*/                                              


/* SIMIF_RXPROLOGUEDATA: Four first Rx data bytes from card */
  #define SIMIF_RXPROLOGUEDATA_ResetValue (0x00000000UL) /*!< Reset value of RXPROLOGUEDATA register.                          */

/* RXBYTE0 @Bits 0..7 : First Rx byte from card */
  #define SIMIF_RXPROLOGUEDATA_RXBYTE0_Pos (0UL)     /*!< Position of RXBYTE0 field.                                           */
  #define SIMIF_RXPROLOGUEDATA_RXBYTE0_Msk (0xFFUL << SIMIF_RXPROLOGUEDATA_RXBYTE0_Pos) /*!< Bit mask of RXBYTE0 field.        */

/* RXBYTE1 @Bits 8..15 : Second Rx byte from card */
  #define SIMIF_RXPROLOGUEDATA_RXBYTE1_Pos (8UL)     /*!< Position of RXBYTE1 field.                                           */
  #define SIMIF_RXPROLOGUEDATA_RXBYTE1_Msk (0xFFUL << SIMIF_RXPROLOGUEDATA_RXBYTE1_Pos) /*!< Bit mask of RXBYTE1 field.        */

/* RXBYTE2 @Bits 16..23 : Third Rx byte from card */
  #define SIMIF_RXPROLOGUEDATA_RXBYTE2_Pos (16UL)    /*!< Position of RXBYTE2 field.                                           */
  #define SIMIF_RXPROLOGUEDATA_RXBYTE2_Msk (0xFFUL << SIMIF_RXPROLOGUEDATA_RXBYTE2_Pos) /*!< Bit mask of RXBYTE2 field.        */

/* RXBYTE3 @Bits 24..31 : Fourth Rx byte from card */
  #define SIMIF_RXPROLOGUEDATA_RXBYTE3_Pos (24UL)    /*!< Position of RXBYTE3 field.                                           */
  #define SIMIF_RXPROLOGUEDATA_RXBYTE3_Msk (0xFFUL << SIMIF_RXPROLOGUEDATA_RXBYTE3_Pos) /*!< Bit mask of RXBYTE3 field.        */


/* SIMIF_UARTENABLE: UART Enable */
  #define SIMIF_UARTENABLE_ResetValue (0x00000000UL) /*!< Reset value of UARTENABLE register.                                  */

/* ENABLE @Bit 0 : UART master enable */
  #define SIMIF_UARTENABLE_ENABLE_Pos (0UL)          /*!< Position of ENABLE field.                                            */
  #define SIMIF_UARTENABLE_ENABLE_Msk (0x1UL << SIMIF_UARTENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                    */


/* SIMIF_UARTRXENABLE: UART Rx Enable */
  #define SIMIF_UARTRXENABLE_ResetValue (0x00000000UL) /*!< Reset value of UARTRXENABLE register.                              */

/* ENABLE @Bit 0 : UART Rx enable */
  #define SIMIF_UARTRXENABLE_ENABLE_Pos (0UL)        /*!< Position of ENABLE field.                                            */
  #define SIMIF_UARTRXENABLE_ENABLE_Msk (0x1UL << SIMIF_UARTRXENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                */


/* SIMIF_UARTTXENABLE: UART Tx Enable */
  #define SIMIF_UARTTXENABLE_ResetValue (0x00000000UL) /*!< Reset value of UARTTXENABLE register.                              */

/* ENABLE @Bit 0 : UART Tx enable */
  #define SIMIF_UARTTXENABLE_ENABLE_Pos (0UL)        /*!< Position of ENABLE field.                                            */
  #define SIMIF_UARTTXENABLE_ENABLE_Msk (0x1UL << SIMIF_UARTTXENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                */


