adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SIMIF_DMARXADDR: DMA access buffer RAM start address */
  #define SIMIF_DMARXADDR_ResetValue (0x00000000UL)  /*!< Reset value of DMARXADDR register.                                   */

/* DMARXSTARTADDRESS @Bits 0..31 : DMA access buffer RAM start address */
  #define SIMIF_DMARXADDR_DMARXSTARTADDRESS_Pos (0UL) /*!< Position of DMARXSTARTADDRESS field.                                */
  #define SIMIF_DMARXADDR_DMARXSTARTADDRESS_Msk (0xFFFFFFFFUL << SIMIF_DMARXADDR_DMARXSTARTADDRESS_Pos) /*!< Bit mask of
                                                                            DMARXSTARTADDRESS field.*/                            


/* SIMIF_DMARXBUFFERSIZE: Byte count to receive in Dma Rx operation */
  #define SIMIF_DMARXBUFFERSIZE_ResetValue (0x00000000UL) /*!< Reset value of DMARXBUFFERSIZE register.                        */

/* DMARXBUFFERSIZE @Bits 0..15 : Byte count to receive in Dma Rx operation */
  #define SIMIF_DMARXBUFFERSIZE_DMARXBUFFERSIZE_Pos (0UL) /*!< Position of DMARXBUFFERSIZE field.                              */
  #define SIMIF_DMARXBUFFERSIZE_DMARXBUFFERSIZE_Msk (0xFFFFUL << SIMIF_DMARXBUFFERSIZE_DMARXBUFFERSIZE_Pos) /*!< Bit mask of
                                                                            DMARXBUFFERSIZE field.*/                              


/* SIMIF_DMARXBYTECOUNT: Byte count received in latest Dma Rx operation */
  #define SIMIF_DMARXBYTECOUNT_ResetValue (0x00000000UL) /*!< Reset value of DMARXBYTECOUNT register.                          */

/* DMARXBYTECOUNT @Bits 0..15 : Byte count received in latest Dma Rx operation */
  #define SIMIF_DMARXBYTECOUNT_DMARXBYTECOUNT_Pos (0UL) /*!< Position of DMARXBYTECOUNT field.                                 */
  #define SIMIF_DMARXBYTECOUNT_DMARXBYTECOUNT_Msk (0xFFFFUL << SIMIF_DMARXBYTECOUNT_DMARXBYTECOUNT_Pos) /*!< Bit mask of
                                                                            DMARXBYTECOUNT field.*/                               


/* SIMIF_DMARXENABLE: Enable for rx dma */
  #define SIMIF_DMARXENABLE_ResetValue (0x00000000UL) /*!< Reset value of DMARXENABLE register.                                */

/* DMARXENABLE @Bit 0 : Enable for rx dma */
  #define SIMIF_DMARXENABLE_DMARXENABLE_Pos (0UL)    /*!< Position of DMARXENABLE field.                                       */
  #define SIMIF_DMARXENABLE_DMARXENABLE_Msk (0x1UL << SIMIF_DMARXENABLE_DMARXENABLE_Pos) /*!< Bit mask of DMARXENABLE field.   */


/* SIMIF_DMARXSELECTLIST: Rx select address from list */
  #define SIMIF_DMARXSELECTLIST_ResetValue (0x00000000UL) /*!< Reset value of DMARXSELECTLIST register.                        */

/* DMARXSELECTLIST @Bits 0..1 : Select address from list */
  #define SIMIF_DMARXSELECTLIST_DMARXSELECTLIST_Pos (0UL) /*!< Position of DMARXSELECTLIST field.                              */
  #define SIMIF_DMARXSELECTLIST_DMARXSELECTLIST_Msk (0x3UL << SIMIF_DMARXSELECTLIST_DMARXSELECTLIST_Pos) /*!< Bit mask of
                                                                            DMARXSELECTLIST field.*/                              


/* SIMIF_DMATXADDR: Start address for DMA access in buffer RAM */
  #define SIMIF_DMATXADDR_ResetValue (0x00000000UL)  /*!< Reset value of DMATXADDR register.                                   */

/* DMATXSTARTADDRESS @Bits 0..31 : Start address for DMA access in buffer RAM */
  #define SIMIF_DMATXADDR_DMATXSTARTADDRESS_Pos (0UL) /*!< Position of DMATXSTARTADDRESS field.                                */
  #define SIMIF_DMATXADDR_DMATXSTARTADDRESS_Msk (0xFFFFFFFFUL << SIMIF_DMATXADDR_DMATXSTARTADDRESS_Pos) /*!< Bit mask of
                                                                            DMATXSTARTADDRESS field.*/                            


/* SIMIF_DMATXBUFFERSIZE: Byte count to transmit in Dma Rx operation */
  #define SIMIF_DMATXBUFFERSIZE_ResetValue (0x00000000UL) /*!< Reset value of DMATXBUFFERSIZE register.                        */

/* DMATXBUFFERSIZE @Bits 0..15 : Byte count to transmit in Dma Tx operation */
  #define SIMIF_DMATXBUFFERSIZE_DMATXBUFFERSIZE_Pos (0UL) /*!< Position of DMATXBUFFERSIZE field.                              */
  #define SIMIF_DMATXBUFFERSIZE_DMATXBUFFERSIZE_Msk (0xFFFFUL << SIMIF_DMATXBUFFERSIZE_DMATXBUFFERSIZE_Pos) /*!< Bit mask of
                                                                            DMATXBUFFERSIZE field.*/                              


/* SIMIF_DMATXBYTECOUNT: Byte count transmitted in latest Dma Tx operation */
  #define SIMIF_DMATXBYTECOUNT_ResetValue (0x00000000UL) /*!< Reset value of DMATXBYTECOUNT register.                          */

/* DMATXBYTECOUNT @Bits 0..15 : Byte count transmitted in latest Dma Tx operation */
  #define SIMIF_DMATXBYTECOUNT_DMATXBYTECOUNT_Pos (0UL) /*!< Position of DMATXBYTECOUNT field.                                 */
  #define SIMIF_DMATXBYTECOUNT_DMATXBYTECOUNT_Msk (0xFFFFUL << SIMIF_DMATXBYTECOUNT_DMATXBYTECOUNT_Pos) /*!< Bit mask of
                                                                            DMATXBYTECOUNT field.*/                               


/* SIMIF_DMATXENABLE: Enable for rx dma */
  #define SIMIF_DMATXENABLE_ResetValue (0x00000000UL) /*!< Reset value of DMATXENABLE register.                                */

/* DMATXENABLE @Bit 0 : Enable for rx dma */
  #define SIMIF_DMATXENABLE_DMATXENABLE_Pos (0UL)    /*!< Position of DMATXENABLE field.                                       */
  #define SIMIF_DMATXENABLE_DMATXENABLE_Msk (0x1UL << SIMIF_DMATXENABLE_DMATXENABLE_Pos) /*!< Bit mask of DMATXENABLE field.   */


/* SIMIF_DMATXSELECTLIST: Tx select address from list */
  #define SIMIF_DMATXSELECTLIST_ResetValue (0x00000000UL) /*!< Reset value of DMATXSELECTLIST register.                        */

/* DMATXSELECTLIST @Bits 0..1 : Select address from list */
  #define SIMIF_DMATXSELECTLIST_DMATXSELECTLIST_Pos (0UL) /*!< Position of DMATXSELECTLIST field.                              */
  #define SIMIF_DMATXSELECTLIST_DMATXSELECTLIST_Msk (0x3UL << SIMIF_DMATXSELECTLIST_DMATXSELECTLIST_Pos) /*!< Bit mask of
                                                                            DMATXSELECTLIST field.*/                              


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           SPIM                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct SPIM_TASKS_DMA_RX ================================================= */
/**
  * @brief RX [SPIM_TASKS_DMA_RX] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  ENABLEMATCH[4];                    /*!< (@ 0x00000000) Enables the MATCH[n] event by setting the ENABLE[n] bit
                                                                         in the CONFIG register.*/                                
  __OM  uint32_t  DISABLEMATCH[4];                   /*!< (@ 0x00000010) Disables the MATCH[n] event by clearing the ENABLE[n]
                                                                         bit in the CONFIG register.*/                            
} NRF_SPIM_TASKS_DMA_RX_Type;                        /*!< Size = 32 (0x020)                                                    */

/* SPIM_TASKS_DMA_RX_ENABLEMATCH: Enables the MATCH[n] event by setting the ENABLE[n] bit in the CONFIG register. */
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_MaxCount (4UL) /*!< Max size of ENABLEMATCH[4] array.                                  */
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_ResetValue (0x00000000UL) /*!< Reset value of ENABLEMATCH[4] register.                 */

/* ENABLEMATCH @Bit 0 : Enables the MATCH[n] event by setting the ENABLE[n] bit in the CONFIG register. */
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Pos (0UL) /*!< Position of ENABLEMATCH field.                              */
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Msk (0x1UL << SPIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Pos) /*!< Bit mask
                                                                            of ENABLEMATCH field.*/                               
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Min (0x1UL) /*!< Min enumerator value of ENABLEMATCH field.                */
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Max (0x1UL) /*!< Max enumerator value of ENABLEMATCH field.                */
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Trigger (0x1UL) /*!< Trigger task                                          */


