adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ONESHOT0 @Bit 16 : Configure match filter 0 as one-shot or sticky */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Pos (16UL) /*!< Position of ONESHOT0 field.                                        */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Msk (0x1UL << SPIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Pos) /*!< Bit mask of ONESHOT0
                                                                            field.*/                                              
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Min (0x0UL) /*!< Min enumerator value of ONESHOT0 field.                           */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Max (0x1UL) /*!< Max enumerator value of ONESHOT0 field.                           */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Continuous (0x0UL) /*!< Match filter stays enabled until disabled by task          */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Oneshot (0x1UL) /*!< Match filter stays enabled until next data word is received   */

/* ONESHOT1 @Bit 17 : Configure match filter 1 as one-shot or sticky */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Pos (17UL) /*!< Position of ONESHOT1 field.                                        */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Msk (0x1UL << SPIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Pos) /*!< Bit mask of ONESHOT1
                                                                            field.*/                                              
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Min (0x0UL) /*!< Min enumerator value of ONESHOT1 field.                           */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Max (0x1UL) /*!< Max enumerator value of ONESHOT1 field.                           */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Continuous (0x0UL) /*!< Match filter stays enabled until disabled by task          */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Oneshot (0x1UL) /*!< Match filter stays enabled until next data word is received   */

/* ONESHOT2 @Bit 18 : Configure match filter 2 as one-shot or sticky */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Pos (18UL) /*!< Position of ONESHOT2 field.                                        */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Msk (0x1UL << SPIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Pos) /*!< Bit mask of ONESHOT2
                                                                            field.*/                                              
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Min (0x0UL) /*!< Min enumerator value of ONESHOT2 field.                           */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Max (0x1UL) /*!< Max enumerator value of ONESHOT2 field.                           */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Continuous (0x0UL) /*!< Match filter stays enabled until disabled by task          */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Oneshot (0x1UL) /*!< Match filter stays enabled until next data word is received   */

/* ONESHOT3 @Bit 19 : Configure match filter 3 as one-shot or sticky */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Pos (19UL) /*!< Position of ONESHOT3 field.                                        */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Msk (0x1UL << SPIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Pos) /*!< Bit mask of ONESHOT3
                                                                            field.*/                                              
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Min (0x0UL) /*!< Min enumerator value of ONESHOT3 field.                           */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Max (0x1UL) /*!< Max enumerator value of ONESHOT3 field.                           */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Continuous (0x0UL) /*!< Match filter stays enabled until disabled by task          */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Oneshot (0x1UL) /*!< Match filter stays enabled until next data word is received   */


/* SPIS_DMA_RX_MATCH_CANDIDATE: The data to look for - any match will trigger the MATCH[n] event, if enabled. */
  #define SPIS_DMA_RX_MATCH_CANDIDATE_MaxCount (4UL) /*!< Max size of CANDIDATE[4] array.                                      */
  #define SPIS_DMA_RX_MATCH_CANDIDATE_ResetValue (0x00000000UL) /*!< Reset value of CANDIDATE[4] register.                     */

/* DATA @Bits 0..31 : Data to look for */
  #define SPIS_DMA_RX_MATCH_CANDIDATE_DATA_Pos (0UL) /*!< Position of DATA field.                                              */
  #define SPIS_DMA_RX_MATCH_CANDIDATE_DATA_Msk (0xFFFFFFFFUL << SPIS_DMA_RX_MATCH_CANDIDATE_DATA_Pos) /*!< Bit mask of DATA
                                                                            field.*/                                              



/* =================================================== Struct SPIS_DMA_RX ==================================================== */
/**
  * @brief RX [SPIS_DMA_RX] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ENABLE;                            /*!< (@ 0x00000000) Register doesn't do anything. Can be written and read,
                                                                         but has no functionality attached.*/                     
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000004) RAM buffer start address                              */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000008) Maximum number of bytes in receive buffer             */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x0000000C) Number of bytes transferred in the last transaction,
                                                                         updated after the END event. Also updated after each
                                                                         MATCH event.*/                                           
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  LIST;                              /*!< (@ 0x00000014) EasyDMA list type                                     */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x0000001C) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/                                              
  __IOM uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000020) Address of transaction that generated the last BUSERROR
                                                                         event.*/                                                 
  __IOM NRF_SPIS_DMA_RX_MATCH_Type MATCH;            /*!< (@ 0x00000024) Registers to control the behavior of the pattern
                                                                         matcher engine*/                                         
} NRF_SPIS_DMA_RX_Type;                              /*!< Size = 56 (0x038)                                                    */

/* SPIS_DMA_RX_ENABLE: Register doesn't do anything. Can be written and read, but has no functionality attached. */
  #define SPIS_DMA_RX_ENABLE_ResetValue (0x00000000UL) /*!< Reset value of ENABLE register.                                    */

/* ENABLE @Bit 0 : Register doesn't do anything. Can be written and read, but has no functionality attached. */
  #define SPIS_DMA_RX_ENABLE_ENABLE_Pos (0UL)        /*!< Position of ENABLE field.                                            */
  #define SPIS_DMA_RX_ENABLE_ENABLE_Msk (0x1UL << SPIS_DMA_RX_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                */
  #define SPIS_DMA_RX_ENABLE_ENABLE_Min (0x0UL)      /*!< Min enumerator value of ENABLE field.                                */
  #define SPIS_DMA_RX_ENABLE_ENABLE_Max (0x1UL)      /*!< Max enumerator value of ENABLE field.                                */
  #define SPIS_DMA_RX_ENABLE_ENABLE_Disabled (0x0UL) /*!< Disable                                                              */
  #define SPIS_DMA_RX_ENABLE_ENABLE_Enabled (0x1UL)  /*!< Enable                                                               */


/* SPIS_DMA_RX_PTR: RAM buffer start address */
  #define SPIS_DMA_RX_PTR_ResetValue (0x00000000UL)  /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : RAM buffer start address for this EasyDMA channel. This address is a word aligned Data RAM address. */
  #define SPIS_DMA_RX_PTR_PTR_Pos (0UL)              /*!< Position of PTR field.                                               */
  #define SPIS_DMA_RX_PTR_PTR_Msk (0xFFFFFFFFUL << SPIS_DMA_RX_PTR_PTR_Pos) /*!< Bit mask of PTR field.                        */


