adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ======================================================= Struct SPIS ======================================================= */
/**
  * @brief SPI Slave
  */
  typedef struct {                                   /*!< SPIS Structure                                                       */
    __IM uint32_t RESERVED[5];
    __OM uint32_t TASKS_ACQUIRE;                     /*!< (@ 0x00000014) Acquire SPI semaphore                                 */
    __OM uint32_t TASKS_RELEASE;                     /*!< (@ 0x00000018) Release SPI semaphore, enabling the SPI slave to
                                                                         acquire it*/                                             
    __IM uint32_t RESERVED1[3];
    __OM NRF_SPIS_TASKS_DMA_Type TASKS_DMA;          /*!< (@ 0x00000028) Peripheral tasks.                                     */
    __IM uint32_t RESERVED2[17];
    __IOM uint32_t SUBSCRIBE_ACQUIRE;                /*!< (@ 0x00000094) Subscribe configuration for task ACQUIRE              */
    __IOM uint32_t SUBSCRIBE_RELEASE;                /*!< (@ 0x00000098) Subscribe configuration for task RELEASE              */
    __IM uint32_t RESERVED3[3];
    __IOM NRF_SPIS_SUBSCRIBE_DMA_Type SUBSCRIBE_DMA; /*!< (@ 0x000000A8) Subscribe configuration for tasks                     */
    __IM uint32_t RESERVED4[13];
    __IOM uint32_t EVENTS_END;                       /*!< (@ 0x00000104) Granted transaction completed                         */
    __IM uint32_t RESERVED5[4];
    __IOM uint32_t EVENTS_ACQUIRED;                  /*!< (@ 0x00000118) Semaphore acquired                                    */
    __IM uint32_t RESERVED6[12];
    __IOM NRF_SPIS_EVENTS_DMA_Type EVENTS_DMA;       /*!< (@ 0x0000014C) Peripheral events.                                    */
    __IM uint32_t RESERVED7[4];
    __IOM uint32_t PUBLISH_END;                      /*!< (@ 0x00000184) Publish configuration for event END                   */
    __IM uint32_t RESERVED8[4];
    __IOM uint32_t PUBLISH_ACQUIRED;                 /*!< (@ 0x00000198) Publish configuration for event ACQUIRED              */
    __IM uint32_t RESERVED9[12];
    __IOM NRF_SPIS_PUBLISH_DMA_Type PUBLISH_DMA;     /*!< (@ 0x000001CC) Publish configuration for events                      */
    __IM uint32_t RESERVED10[3];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED11[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED12[61];
    __IM uint32_t SEMSTAT;                           /*!< (@ 0x00000400) Semaphore status register                             */
    __IM uint32_t RESERVED13[15];
    __IOM uint32_t STATUS;                           /*!< (@ 0x00000440) Status from last transaction                          */
    __IM uint32_t RESERVED14[47];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable SPI slave                                      */
    __IM uint32_t RESERVED15[20];
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000554) Configuration register                                */
    __IM uint32_t RESERVED16;
    __IOM uint32_t DEF;                              /*!< (@ 0x0000055C) Default character. Character clocked out in case of an
                                                                         ignored transaction.*/                                   
    __IM uint32_t RESERVED17[24];
    __IOM uint32_t ORC;                              /*!< (@ 0x000005C0) Over-read character                                   */
    __IM uint32_t RESERVED18[15];
    __IOM NRF_SPIS_PSEL_Type PSEL;                   /*!< (@ 0x00000600) (unspecified)                                         */
    __IM uint32_t RESERVED19[59];
    __IOM NRF_SPIS_DMA_Type DMA;                     /*!< (@ 0x00000700) (unspecified)                                         */
  } NRF_SPIS_Type;                                   /*!< Size = 1884 (0x75C)                                                  */

/* SPIS_TASKS_ACQUIRE: Acquire SPI semaphore */
  #define SPIS_TASKS_ACQUIRE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_ACQUIRE register.                             */

/* TASKS_ACQUIRE @Bit 0 : Acquire SPI semaphore */
  #define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Pos (0UL) /*!< Position of TASKS_ACQUIRE field.                                     */
  #define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Msk (0x1UL << SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Pos) /*!< Bit mask of TASKS_ACQUIRE
                                                                            field.*/                                              
  #define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Min (0x1UL) /*!< Min enumerator value of TASKS_ACQUIRE field.                       */
  #define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Max (0x1UL) /*!< Max enumerator value of TASKS_ACQUIRE field.                       */
  #define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Trigger (0x1UL) /*!< Trigger task                                                   */


/* SPIS_TASKS_RELEASE: Release SPI semaphore, enabling the SPI slave to acquire it */
  #define SPIS_TASKS_RELEASE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RELEASE register.                             */

/* TASKS_RELEASE @Bit 0 : Release SPI semaphore, enabling the SPI slave to acquire it */
  #define SPIS_TASKS_RELEASE_TASKS_RELEASE_Pos (0UL) /*!< Position of TASKS_RELEASE field.                                     */
  #define SPIS_TASKS_RELEASE_TASKS_RELEASE_Msk (0x1UL << SPIS_TASKS_RELEASE_TASKS_RELEASE_Pos) /*!< Bit mask of TASKS_RELEASE
                                                                            field.*/                                              
  #define SPIS_TASKS_RELEASE_TASKS_RELEASE_Min (0x1UL) /*!< Min enumerator value of TASKS_RELEASE field.                       */
  #define SPIS_TASKS_RELEASE_TASKS_RELEASE_Max (0x1UL) /*!< Max enumerator value of TASKS_RELEASE field.                       */
  #define SPIS_TASKS_RELEASE_TASKS_RELEASE_Trigger (0x1UL) /*!< Trigger task                                                   */


/* SPIS_SUBSCRIBE_ACQUIRE: Subscribe configuration for task ACQUIRE */
  #define SPIS_SUBSCRIBE_ACQUIRE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_ACQUIRE register.                     */

