adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CPOL @Bit 2 : Serial clock (SCK) polarity */
  #define SPIS_CONFIG_CPOL_Pos (2UL)                 /*!< Position of CPOL field.                                              */
  #define SPIS_CONFIG_CPOL_Msk (0x1UL << SPIS_CONFIG_CPOL_Pos) /*!< Bit mask of CPOL field.                                    */
  #define SPIS_CONFIG_CPOL_Min (0x0UL)               /*!< Min enumerator value of CPOL field.                                  */
  #define SPIS_CONFIG_CPOL_Max (0x1UL)               /*!< Max enumerator value of CPOL field.                                  */
  #define SPIS_CONFIG_CPOL_ActiveHigh (0x0UL)        /*!< Active high                                                          */
  #define SPIS_CONFIG_CPOL_ActiveLow (0x1UL)         /*!< Active low                                                           */


/* SPIS_DEF: Default character. Character clocked out in case of an ignored transaction. */
  #define SPIS_DEF_ResetValue (0x00000000UL)         /*!< Reset value of DEF register.                                         */

/* DEF @Bits 0..7 : Default character. Character clocked out in case of an ignored transaction. */
  #define SPIS_DEF_DEF_Pos (0UL)                     /*!< Position of DEF field.                                               */
  #define SPIS_DEF_DEF_Msk (0xFFUL << SPIS_DEF_DEF_Pos) /*!< Bit mask of DEF field.                                            */


/* SPIS_ORC: Over-read character */
  #define SPIS_ORC_ResetValue (0x00000000UL)         /*!< Reset value of ORC register.                                         */

/* ORC @Bits 0..7 : Over-read character. Character clocked out after an over-read of the transmit buffer. */
  #define SPIS_ORC_ORC_Pos (0UL)                     /*!< Position of ORC field.                                               */
  #define SPIS_ORC_ORC_Msk (0xFFUL << SPIS_ORC_ORC_Pos) /*!< Bit mask of ORC field.                                            */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            SPU                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct SPU_PERIPHACCERR ================================================= */
/**
  * @brief PERIPHACCERR [SPU_PERIPHACCERR] (unspecified)
  */
typedef struct {
  __IM  uint32_t  ADDRESS;                           /*!< (@ 0x00000000) Address of the transaction that caused first error.   */
  __IM  uint32_t  INFO;                              /*!< (@ 0x00000004) Information about the transaction that caused first
                                                                         error.*/                                                 
} NRF_SPU_PERIPHACCERR_Type;                         /*!< Size = 8 (0x008)                                                     */

/* SPU_PERIPHACCERR_ADDRESS: Address of the transaction that caused first error. */
  #define SPU_PERIPHACCERR_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                             */

/* ADDRESS @Bits 0..15 : Address */
  #define SPU_PERIPHACCERR_ADDRESS_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                           */
  #define SPU_PERIPHACCERR_ADDRESS_ADDRESS_Msk (0xFFFFUL << SPU_PERIPHACCERR_ADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/                                              


/* SPU_PERIPHACCERR_INFO: Information about the transaction that caused first error. */
  #define SPU_PERIPHACCERR_INFO_ResetValue (0x00000000UL) /*!< Reset value of INFO register.                                   */

/* OWNERID @Bits 0..3 : OWNERID */
  #define SPU_PERIPHACCERR_INFO_OWNERID_Pos (0UL)    /*!< Position of OWNERID field.                                           */
  #define SPU_PERIPHACCERR_INFO_OWNERID_Msk (0xFUL << SPU_PERIPHACCERR_INFO_OWNERID_Pos) /*!< Bit mask of OWNERID field.       */



/* ==================================================== Struct SPU_PERIPH ==================================================== */
/**
  * @brief PERIPH [SPU_PERIPH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PERM;                              /*!< (@ 0x00000000) Get and set the applicable access permissions for the
                                                                         peripheral slave index n*/                               
} NRF_SPU_PERIPH_Type;                               /*!< Size = 4 (0x004)                                                     */
  #define SPU_PERIPH_MaxCount (32UL)                 /*!< Max size of PERIPH[32] array.                                        */

/* SPU_PERIPH_PERM: Get and set the applicable access permissions for the peripheral slave index n */
  #define SPU_PERIPH_PERM_ResetValue (0x8000000AUL)  /*!< Reset value of PERM register.                                        */

/* SECUREMAPPING @Bits 0..1 : Read capabilities for TrustZone Cortex-M secure attribute */
  #define SPU_PERIPH_PERM_SECUREMAPPING_Pos (0UL)    /*!< Position of SECUREMAPPING field.                                     */
  #define SPU_PERIPH_PERM_SECUREMAPPING_Msk (0x3UL << SPU_PERIPH_PERM_SECUREMAPPING_Pos) /*!< Bit mask of SECUREMAPPING field. */
  #define SPU_PERIPH_PERM_SECUREMAPPING_Min (0x0UL)  /*!< Min enumerator value of SECUREMAPPING field.                         */
  #define SPU_PERIPH_PERM_SECUREMAPPING_Max (0x3UL)  /*!< Max enumerator value of SECUREMAPPING field.                         */
  #define SPU_PERIPH_PERM_SECUREMAPPING_NonSecure (0x0UL) /*!< This peripheral is always accessible as a non-secure peripheral */
  #define SPU_PERIPH_PERM_SECUREMAPPING_Secure (0x1UL) /*!< This peripheral is always accessible as a secure peripheral        */
  #define SPU_PERIPH_PERM_SECUREMAPPING_UserSelectable (0x2UL) /*!< Non-secure or secure attribute for this peripheral is
                                                                    defined by the PERIPH[n].PERM register*/                      
  #define SPU_PERIPH_PERM_SECUREMAPPING_Split (0x3UL) /*!< This peripheral implements the split security mechanism.            */

/* DMA @Bits 2..3 : Read the peripheral DMA capabilities */
  #define SPU_PERIPH_PERM_DMA_Pos (2UL)              /*!< Position of DMA field.                                               */
  #define SPU_PERIPH_PERM_DMA_Msk (0x3UL << SPU_PERIPH_PERM_DMA_Pos) /*!< Bit mask of DMA field.                               */
  #define SPU_PERIPH_PERM_DMA_Min (0x0UL)            /*!< Min enumerator value of DMA field.                                   */
  #define SPU_PERIPH_PERM_DMA_Max (0x2UL)            /*!< Max enumerator value of DMA field.                                   */
  #define SPU_PERIPH_PERM_DMA_NoDMA (0x0UL)          /*!< Peripheral has no DMA capability                                     */
  #define SPU_PERIPH_PERM_DMA_NoSeparateAttribute (0x1UL) /*!< Peripheral has DMA and DMA transfers always have the same
                                                               security attribute as assigned to the peripheral*/                 
  #define SPU_PERIPH_PERM_DMA_SeparateAttribute (0x2UL) /*!< Peripheral has DMA and DMA transfers can have a different security
                                                             attribute than the one assigned to the peripheral*/                  

/* SECATTR @Bit 4 : Peripheral security mapping */
  #define SPU_PERIPH_PERM_SECATTR_Pos (4UL)          /*!< Position of SECATTR field.                                           */
  #define SPU_PERIPH_PERM_SECATTR_Msk (0x1UL << SPU_PERIPH_PERM_SECATTR_Pos) /*!< Bit mask of SECATTR field.                   */
  #define SPU_PERIPH_PERM_SECATTR_Min (0x0UL)        /*!< Min enumerator value of SECATTR field.                               */
  #define SPU_PERIPH_PERM_SECATTR_Max (0x1UL)        /*!< Max enumerator value of SECATTR field.                               */
  #define SPU_PERIPH_PERM_SECATTR_Secure (0x1UL)     /*!< Peripheral is mapped in secure peripheral address space              */
  #define SPU_PERIPH_PERM_SECATTR_NonSecure (0x0UL)  /*!< If SECUREMAPPING == UserSelectable: Peripheral is mapped in non-secure
                                                          peripheral address space. If SECUREMAPPING == Split: Peripheral is
                                                          mapped in non-secure and secure peripheral address space.*/             

/* DMASEC @Bit 5 : Security attribution for the DMA transfer */
  #define SPU_PERIPH_PERM_DMASEC_Pos (5UL)           /*!< Position of DMASEC field.                                            */
  #define SPU_PERIPH_PERM_DMASEC_Msk (0x1UL << SPU_PERIPH_PERM_DMASEC_Pos) /*!< Bit mask of DMASEC field.                      */
  #define SPU_PERIPH_PERM_DMASEC_Min (0x0UL)         /*!< Min enumerator value of DMASEC field.                                */
  #define SPU_PERIPH_PERM_DMASEC_Max (0x1UL)         /*!< Max enumerator value of DMASEC field.                                */
  #define SPU_PERIPH_PERM_DMASEC_Secure (0x1UL)      /*!< DMA transfers initiated by this peripheral have the secure attribute
                                                          set*/                                                                   
  #define SPU_PERIPH_PERM_DMASEC_NonSecure (0x0UL)   /*!< DMA transfers initiated by this peripheral have the non-secure
                                                          attribute set*/                                                         

/* BLOCK @Bit 6 : Peripheral block */
  #define SPU_PERIPH_PERM_BLOCK_Pos (6UL)            /*!< Position of BLOCK field.                                             */
  #define SPU_PERIPH_PERM_BLOCK_Msk (0x1UL << SPU_PERIPH_PERM_BLOCK_Pos) /*!< Bit mask of BLOCK field.                         */
  #define SPU_PERIPH_PERM_BLOCK_Min (0x0UL)          /*!< Min enumerator value of BLOCK field.                                 */
  #define SPU_PERIPH_PERM_BLOCK_Max (0x1UL)          /*!< Max enumerator value of BLOCK field.                                 */
  #define SPU_PERIPH_PERM_BLOCK_Available (0x0UL)    /*!< Peripheral is accessible                                             */
  #define SPU_PERIPH_PERM_BLOCK_Blocked (0x1UL)      /*!< Peripheral cannot be accessed until next reset                       */

/* LOCK @Bit 8 : Register lock */
  #define SPU_PERIPH_PERM_LOCK_Pos (8UL)             /*!< Position of LOCK field.                                              */
  #define SPU_PERIPH_PERM_LOCK_Msk (0x1UL << SPU_PERIPH_PERM_LOCK_Pos) /*!< Bit mask of LOCK field.                            */
  #define SPU_PERIPH_PERM_LOCK_Min (0x0UL)           /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_PERIPH_PERM_LOCK_Max (0x1UL)           /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_PERIPH_PERM_LOCK_Unlocked (0x0UL)      /*!< This register can be updated                                         */
  #define SPU_PERIPH_PERM_LOCK_Locked (0x1UL)        /*!< The content of this register can not be changed until the next reset */

/* OWNERID @Bits 16..19 : Peripheral owner ID */
  #define SPU_PERIPH_PERM_OWNERID_Pos (16UL)         /*!< Position of OWNERID field.                                           */
  #define SPU_PERIPH_PERM_OWNERID_Msk (0xFUL << SPU_PERIPH_PERM_OWNERID_Pos) /*!< Bit mask of OWNERID field.                   */
  #define SPU_PERIPH_PERM_OWNERID_Min (0x0UL)        /*!< Min value of OWNERID field.                                          */
  #define SPU_PERIPH_PERM_OWNERID_Max (0xFUL)        /*!< Max size of OWNERID field.                                           */

/* OWNERPROG @Bit 30 : Indicates if OWNERID is programmable or not */
  #define SPU_PERIPH_PERM_OWNERPROG_Pos (30UL)       /*!< Position of OWNERPROG field.                                         */
  #define SPU_PERIPH_PERM_OWNERPROG_Msk (0x1UL << SPU_PERIPH_PERM_OWNERPROG_Pos) /*!< Bit mask of OWNERPROG field.             */
  #define SPU_PERIPH_PERM_OWNERPROG_Min (0x0UL)      /*!< Min enumerator value of OWNERPROG field.                             */
  #define SPU_PERIPH_PERM_OWNERPROG_Max (0x1UL)      /*!< Max enumerator value of OWNERPROG field.                             */
  #define SPU_PERIPH_PERM_OWNERPROG_NotProgrammable (0x0UL) /*!< OWNERID is not programmable                                   */
  #define SPU_PERIPH_PERM_OWNERPROG_Programmable (0x1UL) /*!< OWNERID is programmable                                          */

