adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PRESENT @Bit 31 : Indicates if a peripheral is present with peripheral slave index n */
  #define SPU_PERIPH_PERM_PRESENT_Pos (31UL)         /*!< Position of PRESENT field.                                           */
  #define SPU_PERIPH_PERM_PRESENT_Msk (0x1UL << SPU_PERIPH_PERM_PRESENT_Pos) /*!< Bit mask of PRESENT field.                   */
  #define SPU_PERIPH_PERM_PRESENT_Min (0x0UL)        /*!< Min enumerator value of PRESENT field.                               */
  #define SPU_PERIPH_PERM_PRESENT_Max (0x1UL)        /*!< Max enumerator value of PRESENT field.                               */
  #define SPU_PERIPH_PERM_PRESENT_NotPresent (0x0UL) /*!< Peripheral is not present                                            */
  #define SPU_PERIPH_PERM_PRESENT_IsPresent (0x1UL)  /*!< Peripheral is present                                                */



/* ================================================= Struct SPU_FEATURE_IPCT ================================================= */
/**
  * @brief IPCT [SPU_FEATURE_IPCT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CH[24];                            /*!< (@ 0x00000000) Configuration of features for channel n of IPCT       */
  __IOM uint32_t  INTERRUPT[8];                      /*!< (@ 0x00000060) Configuration of features for interrupt n of IPCT     */
} NRF_SPU_FEATURE_IPCT_Type;                         /*!< Size = 128 (0x080)                                                   */

/* SPU_FEATURE_IPCT_CH: Configuration of features for channel n of IPCT */
  #define SPU_FEATURE_IPCT_CH_MaxCount (24UL)        /*!< Max size of CH[24] array.                                            */
  #define SPU_FEATURE_IPCT_CH_ResetValue (0x00000000UL) /*!< Reset value of CH[24] register.                                   */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_IPCT_CH_SECATTR_Pos (4UL)      /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_IPCT_CH_SECATTR_Msk (0x1UL << SPU_FEATURE_IPCT_CH_SECATTR_Pos) /*!< Bit mask of SECATTR field.           */
  #define SPU_FEATURE_IPCT_CH_SECATTR_Min (0x0UL)    /*!< Min enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_IPCT_CH_SECATTR_Max (0x1UL)    /*!< Max enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_IPCT_CH_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                         */
  #define SPU_FEATURE_IPCT_CH_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                                 */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_IPCT_CH_LOCK_Pos (8UL)         /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_IPCT_CH_LOCK_Msk (0x1UL << SPU_FEATURE_IPCT_CH_LOCK_Pos) /*!< Bit mask of LOCK field.                    */
  #define SPU_FEATURE_IPCT_CH_LOCK_Min (0x0UL)       /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_IPCT_CH_LOCK_Max (0x1UL)       /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_IPCT_CH_LOCK_Unlocked (0x0UL)  /*!< Feature permissions can be updated                                   */
  #define SPU_FEATURE_IPCT_CH_LOCK_Locked (0x1UL)    /*!< Feature permissions can not be changed until the next reset          */

/* BLOCK @Bit 12 : BLOCK feature */
  #define SPU_FEATURE_IPCT_CH_BLOCK_Pos (12UL)       /*!< Position of BLOCK field.                                             */
  #define SPU_FEATURE_IPCT_CH_BLOCK_Msk (0x1UL << SPU_FEATURE_IPCT_CH_BLOCK_Pos) /*!< Bit mask of BLOCK field.                 */
  #define SPU_FEATURE_IPCT_CH_BLOCK_Min (0x0UL)      /*!< Min enumerator value of BLOCK field.                                 */
  #define SPU_FEATURE_IPCT_CH_BLOCK_Max (0x1UL)      /*!< Max enumerator value of BLOCK field.                                 */
  #define SPU_FEATURE_IPCT_CH_BLOCK_Available (0x0UL) /*!< Feature is accessible                                               */
  #define SPU_FEATURE_IPCT_CH_BLOCK_Blocked (0x1UL)  /*!< Feature cannot be accessed until next reset                          */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_IPCT_CH_OWNERID_Pos (16UL)     /*!< Position of OWNERID field.                                           */
  #define SPU_FEATURE_IPCT_CH_OWNERID_Msk (0xFUL << SPU_FEATURE_IPCT_CH_OWNERID_Pos) /*!< Bit mask of OWNERID field.           */
  #define SPU_FEATURE_IPCT_CH_OWNERID_Min (0x0UL)    /*!< Min value of OWNERID field.                                          */
  #define SPU_FEATURE_IPCT_CH_OWNERID_Max (0xFUL)    /*!< Max size of OWNERID field.                                           */


/* SPU_FEATURE_IPCT_INTERRUPT: Configuration of features for interrupt n of IPCT */
  #define SPU_FEATURE_IPCT_INTERRUPT_MaxCount (8UL)  /*!< Max size of INTERRUPT[8] array.                                      */
  #define SPU_FEATURE_IPCT_INTERRUPT_ResetValue (0x00000000UL) /*!< Reset value of INTERRUPT[8] register.                      */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_IPCT_INTERRUPT_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                         */
  #define SPU_FEATURE_IPCT_INTERRUPT_SECATTR_Msk (0x1UL << SPU_FEATURE_IPCT_INTERRUPT_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/                                              
  #define SPU_FEATURE_IPCT_INTERRUPT_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                           */
  #define SPU_FEATURE_IPCT_INTERRUPT_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                           */
  #define SPU_FEATURE_IPCT_INTERRUPT_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                  */
  #define SPU_FEATURE_IPCT_INTERRUPT_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                          */

