adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Pos (8UL) /*!< Position of LOCK field.                                             */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Msk (0x1UL << SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Pos) /*!< Bit mask of LOCK field.  */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                               */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                               */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                           */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset    */

/* BLOCK @Bit 12 : BLOCK feature */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_BLOCK_Pos (12UL) /*!< Position of BLOCK field.                                          */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_BLOCK_Msk (0x1UL << SPU_FEATURE_GPIOTE_INTERRUPT_BLOCK_Pos) /*!< Bit mask of BLOCK
                                                                            field.*/                                              
  #define SPU_FEATURE_GPIOTE_INTERRUPT_BLOCK_Min (0x0UL) /*!< Min enumerator value of BLOCK field.                             */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_BLOCK_Max (0x1UL) /*!< Max enumerator value of BLOCK field.                             */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_BLOCK_Available (0x0UL) /*!< Feature is accessible                                      */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_BLOCK_Blocked (0x1UL) /*!< Feature cannot be accessed until next reset                  */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_OWNERID_Pos (16UL) /*!< Position of OWNERID field.                                      */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_OWNERID_Msk (0xFUL << SPU_FEATURE_GPIOTE_INTERRUPT_OWNERID_Pos) /*!< Bit mask of OWNERID
                                                                            field.*/                                              
  #define SPU_FEATURE_GPIOTE_INTERRUPT_OWNERID_Min (0x0UL) /*!< Min value of OWNERID field.                                    */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_OWNERID_Max (0xFUL) /*!< Max size of OWNERID field.                                     */



/* ================================================ Struct SPU_FEATURE_COEXC ================================================= */
/**
  * @brief COEXC [SPU_FEATURE_COEXC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CCCONF[8];                         /*!< (@ 0x00000000) Configuration of features for CCCONF[n] of COEXC      */
  __IOM uint32_t  TURNAROUND[8];                     /*!< (@ 0x00000020) Configuration of features for TURNAROUND[n] of COEXC  */
  __IOM uint32_t  CCMALLOW;                          /*!< (@ 0x00000040) Configuration of features for CCMALLOW of COEXC       */
} NRF_SPU_FEATURE_COEXC_Type;                        /*!< Size = 68 (0x044)                                                    */

/* SPU_FEATURE_COEXC_CCCONF: Configuration of features for CCCONF[n] of COEXC */
  #define SPU_FEATURE_COEXC_CCCONF_MaxCount (8UL)    /*!< Max size of CCCONF[8] array.                                         */
  #define SPU_FEATURE_COEXC_CCCONF_ResetValue (0x00000000UL) /*!< Reset value of CCCONF[8] register.                           */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_COEXC_CCCONF_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_COEXC_CCCONF_SECATTR_Msk (0x1UL << SPU_FEATURE_COEXC_CCCONF_SECATTR_Pos) /*!< Bit mask of SECATTR field. */
  #define SPU_FEATURE_COEXC_CCCONF_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                             */
  #define SPU_FEATURE_COEXC_CCCONF_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                             */
  #define SPU_FEATURE_COEXC_CCCONF_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                    */
  #define SPU_FEATURE_COEXC_CCCONF_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                            */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_COEXC_CCCONF_LOCK_Pos (8UL)    /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_COEXC_CCCONF_LOCK_Msk (0x1UL << SPU_FEATURE_COEXC_CCCONF_LOCK_Pos) /*!< Bit mask of LOCK field.          */
  #define SPU_FEATURE_COEXC_CCCONF_LOCK_Min (0x0UL)  /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_COEXC_CCCONF_LOCK_Max (0x1UL)  /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_COEXC_CCCONF_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                               */
  #define SPU_FEATURE_COEXC_CCCONF_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset        */

/* BLOCK @Bit 12 : BLOCK feature */
  #define SPU_FEATURE_COEXC_CCCONF_BLOCK_Pos (12UL)  /*!< Position of BLOCK field.                                             */
  #define SPU_FEATURE_COEXC_CCCONF_BLOCK_Msk (0x1UL << SPU_FEATURE_COEXC_CCCONF_BLOCK_Pos) /*!< Bit mask of BLOCK field.       */
  #define SPU_FEATURE_COEXC_CCCONF_BLOCK_Min (0x0UL) /*!< Min enumerator value of BLOCK field.                                 */
  #define SPU_FEATURE_COEXC_CCCONF_BLOCK_Max (0x1UL) /*!< Max enumerator value of BLOCK field.                                 */
  #define SPU_FEATURE_COEXC_CCCONF_BLOCK_Available (0x0UL) /*!< Feature is accessible                                          */
  #define SPU_FEATURE_COEXC_CCCONF_BLOCK_Blocked (0x1UL) /*!< Feature cannot be accessed until next reset                      */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_COEXC_CCCONF_OWNERID_Pos (16UL) /*!< Position of OWNERID field.                                          */
  #define SPU_FEATURE_COEXC_CCCONF_OWNERID_Msk (0xFUL << SPU_FEATURE_COEXC_CCCONF_OWNERID_Pos) /*!< Bit mask of OWNERID field. */
  #define SPU_FEATURE_COEXC_CCCONF_OWNERID_Min (0x0UL) /*!< Min value of OWNERID field.                                        */
  #define SPU_FEATURE_COEXC_CCCONF_OWNERID_Max (0xFUL) /*!< Max size of OWNERID field.                                         */


/* SPU_FEATURE_COEXC_TURNAROUND: Configuration of features for TURNAROUND[n] of COEXC */
  #define SPU_FEATURE_COEXC_TURNAROUND_MaxCount (8UL) /*!< Max size of TURNAROUND[8] array.                                    */
  #define SPU_FEATURE_COEXC_TURNAROUND_ResetValue (0x00000000UL) /*!< Reset value of TURNAROUND[8] register.                   */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_COEXC_TURNAROUND_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                       */
  #define SPU_FEATURE_COEXC_TURNAROUND_SECATTR_Msk (0x1UL << SPU_FEATURE_COEXC_TURNAROUND_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/                                              
  #define SPU_FEATURE_COEXC_TURNAROUND_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                         */
  #define SPU_FEATURE_COEXC_TURNAROUND_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                         */
  #define SPU_FEATURE_COEXC_TURNAROUND_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                */
  #define SPU_FEATURE_COEXC_TURNAROUND_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                        */

