adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_COEXC_TURNAROUND_LOCK_Pos (8UL) /*!< Position of LOCK field.                                             */
  #define SPU_FEATURE_COEXC_TURNAROUND_LOCK_Msk (0x1UL << SPU_FEATURE_COEXC_TURNAROUND_LOCK_Pos) /*!< Bit mask of LOCK field.  */
  #define SPU_FEATURE_COEXC_TURNAROUND_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                               */
  #define SPU_FEATURE_COEXC_TURNAROUND_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                               */
  #define SPU_FEATURE_COEXC_TURNAROUND_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                           */
  #define SPU_FEATURE_COEXC_TURNAROUND_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset    */

/* BLOCK @Bit 12 : BLOCK feature */
  #define SPU_FEATURE_COEXC_TURNAROUND_BLOCK_Pos (12UL) /*!< Position of BLOCK field.                                          */
  #define SPU_FEATURE_COEXC_TURNAROUND_BLOCK_Msk (0x1UL << SPU_FEATURE_COEXC_TURNAROUND_BLOCK_Pos) /*!< Bit mask of BLOCK
                                                                            field.*/                                              
  #define SPU_FEATURE_COEXC_TURNAROUND_BLOCK_Min (0x0UL) /*!< Min enumerator value of BLOCK field.                             */
  #define SPU_FEATURE_COEXC_TURNAROUND_BLOCK_Max (0x1UL) /*!< Max enumerator value of BLOCK field.                             */
  #define SPU_FEATURE_COEXC_TURNAROUND_BLOCK_Available (0x0UL) /*!< Feature is accessible                                      */
  #define SPU_FEATURE_COEXC_TURNAROUND_BLOCK_Blocked (0x1UL) /*!< Feature cannot be accessed until next reset                  */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_COEXC_TURNAROUND_OWNERID_Pos (16UL) /*!< Position of OWNERID field.                                      */
  #define SPU_FEATURE_COEXC_TURNAROUND_OWNERID_Msk (0xFUL << SPU_FEATURE_COEXC_TURNAROUND_OWNERID_Pos) /*!< Bit mask of OWNERID
                                                                            field.*/                                              
  #define SPU_FEATURE_COEXC_TURNAROUND_OWNERID_Min (0x0UL) /*!< Min value of OWNERID field.                                    */
  #define SPU_FEATURE_COEXC_TURNAROUND_OWNERID_Max (0xFUL) /*!< Max size of OWNERID field.                                     */


/* SPU_FEATURE_COEXC_CCMALLOW: Configuration of features for CCMALLOW of COEXC */
  #define SPU_FEATURE_COEXC_CCMALLOW_ResetValue (0x00000000UL) /*!< Reset value of CCMALLOW register.                          */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_COEXC_CCMALLOW_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                         */
  #define SPU_FEATURE_COEXC_CCMALLOW_SECATTR_Msk (0x1UL << SPU_FEATURE_COEXC_CCMALLOW_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/                                              
  #define SPU_FEATURE_COEXC_CCMALLOW_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                           */
  #define SPU_FEATURE_COEXC_CCMALLOW_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                           */
  #define SPU_FEATURE_COEXC_CCMALLOW_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                  */
  #define SPU_FEATURE_COEXC_CCMALLOW_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                          */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_COEXC_CCMALLOW_LOCK_Pos (8UL)  /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_COEXC_CCMALLOW_LOCK_Msk (0x1UL << SPU_FEATURE_COEXC_CCMALLOW_LOCK_Pos) /*!< Bit mask of LOCK field.      */
  #define SPU_FEATURE_COEXC_CCMALLOW_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                                 */
  #define SPU_FEATURE_COEXC_CCMALLOW_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                                 */
  #define SPU_FEATURE_COEXC_CCMALLOW_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                             */
  #define SPU_FEATURE_COEXC_CCMALLOW_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset      */

/* BLOCK @Bit 12 : BLOCK feature */
  #define SPU_FEATURE_COEXC_CCMALLOW_BLOCK_Pos (12UL) /*!< Position of BLOCK field.                                            */
  #define SPU_FEATURE_COEXC_CCMALLOW_BLOCK_Msk (0x1UL << SPU_FEATURE_COEXC_CCMALLOW_BLOCK_Pos) /*!< Bit mask of BLOCK field.   */
  #define SPU_FEATURE_COEXC_CCMALLOW_BLOCK_Min (0x0UL) /*!< Min enumerator value of BLOCK field.                               */
  #define SPU_FEATURE_COEXC_CCMALLOW_BLOCK_Max (0x1UL) /*!< Max enumerator value of BLOCK field.                               */
  #define SPU_FEATURE_COEXC_CCMALLOW_BLOCK_Available (0x0UL) /*!< Feature is accessible                                        */
  #define SPU_FEATURE_COEXC_CCMALLOW_BLOCK_Blocked (0x1UL) /*!< Feature cannot be accessed until next reset                    */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_COEXC_CCMALLOW_OWNERID_Pos (16UL) /*!< Position of OWNERID field.                                        */
  #define SPU_FEATURE_COEXC_CCMALLOW_OWNERID_Msk (0xFUL << SPU_FEATURE_COEXC_CCMALLOW_OWNERID_Pos) /*!< Bit mask of OWNERID
                                                                            field.*/                                              
  #define SPU_FEATURE_COEXC_CCMALLOW_OWNERID_Min (0x0UL) /*!< Min value of OWNERID field.                                      */
  #define SPU_FEATURE_COEXC_CCMALLOW_OWNERID_Max (0xFUL) /*!< Max size of OWNERID field.                                       */



/* ================================================ Struct SPU_FEATURE_ANTSWC ================================================ */
/**
  * @brief ANTSWC [SPU_FEATURE_ANTSWC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  RADIOPORT[8];                      /*!< (@ 0x00000000) Configuration of features for radio port [n] of ANTSWC*/
  __IOM uint32_t  OVERRIDEEN;                        /*!< (@ 0x00000020) Configuration of features for OVERRIDE enable of
                                                                         ANTSWC*/                                                 
} NRF_SPU_FEATURE_ANTSWC_Type;                       /*!< Size = 36 (0x024)                                                    */

