adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SPU_FEATURE_ANTSWC_RADIOPORT: Configuration of features for radio port [n] of ANTSWC */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_MaxCount (8UL) /*!< Max size of RADIOPORT[8] array.                                     */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_ResetValue (0x00000000UL) /*!< Reset value of RADIOPORT[8] register.                    */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                       */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_SECATTR_Msk (0x1UL << SPU_FEATURE_ANTSWC_RADIOPORT_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/                                              
  #define SPU_FEATURE_ANTSWC_RADIOPORT_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                         */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                         */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                        */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_LOCK_Pos (8UL) /*!< Position of LOCK field.                                             */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_LOCK_Msk (0x1UL << SPU_FEATURE_ANTSWC_RADIOPORT_LOCK_Pos) /*!< Bit mask of LOCK field.  */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                               */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                               */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                           */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset    */

/* BLOCK @Bit 12 : BLOCK feature */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_BLOCK_Pos (12UL) /*!< Position of BLOCK field.                                          */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_BLOCK_Msk (0x1UL << SPU_FEATURE_ANTSWC_RADIOPORT_BLOCK_Pos) /*!< Bit mask of BLOCK
                                                                            field.*/                                              
  #define SPU_FEATURE_ANTSWC_RADIOPORT_BLOCK_Min (0x0UL) /*!< Min enumerator value of BLOCK field.                             */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_BLOCK_Max (0x1UL) /*!< Max enumerator value of BLOCK field.                             */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_BLOCK_Available (0x0UL) /*!< Feature is accessible                                      */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_BLOCK_Blocked (0x1UL) /*!< Feature cannot be accessed until next reset                  */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_OWNERID_Pos (16UL) /*!< Position of OWNERID field.                                      */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_OWNERID_Msk (0xFUL << SPU_FEATURE_ANTSWC_RADIOPORT_OWNERID_Pos) /*!< Bit mask of OWNERID
                                                                            field.*/                                              
  #define SPU_FEATURE_ANTSWC_RADIOPORT_OWNERID_Min (0x0UL) /*!< Min value of OWNERID field.                                    */
  #define SPU_FEATURE_ANTSWC_RADIOPORT_OWNERID_Max (0xFUL) /*!< Max size of OWNERID field.                                     */


/* SPU_FEATURE_ANTSWC_OVERRIDEEN: Configuration of features for OVERRIDE enable of ANTSWC */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_ResetValue (0x00000000UL) /*!< Reset value of OVERRIDEEN register.                     */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                      */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_SECATTR_Msk (0x1UL << SPU_FEATURE_ANTSWC_OVERRIDEEN_SECATTR_Pos) /*!< Bit mask of
                                                                            SECATTR field.*/                                      
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                        */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                        */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage               */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                       */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_LOCK_Pos (8UL) /*!< Position of LOCK field.                                            */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_LOCK_Msk (0x1UL << SPU_FEATURE_ANTSWC_OVERRIDEEN_LOCK_Pos) /*!< Bit mask of LOCK field.*/
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                              */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                              */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                          */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset   */

/* BLOCK @Bit 12 : BLOCK feature */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_BLOCK_Pos (12UL) /*!< Position of BLOCK field.                                         */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_BLOCK_Msk (0x1UL << SPU_FEATURE_ANTSWC_OVERRIDEEN_BLOCK_Pos) /*!< Bit mask of BLOCK
                                                                            field.*/                                              
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_BLOCK_Min (0x0UL) /*!< Min enumerator value of BLOCK field.                            */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_BLOCK_Max (0x1UL) /*!< Max enumerator value of BLOCK field.                            */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_BLOCK_Available (0x0UL) /*!< Feature is accessible                                     */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_BLOCK_Blocked (0x1UL) /*!< Feature cannot be accessed until next reset                 */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_OWNERID_Pos (16UL) /*!< Position of OWNERID field.                                     */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_OWNERID_Msk (0xFUL << SPU_FEATURE_ANTSWC_OVERRIDEEN_OWNERID_Pos) /*!< Bit mask of
                                                                            OWNERID field.*/                                      
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_OWNERID_Min (0x0UL) /*!< Min value of OWNERID field.                                   */
  #define SPU_FEATURE_ANTSWC_OVERRIDEEN_OWNERID_Max (0xFUL) /*!< Max size of OWNERID field.                                    */



/* ================================================= Struct SPU_FEATURE_GPIO ================================================= */
/**
  * @brief GPIO [SPU_FEATURE_GPIO] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PIN[32];                           /*!< (@ 0x00000000) Configuration of features for GPIO[n] PIN[o]          */
} NRF_SPU_FEATURE_GPIO_Type;                         /*!< Size = 128 (0x080)                                                   */
  #define SPU_FEATURE_GPIO_MaxCount (10UL)           /*!< Max size of GPIO[10] array.                                          */

/* SPU_FEATURE_GPIO_PIN: Configuration of features for GPIO[n] PIN[o] */
  #define SPU_FEATURE_GPIO_PIN_MaxCount (32UL)       /*!< Max size of PIN[32] array.                                           */
  #define SPU_FEATURE_GPIO_PIN_ResetValue (0x00000000UL) /*!< Reset value of PIN[32] register.                                 */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Pos (4UL)     /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Msk (0x1UL << SPU_FEATURE_GPIO_PIN_SECATTR_Pos) /*!< Bit mask of SECATTR field.         */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Min (0x0UL)   /*!< Min enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Max (0x1UL)   /*!< Max enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                        */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                                */

