adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TRACEBUS @Bits 10..13 : Trace bus support. */
  #define STM_SPFEAT1R_TRACEBUS_Pos (10UL)           /*!< Position of TRACEBUS field.                                          */
  #define STM_SPFEAT1R_TRACEBUS_Msk (0xFUL << STM_SPFEAT1R_TRACEBUS_Pos) /*!< Bit mask of TRACEBUS field.                      */

/* TRIGCTL @Bits 14..15 : Trigger control support. */
  #define STM_SPFEAT1R_TRIGCTL_Pos (14UL)            /*!< Position of TRIGCTL field.                                           */
  #define STM_SPFEAT1R_TRIGCTL_Msk (0x3UL << STM_SPFEAT1R_TRIGCTL_Pos) /*!< Bit mask of TRIGCTL field.                         */

/* TSPRESCALE @Bits 16..17 : Timestamp prescale support */
  #define STM_SPFEAT1R_TSPRESCALE_Pos (16UL)         /*!< Position of TSPRESCALE field.                                        */
  #define STM_SPFEAT1R_TSPRESCALE_Msk (0x3UL << STM_SPFEAT1R_TSPRESCALE_Pos) /*!< Bit mask of TSPRESCALE field.                */
  #define STM_SPFEAT1R_TSPRESCALE_Min (0x0UL)        /*!< Min enumerator value of TSPRESCALE field.                            */
  #define STM_SPFEAT1R_TSPRESCALE_Max (0x1UL)        /*!< Max enumerator value of TSPRESCALE field.                            */
  #define STM_SPFEAT1R_TSPRESCALE_NotImplemented (0x0UL) /*!< Timestamp prescale is not implemented.                           */
  #define STM_SPFEAT1R_TSPRESCALE_Implemented (0x1UL) /*!< Timestamp prescale is implemented.                                  */

/* HWTEN @Bits 18..19 : STMTCSR.HWTEN support */
  #define STM_SPFEAT1R_HWTEN_Pos (18UL)              /*!< Position of HWTEN field.                                             */
  #define STM_SPFEAT1R_HWTEN_Msk (0x3UL << STM_SPFEAT1R_HWTEN_Pos) /*!< Bit mask of HWTEN field.                               */
  #define STM_SPFEAT1R_HWTEN_Min (0x1UL)             /*!< Min enumerator value of HWTEN field.                                 */
  #define STM_SPFEAT1R_HWTEN_Max (0x1UL)             /*!< Max enumerator value of HWTEN field.                                 */
  #define STM_SPFEAT1R_HWTEN_NotImplemented (0x1UL)  /*!< STMTCSR.HWTEN is not implemented                                     */

/* SYNCEN @Bits 20..21 : STMTCSR.SYNCEN support */
  #define STM_SPFEAT1R_SYNCEN_Pos (20UL)             /*!< Position of SYNCEN field.                                            */
  #define STM_SPFEAT1R_SYNCEN_Msk (0x3UL << STM_SPFEAT1R_SYNCEN_Pos) /*!< Bit mask of SYNCEN field.                            */
  #define STM_SPFEAT1R_SYNCEN_Min (0x2UL)            /*!< Min enumerator value of SYNCEN field.                                */
  #define STM_SPFEAT1R_SYNCEN_Max (0x2UL)            /*!< Max enumerator value of SYNCEN field.                                */
  #define STM_SPFEAT1R_SYNCEN_ReadAsOne (0x2UL)      /*!< STMTCSR.SYNCEN implemented but always reads as b1                    */

/* SWOEN @Bits 22..23 : STMTCSR.SWOEN support */
  #define STM_SPFEAT1R_SWOEN_Pos (22UL)              /*!< Position of SWOEN field.                                             */
  #define STM_SPFEAT1R_SWOEN_Msk (0x3UL << STM_SPFEAT1R_SWOEN_Pos) /*!< Bit mask of SWOEN field.                               */
  #define STM_SPFEAT1R_SWOEN_Min (0x1UL)             /*!< Min enumerator value of SWOEN field.                                 */
  #define STM_SPFEAT1R_SWOEN_Max (0x1UL)             /*!< Max enumerator value of SWOEN field.                                 */
  #define STM_SPFEAT1R_SWOEN_NotImplemented (0x1UL)  /*!< STMTCSR.SWOEN not implemented                                        */


/* STM_SPFEAT2R: Indicates the features of the STM. */
  #define STM_SPFEAT2R_ResetValue (0x00000000UL)     /*!< Reset value of SPFEAT2R register.                                    */

/* SPTER @Bits 0..1 : STMSPTER support. */
  #define STM_SPFEAT2R_SPTER_Pos (0UL)               /*!< Position of SPTER field.                                             */
  #define STM_SPFEAT2R_SPTER_Msk (0x3UL << STM_SPFEAT2R_SPTER_Pos) /*!< Bit mask of SPTER field.                               */
  #define STM_SPFEAT2R_SPTER_Min (0x2UL)             /*!< Min enumerator value of SPTER field.                                 */
  #define STM_SPFEAT2R_SPTER_Max (0x2UL)             /*!< Max enumerator value of SPTER field.                                 */
  #define STM_SPFEAT2R_SPTER_Implemented (0x2UL)     /*!< STMSPTER is implemented.                                             */

/* SPER @Bit 2 : STMSPER presence. */
  #define STM_SPFEAT2R_SPER_Pos (2UL)                /*!< Position of SPER field.                                              */
  #define STM_SPFEAT2R_SPER_Msk (0x1UL << STM_SPFEAT2R_SPER_Pos) /*!< Bit mask of SPER field.                                  */
  #define STM_SPFEAT2R_SPER_Min (0x0UL)              /*!< Min enumerator value of SPER field.                                  */
  #define STM_SPFEAT2R_SPER_Max (0x1UL)              /*!< Max enumerator value of SPER field.                                  */
  #define STM_SPFEAT2R_SPER_Implemented (0x0UL)      /*!< STMSPER is implemented.                                              */
  #define STM_SPFEAT2R_SPER_NotImplemented (0x1UL)   /*!< STMSPER is not implemented.                                          */

/* SPCOMP @Bits 4..5 : Data compression on stimulus ports support. */
  #define STM_SPFEAT2R_SPCOMP_Pos (4UL)              /*!< Position of SPCOMP field.                                            */
  #define STM_SPFEAT2R_SPCOMP_Msk (0x3UL << STM_SPFEAT2R_SPCOMP_Pos) /*!< Bit mask of SPCOMP field.                            */
  #define STM_SPFEAT2R_SPCOMP_Min (0x3UL)            /*!< Min enumerator value of SPCOMP field.                                */
  #define STM_SPFEAT2R_SPCOMP_Max (0x3UL)            /*!< Max enumerator value of SPCOMP field.                                */
  #define STM_SPFEAT2R_SPCOMP_Programmable (0x3UL)   /*!< Data compression support is programmable. STMTCSR.COMPEN is
                                                          implemented.*/                                                          

/* SPOVERRIDE @Bit 6 : Timestamp force configuration. */
  #define STM_SPFEAT2R_SPOVERRIDE_Pos (6UL)          /*!< Position of SPOVERRIDE field.                                        */
  #define STM_SPFEAT2R_SPOVERRIDE_Msk (0x1UL << STM_SPFEAT2R_SPOVERRIDE_Pos) /*!< Bit mask of SPOVERRIDE field.                */
  #define STM_SPFEAT2R_SPOVERRIDE_Min (0x0UL)        /*!< Min enumerator value of SPOVERRIDE field.                            */
  #define STM_SPFEAT2R_SPOVERRIDE_Max (0x1UL)        /*!< Max enumerator value of SPOVERRIDE field.                            */
  #define STM_SPFEAT2R_SPOVERRIDE_NotImplemented (0x0UL) /*!< STMSPOVERRIDER and STMSPMOVERRIDER is not implemented.           */
  #define STM_SPFEAT2R_SPOVERRIDE_Implemented (0x1UL) /*!< STMSPOVERRIDER and STMSPMOVERRIDER is implemented.                  */

