adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PRIVMASK @Bits 7..8 : STMPRIVMASKR support. */
  #define STM_SPFEAT2R_PRIVMASK_Pos (7UL)            /*!< Position of PRIVMASK field.                                          */
  #define STM_SPFEAT2R_PRIVMASK_Msk (0x3UL << STM_SPFEAT2R_PRIVMASK_Pos) /*!< Bit mask of PRIVMASK field.                      */
  #define STM_SPFEAT2R_PRIVMASK_Min (0x1UL)          /*!< Min enumerator value of PRIVMASK field.                              */
  #define STM_SPFEAT2R_PRIVMASK_Max (0x1UL)          /*!< Max enumerator value of PRIVMASK field.                              */
  #define STM_SPFEAT2R_PRIVMASK_NotImplemented (0x1UL) /*!< STMPRIVMASKR is not implemented.                                   */

/* SPTRTYPE @Bits 9..10 : Stimulus port transaction type support. */
  #define STM_SPFEAT2R_SPTRTYPE_Pos (9UL)            /*!< Position of SPTRTYPE field.                                          */
  #define STM_SPFEAT2R_SPTRTYPE_Msk (0x3UL << STM_SPFEAT2R_SPTRTYPE_Pos) /*!< Bit mask of SPTRTYPE field.                      */
  #define STM_SPFEAT2R_SPTRTYPE_Min (0x2UL)          /*!< Min enumerator value of SPTRTYPE field.                              */
  #define STM_SPFEAT2R_SPTRTYPE_Max (0x2UL)          /*!< Max enumerator value of SPTRTYPE field.                              */
  #define STM_SPFEAT2R_SPTRTYPE_InvariantAndGuaranteed (0x2UL) /*!< Both invariant timing and guaranteed transactions are
                                                                    supported.*/                                                  

/* DSIZE @Bits 12..15 : Fundamental data size. */
  #define STM_SPFEAT2R_DSIZE_Pos (12UL)              /*!< Position of DSIZE field.                                             */
  #define STM_SPFEAT2R_DSIZE_Msk (0xFUL << STM_SPFEAT2R_DSIZE_Pos) /*!< Bit mask of DSIZE field.                               */
  #define STM_SPFEAT2R_DSIZE_Min (0x0UL)             /*!< Min enumerator value of DSIZE field.                                 */
  #define STM_SPFEAT2R_DSIZE_Max (0x0UL)             /*!< Max enumerator value of DSIZE field.                                 */
  #define STM_SPFEAT2R_DSIZE_Bits32 (0x0UL)          /*!< 32-bit data.                                                         */

/* SPTYPE @Bits 18..19 : Stimulus port type support */
  #define STM_SPFEAT2R_SPTYPE_Pos (18UL)             /*!< Position of SPTYPE field.                                            */
  #define STM_SPFEAT2R_SPTYPE_Msk (0x3UL << STM_SPFEAT2R_SPTYPE_Pos) /*!< Bit mask of SPTYPE field.                            */
  #define STM_SPFEAT2R_SPTYPE_Min (0x1UL)            /*!< Min enumerator value of SPTYPE field.                                */
  #define STM_SPFEAT2R_SPTYPE_Max (0x1UL)            /*!< Max enumerator value of SPTYPE field.                                */
  #define STM_SPFEAT2R_SPTYPE_OnlyExtended (0x1UL)   /*!< Only extended stimulus ports are implemented.                        */


/* STM_SPFEAT3R: Indicates the features of the STM. */
  #define STM_SPFEAT3R_ResetValue (0x00000000UL)     /*!< Reset value of SPFEAT3R register.                                    */

/* NUMMAST @Bits 0..6 : The number of stimulus ports masters implemented, minus 1. */
  #define STM_SPFEAT3R_NUMMAST_Pos (0UL)             /*!< Position of NUMMAST field.                                           */
  #define STM_SPFEAT3R_NUMMAST_Msk (0x7FUL << STM_SPFEAT3R_NUMMAST_Pos) /*!< Bit mask of NUMMAST field.                        */
  #define STM_SPFEAT3R_NUMMAST_Min (0x3FUL)          /*!< Min enumerator value of NUMMAST field.                               */
  #define STM_SPFEAT3R_NUMMAST_Max (0x3FUL)          /*!< Max enumerator value of NUMMAST field.                               */
  #define STM_SPFEAT3R_NUMMAST_Masters128 (0x3FUL)   /*!< Example: 128 masters implemented.                                    */


/* STM_ITTRIGGER: Integration Test for Cross-Trigger Outputs Register. */
  #define STM_ITTRIGGER_ResetValue (0x00000000UL)    /*!< Reset value of ITTRIGGER register.                                   */

/* TRIGOUTSPTE_W @Bit 0 : Sets the value of the TRIGOUTSPTE output in integration mode. */
  #define STM_ITTRIGGER_TRIGOUTSPTE_W_Pos (0UL)      /*!< Position of TRIGOUTSPTE_W field.                                     */
  #define STM_ITTRIGGER_TRIGOUTSPTE_W_Msk (0x1UL << STM_ITTRIGGER_TRIGOUTSPTE_W_Pos) /*!< Bit mask of TRIGOUTSPTE_W field.     */
  #define STM_ITTRIGGER_TRIGOUTSPTE_W_Min (0x0UL)    /*!< Min enumerator value of TRIGOUTSPTE_W field.                         */
  #define STM_ITTRIGGER_TRIGOUTSPTE_W_Max (0x1UL)    /*!< Max enumerator value of TRIGOUTSPTE_W field.                         */
  #define STM_ITTRIGGER_TRIGOUTSPTE_W_Low (0x0UL)    /*!< Drive logic 0 on output.                                             */
  #define STM_ITTRIGGER_TRIGOUTSPTE_W_High (0x1UL)   /*!< Drive logic 1 on output.                                             */

/* TRIGOUTSW_W @Bit 1 : Sets the value of the TRIGOUTSW output in integration mode. */
  #define STM_ITTRIGGER_TRIGOUTSW_W_Pos (1UL)        /*!< Position of TRIGOUTSW_W field.                                       */
  #define STM_ITTRIGGER_TRIGOUTSW_W_Msk (0x1UL << STM_ITTRIGGER_TRIGOUTSW_W_Pos) /*!< Bit mask of TRIGOUTSW_W field.           */
  #define STM_ITTRIGGER_TRIGOUTSW_W_Min (0x0UL)      /*!< Min enumerator value of TRIGOUTSW_W field.                           */
  #define STM_ITTRIGGER_TRIGOUTSW_W_Max (0x1UL)      /*!< Max enumerator value of TRIGOUTSW_W field.                           */
  #define STM_ITTRIGGER_TRIGOUTSW_W_Low (0x0UL)      /*!< Drive logic 0 on output.                                             */
  #define STM_ITTRIGGER_TRIGOUTSW_W_High (0x1UL)     /*!< Drive logic 1 on output.                                             */

/* TRIGOUTHETE_W @Bit 2 : Sets the value of the TRIGOUTHETE output in integration mode. */
  #define STM_ITTRIGGER_TRIGOUTHETE_W_Pos (2UL)      /*!< Position of TRIGOUTHETE_W field.                                     */
  #define STM_ITTRIGGER_TRIGOUTHETE_W_Msk (0x1UL << STM_ITTRIGGER_TRIGOUTHETE_W_Pos) /*!< Bit mask of TRIGOUTHETE_W field.     */
  #define STM_ITTRIGGER_TRIGOUTHETE_W_Min (0x0UL)    /*!< Min enumerator value of TRIGOUTHETE_W field.                         */
  #define STM_ITTRIGGER_TRIGOUTHETE_W_Max (0x1UL)    /*!< Max enumerator value of TRIGOUTHETE_W field.                         */
  #define STM_ITTRIGGER_TRIGOUTHETE_W_Low (0x0UL)    /*!< Drive logic 0 on output.                                             */
  #define STM_ITTRIGGER_TRIGOUTHETE_W_High (0x1UL)   /*!< Drive logic 1 on output.                                             */

/* ASYNCOUT_W @Bit 3 : Sets the value of the ASYNCOUT output in integration mode. */
  #define STM_ITTRIGGER_ASYNCOUT_W_Pos (3UL)         /*!< Position of ASYNCOUT_W field.                                        */
  #define STM_ITTRIGGER_ASYNCOUT_W_Msk (0x1UL << STM_ITTRIGGER_ASYNCOUT_W_Pos) /*!< Bit mask of ASYNCOUT_W field.              */
  #define STM_ITTRIGGER_ASYNCOUT_W_Min (0x0UL)       /*!< Min enumerator value of ASYNCOUT_W field.                            */
  #define STM_ITTRIGGER_ASYNCOUT_W_Max (0x1UL)       /*!< Max enumerator value of ASYNCOUT_W field.                            */
  #define STM_ITTRIGGER_ASYNCOUT_W_Low (0x0UL)       /*!< Drive logic 0 on output.                                             */
  #define STM_ITTRIGGER_ASYNCOUT_W_High (0x1UL)      /*!< Drive logic 1 on output.                                             */


/* STM_ITATBDATA0: Controls the value of the ATDATAM output in integration mode. */
  #define STM_ITATBDATA0_ResetValue (0x00000000UL)   /*!< Reset value of ITATBDATA0 register.                                  */

/* ATDATAM0_W @Bit 0 : Sets the value of the ATDATAM[0]. */
  #define STM_ITATBDATA0_ATDATAM0_W_Pos (0UL)        /*!< Position of ATDATAM0_W field.                                        */
  #define STM_ITATBDATA0_ATDATAM0_W_Msk (0x1UL << STM_ITATBDATA0_ATDATAM0_W_Pos) /*!< Bit mask of ATDATAM0_W field.            */
  #define STM_ITATBDATA0_ATDATAM0_W_Min (0x0UL)      /*!< Min enumerator value of ATDATAM0_W field.                            */
  #define STM_ITATBDATA0_ATDATAM0_W_Max (0x1UL)      /*!< Max enumerator value of ATDATAM0_W field.                            */
  #define STM_ITATBDATA0_ATDATAM0_W_Low (0x0UL)      /*!< Drive logic 0 on output.                                             */
  #define STM_ITATBDATA0_ATDATAM0_W_High (0x1UL)     /*!< Drive logic 1 on output.                                             */

/* ATDATAM7_W @Bit 1 : Sets the value of the ATDATAM[7] output. */
  #define STM_ITATBDATA0_ATDATAM7_W_Pos (1UL)        /*!< Position of ATDATAM7_W field.                                        */
  #define STM_ITATBDATA0_ATDATAM7_W_Msk (0x1UL << STM_ITATBDATA0_ATDATAM7_W_Pos) /*!< Bit mask of ATDATAM7_W field.            */
  #define STM_ITATBDATA0_ATDATAM7_W_Min (0x0UL)      /*!< Min enumerator value of ATDATAM7_W field.                            */
  #define STM_ITATBDATA0_ATDATAM7_W_Max (0x1UL)      /*!< Max enumerator value of ATDATAM7_W field.                            */
  #define STM_ITATBDATA0_ATDATAM7_W_Low (0x0UL)      /*!< Drive logic 0 on output.                                             */
  #define STM_ITATBDATA0_ATDATAM7_W_High (0x1UL)     /*!< Drive logic 1 on output.                                             */

/* ATDATAM15_W @Bit 2 : Sets the value of the ATDATAM[15]. */
  #define STM_ITATBDATA0_ATDATAM15_W_Pos (2UL)       /*!< Position of ATDATAM15_W field.                                       */
  #define STM_ITATBDATA0_ATDATAM15_W_Msk (0x1UL << STM_ITATBDATA0_ATDATAM15_W_Pos) /*!< Bit mask of ATDATAM15_W field.         */
  #define STM_ITATBDATA0_ATDATAM15_W_Min (0x0UL)     /*!< Min enumerator value of ATDATAM15_W field.                           */
  #define STM_ITATBDATA0_ATDATAM15_W_Max (0x1UL)     /*!< Max enumerator value of ATDATAM15_W field.                           */
  #define STM_ITATBDATA0_ATDATAM15_W_Low (0x0UL)     /*!< Drive logic 0 on output.                                             */
  #define STM_ITATBDATA0_ATDATAM15_W_High (0x1UL)    /*!< Drive logic 1 on output.                                             */

/* ATDATAM23_W @Bit 3 : Sets the value of the ATDATAM[23]. */
  #define STM_ITATBDATA0_ATDATAM23_W_Pos (3UL)       /*!< Position of ATDATAM23_W field.                                       */
  #define STM_ITATBDATA0_ATDATAM23_W_Msk (0x1UL << STM_ITATBDATA0_ATDATAM23_W_Pos) /*!< Bit mask of ATDATAM23_W field.         */
  #define STM_ITATBDATA0_ATDATAM23_W_Min (0x0UL)     /*!< Min enumerator value of ATDATAM23_W field.                           */
  #define STM_ITATBDATA0_ATDATAM23_W_Max (0x1UL)     /*!< Max enumerator value of ATDATAM23_W field.                           */
  #define STM_ITATBDATA0_ATDATAM23_W_Low (0x0UL)     /*!< Drive logic 0 on output.                                             */
  #define STM_ITATBDATA0_ATDATAM23_W_High (0x1UL)    /*!< Drive logic 1 on output.                                             */

