adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* AFREADYM_W @Bit 1 : Sets the value of the AFREADYM_W output. */
  #define STM_ITATBCTR0_AFREADYM_W_Pos (1UL)         /*!< Position of AFREADYM_W field.                                        */
  #define STM_ITATBCTR0_AFREADYM_W_Msk (0x1UL << STM_ITATBCTR0_AFREADYM_W_Pos) /*!< Bit mask of AFREADYM_W field.              */
  #define STM_ITATBCTR0_AFREADYM_W_Min (0x0UL)       /*!< Min enumerator value of AFREADYM_W field.                            */
  #define STM_ITATBCTR0_AFREADYM_W_Max (0x1UL)       /*!< Max enumerator value of AFREADYM_W field.                            */
  #define STM_ITATBCTR0_AFREADYM_W_Low (0x0UL)       /*!< Pin is at logic 0.                                                   */
  #define STM_ITATBCTR0_AFREADYM_W_High (0x1UL)      /*!< Pin is at logic 1.                                                   */

/* ATBYTESM_W0 @Bit 8 : Sets the value of pin 0 of the ATBYTESM output. */
  #define STM_ITATBCTR0_ATBYTESM_W0_Pos (8UL)        /*!< Position of ATBYTESM_W0 field.                                       */
  #define STM_ITATBCTR0_ATBYTESM_W0_Msk (0x1UL << STM_ITATBCTR0_ATBYTESM_W0_Pos) /*!< Bit mask of ATBYTESM_W0 field.           */
  #define STM_ITATBCTR0_ATBYTESM_W0_Min (0x0UL)      /*!< Min enumerator value of ATBYTESM_W0 field.                           */
  #define STM_ITATBCTR0_ATBYTESM_W0_Max (0x1UL)      /*!< Max enumerator value of ATBYTESM_W0 field.                           */
  #define STM_ITATBCTR0_ATBYTESM_W0_Low (0x0UL)      /*!< Pin is at logic 0.                                                   */
  #define STM_ITATBCTR0_ATBYTESM_W0_High (0x1UL)     /*!< Pin is at logic 1.                                                   */

/* ATBYTESM_W1 @Bit 9 : Sets the value of pin 1 of the ATBYTESM output. */
  #define STM_ITATBCTR0_ATBYTESM_W1_Pos (9UL)        /*!< Position of ATBYTESM_W1 field.                                       */
  #define STM_ITATBCTR0_ATBYTESM_W1_Msk (0x1UL << STM_ITATBCTR0_ATBYTESM_W1_Pos) /*!< Bit mask of ATBYTESM_W1 field.           */
  #define STM_ITATBCTR0_ATBYTESM_W1_Min (0x0UL)      /*!< Min enumerator value of ATBYTESM_W1 field.                           */
  #define STM_ITATBCTR0_ATBYTESM_W1_Max (0x1UL)      /*!< Max enumerator value of ATBYTESM_W1 field.                           */
  #define STM_ITATBCTR0_ATBYTESM_W1_Low (0x0UL)      /*!< Pin is at logic 0.                                                   */
  #define STM_ITATBCTR0_ATBYTESM_W1_High (0x1UL)     /*!< Pin is at logic 1.                                                   */


/* STM_ITCTRL: Used to enable topology detection. This register enables the component to switch from a functional mode, the
                default behavior, to integration mode where the inputs and outputs of the component can be directly controlled
                for integration testing and topology solving. */                                                                  
                                                                                                                                  
  #define STM_ITCTRL_ResetValue (0x00000000UL)       /*!< Reset value of ITCTRL register.                                      */

/* INTEGRATIONMODE @Bit 0 : Enables the component to switch from functional mode to integration mode and back. If no integration
                            functionality is implemented, this register must read as zero. */                                     
                                                                                                                                  
  #define STM_ITCTRL_INTEGRATIONMODE_Pos (0UL)       /*!< Position of INTEGRATIONMODE field.                                   */
  #define STM_ITCTRL_INTEGRATIONMODE_Msk (0x1UL << STM_ITCTRL_INTEGRATIONMODE_Pos) /*!< Bit mask of INTEGRATIONMODE field.     */
  #define STM_ITCTRL_INTEGRATIONMODE_Min (0x0UL)     /*!< Min enumerator value of INTEGRATIONMODE field.                       */
  #define STM_ITCTRL_INTEGRATIONMODE_Max (0x1UL)     /*!< Max enumerator value of INTEGRATIONMODE field.                       */
  #define STM_ITCTRL_INTEGRATIONMODE_Disabled (0x0UL) /*!< Integration mode is disabled.                                       */
  #define STM_ITCTRL_INTEGRATIONMODE_Enabled (0x1UL) /*!< Integration mode is Enabled.                                         */


/* STM_LAR: This is used to enable write access to device registers. */
  #define STM_LAR_ResetValue (0x00000000UL)          /*!< Reset value of LAR register.                                         */

/* ACCESS @Bits 0..31 : A write of 0xC5ACCE55 enables further write access to this device. Any other write removes write access.
                        */                                                                                                        
                                                                                                                                  
  #define STM_LAR_ACCESS_Pos (0UL)                   /*!< Position of ACCESS field.                                            */
  #define STM_LAR_ACCESS_Msk (0xFFFFFFFFUL << STM_LAR_ACCESS_Pos) /*!< Bit mask of ACCESS field.                               */
  #define STM_LAR_ACCESS_Min (0xC5ACCE55UL)          /*!< Min enumerator value of ACCESS field.                                */
  #define STM_LAR_ACCESS_Max (0xC5ACCE55UL)          /*!< Max enumerator value of ACCESS field.                                */
  #define STM_LAR_ACCESS_UnLock (0xC5ACCE55UL)       /*!< Unlock register interface.                                           */


/* STM_LSR: This indicates the status of the lock control mechanism. This lock prevents accidental writes by code under debug.
             Accesses to the extended stimulus port registers are not affected by the lock mechanism. This register must always
             be present although there might not be any lock access control mechanism. The lock mechanism, where present and
             locked, must block write accesses to any control register, except the Lock Access Register. For most components
             this covers all registers except for the Lock Access Register. */                                                    
                                                                                                                                  
