adamkondraciuk/nrfx/mdk/nrf7140_types.h
  #define STM_LSR_ResetValue (0x00000000UL)          /*!< Reset value of LSR register.                                         */

/* PRESENT @Bit 0 : Indicates that a lock control mechanism exists for this device. */
  #define STM_LSR_PRESENT_Pos (0UL)                  /*!< Position of PRESENT field.                                           */
  #define STM_LSR_PRESENT_Msk (0x1UL << STM_LSR_PRESENT_Pos) /*!< Bit mask of PRESENT field.                                   */
  #define STM_LSR_PRESENT_Min (0x0UL)                /*!< Min enumerator value of PRESENT field.                               */
  #define STM_LSR_PRESENT_Max (0x1UL)                /*!< Max enumerator value of PRESENT field.                               */
  #define STM_LSR_PRESENT_NotImplemented (0x0UL)     /*!< No lock control mechanism exists, writes to the Lock Access Register
                                                          are ignored.*/                                                          
  #define STM_LSR_PRESENT_Implemented (0x1UL)        /*!< Lock control mechanism is present.                                   */

/* LOCKED @Bit 1 : Returns the current status of the Lock. */
  #define STM_LSR_LOCKED_Pos (1UL)                   /*!< Position of LOCKED field.                                            */
  #define STM_LSR_LOCKED_Msk (0x1UL << STM_LSR_LOCKED_Pos) /*!< Bit mask of LOCKED field.                                      */
  #define STM_LSR_LOCKED_Min (0x0UL)                 /*!< Min enumerator value of LOCKED field.                                */
  #define STM_LSR_LOCKED_Max (0x1UL)                 /*!< Max enumerator value of LOCKED field.                                */
  #define STM_LSR_LOCKED_UnLocked (0x0UL)            /*!< Write access is allowed to this device.                              */
  #define STM_LSR_LOCKED_Locked (0x1UL)              /*!< Write access to the component is blocked. All writes to control
                                                          registers are ignored. Reads are permitted.*/                           

/* TYPE @Bit 2 : Indicates if the Lock Access Register is implemented as 8-bit or 32-bit. */
  #define STM_LSR_TYPE_Pos (2UL)                     /*!< Position of TYPE field.                                              */
  #define STM_LSR_TYPE_Msk (0x1UL << STM_LSR_TYPE_Pos) /*!< Bit mask of TYPE field.                                            */
  #define STM_LSR_TYPE_Min (0x0UL)                   /*!< Min enumerator value of TYPE field.                                  */
  #define STM_LSR_TYPE_Max (0x1UL)                   /*!< Max enumerator value of TYPE field.                                  */
  #define STM_LSR_TYPE_Bits32 (0x0UL)                /*!< This component implements a 32-bit Lock Access Register.             */
  #define STM_LSR_TYPE_Bits8 (0x1UL)                 /*!< This component implements an 8-bit Lock Access Register.             */


/* STM_AUTHSTATUS: Indicates the current level of tracing permitted by the system */
  #define STM_AUTHSTATUS_ResetValue (0x00000000UL)   /*!< Reset value of AUTHSTATUS register.                                  */

/* NSID @Bits 0..1 : Non-secure Invasive Debug */
  #define STM_AUTHSTATUS_NSID_Pos (0UL)              /*!< Position of NSID field.                                              */
  #define STM_AUTHSTATUS_NSID_Msk (0x3UL << STM_AUTHSTATUS_NSID_Pos) /*!< Bit mask of NSID field.                              */
  #define STM_AUTHSTATUS_NSID_Min (0x0UL)            /*!< Min enumerator value of NSID field.                                  */
  #define STM_AUTHSTATUS_NSID_Max (0x1UL)            /*!< Max enumerator value of NSID field.                                  */
  #define STM_AUTHSTATUS_NSID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                      */
  #define STM_AUTHSTATUS_NSID_Implemented (0x1UL)    /*!< The feature is implemented.                                          */

/* NSNID @Bits 2..3 : Non-secure Non-Invasive Debug */
  #define STM_AUTHSTATUS_NSNID_Pos (2UL)             /*!< Position of NSNID field.                                             */
  #define STM_AUTHSTATUS_NSNID_Msk (0x3UL << STM_AUTHSTATUS_NSNID_Pos) /*!< Bit mask of NSNID field.                           */
  #define STM_AUTHSTATUS_NSNID_Min (0x0UL)           /*!< Min enumerator value of NSNID field.                                 */
  #define STM_AUTHSTATUS_NSNID_Max (0x1UL)           /*!< Max enumerator value of NSNID field.                                 */
  #define STM_AUTHSTATUS_NSNID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                     */
  #define STM_AUTHSTATUS_NSNID_Implemented (0x1UL)   /*!< The feature is implemented.                                          */

/* SID @Bits 4..5 : Secure Invasive Debug */
  #define STM_AUTHSTATUS_SID_Pos (4UL)               /*!< Position of SID field.                                               */
  #define STM_AUTHSTATUS_SID_Msk (0x3UL << STM_AUTHSTATUS_SID_Pos) /*!< Bit mask of SID field.                                 */
  #define STM_AUTHSTATUS_SID_Min (0x0UL)             /*!< Min enumerator value of SID field.                                   */
  #define STM_AUTHSTATUS_SID_Max (0x1UL)             /*!< Max enumerator value of SID field.                                   */
  #define STM_AUTHSTATUS_SID_NotImplemented (0x0UL)  /*!< The feature is not implemented.                                      */
  #define STM_AUTHSTATUS_SID_Implemented (0x1UL)     /*!< The feature is implemented.                                          */

/* SNID @Bits 6..7 : Secure Non-Invasive Debug */
  #define STM_AUTHSTATUS_SNID_Pos (6UL)              /*!< Position of SNID field.                                              */
  #define STM_AUTHSTATUS_SNID_Msk (0x3UL << STM_AUTHSTATUS_SNID_Pos) /*!< Bit mask of SNID field.                              */
  #define STM_AUTHSTATUS_SNID_Min (0x0UL)            /*!< Min enumerator value of SNID field.                                  */
  #define STM_AUTHSTATUS_SNID_Max (0x1UL)            /*!< Max enumerator value of SNID field.                                  */
  #define STM_AUTHSTATUS_SNID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                      */
  #define STM_AUTHSTATUS_SNID_Implemented (0x1UL)    /*!< The feature is implemented.                                          */


