adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* STM_DEVID: Indicates the capabilities of the STM. */
  #define STM_DEVID_ResetValue (0x00000000UL)        /*!< Reset value of DEVID register.                                       */

/* NUMSP @Bits 0..16 : This value indicates the number of stimulus ports implemented. */
  #define STM_DEVID_NUMSP_Pos (0UL)                  /*!< Position of NUMSP field.                                             */
  #define STM_DEVID_NUMSP_Msk (0x1FFFFUL << STM_DEVID_NUMSP_Pos) /*!< Bit mask of NUMSP field.                                 */
  #define STM_DEVID_NUMSP_Max (0x10000UL)            /*!< Maximum 65,536 stimulus ports can be implemented.                    */


/* STM_DEVTYPE: Controls the single-shot comparator. */
  #define STM_DEVTYPE_ResetValue (0x00000000UL)      /*!< Reset value of DEVTYPE register.                                     */

/* MAJOR @Bits 0..3 : The main type of the component */
  #define STM_DEVTYPE_MAJOR_Pos (0UL)                /*!< Position of MAJOR field.                                             */
  #define STM_DEVTYPE_MAJOR_Msk (0xFUL << STM_DEVTYPE_MAJOR_Pos) /*!< Bit mask of MAJOR field.                                 */
  #define STM_DEVTYPE_MAJOR_Min (0x3UL)              /*!< Min enumerator value of MAJOR field.                                 */
  #define STM_DEVTYPE_MAJOR_Max (0x3UL)              /*!< Max enumerator value of MAJOR field.                                 */
  #define STM_DEVTYPE_MAJOR_TraceSource (0x3UL)      /*!< Peripheral is a trace source.                                        */

/* SUB @Bits 4..7 : The sub-type of the component */
  #define STM_DEVTYPE_SUB_Pos (4UL)                  /*!< Position of SUB field.                                               */
  #define STM_DEVTYPE_SUB_Msk (0xFUL << STM_DEVTYPE_SUB_Pos) /*!< Bit mask of SUB field.                                       */
  #define STM_DEVTYPE_SUB_Min (0x6UL)                /*!< Min enumerator value of SUB field.                                   */
  #define STM_DEVTYPE_SUB_Max (0x6UL)                /*!< Max enumerator value of SUB field.                                   */
  #define STM_DEVTYPE_SUB_StimulusTrace (0x6UL)      /*!< Peripheral is a stimulus trace source.                               */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          STMDATA                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct STMDATA_DOMAIN ================================================== */
/**
  * @brief DOMAIN [STMDATA_DOMAIN] (unspecified)
  */
typedef struct {
  __IOM uint8_t   NSDATA[16777216];                  /*!< (@ 0x00000000) NonSecure STM output data buffer for domain n. Writes
                                                                         to this region generates trace packets with id n+96.*/   
  __IOM uint8_t   SDATA[16777216];                   /*!< (@ 0x01000000) Secure STM output data buffer for domain n. Writes to
                                                                         this region generates trace packets with id n+32.*/      
} NRF_STMDATA_DOMAIN_Type;                           /*!< Size = 33554432 (0x2000000)                                          */
  #define STMDATA_DOMAIN_MaxCount (16UL)             /*!< Max size of DOMAIN[16] array.                                        */


/* ================================================== Struct STMDATA_BUFFER ================================================== */
/**
  * @brief BUFFER [STMDATA_BUFFER] Raw buffer access to STM array. Use when DOMAIN array does not apply.
  */
typedef struct {
  __IOM uint8_t   DATA[16777216];                    /*!< (@ 0x00000000) STM output data buffer n. Writes to this region
                                                                         generates trace packets.*/                               
} NRF_STMDATA_BUFFER_Type;                           /*!< Size = 16777216 (0x1000000)                                          */
  #define STMDATA_BUFFER_MaxCount (16UL)             /*!< Max size of BUFFER[16] array.                                        */

/* ===================================================== Struct STMDATA ====================================================== */
/**
  * @brief System Trace Macrocell data buffer
  */
  typedef struct {                                   /*!< STMDATA Structure                                                    */
    #if defined(_GNUC_)
      #pragma GCC diagnostic push
      #pragma GCC diagnostic ignored "-Wpedantic"
    #endif
    union {
      __IOM NRF_STMDATA_DOMAIN_Type DOMAIN[16];      /*!< (@ 0x00000000) (unspecified)                                         */
      __IOM NRF_STMDATA_BUFFER_Type BUFFER[16];      /*!< (@ 0x00000000) Raw buffer access to STM array. Use when DOMAIN array
                                                                         does not apply.*/                                        
    };
    #if defined(_GNUC_)
      #pragma GCC diagnostic pop
    #endif
  } NRF_STMDATA_Type;                                /*!< Size = 536870912 (0x20000000)                                        */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           SWEXT                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct SWEXT ======================================================= */
/**
  * @brief SWEXT peripheral
  */
  typedef struct {                                   /*!< SWEXT Structure                                                      */
    __IM uint32_t RESERVED[256];
    __IOM uint32_t CONTROL;                          /*!< (@ 0x00000400) Switch control for the 1.8V supply to external circuit*/
  } NRF_SWEXT_Type;                                  /*!< Size = 1028 (0x404)                                                  */

