adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SWEXT_CONTROL: Switch control for the 1.8V supply to external circuit */
  #define SWEXT_CONTROL_ResetValue (0x00000000UL)    /*!< Reset value of CONTROL register.                                     */

/* ENABLE @Bit 0 : Enable for the switch */
  #define SWEXT_CONTROL_ENABLE_Pos (0UL)             /*!< Position of ENABLE field.                                            */
  #define SWEXT_CONTROL_ENABLE_Msk (0x1UL << SWEXT_CONTROL_ENABLE_Pos) /*!< Bit mask of ENABLE field.                          */
  #define SWEXT_CONTROL_ENABLE_Min (0x0UL)           /*!< Min enumerator value of ENABLE field.                                */
  #define SWEXT_CONTROL_ENABLE_Max (0x1UL)           /*!< Max enumerator value of ENABLE field.                                */
  #define SWEXT_CONTROL_ENABLE_Disable (0x0UL)       /*!< Switch disabled                                                      */
  #define SWEXT_CONTROL_ENABLE_Enable (0x1UL)        /*!< Switch enabled                                                       */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TAMPC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct TAMPC_ACTIVESHIELD ================================================ */
/**
  * @brief ACTIVESHIELD [TAMPC_ACTIVESHIELD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CHEN;                              /*!< (@ 0x00000000) Active shield detector channel enable register.       */
} NRF_TAMPC_ACTIVESHIELD_Type;                       /*!< Size = 4 (0x004)                                                     */

/* TAMPC_ACTIVESHIELD_CHEN: Active shield detector channel enable register. */
  #define TAMPC_ACTIVESHIELD_CHEN_ResetValue (0x00000000UL) /*!< Reset value of CHEN register.                                 */

/* CH0 @Bit 0 : Enable or disable active shield channel 0. */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Pos (0UL)      /*!< Position of CH0 field.                                               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Msk (0x1UL << TAMPC_ACTIVESHIELD_CHEN_CH0_Pos) /*!< Bit mask of CH0 field.               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Min (0x0UL)    /*!< Min enumerator value of CH0 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Max (0x1UL)    /*!< Max enumerator value of CH0 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Disabled (0x0UL) /*!< Disable channel.                                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Enabled (0x1UL) /*!< Enable channel.                                                     */

/* CH1 @Bit 1 : Enable or disable active shield channel 1. */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Pos (1UL)      /*!< Position of CH1 field.                                               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Msk (0x1UL << TAMPC_ACTIVESHIELD_CHEN_CH1_Pos) /*!< Bit mask of CH1 field.               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Min (0x0UL)    /*!< Min enumerator value of CH1 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Max (0x1UL)    /*!< Max enumerator value of CH1 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Disabled (0x0UL) /*!< Disable channel.                                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Enabled (0x1UL) /*!< Enable channel.                                                     */

/* CH2 @Bit 2 : Enable or disable active shield channel 2. */
  #define TAMPC_ACTIVESHIELD_CHEN_CH2_Pos (2UL)      /*!< Position of CH2 field.                                               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH2_Msk (0x1UL << TAMPC_ACTIVESHIELD_CHEN_CH2_Pos) /*!< Bit mask of CH2 field.               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH2_Min (0x0UL)    /*!< Min enumerator value of CH2 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH2_Max (0x1UL)    /*!< Max enumerator value of CH2 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH2_Disabled (0x0UL) /*!< Disable channel.                                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH2_Enabled (0x1UL) /*!< Enable channel.                                                     */

/* CH3 @Bit 3 : Enable or disable active shield channel 3. */
  #define TAMPC_ACTIVESHIELD_CHEN_CH3_Pos (3UL)      /*!< Position of CH3 field.                                               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH3_Msk (0x1UL << TAMPC_ACTIVESHIELD_CHEN_CH3_Pos) /*!< Bit mask of CH3 field.               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH3_Min (0x0UL)    /*!< Min enumerator value of CH3 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH3_Max (0x1UL)    /*!< Max enumerator value of CH3 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH3_Disabled (0x0UL) /*!< Disable channel.                                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH3_Enabled (0x1UL) /*!< Enable channel.                                                     */



/* =================================================== Struct TAMPC_GLITCH =================================================== */
/**
  * @brief GLITCH [TAMPC_GLITCH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIGSLOWDOMAIN;                  /*!< (@ 0x00000000) Configuration for slow domain glitch detectors.       */
  __IOM uint32_t  CONFIGFASTDOMAIN;                  /*!< (@ 0x00000004) Configuration for fast domain glitch detectors.       */
} NRF_TAMPC_GLITCH_Type;                             /*!< Size = 8 (0x008)                                                     */

/* TAMPC_GLITCH_CONFIGSLOWDOMAIN: Configuration for slow domain glitch detectors. */
  #define TAMPC_GLITCH_CONFIGSLOWDOMAIN_ResetValue (0x00000000UL) /*!< Reset value of CONFIGSLOWDOMAIN register.               */

/* EXTRADELAY @Bits 0..3 : Extra delay configuration. */
  #define TAMPC_GLITCH_CONFIGSLOWDOMAIN_EXTRADELAY_Pos (0UL) /*!< Position of EXTRADELAY field.                                */
  #define TAMPC_GLITCH_CONFIGSLOWDOMAIN_EXTRADELAY_Msk (0xFUL << TAMPC_GLITCH_CONFIGSLOWDOMAIN_EXTRADELAY_Pos) /*!< Bit mask of
                                                                            EXTRADELAY field.*/                                   


/* TAMPC_GLITCH_CONFIGFASTDOMAIN: Configuration for fast domain glitch detectors. */
  #define TAMPC_GLITCH_CONFIGFASTDOMAIN_ResetValue (0x00000000UL) /*!< Reset value of CONFIGFASTDOMAIN register.               */

/* EXTRADELAY @Bits 0..3 : Extra delay configuration. */
  #define TAMPC_GLITCH_CONFIGFASTDOMAIN_EXTRADELAY_Pos (0UL) /*!< Position of EXTRADELAY field.                                */
  #define TAMPC_GLITCH_CONFIGFASTDOMAIN_EXTRADELAY_Msk (0xFUL << TAMPC_GLITCH_CONFIGFASTDOMAIN_EXTRADELAY_Pos) /*!< Bit mask of
                                                                            EXTRADELAY field.*/                                   



/* ============================================ Struct TAMPC_PROTECT_DOMAIN_DBGEN ============================================ */
/**
  * @brief DBGEN [TAMPC_PROTECT_DOMAIN_DBGEN] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CTRL;                              /*!< (@ 0x00000000) Control register for invasive (halting) debug enable
                                                                         for the local debug components within domain n.*/        
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000004) Status register for invasive (halting) debug enable for
                                                                         domain n.*/                                              
} NRF_TAMPC_PROTECT_DOMAIN_DBGEN_Type;               /*!< Size = 8 (0x008)                                                     */

/* TAMPC_PROTECT_DOMAIN_DBGEN_CTRL: Control register for invasive (halting) debug enable for the local debug components within
                                     domain n. */                                                                                 
                                                                                                                                  
  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_ResetValue (0x00000001UL) /*!< Reset value of CTRL register.                         */

