adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* WRITEPROTECTION @Bits 4..7 : The write protection must be cleared to allow updates to the VALUE field. */
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_CTRL_WRITEPROTECTION_Pos (4UL) /*!< Position of WRITEPROTECTION field.              */
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_CTRL_WRITEPROTECTION_Msk (0xFUL << TAMPC_PROTECT_CRACEN_PKDISABLECM_CTRL_WRITEPROTECTION_Pos)
                                                                            /*!< Bit mask of WRITEPROTECTION field.*/             
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_CTRL_WRITEPROTECTION_Min (0x0UL) /*!< Min enumerator value of WRITEPROTECTION field.*/
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_CTRL_WRITEPROTECTION_Max (0xFUL) /*!< Max enumerator value of WRITEPROTECTION field.*/
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_CTRL_WRITEPROTECTION_Disabled (0x0UL) /*!< Read: Write protection is disabled.      */
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_CTRL_WRITEPROTECTION_Enabled (0x1UL) /*!< Read: Write protection is enabled.        */
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_CTRL_WRITEPROTECTION_Clear (0xFUL) /*!< Write: Value to clear write protection.     */

/* KEY @Bits 16..31 : Required write key for upper 16 bits. Must be included in all register write operations. */
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_CTRL_KEY_Pos (16UL) /*!< Position of KEY field.                                     */
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_CTRL_KEY_Msk (0xFFFFUL << TAMPC_PROTECT_CRACEN_PKDISABLECM_CTRL_KEY_Pos) /*!< Bit
                                                                            mask of KEY field.*/                                  
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_CTRL_KEY_Min (0x50FAUL) /*!< Min enumerator value of KEY field.                     */
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_CTRL_KEY_Max (0x50FAUL) /*!< Max enumerator value of KEY field.                     */
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_CTRL_KEY_KEY (0x50FAUL) /*!< Write key value.                                       */


/* TAMPC_PROTECT_CRACEN_PKDISABLECM_STATUS: Status register for the PK engine DPA counter-measures disable signal in CRACEN. */
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.               */

/* ERROR @Bit 0 : Error detection status. */
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_STATUS_ERROR_Pos (0UL) /*!< Position of ERROR field.                                */
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_STATUS_ERROR_Msk (0x1UL << TAMPC_PROTECT_CRACEN_PKDISABLECM_STATUS_ERROR_Pos) /*!<
                                                                            Bit mask of ERROR field.*/                            
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_STATUS_ERROR_Min (0x0UL) /*!< Min enumerator value of ERROR field.                  */
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_STATUS_ERROR_Max (0x1UL) /*!< Max enumerator value of ERROR field.                  */
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_STATUS_ERROR_NoError (0x0UL) /*!< No error detected.                                */
  #define TAMPC_PROTECT_CRACEN_PKDISABLECM_STATUS_ERROR_Error (0x1UL) /*!< Error detected.                                     */



/* =============================================== Struct TAMPC_PROTECT_CRACEN =============================================== */
/**
  * @brief CRACEN [TAMPC_PROTECT_CRACEN] (unspecified)
  */
typedef struct {
  __IOM NRF_TAMPC_PROTECT_CRACEN_AESDISABLECM_Type AESDISABLECM; /*!< (@ 0x00000000) (unspecified)                             */
  __IOM NRF_TAMPC_PROTECT_CRACEN_SM4DISABLECM_Type SM4DISABLECM; /*!< (@ 0x00000008) (unspecified)                             */
  __IOM NRF_TAMPC_PROTECT_CRACEN_PKDISABLECM_Type PKDISABLECM; /*!< (@ 0x00000010) (unspecified)                               */
} NRF_TAMPC_PROTECT_CRACEN_Type;                     /*!< Size = 24 (0x018)                                                    */


/* ========================================= Struct TAMPC_PROTECT_WARMBOOT_UNRETIDLE ========================================= */
/**
  * @brief UNRETIDLE [TAMPC_PROTECT_WARMBOOT_UNRETIDLE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CTRL;                              /*!< (@ 0x00000000) Control register to enable warm boot from unretained
                                                                         idle mode.*/                                             
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000004) Status register for the warm boot unretained idle
                                                                         signal.*/                                                
} NRF_TAMPC_PROTECT_WARMBOOT_UNRETIDLE_Type;         /*!< Size = 8 (0x008)                                                     */

/* TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL: Control register to enable warm boot from unretained idle mode. */
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_ResetValue (0x00000001UL) /*!< Reset value of CTRL register.                   */

/* VALUE @Bit 0 : Set value of warm boot unretained idle signal. */
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_VALUE_Msk (0x1UL << TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/                                
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_VALUE_Min (0x0UL) /*!< Min enumerator value of VALUE field.                    */
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_VALUE_Max (0x1UL) /*!< Max enumerator value of VALUE field.                    */
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_VALUE_Low (0x0UL) /*!< Signal is logic 0.                                      */
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_VALUE_High (0x1UL) /*!< Signal is logic 1.                                     */

/* LOCK @Bit 1 : Lock this register to prevent changes to the VALUE field until next reset. */
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_LOCK_Pos (1UL) /*!< Position of LOCK field.                                    */
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_LOCK_Msk (0x1UL << TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_LOCK_Pos) /*!< Bit mask
                                                                            of LOCK field.*/                                      
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                      */
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                      */
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_LOCK_Disabled (0x0UL) /*!< Lock disabled.                                      */
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_LOCK_Enabled (0x1UL) /*!< Lock enabled.                                        */

/* FAULTTEST @Bit 2 : Injects a fault in the protected signal. */
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_FAULTTEST_Pos (2UL) /*!< Position of FAULTTEST field.                          */
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_FAULTTEST_Msk (0x1UL << TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_FAULTTEST_Pos)
                                                                            /*!< Bit mask of FAULTTEST field.*/                   
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_FAULTTEST_Min (0x0UL) /*!< Min enumerator value of FAULTTEST field.            */
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_FAULTTEST_Max (0x1UL) /*!< Max enumerator value of FAULTTEST field.            */
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_FAULTTEST_NoOperation (0x0UL) /*!< No operation.                               */
  #define TAMPC_PROTECT_WARMBOOT_UNRETIDLE_CTRL_FAULTTEST_Trigger (0x1UL) /*!< Trigger fault.                                  */

