adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* WRITEPROTECTION @Bits 4..7 : The write protection must be cleared to allow updates to the VALUE field. */
  #define TAMPC_PROTECT_FEATURE_CTRL_WRITEPROTECTION_Pos (4UL) /*!< Position of WRITEPROTECTION field.                         */
  #define TAMPC_PROTECT_FEATURE_CTRL_WRITEPROTECTION_Msk (0xFUL << TAMPC_PROTECT_FEATURE_CTRL_WRITEPROTECTION_Pos) /*!< Bit mask
                                                                            of WRITEPROTECTION field.*/                           
  #define TAMPC_PROTECT_FEATURE_CTRL_WRITEPROTECTION_Min (0x0UL) /*!< Min enumerator value of WRITEPROTECTION field.           */
  #define TAMPC_PROTECT_FEATURE_CTRL_WRITEPROTECTION_Max (0xFUL) /*!< Max enumerator value of WRITEPROTECTION field.           */
  #define TAMPC_PROTECT_FEATURE_CTRL_WRITEPROTECTION_Disabled (0x0UL) /*!< Read: Write protection is disabled.                 */
  #define TAMPC_PROTECT_FEATURE_CTRL_WRITEPROTECTION_Enabled (0x1UL) /*!< Read: Write protection is enabled.                   */
  #define TAMPC_PROTECT_FEATURE_CTRL_WRITEPROTECTION_Clear (0xFUL) /*!< Write: Value to clear write protection.                */

/* KEY @Bits 16..31 : Required write key for upper 16 bits. Must be included in all register write operations. */
  #define TAMPC_PROTECT_FEATURE_CTRL_KEY_Pos (16UL)  /*!< Position of KEY field.                                               */
  #define TAMPC_PROTECT_FEATURE_CTRL_KEY_Msk (0xFFFFUL << TAMPC_PROTECT_FEATURE_CTRL_KEY_Pos) /*!< Bit mask of KEY field.      */
  #define TAMPC_PROTECT_FEATURE_CTRL_KEY_Min (0x50FAUL) /*!< Min enumerator value of KEY field.                                */
  #define TAMPC_PROTECT_FEATURE_CTRL_KEY_Max (0x50FAUL) /*!< Max enumerator value of KEY field.                                */
  #define TAMPC_PROTECT_FEATURE_CTRL_KEY_KEY (0x50FAUL) /*!< Write key value.                                                  */



/* ================================================== Struct TAMPC_PROTECT =================================================== */
/**
  * @brief PROTECT [TAMPC_PROTECT] (unspecified)
  */
typedef union {
  struct {
    __IOM NRF_TAMPC_PROTECT_DOMAIN_Type DOMAIN[16];  /*!< (@ 0x00000000) (unspecified)                                         */
    __IOM NRF_TAMPC_PROTECT_AP_Type AP[16];          /*!< (@ 0x00000200) (unspecified)                                         */
    __IOM NRF_TAMPC_PROTECT_CORESIGHT_Type CORESIGHT; /*!< (@ 0x00000300) (unspecified)                                        */
    __IM uint32_t RESERVED[2];
    __IOM NRF_TAMPC_PROTECT_CRACEN_Type CRACEN;      /*!< (@ 0x00000330) (unspecified)                                         */
    __IM uint32_t RESERVED1[40];
    __IOM NRF_TAMPC_PROTECT_WARMBOOT_Type WARMBOOT;  /*!< (@ 0x000003E8) (unspecified)                                         */
    __IOM NRF_TAMPC_PROTECT_DFT_Type DFT;            /*!< (@ 0x000003F8) (unspecified)                                         */
    __IOM NRF_TAMPC_PROTECT_ACTIVESHIELD_Type ACTIVESHIELD; /*!< (@ 0x00000400) Enable active shield detector.                 */
    __IOM NRF_TAMPC_PROTECT_TAMPERSWITCH_Type TAMPERSWITCH; /*!< (@ 0x00000408) Enable tamper switch detector.                 */
    __IM uint32_t RESERVED2[8];
    __IOM NRF_TAMPC_PROTECT_PROTECT_Type PROTECT;    /*!< (@ 0x00000430) Enable the signal protector.                          */
    __IOM NRF_TAMPC_PROTECT_CRACENTAMP_Type CRACENTAMP; /*!< (@ 0x00000438) Enable tamper detector from CRACEN.                */
    __IOM NRF_TAMPC_PROTECT_GLITCHSLOWDOMAIN_Type GLITCHSLOWDOMAIN; /*!< (@ 0x00000440) Enable slow domain glitch detectors.   */
    __IOM NRF_TAMPC_PROTECT_GLITCHFASTDOMAIN_Type GLITCHFASTDOMAIN; /*!< (@ 0x00000448) Enable fast domain glitch detectors.   */
    __IM uint32_t RESERVED3[8];
    __IOM NRF_TAMPC_PROTECT_EXTRESETEN_Type EXTRESETEN; /*!< (@ 0x00000470) Trigger a reset when tamper is detected by the
                                                                            active shield or tamper switch detector.*/            
    __IOM NRF_TAMPC_PROTECT_INTRESETEN_Type INTRESETEN; /*!< (@ 0x00000478) Trigger a reset when tamper is detected by the
                                                                            glitch detectors, signal protector or CRACEN tamper
                                                                            detector.*/                                           
  };
  __IOM NRF_TAMPC_PROTECT_FEATURE_Type FEATURE[128]; /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_TAMPC_PROTECT_Type;                            /*!< Size = 1152 (0x480)                                                  */

/* ====================================================== Struct TAMPC ======================================================= */
/**
  * @brief Tamper controller
  */
  typedef struct {                                   /*!< TAMPC Structure                                                      */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_TAMPER;                    /*!< (@ 0x00000100) Tamper controller detected an error.                  */
    __IOM uint32_t EVENTS_WRITEERROR;                /*!< (@ 0x00000104) Attempt to write a VALUE in PROTECT registers without
                                                                         clearing the WRITEPROTECT.*/                             
    __IM uint32_t RESERVED1[126];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IOM uint32_t STATUS;                           /*!< (@ 0x00000400) The tamper controller status.                         */
    __IOM NRF_TAMPC_ACTIVESHIELD_Type ACTIVESHIELD;  /*!< (@ 0x00000404) (unspecified)                                         */
    __IOM NRF_TAMPC_GLITCH_Type GLITCH;              /*!< (@ 0x00000408) (unspecified)                                         */
    __IM uint32_t RESERVED3[60];
    __IOM NRF_TAMPC_PROTECT_Type PROTECT;            /*!< (@ 0x00000500) (unspecified)                                         */
  } NRF_TAMPC_Type;                                  /*!< Size = 2432 (0x980)                                                  */

