adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* WRITEERROR @Bit 1 : Write '1' to disable interrupt for event WRITEERROR */
  #define TAMPC_INTENCLR_WRITEERROR_Pos (1UL)        /*!< Position of WRITEERROR field.                                        */
  #define TAMPC_INTENCLR_WRITEERROR_Msk (0x1UL << TAMPC_INTENCLR_WRITEERROR_Pos) /*!< Bit mask of WRITEERROR field.            */
  #define TAMPC_INTENCLR_WRITEERROR_Min (0x0UL)      /*!< Min enumerator value of WRITEERROR field.                            */
  #define TAMPC_INTENCLR_WRITEERROR_Max (0x1UL)      /*!< Max enumerator value of WRITEERROR field.                            */
  #define TAMPC_INTENCLR_WRITEERROR_Clear (0x1UL)    /*!< Disable                                                              */
  #define TAMPC_INTENCLR_WRITEERROR_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define TAMPC_INTENCLR_WRITEERROR_Enabled (0x1UL)  /*!< Read: Enabled                                                        */


/* TAMPC_INTPEND: Pending interrupts */
  #define TAMPC_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* TAMPER @Bit 0 : Read pending status of interrupt for event TAMPER */
  #define TAMPC_INTPEND_TAMPER_Pos (0UL)             /*!< Position of TAMPER field.                                            */
  #define TAMPC_INTPEND_TAMPER_Msk (0x1UL << TAMPC_INTPEND_TAMPER_Pos) /*!< Bit mask of TAMPER field.                          */
  #define TAMPC_INTPEND_TAMPER_Min (0x0UL)           /*!< Min enumerator value of TAMPER field.                                */
  #define TAMPC_INTPEND_TAMPER_Max (0x1UL)           /*!< Max enumerator value of TAMPER field.                                */
  #define TAMPC_INTPEND_TAMPER_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define TAMPC_INTPEND_TAMPER_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* WRITEERROR @Bit 1 : Read pending status of interrupt for event WRITEERROR */
  #define TAMPC_INTPEND_WRITEERROR_Pos (1UL)         /*!< Position of WRITEERROR field.                                        */
  #define TAMPC_INTPEND_WRITEERROR_Msk (0x1UL << TAMPC_INTPEND_WRITEERROR_Pos) /*!< Bit mask of WRITEERROR field.              */
  #define TAMPC_INTPEND_WRITEERROR_Min (0x0UL)       /*!< Min enumerator value of WRITEERROR field.                            */
  #define TAMPC_INTPEND_WRITEERROR_Max (0x1UL)       /*!< Max enumerator value of WRITEERROR field.                            */
  #define TAMPC_INTPEND_WRITEERROR_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define TAMPC_INTPEND_WRITEERROR_Pending (0x1UL)   /*!< Read: Pending                                                        */


/* TAMPC_STATUS: The tamper controller status. */
  #define TAMPC_STATUS_ResetValue (0x00000000UL)     /*!< Reset value of STATUS register.                                      */

/* ACTIVESHIELD @Bit 0 : Active shield detector detected an error. */
  #define TAMPC_STATUS_ACTIVESHIELD_Pos (0UL)        /*!< Position of ACTIVESHIELD field.                                      */
  #define TAMPC_STATUS_ACTIVESHIELD_Msk (0x1UL << TAMPC_STATUS_ACTIVESHIELD_Pos) /*!< Bit mask of ACTIVESHIELD field.          */
  #define TAMPC_STATUS_ACTIVESHIELD_Min (0x0UL)      /*!< Min enumerator value of ACTIVESHIELD field.                          */
  #define TAMPC_STATUS_ACTIVESHIELD_Max (0x1UL)      /*!< Max enumerator value of ACTIVESHIELD field.                          */
  #define TAMPC_STATUS_ACTIVESHIELD_NotDetected (0x0UL) /*!< Not detected.                                                     */
  #define TAMPC_STATUS_ACTIVESHIELD_Detected (0x1UL) /*!< Detected.                                                            */

/* TAMPERSWITCH @Bit 1 : External tamper switch detector detected an error. */
  #define TAMPC_STATUS_TAMPERSWITCH_Pos (1UL)        /*!< Position of TAMPERSWITCH field.                                      */
  #define TAMPC_STATUS_TAMPERSWITCH_Msk (0x1UL << TAMPC_STATUS_TAMPERSWITCH_Pos) /*!< Bit mask of TAMPERSWITCH field.          */
  #define TAMPC_STATUS_TAMPERSWITCH_Min (0x0UL)      /*!< Min enumerator value of TAMPERSWITCH field.                          */
  #define TAMPC_STATUS_TAMPERSWITCH_Max (0x1UL)      /*!< Max enumerator value of TAMPERSWITCH field.                          */
  #define TAMPC_STATUS_TAMPERSWITCH_NotDetected (0x0UL) /*!< Not detected.                                                     */
  #define TAMPC_STATUS_TAMPERSWITCH_Detected (0x1UL) /*!< Detected.                                                            */

/* PROTECT @Bit 4 : Error detected for the protected signals. */
  #define TAMPC_STATUS_PROTECT_Pos (4UL)             /*!< Position of PROTECT field.                                           */
  #define TAMPC_STATUS_PROTECT_Msk (0x1UL << TAMPC_STATUS_PROTECT_Pos) /*!< Bit mask of PROTECT field.                         */
  #define TAMPC_STATUS_PROTECT_Min (0x0UL)           /*!< Min enumerator value of PROTECT field.                               */
  #define TAMPC_STATUS_PROTECT_Max (0x1UL)           /*!< Max enumerator value of PROTECT field.                               */
  #define TAMPC_STATUS_PROTECT_NotDetected (0x0UL)   /*!< Not detected.                                                        */
  #define TAMPC_STATUS_PROTECT_Detected (0x1UL)      /*!< Detected.                                                            */

/* CRACENTAMP @Bit 5 : CRACEN detected an error. */
  #define TAMPC_STATUS_CRACENTAMP_Pos (5UL)          /*!< Position of CRACENTAMP field.                                        */
  #define TAMPC_STATUS_CRACENTAMP_Msk (0x1UL << TAMPC_STATUS_CRACENTAMP_Pos) /*!< Bit mask of CRACENTAMP field.                */
  #define TAMPC_STATUS_CRACENTAMP_Min (0x0UL)        /*!< Min enumerator value of CRACENTAMP field.                            */
  #define TAMPC_STATUS_CRACENTAMP_Max (0x1UL)        /*!< Max enumerator value of CRACENTAMP field.                            */
  #define TAMPC_STATUS_CRACENTAMP_NotDetected (0x0UL) /*!< Not detected.                                                       */
  #define TAMPC_STATUS_CRACENTAMP_Detected (0x1UL)   /*!< Detected.                                                            */

/* GLITCHSLOWDOMAIN0 @Bit 8 : Slow domain glitch detector 0 detected an error. */
  #define TAMPC_STATUS_GLITCHSLOWDOMAIN0_Pos (8UL)   /*!< Position of GLITCHSLOWDOMAIN0 field.                                 */
  #define TAMPC_STATUS_GLITCHSLOWDOMAIN0_Msk (0x1UL << TAMPC_STATUS_GLITCHSLOWDOMAIN0_Pos) /*!< Bit mask of GLITCHSLOWDOMAIN0
                                                                            field.*/                                              
  #define TAMPC_STATUS_GLITCHSLOWDOMAIN0_Min (0x0UL) /*!< Min enumerator value of GLITCHSLOWDOMAIN0 field.                     */
  #define TAMPC_STATUS_GLITCHSLOWDOMAIN0_Max (0x1UL) /*!< Max enumerator value of GLITCHSLOWDOMAIN0 field.                     */
  #define TAMPC_STATUS_GLITCHSLOWDOMAIN0_NotDetected (0x0UL) /*!< Not detected.                                                */
  #define TAMPC_STATUS_GLITCHSLOWDOMAIN0_Detected (0x1UL) /*!< Detected.                                                       */

/* GLITCHFASTDOMAIN0 @Bit 12 : Fast domain glitch detector 0 detected an error. */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN0_Pos (12UL)  /*!< Position of GLITCHFASTDOMAIN0 field.                                 */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN0_Msk (0x1UL << TAMPC_STATUS_GLITCHFASTDOMAIN0_Pos) /*!< Bit mask of GLITCHFASTDOMAIN0
                                                                            field.*/                                              
  #define TAMPC_STATUS_GLITCHFASTDOMAIN0_Min (0x0UL) /*!< Min enumerator value of GLITCHFASTDOMAIN0 field.                     */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN0_Max (0x1UL) /*!< Max enumerator value of GLITCHFASTDOMAIN0 field.                     */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN0_NotDetected (0x0UL) /*!< Not detected.                                                */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN0_Detected (0x1UL) /*!< Detected.                                                       */

/* GLITCHFASTDOMAIN1 @Bit 13 : Fast domain glitch detector 1 detected an error. */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN1_Pos (13UL)  /*!< Position of GLITCHFASTDOMAIN1 field.                                 */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN1_Msk (0x1UL << TAMPC_STATUS_GLITCHFASTDOMAIN1_Pos) /*!< Bit mask of GLITCHFASTDOMAIN1
                                                                            field.*/                                              
  #define TAMPC_STATUS_GLITCHFASTDOMAIN1_Min (0x0UL) /*!< Min enumerator value of GLITCHFASTDOMAIN1 field.                     */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN1_Max (0x1UL) /*!< Max enumerator value of GLITCHFASTDOMAIN1 field.                     */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN1_NotDetected (0x0UL) /*!< Not detected.                                                */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN1_Detected (0x1UL) /*!< Detected.                                                       */

/* GLITCHFASTDOMAIN2 @Bit 14 : Fast domain glitch detector 2 detected an error. */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN2_Pos (14UL)  /*!< Position of GLITCHFASTDOMAIN2 field.                                 */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN2_Msk (0x1UL << TAMPC_STATUS_GLITCHFASTDOMAIN2_Pos) /*!< Bit mask of GLITCHFASTDOMAIN2
                                                                            field.*/                                              
  #define TAMPC_STATUS_GLITCHFASTDOMAIN2_Min (0x0UL) /*!< Min enumerator value of GLITCHFASTDOMAIN2 field.                     */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN2_Max (0x1UL) /*!< Max enumerator value of GLITCHFASTDOMAIN2 field.                     */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN2_NotDetected (0x0UL) /*!< Not detected.                                                */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN2_Detected (0x1UL) /*!< Detected.                                                       */

/* GLITCHFASTDOMAIN3 @Bit 15 : Fast domain glitch detector 3 detected an error. */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN3_Pos (15UL)  /*!< Position of GLITCHFASTDOMAIN3 field.                                 */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN3_Msk (0x1UL << TAMPC_STATUS_GLITCHFASTDOMAIN3_Pos) /*!< Bit mask of GLITCHFASTDOMAIN3
                                                                            field.*/                                              
  #define TAMPC_STATUS_GLITCHFASTDOMAIN3_Min (0x0UL) /*!< Min enumerator value of GLITCHFASTDOMAIN3 field.                     */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN3_Max (0x1UL) /*!< Max enumerator value of GLITCHFASTDOMAIN3 field.                     */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN3_NotDetected (0x0UL) /*!< Not detected.                                                */
  #define TAMPC_STATUS_GLITCHFASTDOMAIN3_Detected (0x1UL) /*!< Detected.                                                       */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            TBM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct TBM ======================================================== */
/**
  * @brief Trace buffer monitor
  */
  typedef struct {                                   /*!< TBM Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start counter                                         */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop counter, clear counter value                     */
    __OM uint32_t TASKS_FLUSH;                       /*!< (@ 0x00000008) Stop counter, keep current counter value              */
    __IM uint32_t RESERVED[61];
    __IOM uint32_t EVENTS_HALFFULL;                  /*!< (@ 0x00000100) Counter value equals half-full                        */
    __IOM uint32_t EVENTS_FULL;                      /*!< (@ 0x00000104) Counter value equals full                             */
    __IOM uint32_t EVENTS_FLUSH;                     /*!< (@ 0x00000108) Counter stopped due to flush                          */
    __IM uint32_t RESERVED1[61];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED2[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED3[60];
    __IOM uint32_t BUFFERSIZE;                       /*!< (@ 0x00000400) System RAM trace buffer total size in bytes           */
    __IM uint32_t COUNT;                             /*!< (@ 0x00000404) Counter current value                                 */
  } NRF_TBM_Type;                                    /*!< Size = 1032 (0x408)                                                  */

/* TBM_TASKS_START: Start counter */
  #define TBM_TASKS_START_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_START register.                                 */

