adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TDDCONF_DBGPWRUPREQ: Debug power-up request */
  #define TDDCONF_DBGPWRUPREQ_ResetValue (0x00000000UL) /*!< Reset value of DBGPWRUPREQ register.                              */

/* ACTIVE @Bit 0 : Activate power-up request */
  #define TDDCONF_DBGPWRUPREQ_ACTIVE_Pos (0UL)       /*!< Position of ACTIVE field.                                            */
  #define TDDCONF_DBGPWRUPREQ_ACTIVE_Msk (0x1UL << TDDCONF_DBGPWRUPREQ_ACTIVE_Pos) /*!< Bit mask of ACTIVE field.              */
  #define TDDCONF_DBGPWRUPREQ_ACTIVE_Min (0x0UL)     /*!< Min enumerator value of ACTIVE field.                                */
  #define TDDCONF_DBGPWRUPREQ_ACTIVE_Max (0x1UL)     /*!< Max enumerator value of ACTIVE field.                                */
  #define TDDCONF_DBGPWRUPREQ_ACTIVE_NotActive (0x0UL) /*!< Power-up request not active                                        */
  #define TDDCONF_DBGPWRUPREQ_ACTIVE_Active (0x1UL)  /*!< Power-up request active                                              */


/* TDDCONF_TRACEPORTSPEED: Trace port trace clock speed */
  #define TDDCONF_TRACEPORTSPEED_ResetValue (0x00000000UL) /*!< Reset value of TRACEPORTSPEED register.                        */

/* SPEED @Bits 0..1 : Trace clock speed */
  #define TDDCONF_TRACEPORTSPEED_SPEED_Pos (0UL)     /*!< Position of SPEED field.                                             */
  #define TDDCONF_TRACEPORTSPEED_SPEED_Msk (0x3UL << TDDCONF_TRACEPORTSPEED_SPEED_Pos) /*!< Bit mask of SPEED field.           */
  #define TDDCONF_TRACEPORTSPEED_SPEED_Min (0x0UL)   /*!< Min enumerator value of SPEED field.                                 */
  #define TDDCONF_TRACEPORTSPEED_SPEED_Max (0x3UL)   /*!< Max enumerator value of SPEED field.                                 */
  #define TDDCONF_TRACEPORTSPEED_SPEED_Speed80MHz (0x0UL) /*!< Speed 80MHz                                                     */
  #define TDDCONF_TRACEPORTSPEED_SPEED_Speed40MHz (0x1UL) /*!< Speed 40MHz                                                     */
  #define TDDCONF_TRACEPORTSPEED_SPEED_Speed20MHz (0x2UL) /*!< Speed 20MHz                                                     */
  #define TDDCONF_TRACEPORTSPEED_SPEED_Speed10MHz (0x3UL) /*!< Speed 10MHz                                                     */


/* TDDCONF_DEBUGPOWERREQSTATUS: Combined effective system status of both SWJ-DP and TDDCONF registers originated power requests
                                 */                                                                                               
                                                                                                                                  
  #define TDDCONF_DEBUGPOWERREQSTATUS_ResetValue (0x00000000UL) /*!< Reset value of DEBUGPOWERREQSTATUS register.              */

/* SYSPWRUPREQUESTED @Bit 0 : System powerup request status */
  #define TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_Pos (0UL) /*!< Position of SYSPWRUPREQUESTED field.                    */
  #define TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_Msk (0x1UL << TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_Pos) /*!<
                                                                            Bit mask of SYSPWRUPREQUESTED field.*/                
  #define TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_Min (0x0UL) /*!< Min enumerator value of SYSPWRUPREQUESTED field.      */
  #define TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_Max (0x1UL) /*!< Max enumerator value of SYSPWRUPREQUESTED field.      */
  #define TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_NoPowerReq (0x0UL) /*!< Power not requested                            */
  #define TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_PowerReq (0x1UL) /*!< Power requested                                  */

/* DBGPWRUPREQUESTED @Bit 1 : Debug domain powerup request status */
  #define TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_Pos (1UL) /*!< Position of DBGPWRUPREQUESTED field.                    */
  #define TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_Msk (0x1UL << TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_Pos) /*!<
                                                                            Bit mask of DBGPWRUPREQUESTED field.*/                
  #define TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_Min (0x0UL) /*!< Min enumerator value of DBGPWRUPREQUESTED field.      */
  #define TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_Max (0x1UL) /*!< Max enumerator value of DBGPWRUPREQUESTED field.      */
  #define TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_NoPowerReq (0x0UL) /*!< Power not requested                            */
  #define TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_PowerReq (0x1UL) /*!< Power requested                                  */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            TDM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct TDM_CONFIG_MCK ================================================== */
/**
  * @brief MCK [TDM_CONFIG_MCK] (unspecified)
  */
typedef struct {
  __IOM uint32_t  EN;                                /*!< (@ 0x00000000) Master clock generator enable.                        */
  __IOM uint32_t  DIV;                               /*!< (@ 0x00000004) MCK divider.                                          */
  __IOM uint32_t  SRC;                               /*!< (@ 0x00000008) MCK clock source selection                            */
} NRF_TDM_CONFIG_MCK_Type;                           /*!< Size = 12 (0x00C)                                                    */

