adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TDM_CONFIG_MCK_EN: Master clock generator enable. */
  #define TDM_CONFIG_MCK_EN_ResetValue (0x00000000UL) /*!< Reset value of EN register.                                         */

/* MCKEN @Bit 0 : Master clock generator enable. */
  #define TDM_CONFIG_MCK_EN_MCKEN_Pos (0UL)          /*!< Position of MCKEN field.                                             */
  #define TDM_CONFIG_MCK_EN_MCKEN_Msk (0x1UL << TDM_CONFIG_MCK_EN_MCKEN_Pos) /*!< Bit mask of MCKEN field.                     */
  #define TDM_CONFIG_MCK_EN_MCKEN_Min (0x0UL)        /*!< Min enumerator value of MCKEN field.                                 */
  #define TDM_CONFIG_MCK_EN_MCKEN_Max (0x1UL)        /*!< Max enumerator value of MCKEN field.                                 */
  #define TDM_CONFIG_MCK_EN_MCKEN_Disabled (0x0UL)   /*!< Master clock generator disabled.                                     */
  #define TDM_CONFIG_MCK_EN_MCKEN_Enabled (0x1UL)    /*!< Master clock generator enabled.                                      */


/* TDM_CONFIG_MCK_DIV: MCK divider. */
  #define TDM_CONFIG_MCK_DIV_ResetValue (0x00000000UL) /*!< Reset value of DIV register.                                       */

/* DIV @Bits 0..31 : MCK frequency configuration NOTE: The 12 least significant bits of the register are ignored and shall be
                     set to zero. */                                                                                              
                                                                                                                                  
  #define TDM_CONFIG_MCK_DIV_DIV_Pos (0UL)           /*!< Position of DIV field.                                               */
  #define TDM_CONFIG_MCK_DIV_DIV_Msk (0xFFFFFFFFUL << TDM_CONFIG_MCK_DIV_DIV_Pos) /*!< Bit mask of DIV field.                  */
  #define TDM_CONFIG_MCK_DIV_DIV_Min (0x20C0000UL)   /*!< Min enumerator value of DIV field.                                   */
  #define TDM_CONFIG_MCK_DIV_DIV_Max (0x80000000UL)  /*!< Max enumerator value of DIV field.                                   */
  #define TDM_CONFIG_MCK_DIV_DIV_CKDIV2 (0x80000000UL) /*!< CK divided by 2                                                    */
  #define TDM_CONFIG_MCK_DIV_DIV_CKDIV3 (0x50000000UL) /*!< CK divided by 3                                                    */
  #define TDM_CONFIG_MCK_DIV_DIV_CKDIV4 (0x40000000UL) /*!< CK divided by 4                                                    */
  #define TDM_CONFIG_MCK_DIV_DIV_CKDIV5 (0x30000000UL) /*!< CK divided by 5                                                    */
  #define TDM_CONFIG_MCK_DIV_DIV_CKDIV6 (0x28000000UL) /*!< CK divided by 6                                                    */
  #define TDM_CONFIG_MCK_DIV_DIV_CKDIV8 (0x20000000UL) /*!< CK divided by 8                                                    */
  #define TDM_CONFIG_MCK_DIV_DIV_CKDIV10 (0x18000000UL) /*!< CK divided by 10                                                  */
  #define TDM_CONFIG_MCK_DIV_DIV_CKDIV11 (0x16000000UL) /*!< CK divided by 11                                                  */
  #define TDM_CONFIG_MCK_DIV_DIV_CKDIV15 (0x11000000UL) /*!< CK divided by 15                                                  */
  #define TDM_CONFIG_MCK_DIV_DIV_CKDIV16 (0x10000000UL) /*!< CK divided by 16                                                  */
  #define TDM_CONFIG_MCK_DIV_DIV_CKDIV21 (0x0C000000UL) /*!< CK divided by 21                                                  */
  #define TDM_CONFIG_MCK_DIV_DIV_CKDIV23 (0x0B000000UL) /*!< CK divided by 23                                                  */
  #define TDM_CONFIG_MCK_DIV_DIV_CKDIV30 (0x08800000UL) /*!< CK divided by 30                                                  */
  #define TDM_CONFIG_MCK_DIV_DIV_CKDIV31 (0x08400000UL) /*!< CK divided by 31                                                  */
  #define TDM_CONFIG_MCK_DIV_DIV_CKDIV32 (0x08000000UL) /*!< CK divided by 32                                                  */
  #define TDM_CONFIG_MCK_DIV_DIV_CKDIV42 (0x06000000UL) /*!< CK divided by 42                                                  */
  #define TDM_CONFIG_MCK_DIV_DIV_CKDIV63 (0x04100000UL) /*!< CK divided by 63                                                  */
  #define TDM_CONFIG_MCK_DIV_DIV_CKDIV125 (0x020C0000UL) /*!< CK divided by 125                                                */


/* TDM_CONFIG_MCK_SRC: MCK clock source selection */
  #define TDM_CONFIG_MCK_SRC_ResetValue (0x00000000UL) /*!< Reset value of SRC register.                                       */

/* CLKSRC @Bit 0 : Clock source selection */
  #define TDM_CONFIG_MCK_SRC_CLKSRC_Pos (0UL)        /*!< Position of CLKSRC field.                                            */
  #define TDM_CONFIG_MCK_SRC_CLKSRC_Msk (0x1UL << TDM_CONFIG_MCK_SRC_CLKSRC_Pos) /*!< Bit mask of CLKSRC field.                */
  #define TDM_CONFIG_MCK_SRC_CLKSRC_Min (0x0UL)      /*!< Min enumerator value of CLKSRC field.                                */
  #define TDM_CONFIG_MCK_SRC_CLKSRC_Max (0x1UL)      /*!< Max enumerator value of CLKSRC field.                                */
  #define TDM_CONFIG_MCK_SRC_CLKSRC_PCLK32M (0x0UL)  /*!< 32MHz peripheral clock                                               */
  #define TDM_CONFIG_MCK_SRC_CLKSRC_ACLK (0x1UL)     /*!< Audio PLL clock                                                      */

/* BYPASS @Bit 8 : Bypass clock generator. MCK will be equal to source input. If bypass is enabled the MCKFREQ setting has no
                   effect. */                                                                                                     
                                                                                                                                  
  #define TDM_CONFIG_MCK_SRC_BYPASS_Pos (8UL)        /*!< Position of BYPASS field.                                            */
  #define TDM_CONFIG_MCK_SRC_BYPASS_Msk (0x1UL << TDM_CONFIG_MCK_SRC_BYPASS_Pos) /*!< Bit mask of BYPASS field.                */
  #define TDM_CONFIG_MCK_SRC_BYPASS_Min (0x0UL)      /*!< Min enumerator value of BYPASS field.                                */
  #define TDM_CONFIG_MCK_SRC_BYPASS_Max (0x1UL)      /*!< Max enumerator value of BYPASS field.                                */
  #define TDM_CONFIG_MCK_SRC_BYPASS_Disable (0x0UL)  /*!< Disable bypass                                                       */
  #define TDM_CONFIG_MCK_SRC_BYPASS_Enable (0x1UL)   /*!< Enable bypass                                                        */

/* JITTER @Bit 9 : Enable jittering clock. */
  #define TDM_CONFIG_MCK_SRC_JITTER_Pos (9UL)        /*!< Position of JITTER field.                                            */
  #define TDM_CONFIG_MCK_SRC_JITTER_Msk (0x1UL << TDM_CONFIG_MCK_SRC_JITTER_Pos) /*!< Bit mask of JITTER field.                */
  #define TDM_CONFIG_MCK_SRC_JITTER_Min (0x0UL)      /*!< Min enumerator value of JITTER field.                                */
  #define TDM_CONFIG_MCK_SRC_JITTER_Max (0x1UL)      /*!< Max enumerator value of JITTER field.                                */
  #define TDM_CONFIG_MCK_SRC_JITTER_Disable (0x0UL)  /*!< Disable jitter                                                       */
  #define TDM_CONFIG_MCK_SRC_JITTER_Enable (0x1UL)   /*!< Enable jitter                                                        */



/* ================================================== Struct TDM_CONFIG_SCK ================================================== */
/**
  * @brief SCK [TDM_CONFIG_SCK] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DIV;                               /*!< (@ 0x00000000) SCK divider.                                          */
  __IOM uint32_t  SRC;                               /*!< (@ 0x00000004) SCK clock source selection                            */
  __IOM uint32_t  POLARITY;                          /*!< (@ 0x00000008) Set SCK Polarity.                                     */
} NRF_TDM_CONFIG_SCK_Type;                           /*!< Size = 12 (0x00C)                                                    */

/* TDM_CONFIG_SCK_DIV: SCK divider. */
  #define TDM_CONFIG_SCK_DIV_ResetValue (0x00000000UL) /*!< Reset value of DIV register.                                       */

/* SCKDIV @Bits 0..31 : SCK frequency configuration NOTE: The 12 least significant bits of the register are ignored and shall be
                        set to zero. */                                                                                           
                                                                                                                                  
  #define TDM_CONFIG_SCK_DIV_SCKDIV_Pos (0UL)        /*!< Position of SCKDIV field.                                            */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_Msk (0xFFFFFFFFUL << TDM_CONFIG_SCK_DIV_SCKDIV_Pos) /*!< Bit mask of SCKDIV field.         */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_Min (0x20C0000UL) /*!< Min enumerator value of SCKDIV field.                               */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_Max (0x80000000UL) /*!< Max enumerator value of SCKDIV field.                              */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV2 (0x80000000UL) /*!< CK divided by 2                                                 */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV3 (0x50000000UL) /*!< CK divided by 3                                                 */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV4 (0x40000000UL) /*!< CK divided by 4                                                 */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV5 (0x30000000UL) /*!< CK divided by 5                                                 */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV6 (0x28000000UL) /*!< CK divided by 6                                                 */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV8 (0x20000000UL) /*!< CK divided by 8                                                 */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV10 (0x18000000UL) /*!< CK divided by 10                                               */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV11 (0x16000000UL) /*!< CK divided by 11                                               */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV15 (0x11000000UL) /*!< CK divided by 15                                               */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV16 (0x10000000UL) /*!< CK divided by 16                                               */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV21 (0x0C000000UL) /*!< CK divided by 21                                               */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV23 (0x0B000000UL) /*!< CK divided by 23                                               */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV30 (0x08800000UL) /*!< CK divided by 30                                               */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV31 (0x08400000UL) /*!< CK divided by 31                                               */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV32 (0x08000000UL) /*!< CK divided by 32                                               */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV42 (0x06000000UL) /*!< CK divided by 42                                               */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV63 (0x04100000UL) /*!< CK divided by 63                                               */
  #define TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV125 (0x020C0000UL) /*!< CK divided by 125                                             */


/* TDM_CONFIG_SCK_SRC: SCK clock source selection */
  #define TDM_CONFIG_SCK_SRC_ResetValue (0x00000000UL) /*!< Reset value of SRC register.                                       */

