adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CLKSRC @Bit 0 : Clock source selection */
  #define TDM_CONFIG_SCK_SRC_CLKSRC_Pos (0UL)        /*!< Position of CLKSRC field.                                            */
  #define TDM_CONFIG_SCK_SRC_CLKSRC_Msk (0x1UL << TDM_CONFIG_SCK_SRC_CLKSRC_Pos) /*!< Bit mask of CLKSRC field.                */
  #define TDM_CONFIG_SCK_SRC_CLKSRC_Min (0x0UL)      /*!< Min enumerator value of CLKSRC field.                                */
  #define TDM_CONFIG_SCK_SRC_CLKSRC_Max (0x1UL)      /*!< Max enumerator value of CLKSRC field.                                */
  #define TDM_CONFIG_SCK_SRC_CLKSRC_PCLK32M (0x0UL)  /*!< 32MHz peripheral clock                                               */
  #define TDM_CONFIG_SCK_SRC_CLKSRC_ACLK (0x1UL)     /*!< Audio PLL clock                                                      */

/* BYPASS @Bit 8 : Bypass clock generator. MCK will be equal to source input. If bypass is enabled the MCKFREQ setting has no
                   effect. */                                                                                                     
                                                                                                                                  
  #define TDM_CONFIG_SCK_SRC_BYPASS_Pos (8UL)        /*!< Position of BYPASS field.                                            */
  #define TDM_CONFIG_SCK_SRC_BYPASS_Msk (0x1UL << TDM_CONFIG_SCK_SRC_BYPASS_Pos) /*!< Bit mask of BYPASS field.                */
  #define TDM_CONFIG_SCK_SRC_BYPASS_Min (0x0UL)      /*!< Min enumerator value of BYPASS field.                                */
  #define TDM_CONFIG_SCK_SRC_BYPASS_Max (0x1UL)      /*!< Max enumerator value of BYPASS field.                                */
  #define TDM_CONFIG_SCK_SRC_BYPASS_Disable (0x0UL)  /*!< Disable bypass                                                       */
  #define TDM_CONFIG_SCK_SRC_BYPASS_Enable (0x1UL)   /*!< Enable bypass                                                        */

/* JITTER @Bit 9 : Enable jittering clock. */
  #define TDM_CONFIG_SCK_SRC_JITTER_Pos (9UL)        /*!< Position of JITTER field.                                            */
  #define TDM_CONFIG_SCK_SRC_JITTER_Msk (0x1UL << TDM_CONFIG_SCK_SRC_JITTER_Pos) /*!< Bit mask of JITTER field.                */
  #define TDM_CONFIG_SCK_SRC_JITTER_Min (0x0UL)      /*!< Min enumerator value of JITTER field.                                */
  #define TDM_CONFIG_SCK_SRC_JITTER_Max (0x1UL)      /*!< Max enumerator value of JITTER field.                                */
  #define TDM_CONFIG_SCK_SRC_JITTER_Disable (0x0UL)  /*!< Disable jitter                                                       */
  #define TDM_CONFIG_SCK_SRC_JITTER_Enable (0x1UL)   /*!< Enable jitter                                                        */


/* TDM_CONFIG_SCK_POLARITY: Set SCK Polarity. */
  #define TDM_CONFIG_SCK_POLARITY_ResetValue (0x00000000UL) /*!< Reset value of POLARITY register.                             */

/* SCKPOLARITY @Bit 0 : Set the polarity of the active SCK edge. */
  #define TDM_CONFIG_SCK_POLARITY_SCKPOLARITY_Pos (0UL) /*!< Position of SCKPOLARITY field.                                    */
  #define TDM_CONFIG_SCK_POLARITY_SCKPOLARITY_Msk (0x1UL << TDM_CONFIG_SCK_POLARITY_SCKPOLARITY_Pos) /*!< Bit mask of
                                                                            SCKPOLARITY field.*/                                  
  #define TDM_CONFIG_SCK_POLARITY_SCKPOLARITY_Min (0x0UL) /*!< Min enumerator value of SCKPOLARITY field.                      */
  #define TDM_CONFIG_SCK_POLARITY_SCKPOLARITY_Max (0x1UL) /*!< Max enumerator value of SCKPOLARITY field.                      */
  #define TDM_CONFIG_SCK_POLARITY_SCKPOLARITY_PosEdge (0x0UL) /*!< TX data is written to the SDOUT pin on the falling edge of
                                                                   SCK, ready to be received on the rising edge of SCK.*/         
  #define TDM_CONFIG_SCK_POLARITY_SCKPOLARITY_NegEdge (0x1UL) /*!< TX data is written to the SDOUT pin on the rising edge of
                                                                   SCK, ready to be received on the falling edge of SCK.*/        



/* ================================================ Struct TDM_CONFIG_CHANNEL ================================================ */
/**
  * @brief CHANNEL [TDM_CONFIG_CHANNEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MASK;                              /*!< (@ 0x00000000) Select which channels are to be used.                 */
  __IOM uint32_t  NUM;                               /*!< (@ 0x00000004) Select number of channels.                            */
  __IOM uint32_t  DELAY;                             /*!< (@ 0x00000008) Set channel delay.                                    */
} NRF_TDM_CONFIG_CHANNEL_Type;                       /*!< Size = 12 (0x00C)                                                    */

/* TDM_CONFIG_CHANNEL_MASK: Select which channels are to be used. */
  #define TDM_CONFIG_CHANNEL_MASK_ResetValue (0x00FF00FFUL) /*!< Reset value of MASK register.                                 */

/* Rx0Enable @Bit 0 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Rx0Enable_Pos (0UL) /*!< Position of Rx0Enable field.                                        */
  #define TDM_CONFIG_CHANNEL_MASK_Rx0Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Rx0Enable_Pos) /*!< Bit mask of Rx0Enable
                                                                            field.*/                                              
  #define TDM_CONFIG_CHANNEL_MASK_Rx0Enable_Min (0x0UL) /*!< Min enumerator value of Rx0Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx0Enable_Max (0x1UL) /*!< Max enumerator value of Rx0Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx0Enable_Disable (0x0UL) /*!< Disable Rx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Rx0Enable_Enable (0x1UL) /*!< Enable Rx channel data.                                        */

/* Rx1Enable @Bit 1 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Rx1Enable_Pos (1UL) /*!< Position of Rx1Enable field.                                        */
  #define TDM_CONFIG_CHANNEL_MASK_Rx1Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Rx1Enable_Pos) /*!< Bit mask of Rx1Enable
                                                                            field.*/                                              
  #define TDM_CONFIG_CHANNEL_MASK_Rx1Enable_Min (0x0UL) /*!< Min enumerator value of Rx1Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx1Enable_Max (0x1UL) /*!< Max enumerator value of Rx1Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx1Enable_Disable (0x0UL) /*!< Disable Rx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Rx1Enable_Enable (0x1UL) /*!< Enable Rx channel data.                                        */

