adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* Rx2Enable @Bit 2 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Rx2Enable_Pos (2UL) /*!< Position of Rx2Enable field.                                        */
  #define TDM_CONFIG_CHANNEL_MASK_Rx2Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Rx2Enable_Pos) /*!< Bit mask of Rx2Enable
                                                                            field.*/                                              
  #define TDM_CONFIG_CHANNEL_MASK_Rx2Enable_Min (0x0UL) /*!< Min enumerator value of Rx2Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx2Enable_Max (0x1UL) /*!< Max enumerator value of Rx2Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx2Enable_Disable (0x0UL) /*!< Disable Rx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Rx2Enable_Enable (0x1UL) /*!< Enable Rx channel data.                                        */

/* Rx3Enable @Bit 3 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Rx3Enable_Pos (3UL) /*!< Position of Rx3Enable field.                                        */
  #define TDM_CONFIG_CHANNEL_MASK_Rx3Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Rx3Enable_Pos) /*!< Bit mask of Rx3Enable
                                                                            field.*/                                              
  #define TDM_CONFIG_CHANNEL_MASK_Rx3Enable_Min (0x0UL) /*!< Min enumerator value of Rx3Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx3Enable_Max (0x1UL) /*!< Max enumerator value of Rx3Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx3Enable_Disable (0x0UL) /*!< Disable Rx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Rx3Enable_Enable (0x1UL) /*!< Enable Rx channel data.                                        */

/* Rx4Enable @Bit 4 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Rx4Enable_Pos (4UL) /*!< Position of Rx4Enable field.                                        */
  #define TDM_CONFIG_CHANNEL_MASK_Rx4Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Rx4Enable_Pos) /*!< Bit mask of Rx4Enable
                                                                            field.*/                                              
  #define TDM_CONFIG_CHANNEL_MASK_Rx4Enable_Min (0x0UL) /*!< Min enumerator value of Rx4Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx4Enable_Max (0x1UL) /*!< Max enumerator value of Rx4Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx4Enable_Disable (0x0UL) /*!< Disable Rx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Rx4Enable_Enable (0x1UL) /*!< Enable Rx channel data.                                        */

/* Rx5Enable @Bit 5 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Rx5Enable_Pos (5UL) /*!< Position of Rx5Enable field.                                        */
  #define TDM_CONFIG_CHANNEL_MASK_Rx5Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Rx5Enable_Pos) /*!< Bit mask of Rx5Enable
                                                                            field.*/                                              
  #define TDM_CONFIG_CHANNEL_MASK_Rx5Enable_Min (0x0UL) /*!< Min enumerator value of Rx5Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx5Enable_Max (0x1UL) /*!< Max enumerator value of Rx5Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx5Enable_Disable (0x0UL) /*!< Disable Rx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Rx5Enable_Enable (0x1UL) /*!< Enable Rx channel data.                                        */

/* Rx6Enable @Bit 6 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Rx6Enable_Pos (6UL) /*!< Position of Rx6Enable field.                                        */
  #define TDM_CONFIG_CHANNEL_MASK_Rx6Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Rx6Enable_Pos) /*!< Bit mask of Rx6Enable
                                                                            field.*/                                              
  #define TDM_CONFIG_CHANNEL_MASK_Rx6Enable_Min (0x0UL) /*!< Min enumerator value of Rx6Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx6Enable_Max (0x1UL) /*!< Max enumerator value of Rx6Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx6Enable_Disable (0x0UL) /*!< Disable Rx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Rx6Enable_Enable (0x1UL) /*!< Enable Rx channel data.                                        */

/* Rx7Enable @Bit 7 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Rx7Enable_Pos (7UL) /*!< Position of Rx7Enable field.                                        */
  #define TDM_CONFIG_CHANNEL_MASK_Rx7Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Rx7Enable_Pos) /*!< Bit mask of Rx7Enable
                                                                            field.*/                                              
  #define TDM_CONFIG_CHANNEL_MASK_Rx7Enable_Min (0x0UL) /*!< Min enumerator value of Rx7Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx7Enable_Max (0x1UL) /*!< Max enumerator value of Rx7Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx7Enable_Disable (0x0UL) /*!< Disable Rx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Rx7Enable_Enable (0x1UL) /*!< Enable Rx channel data.                                        */

/* Tx0Enable @Bit 16 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Tx0Enable_Pos (16UL) /*!< Position of Tx0Enable field.                                       */
  #define TDM_CONFIG_CHANNEL_MASK_Tx0Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Tx0Enable_Pos) /*!< Bit mask of Tx0Enable
                                                                            field.*/                                              
  #define TDM_CONFIG_CHANNEL_MASK_Tx0Enable_Min (0x0UL) /*!< Min enumerator value of Tx0Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx0Enable_Max (0x1UL) /*!< Max enumerator value of Tx0Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx0Enable_Disable (0x0UL) /*!< Disable Tx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Tx0Enable_Enable (0x1UL) /*!< Enable Tx channel data.                                        */

/* Tx1Enable @Bit 17 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Tx1Enable_Pos (17UL) /*!< Position of Tx1Enable field.                                       */
  #define TDM_CONFIG_CHANNEL_MASK_Tx1Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Tx1Enable_Pos) /*!< Bit mask of Tx1Enable
                                                                            field.*/                                              
  #define TDM_CONFIG_CHANNEL_MASK_Tx1Enable_Min (0x0UL) /*!< Min enumerator value of Tx1Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx1Enable_Max (0x1UL) /*!< Max enumerator value of Tx1Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx1Enable_Disable (0x0UL) /*!< Disable Tx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Tx1Enable_Enable (0x1UL) /*!< Enable Tx channel data.                                        */

