adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* Tx2Enable @Bit 18 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Tx2Enable_Pos (18UL) /*!< Position of Tx2Enable field.                                       */
  #define TDM_CONFIG_CHANNEL_MASK_Tx2Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Tx2Enable_Pos) /*!< Bit mask of Tx2Enable
                                                                            field.*/                                              
  #define TDM_CONFIG_CHANNEL_MASK_Tx2Enable_Min (0x0UL) /*!< Min enumerator value of Tx2Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx2Enable_Max (0x1UL) /*!< Max enumerator value of Tx2Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx2Enable_Disable (0x0UL) /*!< Disable Tx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Tx2Enable_Enable (0x1UL) /*!< Enable Tx channel data.                                        */

/* Tx3Enable @Bit 19 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Tx3Enable_Pos (19UL) /*!< Position of Tx3Enable field.                                       */
  #define TDM_CONFIG_CHANNEL_MASK_Tx3Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Tx3Enable_Pos) /*!< Bit mask of Tx3Enable
                                                                            field.*/                                              
  #define TDM_CONFIG_CHANNEL_MASK_Tx3Enable_Min (0x0UL) /*!< Min enumerator value of Tx3Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx3Enable_Max (0x1UL) /*!< Max enumerator value of Tx3Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx3Enable_Disable (0x0UL) /*!< Disable Tx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Tx3Enable_Enable (0x1UL) /*!< Enable Tx channel data.                                        */

/* Tx4Enable @Bit 20 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Tx4Enable_Pos (20UL) /*!< Position of Tx4Enable field.                                       */
  #define TDM_CONFIG_CHANNEL_MASK_Tx4Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Tx4Enable_Pos) /*!< Bit mask of Tx4Enable
                                                                            field.*/                                              
  #define TDM_CONFIG_CHANNEL_MASK_Tx4Enable_Min (0x0UL) /*!< Min enumerator value of Tx4Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx4Enable_Max (0x1UL) /*!< Max enumerator value of Tx4Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx4Enable_Disable (0x0UL) /*!< Disable Tx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Tx4Enable_Enable (0x1UL) /*!< Enable Tx channel data.                                        */

/* Tx5Enable @Bit 21 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Tx5Enable_Pos (21UL) /*!< Position of Tx5Enable field.                                       */
  #define TDM_CONFIG_CHANNEL_MASK_Tx5Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Tx5Enable_Pos) /*!< Bit mask of Tx5Enable
                                                                            field.*/                                              
  #define TDM_CONFIG_CHANNEL_MASK_Tx5Enable_Min (0x0UL) /*!< Min enumerator value of Tx5Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx5Enable_Max (0x1UL) /*!< Max enumerator value of Tx5Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx5Enable_Disable (0x0UL) /*!< Disable Tx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Tx5Enable_Enable (0x1UL) /*!< Enable Tx channel data.                                        */

/* Tx6Enable @Bit 22 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Tx6Enable_Pos (22UL) /*!< Position of Tx6Enable field.                                       */
  #define TDM_CONFIG_CHANNEL_MASK_Tx6Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Tx6Enable_Pos) /*!< Bit mask of Tx6Enable
                                                                            field.*/                                              
  #define TDM_CONFIG_CHANNEL_MASK_Tx6Enable_Min (0x0UL) /*!< Min enumerator value of Tx6Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx6Enable_Max (0x1UL) /*!< Max enumerator value of Tx6Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx6Enable_Disable (0x0UL) /*!< Disable Tx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Tx6Enable_Enable (0x1UL) /*!< Enable Tx channel data.                                        */

/* Tx7Enable @Bit 23 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Tx7Enable_Pos (23UL) /*!< Position of Tx7Enable field.                                       */
  #define TDM_CONFIG_CHANNEL_MASK_Tx7Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Tx7Enable_Pos) /*!< Bit mask of Tx7Enable
                                                                            field.*/                                              
  #define TDM_CONFIG_CHANNEL_MASK_Tx7Enable_Min (0x0UL) /*!< Min enumerator value of Tx7Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx7Enable_Max (0x1UL) /*!< Max enumerator value of Tx7Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx7Enable_Disable (0x0UL) /*!< Disable Tx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Tx7Enable_Enable (0x1UL) /*!< Enable Tx channel data.                                        */


/* TDM_CONFIG_CHANNEL_NUM: Select number of channels. */
  #define TDM_CONFIG_CHANNEL_NUM_ResetValue (0x00000001UL) /*!< Reset value of NUM register.                                   */

/* NUM @Bits 0..3 : Select number of channels. */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Pos (0UL)       /*!< Position of NUM field.                                               */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Msk (0xFUL << TDM_CONFIG_CHANNEL_NUM_NUM_Pos) /*!< Bit mask of NUM field.                 */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Min (0x0UL)     /*!< Min enumerator value of NUM field.                                   */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Max (0x7UL)     /*!< Max enumerator value of NUM field.                                   */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Tdm1Ch (0x0UL)  /*!< 1-channel audio (mono).                                              */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Tdm2Ch (0x1UL)  /*!< 2-channel audio (stereo).                                            */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Tdm3Ch (0x2UL)  /*!< 3-channel audio.                                                     */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Tdm4Ch (0x3UL)  /*!< 4-channel audio.                                                     */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Tdm5Ch (0x4UL)  /*!< 5-channel audio.                                                     */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Tdm6Ch (0x5UL)  /*!< 6-channel audio.                                                     */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Tdm7Ch (0x6UL)  /*!< 7-channel audio.                                                     */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Tdm8Ch (0x7UL)  /*!< 8-channel audio.                                                     */


