adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TDM_CONFIG_RXEN: Reception (RX) enable. */
  #define TDM_CONFIG_RXEN_ResetValue (0x00000000UL)  /*!< Reset value of RXEN register.                                        */

/* RXEN @Bit 0 : Reception (RX) enable. */
  #define TDM_CONFIG_RXEN_RXEN_Pos (0UL)             /*!< Position of RXEN field.                                              */
  #define TDM_CONFIG_RXEN_RXEN_Msk (0x1UL << TDM_CONFIG_RXEN_RXEN_Pos) /*!< Bit mask of RXEN field.                            */
  #define TDM_CONFIG_RXEN_RXEN_Min (0x0UL)           /*!< Min enumerator value of RXEN field.                                  */
  #define TDM_CONFIG_RXEN_RXEN_Max (0x1UL)           /*!< Max enumerator value of RXEN field.                                  */
  #define TDM_CONFIG_RXEN_RXEN_Disabled (0x0UL)      /*!< Reception disabled and no data will be written to the RXD.PTR
                                                          address.*/                                                              
  #define TDM_CONFIG_RXEN_RXEN_Enabled (0x1UL)       /*!< Reception enabled.                                                   */


/* TDM_CONFIG_TXEN: Transmission (TX) enable. */
  #define TDM_CONFIG_TXEN_ResetValue (0x00000000UL)  /*!< Reset value of TXEN register.                                        */

/* TXEN @Bit 0 : Transmission (TX) enable. */
  #define TDM_CONFIG_TXEN_TXEN_Pos (0UL)             /*!< Position of TXEN field.                                              */
  #define TDM_CONFIG_TXEN_TXEN_Msk (0x1UL << TDM_CONFIG_TXEN_TXEN_Pos) /*!< Bit mask of TXEN field.                            */
  #define TDM_CONFIG_TXEN_TXEN_Min (0x0UL)           /*!< Min enumerator value of TXEN field.                                  */
  #define TDM_CONFIG_TXEN_TXEN_Max (0x1UL)           /*!< Max enumerator value of TXEN field.                                  */
  #define TDM_CONFIG_TXEN_TXEN_Disabled (0x0UL)      /*!< Transmission disabled and no data will be read from the TXD.PTR
                                                          address.*/                                                              
  #define TDM_CONFIG_TXEN_TXEN_Enabled (0x1UL)       /*!< Transmission enabled.                                                */


/* TDM_CONFIG_SWIDTH: Sample and word width configuration. */
  #define TDM_CONFIG_SWIDTH_ResetValue (0x00000001UL) /*!< Reset value of SWIDTH register.                                     */

/* SWIDTH @Bits 0..2 : Sample and word width */
  #define TDM_CONFIG_SWIDTH_SWIDTH_Pos (0UL)         /*!< Position of SWIDTH field.                                            */
  #define TDM_CONFIG_SWIDTH_SWIDTH_Msk (0x7UL << TDM_CONFIG_SWIDTH_SWIDTH_Pos) /*!< Bit mask of SWIDTH field.                  */
  #define TDM_CONFIG_SWIDTH_SWIDTH_Min (0x0UL)       /*!< Min enumerator value of SWIDTH field.                                */
  #define TDM_CONFIG_SWIDTH_SWIDTH_Max (0x7UL)       /*!< Max enumerator value of SWIDTH field.                                */
  #define TDM_CONFIG_SWIDTH_SWIDTH_8Bit (0x0UL)      /*!< 8 bit sample in an 8-bit word.                                       */
  #define TDM_CONFIG_SWIDTH_SWIDTH_16Bit (0x1UL)     /*!< 16 bit sample in a 16-bit word.                                      */
  #define TDM_CONFIG_SWIDTH_SWIDTH_24Bit (0x2UL)     /*!< 24 bit sample in a 24-bit word.                                      */
  #define TDM_CONFIG_SWIDTH_SWIDTH_32Bit (0x3UL)     /*!< 32 bit sample in a 32-bit word.                                      */
  #define TDM_CONFIG_SWIDTH_SWIDTH_8BitIn16 (0x4UL)  /*!< 8 bit sample in a 16-bit word.                                       */
  #define TDM_CONFIG_SWIDTH_SWIDTH_8BitIn32 (0x5UL)  /*!< 8 bit sample in a 32-bit word.                                       */
  #define TDM_CONFIG_SWIDTH_SWIDTH_16BitIn32 (0x6UL) /*!< 16 bit sample in a 32-bit word.                                      */
  #define TDM_CONFIG_SWIDTH_SWIDTH_24BitIn32 (0x7UL) /*!< 24 bit sample in a 32-bit word.                                      */


/* TDM_CONFIG_ALIGN: Alignment of sample within the audio data word. */
  #define TDM_CONFIG_ALIGN_ResetValue (0x00000000UL) /*!< Reset value of ALIGN register.                                       */

/* ALIGN @Bit 0 : Alignment of sample within the audio data word. */
  #define TDM_CONFIG_ALIGN_ALIGN_Pos (0UL)           /*!< Position of ALIGN field.                                             */
  #define TDM_CONFIG_ALIGN_ALIGN_Msk (0x1UL << TDM_CONFIG_ALIGN_ALIGN_Pos) /*!< Bit mask of ALIGN field.                       */
  #define TDM_CONFIG_ALIGN_ALIGN_Min (0x0UL)         /*!< Min enumerator value of ALIGN field.                                 */
  #define TDM_CONFIG_ALIGN_ALIGN_Max (0x1UL)         /*!< Max enumerator value of ALIGN field.                                 */
  #define TDM_CONFIG_ALIGN_ALIGN_Left (0x0UL)        /*!< Left-aligned.                                                        */
  #define TDM_CONFIG_ALIGN_ALIGN_Right (0x1UL)       /*!< Right-aligned.                                                       */



/* ===================================================== Struct TDM_PSEL ===================================================== */
/**
  * @brief PSEL [TDM_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MCK;                               /*!< (@ 0x00000000) Pin select for MCK signal                             */
  __IOM uint32_t  SCK;                               /*!< (@ 0x00000004) Pin select for SCK signal                             */
  __IOM uint32_t  FSYNC;                             /*!< (@ 0x00000008) Pin select for FSYNC signal                           */
  __IOM uint32_t  SDIN;                              /*!< (@ 0x0000000C) Pin select for SDIN signal                            */
  __IOM uint32_t  SDOUT;                             /*!< (@ 0x00000010) Pin select for SDOUT signal                           */
} NRF_TDM_PSEL_Type;                                 /*!< Size = 20 (0x014)                                                    */

/* TDM_PSEL_MCK: Pin select for MCK signal */
  #define TDM_PSEL_MCK_ResetValue (0xFFFFFFFFUL)     /*!< Reset value of MCK register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define TDM_PSEL_MCK_PIN_Pos (0UL)                 /*!< Position of PIN field.                                               */
  #define TDM_PSEL_MCK_PIN_Msk (0x1FUL << TDM_PSEL_MCK_PIN_Pos) /*!< Bit mask of PIN field.                                    */
  #define TDM_PSEL_MCK_PIN_Min (0x0UL)               /*!< Min value of PIN field.                                              */
  #define TDM_PSEL_MCK_PIN_Max (0x1FUL)              /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define TDM_PSEL_MCK_PORT_Pos (5UL)                /*!< Position of PORT field.                                              */
  #define TDM_PSEL_MCK_PORT_Msk (0xFUL << TDM_PSEL_MCK_PORT_Pos) /*!< Bit mask of PORT field.                                  */
  #define TDM_PSEL_MCK_PORT_Min (0x0UL)              /*!< Min value of PORT field.                                             */
  #define TDM_PSEL_MCK_PORT_Max (0xFUL)              /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define TDM_PSEL_MCK_CONNECT_Pos (31UL)            /*!< Position of CONNECT field.                                           */
  #define TDM_PSEL_MCK_CONNECT_Msk (0x1UL << TDM_PSEL_MCK_CONNECT_Pos) /*!< Bit mask of CONNECT field.                         */
  #define TDM_PSEL_MCK_CONNECT_Min (0x0UL)           /*!< Min enumerator value of CONNECT field.                               */
  #define TDM_PSEL_MCK_CONNECT_Max (0x1UL)           /*!< Max enumerator value of CONNECT field.                               */
  #define TDM_PSEL_MCK_CONNECT_Disconnected (0x1UL)  /*!< Disconnect                                                           */
  #define TDM_PSEL_MCK_CONNECT_Connected (0x0UL)     /*!< Connect                                                              */


