adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TASKS_START @Bit 0 : Starts continuous TDM transfer. Also starts MCK when this is enabled */
  #define TDM_TASKS_START_TASKS_START_Pos (0UL)      /*!< Position of TASKS_START field.                                       */
  #define TDM_TASKS_START_TASKS_START_Msk (0x1UL << TDM_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.       */
  #define TDM_TASKS_START_TASKS_START_Min (0x1UL)    /*!< Min enumerator value of TASKS_START field.                           */
  #define TDM_TASKS_START_TASKS_START_Max (0x1UL)    /*!< Max enumerator value of TASKS_START field.                           */
  #define TDM_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                        */


/* TDM_TASKS_STOP: Stops TDM transfer after the completion of MAXCNT words. Triggering this task will cause the STOPPED event to
                    be generated. */                                                                                              
                                                                                                                                  
  #define TDM_TASKS_STOP_ResetValue (0x00000000UL)   /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stops TDM transfer after the completion of MAXCNT words. Triggering this task will cause the STOPPED
                       event to be generated. */                                                                                  
                                                                                                                                  
  #define TDM_TASKS_STOP_TASKS_STOP_Pos (0UL)        /*!< Position of TASKS_STOP field.                                        */
  #define TDM_TASKS_STOP_TASKS_STOP_Msk (0x1UL << TDM_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.            */
  #define TDM_TASKS_STOP_TASKS_STOP_Min (0x1UL)      /*!< Min enumerator value of TASKS_STOP field.                            */
  #define TDM_TASKS_STOP_TASKS_STOP_Max (0x1UL)      /*!< Max enumerator value of TASKS_STOP field.                            */
  #define TDM_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)  /*!< Trigger task                                                         */


/* TDM_TASKS_ABORT: Abort TDM transfer without completing MAXCNT words. Triggering this task will cause the ABORTED event to be
                     generated. */                                                                                                
                                                                                                                                  
  #define TDM_TASKS_ABORT_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_ABORT register.                                 */

/* TASKS_ABORT @Bit 0 : Abort TDM transfer without completing MAXCNT words. Triggering this task will cause the ABORTED event to
                        be generated. */                                                                                          
                                                                                                                                  
  #define TDM_TASKS_ABORT_TASKS_ABORT_Pos (0UL)      /*!< Position of TASKS_ABORT field.                                       */
  #define TDM_TASKS_ABORT_TASKS_ABORT_Msk (0x1UL << TDM_TASKS_ABORT_TASKS_ABORT_Pos) /*!< Bit mask of TASKS_ABORT field.       */
  #define TDM_TASKS_ABORT_TASKS_ABORT_Min (0x1UL)    /*!< Min enumerator value of TASKS_ABORT field.                           */
  #define TDM_TASKS_ABORT_TASKS_ABORT_Max (0x1UL)    /*!< Max enumerator value of TASKS_ABORT field.                           */
  #define TDM_TASKS_ABORT_TASKS_ABORT_Trigger (0x1UL) /*!< Trigger task                                                        */


/* TDM_TASKS_DMA_START_TX: Equivalent to ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_START_TX */
  #define TDM_TASKS_DMA_START_TX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DMA_START_TX register.                    */

/* TASKS_DMA_START_TX @Bit 0 : Equivalent to ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_START_TX */
  #define TDM_TASKS_DMA_START_TX_TASKS_DMA_START_TX_Pos (0UL) /*!< Position of TASKS_DMA_START_TX field.                       */
  #define TDM_TASKS_DMA_START_TX_TASKS_DMA_START_TX_Msk (0x1UL << TDM_TASKS_DMA_START_TX_TASKS_DMA_START_TX_Pos) /*!< Bit mask
                                                                            of TASKS_DMA_START_TX field.*/                        
  #define TDM_TASKS_DMA_START_TX_TASKS_DMA_START_TX_Min (0x1UL) /*!< Min enumerator value of TASKS_DMA_START_TX field.         */
  #define TDM_TASKS_DMA_START_TX_TASKS_DMA_START_TX_Max (0x1UL) /*!< Max enumerator value of TASKS_DMA_START_TX field.         */
  #define TDM_TASKS_DMA_START_TX_TASKS_DMA_START_TX_Trigger (0x1UL) /*!< Trigger task                                          */


/* TDM_TASKS_DMA_START_RX: Equivalent to ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_START_RX */
  #define TDM_TASKS_DMA_START_RX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DMA_START_RX register.                    */

/* TASKS_DMA_START_RX @Bit 0 : Equivalent to ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_START_RX */
  #define TDM_TASKS_DMA_START_RX_TASKS_DMA_START_RX_Pos (0UL) /*!< Position of TASKS_DMA_START_RX field.                       */
  #define TDM_TASKS_DMA_START_RX_TASKS_DMA_START_RX_Msk (0x1UL << TDM_TASKS_DMA_START_RX_TASKS_DMA_START_RX_Pos) /*!< Bit mask
                                                                            of TASKS_DMA_START_RX field.*/                        
  #define TDM_TASKS_DMA_START_RX_TASKS_DMA_START_RX_Min (0x1UL) /*!< Min enumerator value of TASKS_DMA_START_RX field.         */
  #define TDM_TASKS_DMA_START_RX_TASKS_DMA_START_RX_Max (0x1UL) /*!< Max enumerator value of TASKS_DMA_START_RX field.         */
  #define TDM_TASKS_DMA_START_RX_TASKS_DMA_START_RX_Trigger (0x1UL) /*!< Trigger task                                          */


/* TDM_TASKS_DMA_STOP_TX: Equivalent to ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_STOP_TX */
  #define TDM_TASKS_DMA_STOP_TX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DMA_STOP_TX register.                      */

/* TASKS_DMA_STOP_TX @Bit 0 : Equivalent to ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_STOP_TX */
  #define TDM_TASKS_DMA_STOP_TX_TASKS_DMA_STOP_TX_Pos (0UL) /*!< Position of TASKS_DMA_STOP_TX field.                          */
  #define TDM_TASKS_DMA_STOP_TX_TASKS_DMA_STOP_TX_Msk (0x1UL << TDM_TASKS_DMA_STOP_TX_TASKS_DMA_STOP_TX_Pos) /*!< Bit mask of
                                                                            TASKS_DMA_STOP_TX field.*/                            
  #define TDM_TASKS_DMA_STOP_TX_TASKS_DMA_STOP_TX_Min (0x1UL) /*!< Min enumerator value of TASKS_DMA_STOP_TX field.            */
  #define TDM_TASKS_DMA_STOP_TX_TASKS_DMA_STOP_TX_Max (0x1UL) /*!< Max enumerator value of TASKS_DMA_STOP_TX field.            */
  #define TDM_TASKS_DMA_STOP_TX_TASKS_DMA_STOP_TX_Trigger (0x1UL) /*!< Trigger task                                            */


/* TDM_TASKS_DMA_STOP_RX: Equivalent to ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_STOP_RX */
  #define TDM_TASKS_DMA_STOP_RX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DMA_STOP_RX register.                      */

/* TASKS_DMA_STOP_RX @Bit 0 : Equivalent to ID_DMA_CHANNEL_PERIPHERAL_TASK_TRIG_STOP_RX */
  #define TDM_TASKS_DMA_STOP_RX_TASKS_DMA_STOP_RX_Pos (0UL) /*!< Position of TASKS_DMA_STOP_RX field.                          */
  #define TDM_TASKS_DMA_STOP_RX_TASKS_DMA_STOP_RX_Msk (0x1UL << TDM_TASKS_DMA_STOP_RX_TASKS_DMA_STOP_RX_Pos) /*!< Bit mask of
                                                                            TASKS_DMA_STOP_RX field.*/                            
  #define TDM_TASKS_DMA_STOP_RX_TASKS_DMA_STOP_RX_Min (0x1UL) /*!< Min enumerator value of TASKS_DMA_STOP_RX field.            */
  #define TDM_TASKS_DMA_STOP_RX_TASKS_DMA_STOP_RX_Max (0x1UL) /*!< Max enumerator value of TASKS_DMA_STOP_RX field.            */
  #define TDM_TASKS_DMA_STOP_RX_TASKS_DMA_STOP_RX_Trigger (0x1UL) /*!< Trigger task                                            */


/* TDM_SUBSCRIBE_START: Subscribe configuration for task START */
  #define TDM_SUBSCRIBE_START_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_START register.                          */

