adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define TDM_SUBSCRIBE_START_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define TDM_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << TDM_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define TDM_SUBSCRIBE_START_CHIDX_Min (0x0UL)      /*!< Min value of CHIDX field.                                            */
  #define TDM_SUBSCRIBE_START_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_SUBSCRIBE_START_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define TDM_SUBSCRIBE_START_EN_Msk (0x1UL << TDM_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field.                          */
  #define TDM_SUBSCRIBE_START_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_START_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_START_EN_Disabled (0x0UL)    /*!< Disable subscription                                                 */
  #define TDM_SUBSCRIBE_START_EN_Enabled (0x1UL)     /*!< Enable subscription                                                  */


/* TDM_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define TDM_SUBSCRIBE_STOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOP register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define TDM_SUBSCRIBE_STOP_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define TDM_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << TDM_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define TDM_SUBSCRIBE_STOP_CHIDX_Min (0x0UL)       /*!< Min value of CHIDX field.                                            */
  #define TDM_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_SUBSCRIBE_STOP_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define TDM_SUBSCRIBE_STOP_EN_Msk (0x1UL << TDM_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field.                            */
  #define TDM_SUBSCRIBE_STOP_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_STOP_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_STOP_EN_Disabled (0x0UL)     /*!< Disable subscription                                                 */
  #define TDM_SUBSCRIBE_STOP_EN_Enabled (0x1UL)      /*!< Enable subscription                                                  */


/* TDM_SUBSCRIBE_ABORT: Subscribe configuration for task ABORT */
  #define TDM_SUBSCRIBE_ABORT_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_ABORT register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task ABORT will subscribe to */
  #define TDM_SUBSCRIBE_ABORT_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define TDM_SUBSCRIBE_ABORT_CHIDX_Msk (0xFFUL << TDM_SUBSCRIBE_ABORT_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define TDM_SUBSCRIBE_ABORT_CHIDX_Min (0x0UL)      /*!< Min value of CHIDX field.                                            */
  #define TDM_SUBSCRIBE_ABORT_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_SUBSCRIBE_ABORT_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define TDM_SUBSCRIBE_ABORT_EN_Msk (0x1UL << TDM_SUBSCRIBE_ABORT_EN_Pos) /*!< Bit mask of EN field.                          */
  #define TDM_SUBSCRIBE_ABORT_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_ABORT_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_ABORT_EN_Disabled (0x0UL)    /*!< Disable subscription                                                 */
  #define TDM_SUBSCRIBE_ABORT_EN_Enabled (0x1UL)     /*!< Enable subscription                                                  */


/* TDM_SUBSCRIBE_DMA_START_TX: Subscribe configuration for task DMA_START_TX */
  #define TDM_SUBSCRIBE_DMA_START_TX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DMA_START_TX register.            */

/* CHIDX @Bits 0..7 : DPPI channel that task DMA_START_TX will subscribe to */
  #define TDM_SUBSCRIBE_DMA_START_TX_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define TDM_SUBSCRIBE_DMA_START_TX_CHIDX_Msk (0xFFUL << TDM_SUBSCRIBE_DMA_START_TX_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define TDM_SUBSCRIBE_DMA_START_TX_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                          */
  #define TDM_SUBSCRIBE_DMA_START_TX_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define TDM_SUBSCRIBE_DMA_START_TX_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define TDM_SUBSCRIBE_DMA_START_TX_EN_Msk (0x1UL << TDM_SUBSCRIBE_DMA_START_TX_EN_Pos) /*!< Bit mask of EN field.            */
  #define TDM_SUBSCRIBE_DMA_START_TX_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_DMA_START_TX_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_DMA_START_TX_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define TDM_SUBSCRIBE_DMA_START_TX_EN_Enabled (0x1UL) /*!< Enable subscription                                               */


