adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TDM_SUBSCRIBE_DMA_START_RX: Subscribe configuration for task DMA_START_RX */
  #define TDM_SUBSCRIBE_DMA_START_RX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DMA_START_RX register.            */

/* CHIDX @Bits 0..7 : DPPI channel that task DMA_START_RX will subscribe to */
  #define TDM_SUBSCRIBE_DMA_START_RX_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define TDM_SUBSCRIBE_DMA_START_RX_CHIDX_Msk (0xFFUL << TDM_SUBSCRIBE_DMA_START_RX_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define TDM_SUBSCRIBE_DMA_START_RX_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                          */
  #define TDM_SUBSCRIBE_DMA_START_RX_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define TDM_SUBSCRIBE_DMA_START_RX_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define TDM_SUBSCRIBE_DMA_START_RX_EN_Msk (0x1UL << TDM_SUBSCRIBE_DMA_START_RX_EN_Pos) /*!< Bit mask of EN field.            */
  #define TDM_SUBSCRIBE_DMA_START_RX_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_DMA_START_RX_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_DMA_START_RX_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define TDM_SUBSCRIBE_DMA_START_RX_EN_Enabled (0x1UL) /*!< Enable subscription                                               */


/* TDM_SUBSCRIBE_DMA_STOP_TX: Subscribe configuration for task DMA_STOP_TX */
  #define TDM_SUBSCRIBE_DMA_STOP_TX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DMA_STOP_TX register.              */

/* CHIDX @Bits 0..7 : DPPI channel that task DMA_STOP_TX will subscribe to */
  #define TDM_SUBSCRIBE_DMA_STOP_TX_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define TDM_SUBSCRIBE_DMA_STOP_TX_CHIDX_Msk (0xFFUL << TDM_SUBSCRIBE_DMA_STOP_TX_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define TDM_SUBSCRIBE_DMA_STOP_TX_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                           */
  #define TDM_SUBSCRIBE_DMA_STOP_TX_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define TDM_SUBSCRIBE_DMA_STOP_TX_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define TDM_SUBSCRIBE_DMA_STOP_TX_EN_Msk (0x1UL << TDM_SUBSCRIBE_DMA_STOP_TX_EN_Pos) /*!< Bit mask of EN field.              */
  #define TDM_SUBSCRIBE_DMA_STOP_TX_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_DMA_STOP_TX_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_DMA_STOP_TX_EN_Disabled (0x0UL) /*!< Disable subscription                                              */
  #define TDM_SUBSCRIBE_DMA_STOP_TX_EN_Enabled (0x1UL) /*!< Enable subscription                                                */


/* TDM_SUBSCRIBE_DMA_STOP_RX: Subscribe configuration for task DMA_STOP_RX */
  #define TDM_SUBSCRIBE_DMA_STOP_RX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DMA_STOP_RX register.              */

/* CHIDX @Bits 0..7 : DPPI channel that task DMA_STOP_RX will subscribe to */
  #define TDM_SUBSCRIBE_DMA_STOP_RX_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define TDM_SUBSCRIBE_DMA_STOP_RX_CHIDX_Msk (0xFFUL << TDM_SUBSCRIBE_DMA_STOP_RX_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define TDM_SUBSCRIBE_DMA_STOP_RX_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                           */
  #define TDM_SUBSCRIBE_DMA_STOP_RX_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define TDM_SUBSCRIBE_DMA_STOP_RX_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define TDM_SUBSCRIBE_DMA_STOP_RX_EN_Msk (0x1UL << TDM_SUBSCRIBE_DMA_STOP_RX_EN_Pos) /*!< Bit mask of EN field.              */
  #define TDM_SUBSCRIBE_DMA_STOP_RX_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_DMA_STOP_RX_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_DMA_STOP_RX_EN_Disabled (0x0UL) /*!< Disable subscription                                              */
  #define TDM_SUBSCRIBE_DMA_STOP_RX_EN_Enabled (0x1UL) /*!< Enable subscription                                                */


/* TDM_EVENTS_DMA_END_TX: End of transmission Equivalent to eventDmaEndTx */
  #define TDM_EVENTS_DMA_END_TX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_DMA_END_TX register.                      */

/* EVENTS_DMA_END_TX @Bit 0 : End of transmission Equivalent to eventDmaEndTx */
  #define TDM_EVENTS_DMA_END_TX_EVENTS_DMA_END_TX_Pos (0UL) /*!< Position of EVENTS_DMA_END_TX field.                          */
  #define TDM_EVENTS_DMA_END_TX_EVENTS_DMA_END_TX_Msk (0x1UL << TDM_EVENTS_DMA_END_TX_EVENTS_DMA_END_TX_Pos) /*!< Bit mask of
                                                                            EVENTS_DMA_END_TX field.*/                            
  #define TDM_EVENTS_DMA_END_TX_EVENTS_DMA_END_TX_Min (0x0UL) /*!< Min enumerator value of EVENTS_DMA_END_TX field.            */
  #define TDM_EVENTS_DMA_END_TX_EVENTS_DMA_END_TX_Max (0x1UL) /*!< Max enumerator value of EVENTS_DMA_END_TX field.            */
  #define TDM_EVENTS_DMA_END_TX_EVENTS_DMA_END_TX_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define TDM_EVENTS_DMA_END_TX_EVENTS_DMA_END_TX_Generated (0x1UL) /*!< Event generated                                       */


/* TDM_EVENTS_RXPTRUPD: The RXD.PTR register has been copied to internal double-buffers. When TDM is started and RX is enabled,
                         this event will be generated for every RXTXD.MAXCNT words received on the SDIN pin. Equivalent to
                         eventDmaReadyRx. */                                                                                      
                                                                                                                                  
  #define TDM_EVENTS_RXPTRUPD_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXPTRUPD register.                          */

/* EVENTS_RXPTRUPD @Bit 0 : The RXD.PTR register has been copied to internal double-buffers. When TDM is started and RX is
                            enabled, this event will be generated for every RXTXD.MAXCNT words received on the SDIN pin.
                            Equivalent to eventDmaReadyRx. */                                                                     
                                                                                                                                  
  #define TDM_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Pos (0UL) /*!< Position of EVENTS_RXPTRUPD field.                                */
  #define TDM_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Msk (0x1UL << TDM_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Pos) /*!< Bit mask of
                                                                            EVENTS_RXPTRUPD field.*/                              
  #define TDM_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXPTRUPD field.                  */
  #define TDM_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXPTRUPD field.                  */
  #define TDM_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define TDM_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Generated (0x1UL) /*!< Event generated                                           */


