adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TDM_EVENTS_STOPPED: Transfer stopped. */
  #define TDM_EVENTS_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STOPPED register.                            */

/* EVENTS_STOPPED @Bit 0 : Transfer stopped. */
  #define TDM_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL) /*!< Position of EVENTS_STOPPED field.                                   */
  #define TDM_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << TDM_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of EVENTS_STOPPED
                                                                            field.*/                                              
  #define TDM_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STOPPED field.                     */
  #define TDM_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STOPPED field.                     */
  #define TDM_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define TDM_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL) /*!< Event generated                                             */


/* TDM_EVENTS_ABORTED: Transfer aborted. */
  #define TDM_EVENTS_ABORTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ABORTED register.                            */

/* EVENTS_ABORTED @Bit 0 : Transfer aborted. */
  #define TDM_EVENTS_ABORTED_EVENTS_ABORTED_Pos (0UL) /*!< Position of EVENTS_ABORTED field.                                   */
  #define TDM_EVENTS_ABORTED_EVENTS_ABORTED_Msk (0x1UL << TDM_EVENTS_ABORTED_EVENTS_ABORTED_Pos) /*!< Bit mask of EVENTS_ABORTED
                                                                            field.*/                                              
  #define TDM_EVENTS_ABORTED_EVENTS_ABORTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_ABORTED field.                     */
  #define TDM_EVENTS_ABORTED_EVENTS_ABORTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_ABORTED field.                     */
  #define TDM_EVENTS_ABORTED_EVENTS_ABORTED_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define TDM_EVENTS_ABORTED_EVENTS_ABORTED_Generated (0x1UL) /*!< Event generated                                             */


/* TDM_EVENTS_ERROR_TX: DMA read from memory failed. Equivalent to eventUnderflowTx */
  #define TDM_EVENTS_ERROR_TX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERROR_TX register.                          */

/* EVENTS_ERROR_TX @Bit 0 : DMA read from memory failed. Equivalent to eventUnderflowTx */
  #define TDM_EVENTS_ERROR_TX_EVENTS_ERROR_TX_Pos (0UL) /*!< Position of EVENTS_ERROR_TX field.                                */
  #define TDM_EVENTS_ERROR_TX_EVENTS_ERROR_TX_Msk (0x1UL << TDM_EVENTS_ERROR_TX_EVENTS_ERROR_TX_Pos) /*!< Bit mask of
                                                                            EVENTS_ERROR_TX field.*/                              
  #define TDM_EVENTS_ERROR_TX_EVENTS_ERROR_TX_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERROR_TX field.                  */
  #define TDM_EVENTS_ERROR_TX_EVENTS_ERROR_TX_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERROR_TX field.                  */
  #define TDM_EVENTS_ERROR_TX_EVENTS_ERROR_TX_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define TDM_EVENTS_ERROR_TX_EVENTS_ERROR_TX_Generated (0x1UL) /*!< Event generated                                           */


/* TDM_EVENTS_ERROR_RX: DMA write to memory failed. Equivalent to eventOverflowRx */
  #define TDM_EVENTS_ERROR_RX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERROR_RX register.                          */

/* EVENTS_ERROR_RX @Bit 0 : DMA write to memory failed. Equivalent to eventOverflowRx */
  #define TDM_EVENTS_ERROR_RX_EVENTS_ERROR_RX_Pos (0UL) /*!< Position of EVENTS_ERROR_RX field.                                */
  #define TDM_EVENTS_ERROR_RX_EVENTS_ERROR_RX_Msk (0x1UL << TDM_EVENTS_ERROR_RX_EVENTS_ERROR_RX_Pos) /*!< Bit mask of
                                                                            EVENTS_ERROR_RX field.*/                              
  #define TDM_EVENTS_ERROR_RX_EVENTS_ERROR_RX_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERROR_RX field.                  */
  #define TDM_EVENTS_ERROR_RX_EVENTS_ERROR_RX_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERROR_RX field.                  */
  #define TDM_EVENTS_ERROR_RX_EVENTS_ERROR_RX_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define TDM_EVENTS_ERROR_RX_EVENTS_ERROR_RX_Generated (0x1UL) /*!< Event generated                                           */


/* TDM_EVENTS_TXPTRUPD: The TDX.PTR register has been copied to internal double-buffers. When TDM is started and TX is enabled,
                         this event will be generated for every RXTXD.MAXCNT words that are sent on the SDOUT pin. Equivalent to
                         eventDmaReadyTx. */                                                                                      
                                                                                                                                  
  #define TDM_EVENTS_TXPTRUPD_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXPTRUPD register.                          */

/* EVENTS_TXPTRUPD @Bit 0 : The TDX.PTR register has been copied to internal double-buffers. When TDM is started and TX is
                            enabled, this event will be generated for every RXTXD.MAXCNT words that are sent on the SDOUT pin.
                            Equivalent to eventDmaReadyTx. */                                                                     
                                                                                                                                  
  #define TDM_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Pos (0UL) /*!< Position of EVENTS_TXPTRUPD field.                                */
  #define TDM_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Msk (0x1UL << TDM_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Pos) /*!< Bit mask of
                                                                            EVENTS_TXPTRUPD field.*/                              
  #define TDM_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXPTRUPD field.                  */
  #define TDM_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXPTRUPD field.                  */
  #define TDM_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define TDM_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Generated (0x1UL) /*!< Event generated                                           */


/* TDM_EVENTS_DMA_END_RX: End of transmission Equivalent to eventDmaEndRx */
  #define TDM_EVENTS_DMA_END_RX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_DMA_END_RX register.                      */

/* EVENTS_DMA_END_RX @Bit 0 : End of transmission Equivalent to eventDmaEndRx */
  #define TDM_EVENTS_DMA_END_RX_EVENTS_DMA_END_RX_Pos (0UL) /*!< Position of EVENTS_DMA_END_RX field.                          */
  #define TDM_EVENTS_DMA_END_RX_EVENTS_DMA_END_RX_Msk (0x1UL << TDM_EVENTS_DMA_END_RX_EVENTS_DMA_END_RX_Pos) /*!< Bit mask of
                                                                            EVENTS_DMA_END_RX field.*/                            
  #define TDM_EVENTS_DMA_END_RX_EVENTS_DMA_END_RX_Min (0x0UL) /*!< Min enumerator value of EVENTS_DMA_END_RX field.            */
  #define TDM_EVENTS_DMA_END_RX_EVENTS_DMA_END_RX_Max (0x1UL) /*!< Max enumerator value of EVENTS_DMA_END_RX field.            */
  #define TDM_EVENTS_DMA_END_RX_EVENTS_DMA_END_RX_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define TDM_EVENTS_DMA_END_RX_EVENTS_DMA_END_RX_Generated (0x1UL) /*!< Event generated                                       */


/* TDM_EVENTS_MAXCNT: MAXCNT block event, generated on the active edge of FSYNC of every MAXCNT block */
  #define TDM_EVENTS_MAXCNT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_MAXCNT register.                              */

/* EVENTS_MAXCNT @Bit 0 : MAXCNT block event, generated on the active edge of FSYNC of every MAXCNT block */
  #define TDM_EVENTS_MAXCNT_EVENTS_MAXCNT_Pos (0UL)  /*!< Position of EVENTS_MAXCNT field.                                     */
  #define TDM_EVENTS_MAXCNT_EVENTS_MAXCNT_Msk (0x1UL << TDM_EVENTS_MAXCNT_EVENTS_MAXCNT_Pos) /*!< Bit mask of EVENTS_MAXCNT
                                                                            field.*/                                              
  #define TDM_EVENTS_MAXCNT_EVENTS_MAXCNT_Min (0x0UL) /*!< Min enumerator value of EVENTS_MAXCNT field.                        */
  #define TDM_EVENTS_MAXCNT_EVENTS_MAXCNT_Max (0x1UL) /*!< Max enumerator value of EVENTS_MAXCNT field.                        */
  #define TDM_EVENTS_MAXCNT_EVENTS_MAXCNT_NotGenerated (0x0UL) /*!< Event not generated                                        */
  #define TDM_EVENTS_MAXCNT_EVENTS_MAXCNT_Generated (0x1UL) /*!< Event generated                                               */


