adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TDM_EVENTS_BUSERROR_RX: This event is generated if an error occurs during the bus transfer. This event is generated on an AHB
                            / AXI error response. */                                                                              
                                                                                                                                  
  #define TDM_EVENTS_BUSERROR_RX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_BUSERROR_RX register.                    */

/* EVENTS_BUSERROR_RX @Bit 0 : This event is generated if an error occurs during the bus transfer. This event is generated on an
                               AHB / AXI error response. */                                                                       
                                                                                                                                  
  #define TDM_EVENTS_BUSERROR_RX_EVENTS_BUSERROR_RX_Pos (0UL) /*!< Position of EVENTS_BUSERROR_RX field.                       */
  #define TDM_EVENTS_BUSERROR_RX_EVENTS_BUSERROR_RX_Msk (0x1UL << TDM_EVENTS_BUSERROR_RX_EVENTS_BUSERROR_RX_Pos) /*!< Bit mask
                                                                            of EVENTS_BUSERROR_RX field.*/                        
  #define TDM_EVENTS_BUSERROR_RX_EVENTS_BUSERROR_RX_Min (0x0UL) /*!< Min enumerator value of EVENTS_BUSERROR_RX field.         */
  #define TDM_EVENTS_BUSERROR_RX_EVENTS_BUSERROR_RX_Max (0x1UL) /*!< Max enumerator value of EVENTS_BUSERROR_RX field.         */
  #define TDM_EVENTS_BUSERROR_RX_EVENTS_BUSERROR_RX_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define TDM_EVENTS_BUSERROR_RX_EVENTS_BUSERROR_RX_Generated (0x1UL) /*!< Event generated                                     */


/* TDM_EVENTS_BUSERROR_TX: This event is generated if an error occurs during the bus transfer. This event is generated on an AHB
                            / AXI error response. */                                                                              
                                                                                                                                  
  #define TDM_EVENTS_BUSERROR_TX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_BUSERROR_TX register.                    */

/* EVENTS_BUSERROR_TX @Bit 0 : This event is generated if an error occurs during the bus transfer. This event is generated on an
                               AHB / AXI error response. */                                                                       
                                                                                                                                  
  #define TDM_EVENTS_BUSERROR_TX_EVENTS_BUSERROR_TX_Pos (0UL) /*!< Position of EVENTS_BUSERROR_TX field.                       */
  #define TDM_EVENTS_BUSERROR_TX_EVENTS_BUSERROR_TX_Msk (0x1UL << TDM_EVENTS_BUSERROR_TX_EVENTS_BUSERROR_TX_Pos) /*!< Bit mask
                                                                            of EVENTS_BUSERROR_TX field.*/                        
  #define TDM_EVENTS_BUSERROR_TX_EVENTS_BUSERROR_TX_Min (0x0UL) /*!< Min enumerator value of EVENTS_BUSERROR_TX field.         */
  #define TDM_EVENTS_BUSERROR_TX_EVENTS_BUSERROR_TX_Max (0x1UL) /*!< Max enumerator value of EVENTS_BUSERROR_TX field.         */
  #define TDM_EVENTS_BUSERROR_TX_EVENTS_BUSERROR_TX_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define TDM_EVENTS_BUSERROR_TX_EVENTS_BUSERROR_TX_Generated (0x1UL) /*!< Event generated                                     */


/* TDM_PUBLISH_DMA_END_TX: Publish configuration for event DMA_END_TX */
  #define TDM_PUBLISH_DMA_END_TX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_DMA_END_TX register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event DMA_END_TX will publish to */
  #define TDM_PUBLISH_DMA_END_TX_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_DMA_END_TX_CHIDX_Msk (0xFFUL << TDM_PUBLISH_DMA_END_TX_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define TDM_PUBLISH_DMA_END_TX_CHIDX_Min (0x0UL)   /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_DMA_END_TX_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_DMA_END_TX_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_DMA_END_TX_EN_Msk (0x1UL << TDM_PUBLISH_DMA_END_TX_EN_Pos) /*!< Bit mask of EN field.                    */
  #define TDM_PUBLISH_DMA_END_TX_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_DMA_END_TX_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_DMA_END_TX_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define TDM_PUBLISH_DMA_END_TX_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* TDM_PUBLISH_RXPTRUPD: Publish configuration for event RXPTRUPD */
  #define TDM_PUBLISH_RXPTRUPD_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXPTRUPD register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event RXPTRUPD will publish to */
  #define TDM_PUBLISH_RXPTRUPD_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_RXPTRUPD_CHIDX_Msk (0xFFUL << TDM_PUBLISH_RXPTRUPD_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define TDM_PUBLISH_RXPTRUPD_CHIDX_Min (0x0UL)     /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_RXPTRUPD_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_RXPTRUPD_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_RXPTRUPD_EN_Msk (0x1UL << TDM_PUBLISH_RXPTRUPD_EN_Pos) /*!< Bit mask of EN field.                        */
  #define TDM_PUBLISH_RXPTRUPD_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_RXPTRUPD_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_RXPTRUPD_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define TDM_PUBLISH_RXPTRUPD_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* TDM_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define TDM_PUBLISH_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STOPPED register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define TDM_PUBLISH_STOPPED_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << TDM_PUBLISH_STOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define TDM_PUBLISH_STOPPED_CHIDX_Min (0x0UL)      /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_STOPPED_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_STOPPED_EN_Msk (0x1UL << TDM_PUBLISH_STOPPED_EN_Pos) /*!< Bit mask of EN field.                          */
  #define TDM_PUBLISH_STOPPED_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_STOPPED_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_STOPPED_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define TDM_PUBLISH_STOPPED_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* TDM_PUBLISH_ABORTED: Publish configuration for event ABORTED */
  #define TDM_PUBLISH_ABORTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ABORTED register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that event ABORTED will publish to */
  #define TDM_PUBLISH_ABORTED_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_ABORTED_CHIDX_Msk (0xFFUL << TDM_PUBLISH_ABORTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define TDM_PUBLISH_ABORTED_CHIDX_Min (0x0UL)      /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_ABORTED_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_ABORTED_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_ABORTED_EN_Msk (0x1UL << TDM_PUBLISH_ABORTED_EN_Pos) /*!< Bit mask of EN field.                          */
  #define TDM_PUBLISH_ABORTED_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_ABORTED_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_ABORTED_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define TDM_PUBLISH_ABORTED_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* TDM_PUBLISH_ERROR_TX: Publish configuration for event ERROR_TX */
  #define TDM_PUBLISH_ERROR_TX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ERROR_TX register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event ERROR_TX will publish to */
  #define TDM_PUBLISH_ERROR_TX_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_ERROR_TX_CHIDX_Msk (0xFFUL << TDM_PUBLISH_ERROR_TX_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define TDM_PUBLISH_ERROR_TX_CHIDX_Min (0x0UL)     /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_ERROR_TX_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_ERROR_TX_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_ERROR_TX_EN_Msk (0x1UL << TDM_PUBLISH_ERROR_TX_EN_Pos) /*!< Bit mask of EN field.                        */
  #define TDM_PUBLISH_ERROR_TX_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_ERROR_TX_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_ERROR_TX_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define TDM_PUBLISH_ERROR_TX_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


