adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR_RX will publish to */
  #define TDM_PUBLISH_BUSERROR_RX_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_BUSERROR_RX_CHIDX_Msk (0xFFUL << TDM_PUBLISH_BUSERROR_RX_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define TDM_PUBLISH_BUSERROR_RX_CHIDX_Min (0x0UL)  /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_BUSERROR_RX_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_BUSERROR_RX_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_BUSERROR_RX_EN_Msk (0x1UL << TDM_PUBLISH_BUSERROR_RX_EN_Pos) /*!< Bit mask of EN field.                  */
  #define TDM_PUBLISH_BUSERROR_RX_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_BUSERROR_RX_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_BUSERROR_RX_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define TDM_PUBLISH_BUSERROR_RX_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* TDM_PUBLISH_BUSERROR_TX: Publish configuration for event BUSERROR_TX */
  #define TDM_PUBLISH_BUSERROR_TX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_BUSERROR_TX register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR_TX will publish to */
  #define TDM_PUBLISH_BUSERROR_TX_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_BUSERROR_TX_CHIDX_Msk (0xFFUL << TDM_PUBLISH_BUSERROR_TX_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define TDM_PUBLISH_BUSERROR_TX_CHIDX_Min (0x0UL)  /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_BUSERROR_TX_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_BUSERROR_TX_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_BUSERROR_TX_EN_Msk (0x1UL << TDM_PUBLISH_BUSERROR_TX_EN_Pos) /*!< Bit mask of EN field.                  */
  #define TDM_PUBLISH_BUSERROR_TX_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_BUSERROR_TX_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_BUSERROR_TX_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define TDM_PUBLISH_BUSERROR_TX_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* TDM_INTEN: Enable or disable interrupt */
  #define TDM_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* DMA_END_TX @Bit 0 : Enable or disable interrupt for event DMA_END_TX */
  #define TDM_INTEN_DMA_END_TX_Pos (0UL)             /*!< Position of DMA_END_TX field.                                        */
  #define TDM_INTEN_DMA_END_TX_Msk (0x1UL << TDM_INTEN_DMA_END_TX_Pos) /*!< Bit mask of DMA_END_TX field.                      */
  #define TDM_INTEN_DMA_END_TX_Min (0x0UL)           /*!< Min enumerator value of DMA_END_TX field.                            */
  #define TDM_INTEN_DMA_END_TX_Max (0x1UL)           /*!< Max enumerator value of DMA_END_TX field.                            */
  #define TDM_INTEN_DMA_END_TX_Disabled (0x0UL)      /*!< Disable                                                              */
  #define TDM_INTEN_DMA_END_TX_Enabled (0x1UL)       /*!< Enable                                                               */

/* RXPTRUPD @Bit 1 : Enable or disable interrupt for event RXPTRUPD */
  #define TDM_INTEN_RXPTRUPD_Pos (1UL)               /*!< Position of RXPTRUPD field.                                          */
  #define TDM_INTEN_RXPTRUPD_Msk (0x1UL << TDM_INTEN_RXPTRUPD_Pos) /*!< Bit mask of RXPTRUPD field.                            */
  #define TDM_INTEN_RXPTRUPD_Min (0x0UL)             /*!< Min enumerator value of RXPTRUPD field.                              */
  #define TDM_INTEN_RXPTRUPD_Max (0x1UL)             /*!< Max enumerator value of RXPTRUPD field.                              */
  #define TDM_INTEN_RXPTRUPD_Disabled (0x0UL)        /*!< Disable                                                              */
  #define TDM_INTEN_RXPTRUPD_Enabled (0x1UL)         /*!< Enable                                                               */

/* STOPPED @Bit 2 : Enable or disable interrupt for event STOPPED */
  #define TDM_INTEN_STOPPED_Pos (2UL)                /*!< Position of STOPPED field.                                           */
  #define TDM_INTEN_STOPPED_Msk (0x1UL << TDM_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                               */
  #define TDM_INTEN_STOPPED_Min (0x0UL)              /*!< Min enumerator value of STOPPED field.                               */
  #define TDM_INTEN_STOPPED_Max (0x1UL)              /*!< Max enumerator value of STOPPED field.                               */
  #define TDM_INTEN_STOPPED_Disabled (0x0UL)         /*!< Disable                                                              */
  #define TDM_INTEN_STOPPED_Enabled (0x1UL)          /*!< Enable                                                               */

/* ABORTED @Bit 3 : Enable or disable interrupt for event ABORTED */
  #define TDM_INTEN_ABORTED_Pos (3UL)                /*!< Position of ABORTED field.                                           */
  #define TDM_INTEN_ABORTED_Msk (0x1UL << TDM_INTEN_ABORTED_Pos) /*!< Bit mask of ABORTED field.                               */
  #define TDM_INTEN_ABORTED_Min (0x0UL)              /*!< Min enumerator value of ABORTED field.                               */
  #define TDM_INTEN_ABORTED_Max (0x1UL)              /*!< Max enumerator value of ABORTED field.                               */
  #define TDM_INTEN_ABORTED_Disabled (0x0UL)         /*!< Disable                                                              */
  #define TDM_INTEN_ABORTED_Enabled (0x1UL)          /*!< Enable                                                               */

/* ERROR_TX @Bit 4 : Enable or disable interrupt for event ERROR_TX */
  #define TDM_INTEN_ERROR_TX_Pos (4UL)               /*!< Position of ERROR_TX field.                                          */
  #define TDM_INTEN_ERROR_TX_Msk (0x1UL << TDM_INTEN_ERROR_TX_Pos) /*!< Bit mask of ERROR_TX field.                            */
  #define TDM_INTEN_ERROR_TX_Min (0x0UL)             /*!< Min enumerator value of ERROR_TX field.                              */
  #define TDM_INTEN_ERROR_TX_Max (0x1UL)             /*!< Max enumerator value of ERROR_TX field.                              */
  #define TDM_INTEN_ERROR_TX_Disabled (0x0UL)        /*!< Disable                                                              */
  #define TDM_INTEN_ERROR_TX_Enabled (0x1UL)         /*!< Enable                                                               */

