adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RXPTRUPD @Bit 1 : Write '1' to disable interrupt for event RXPTRUPD */
  #define TDM_INTENCLR_RXPTRUPD_Pos (1UL)            /*!< Position of RXPTRUPD field.                                          */
  #define TDM_INTENCLR_RXPTRUPD_Msk (0x1UL << TDM_INTENCLR_RXPTRUPD_Pos) /*!< Bit mask of RXPTRUPD field.                      */
  #define TDM_INTENCLR_RXPTRUPD_Min (0x0UL)          /*!< Min enumerator value of RXPTRUPD field.                              */
  #define TDM_INTENCLR_RXPTRUPD_Max (0x1UL)          /*!< Max enumerator value of RXPTRUPD field.                              */
  #define TDM_INTENCLR_RXPTRUPD_Clear (0x1UL)        /*!< Disable                                                              */
  #define TDM_INTENCLR_RXPTRUPD_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_RXPTRUPD_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* STOPPED @Bit 2 : Write '1' to disable interrupt for event STOPPED */
  #define TDM_INTENCLR_STOPPED_Pos (2UL)             /*!< Position of STOPPED field.                                           */
  #define TDM_INTENCLR_STOPPED_Msk (0x1UL << TDM_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define TDM_INTENCLR_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define TDM_INTENCLR_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define TDM_INTENCLR_STOPPED_Clear (0x1UL)         /*!< Disable                                                              */
  #define TDM_INTENCLR_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* ABORTED @Bit 3 : Write '1' to disable interrupt for event ABORTED */
  #define TDM_INTENCLR_ABORTED_Pos (3UL)             /*!< Position of ABORTED field.                                           */
  #define TDM_INTENCLR_ABORTED_Msk (0x1UL << TDM_INTENCLR_ABORTED_Pos) /*!< Bit mask of ABORTED field.                         */
  #define TDM_INTENCLR_ABORTED_Min (0x0UL)           /*!< Min enumerator value of ABORTED field.                               */
  #define TDM_INTENCLR_ABORTED_Max (0x1UL)           /*!< Max enumerator value of ABORTED field.                               */
  #define TDM_INTENCLR_ABORTED_Clear (0x1UL)         /*!< Disable                                                              */
  #define TDM_INTENCLR_ABORTED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_ABORTED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* ERROR_TX @Bit 4 : Write '1' to disable interrupt for event ERROR_TX */
  #define TDM_INTENCLR_ERROR_TX_Pos (4UL)            /*!< Position of ERROR_TX field.                                          */
  #define TDM_INTENCLR_ERROR_TX_Msk (0x1UL << TDM_INTENCLR_ERROR_TX_Pos) /*!< Bit mask of ERROR_TX field.                      */
  #define TDM_INTENCLR_ERROR_TX_Min (0x0UL)          /*!< Min enumerator value of ERROR_TX field.                              */
  #define TDM_INTENCLR_ERROR_TX_Max (0x1UL)          /*!< Max enumerator value of ERROR_TX field.                              */
  #define TDM_INTENCLR_ERROR_TX_Clear (0x1UL)        /*!< Disable                                                              */
  #define TDM_INTENCLR_ERROR_TX_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_ERROR_TX_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ERROR_RX @Bit 5 : Write '1' to disable interrupt for event ERROR_RX */
  #define TDM_INTENCLR_ERROR_RX_Pos (5UL)            /*!< Position of ERROR_RX field.                                          */
  #define TDM_INTENCLR_ERROR_RX_Msk (0x1UL << TDM_INTENCLR_ERROR_RX_Pos) /*!< Bit mask of ERROR_RX field.                      */
  #define TDM_INTENCLR_ERROR_RX_Min (0x0UL)          /*!< Min enumerator value of ERROR_RX field.                              */
  #define TDM_INTENCLR_ERROR_RX_Max (0x1UL)          /*!< Max enumerator value of ERROR_RX field.                              */
  #define TDM_INTENCLR_ERROR_RX_Clear (0x1UL)        /*!< Disable                                                              */
  #define TDM_INTENCLR_ERROR_RX_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_ERROR_RX_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* TXPTRUPD @Bit 6 : Write '1' to disable interrupt for event TXPTRUPD */
  #define TDM_INTENCLR_TXPTRUPD_Pos (6UL)            /*!< Position of TXPTRUPD field.                                          */
  #define TDM_INTENCLR_TXPTRUPD_Msk (0x1UL << TDM_INTENCLR_TXPTRUPD_Pos) /*!< Bit mask of TXPTRUPD field.                      */
  #define TDM_INTENCLR_TXPTRUPD_Min (0x0UL)          /*!< Min enumerator value of TXPTRUPD field.                              */
  #define TDM_INTENCLR_TXPTRUPD_Max (0x1UL)          /*!< Max enumerator value of TXPTRUPD field.                              */
  #define TDM_INTENCLR_TXPTRUPD_Clear (0x1UL)        /*!< Disable                                                              */
  #define TDM_INTENCLR_TXPTRUPD_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_TXPTRUPD_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* DMA_END_RX @Bit 7 : Write '1' to disable interrupt for event DMA_END_RX */
  #define TDM_INTENCLR_DMA_END_RX_Pos (7UL)          /*!< Position of DMA_END_RX field.                                        */
  #define TDM_INTENCLR_DMA_END_RX_Msk (0x1UL << TDM_INTENCLR_DMA_END_RX_Pos) /*!< Bit mask of DMA_END_RX field.                */
  #define TDM_INTENCLR_DMA_END_RX_Min (0x0UL)        /*!< Min enumerator value of DMA_END_RX field.                            */
  #define TDM_INTENCLR_DMA_END_RX_Max (0x1UL)        /*!< Max enumerator value of DMA_END_RX field.                            */
  #define TDM_INTENCLR_DMA_END_RX_Clear (0x1UL)      /*!< Disable                                                              */
  #define TDM_INTENCLR_DMA_END_RX_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_DMA_END_RX_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* MAXCNT @Bit 8 : Write '1' to disable interrupt for event MAXCNT */
  #define TDM_INTENCLR_MAXCNT_Pos (8UL)              /*!< Position of MAXCNT field.                                            */
  #define TDM_INTENCLR_MAXCNT_Msk (0x1UL << TDM_INTENCLR_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                            */
  #define TDM_INTENCLR_MAXCNT_Min (0x0UL)            /*!< Min enumerator value of MAXCNT field.                                */
  #define TDM_INTENCLR_MAXCNT_Max (0x1UL)            /*!< Max enumerator value of MAXCNT field.                                */
  #define TDM_INTENCLR_MAXCNT_Clear (0x1UL)          /*!< Disable                                                              */
  #define TDM_INTENCLR_MAXCNT_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_MAXCNT_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* BUSERROR_RX @Bit 9 : Write '1' to disable interrupt for event BUSERROR_RX */
  #define TDM_INTENCLR_BUSERROR_RX_Pos (9UL)         /*!< Position of BUSERROR_RX field.                                       */
  #define TDM_INTENCLR_BUSERROR_RX_Msk (0x1UL << TDM_INTENCLR_BUSERROR_RX_Pos) /*!< Bit mask of BUSERROR_RX field.             */
  #define TDM_INTENCLR_BUSERROR_RX_Min (0x0UL)       /*!< Min enumerator value of BUSERROR_RX field.                           */
  #define TDM_INTENCLR_BUSERROR_RX_Max (0x1UL)       /*!< Max enumerator value of BUSERROR_RX field.                           */
  #define TDM_INTENCLR_BUSERROR_RX_Clear (0x1UL)     /*!< Disable                                                              */
  #define TDM_INTENCLR_BUSERROR_RX_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_BUSERROR_RX_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* BUSERROR_TX @Bit 10 : Write '1' to disable interrupt for event BUSERROR_TX */
  #define TDM_INTENCLR_BUSERROR_TX_Pos (10UL)        /*!< Position of BUSERROR_TX field.                                       */
  #define TDM_INTENCLR_BUSERROR_TX_Msk (0x1UL << TDM_INTENCLR_BUSERROR_TX_Pos) /*!< Bit mask of BUSERROR_TX field.             */
  #define TDM_INTENCLR_BUSERROR_TX_Min (0x0UL)       /*!< Min enumerator value of BUSERROR_TX field.                           */
  #define TDM_INTENCLR_BUSERROR_TX_Max (0x1UL)       /*!< Max enumerator value of BUSERROR_TX field.                           */
  #define TDM_INTENCLR_BUSERROR_TX_Clear (0x1UL)     /*!< Disable                                                              */
  #define TDM_INTENCLR_BUSERROR_TX_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_BUSERROR_TX_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* TDM_ENABLE: Enable TDM */
  #define TDM_ENABLE_ResetValue (0x00000000UL)       /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : Enable TDM */
  #define TDM_ENABLE_ENABLE_Pos (0UL)                /*!< Position of ENABLE field.                                            */
  #define TDM_ENABLE_ENABLE_Msk (0x1UL << TDM_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                                */
  #define TDM_ENABLE_ENABLE_Min (0x0UL)              /*!< Min enumerator value of ENABLE field.                                */
  #define TDM_ENABLE_ENABLE_Max (0x1UL)              /*!< Max enumerator value of ENABLE field.                                */
  #define TDM_ENABLE_ENABLE_Disabled (0x0UL)         /*!< Disable                                                              */
  #define TDM_ENABLE_ENABLE_Enabled (0x1UL)          /*!< Enable                                                               */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TEMP                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct TEMP ======================================================= */
/**
  * @brief Temperature Sensor
  */
  typedef struct {                                   /*!< TEMP Structure                                                       */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start temperature measurement                         */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop temperature measurement                          */
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t EVENTS_DATARDY;                   /*!< (@ 0x00000100) Temperature measurement complete, data ready          */
    __IM uint32_t RESERVED2[31];
    __IOM uint32_t PUBLISH_DATARDY;                  /*!< (@ 0x00000180) Publish configuration for event DATARDY               */
    __IM uint32_t RESERVED3[95];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED4[125];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable temperature sensor bias current                */
    __IOM int32_t COUNTER;                           /*!< (@ 0x00000504) Prototype register containing counter values for
                                                                         timing*/                                                 
    __IM int32_t  TEMP;                              /*!< (@ 0x00000508) Temperature in degC (0.25deg steps)                   */
    __IM int32_t  TEMPRAW;                           /*!< (@ 0x0000050C) Counted oscillator pulses which is equivalent to
                                                                         temperature without calibration and linearization*/      
    __IM uint32_t DATA;                              /*!< (@ 0x00000510) Data after dec and calib                              */
    __IOM uint32_t CALIB;                            /*!< (@ 0x00000514) Calibration value.                                    */
    __IOM int32_t ANALOGCONF;                        /*!< (@ 0x00000518) Analog test bus control                               */
    __IM uint32_t RESERVED5;
    __IOM uint32_t A0;                               /*!< (@ 0x00000520) Slope of 1st piece wise linear function               */
    __IOM uint32_t A1;                               /*!< (@ 0x00000524) Slope of 2nd piece wise linear function               */
    __IOM uint32_t A2;                               /*!< (@ 0x00000528) Slope of 3rd piece wise linear function               */
    __IOM uint32_t A3;                               /*!< (@ 0x0000052C) Slope of 4th piece wise linear function               */
    __IOM uint32_t A4;                               /*!< (@ 0x00000530) Slope of 5th piece wise linear function               */
    __IOM uint32_t A5;                               /*!< (@ 0x00000534) Slope of 6th piece wise linear function               */
    __IOM uint32_t A6;                               /*!< (@ 0x00000538) Slope of 7th piece wise linear function               */
    __IM uint32_t RESERVED6;
    __IOM uint32_t B0;                               /*!< (@ 0x00000540) y-intercept of 1st piece wise linear function         */
    __IOM uint32_t B1;                               /*!< (@ 0x00000544) y-intercept of 2nd piece wise linear function         */
    __IOM uint32_t B2;                               /*!< (@ 0x00000548) y-intercept of 3rd piece wise linear function         */
    __IOM uint32_t B3;                               /*!< (@ 0x0000054C) y-intercept of 4th piece wise linear function         */
    __IOM uint32_t B4;                               /*!< (@ 0x00000550) y-intercept of 5th piece wise linear function         */
    __IOM uint32_t B5;                               /*!< (@ 0x00000554) y-intercept of 6th piece wise linear function         */
    __IOM uint32_t B6;                               /*!< (@ 0x00000558) y-intercept of 7th piece wise linear function         */
    __IM uint32_t RESERVED7;
    __IOM uint32_t T0;                               /*!< (@ 0x00000560) End point of 1st piece wise linear function           */
    __IOM uint32_t T1;                               /*!< (@ 0x00000564) End point of 2nd piece wise linear function           */
    __IOM uint32_t T2;                               /*!< (@ 0x00000568) End point of 3rd piece wise linear function           */
    __IOM uint32_t T3;                               /*!< (@ 0x0000056C) End point of 4th piece wise linear function           */
    __IOM uint32_t T4;                               /*!< (@ 0x00000570) End point of 5th piece wise linear function           */
    __IOM uint32_t T5;                               /*!< (@ 0x00000574) End point of 6th piece wise linear function           */
  } NRF_TEMP_Type;                                   /*!< Size = 1400 (0x578)                                                  */

/* TEMP_TASKS_START: Start temperature measurement */
  #define TEMP_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                 */

/* TASKS_START @Bit 0 : Start temperature measurement */
  #define TEMP_TASKS_START_TASKS_START_Pos (0UL)     /*!< Position of TASKS_START field.                                       */
  #define TEMP_TASKS_START_TASKS_START_Msk (0x1UL << TEMP_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.     */
  #define TEMP_TASKS_START_TASKS_START_Min (0x1UL)   /*!< Min enumerator value of TASKS_START field.                           */
  #define TEMP_TASKS_START_TASKS_START_Max (0x1UL)   /*!< Max enumerator value of TASKS_START field.                           */
  #define TEMP_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                       */


