adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TEMP_INTENSET: Enable interrupt */
  #define TEMP_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* DATARDY @Bit 0 : Write '1' to enable interrupt for event DATARDY */
  #define TEMP_INTENSET_DATARDY_Pos (0UL)            /*!< Position of DATARDY field.                                           */
  #define TEMP_INTENSET_DATARDY_Msk (0x1UL << TEMP_INTENSET_DATARDY_Pos) /*!< Bit mask of DATARDY field.                       */
  #define TEMP_INTENSET_DATARDY_Min (0x0UL)          /*!< Min enumerator value of DATARDY field.                               */
  #define TEMP_INTENSET_DATARDY_Max (0x1UL)          /*!< Max enumerator value of DATARDY field.                               */
  #define TEMP_INTENSET_DATARDY_Set (0x1UL)          /*!< Enable                                                               */
  #define TEMP_INTENSET_DATARDY_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TEMP_INTENSET_DATARDY_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


/* TEMP_INTENCLR: Disable interrupt */
  #define TEMP_INTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of INTENCLR register.                                    */

/* DATARDY @Bit 0 : Write '1' to disable interrupt for event DATARDY */
  #define TEMP_INTENCLR_DATARDY_Pos (0UL)            /*!< Position of DATARDY field.                                           */
  #define TEMP_INTENCLR_DATARDY_Msk (0x1UL << TEMP_INTENCLR_DATARDY_Pos) /*!< Bit mask of DATARDY field.                       */
  #define TEMP_INTENCLR_DATARDY_Min (0x0UL)          /*!< Min enumerator value of DATARDY field.                               */
  #define TEMP_INTENCLR_DATARDY_Max (0x1UL)          /*!< Max enumerator value of DATARDY field.                               */
  #define TEMP_INTENCLR_DATARDY_Clear (0x1UL)        /*!< Disable                                                              */
  #define TEMP_INTENCLR_DATARDY_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TEMP_INTENCLR_DATARDY_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


/* TEMP_ENABLE: Enable temperature sensor bias current */
  #define TEMP_ENABLE_ResetValue (0x00000000UL)      /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : Enable temperature sensor bias current */
  #define TEMP_ENABLE_ENABLE_Pos (0UL)               /*!< Position of ENABLE field.                                            */
  #define TEMP_ENABLE_ENABLE_Msk (0x1UL << TEMP_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                              */
  #define TEMP_ENABLE_ENABLE_Min (0x0UL)             /*!< Min enumerator value of ENABLE field.                                */
  #define TEMP_ENABLE_ENABLE_Max (0x1UL)             /*!< Max enumerator value of ENABLE field.                                */
  #define TEMP_ENABLE_ENABLE_Disabled (0x0UL)        /*!< Bias is disabled                                                     */
  #define TEMP_ENABLE_ENABLE_Enabled (0x1UL)         /*!< Bias is enabled                                                      */


/* TEMP_COUNTER: Prototype register containing counter values for timing */
  #define TEMP_COUNTER_ResetValue (0x02002810UL)     /*!< Reset value of COUNTER register.                                     */

/* DEBOUNCE @Bits 0..4 : Number of cycles for clock debouncing. Simultaneous to analog startup. Should be shorter that analog
                         startup period */                                                                                        
                                                                                                                                  
  #define TEMP_COUNTER_DEBOUNCE_Pos (0UL)            /*!< Position of DEBOUNCE field.                                          */
  #define TEMP_COUNTER_DEBOUNCE_Msk (0x1FUL << TEMP_COUNTER_DEBOUNCE_Pos) /*!< Bit mask of DEBOUNCE field.                     */

/* STARTUP @Bits 8..14 : Number of cycles for analog startup. Simultaneous to clock debouncing. */
  #define TEMP_COUNTER_STARTUP_Pos (8UL)             /*!< Position of STARTUP field.                                           */
  #define TEMP_COUNTER_STARTUP_Msk (0x7FUL << TEMP_COUNTER_STARTUP_Pos) /*!< Bit mask of STARTUP field.                        */

/* COUNT @Bits 16..25 : Number of cycles in measurement period */
  #define TEMP_COUNTER_COUNT_Pos (16UL)              /*!< Position of COUNT field.                                             */
  #define TEMP_COUNTER_COUNT_Msk (0x3FFUL << TEMP_COUNTER_COUNT_Pos) /*!< Bit mask of COUNT field.                             */


/* TEMP_TEMP: Temperature in degC (0.25deg steps) */
  #define TEMP_TEMP_ResetValue (0x00000000UL)        /*!< Reset value of TEMP register.                                        */

/* TEMP @Bits 0..31 : Temperature in degC (0.25deg steps) */
  #define TEMP_TEMP_TEMP_Pos (0UL)                   /*!< Position of TEMP field.                                              */
  #define TEMP_TEMP_TEMP_Msk (0xFFFFFFFFUL << TEMP_TEMP_TEMP_Pos) /*!< Bit mask of TEMP field.                                 */


/* TEMP_TEMPRAW: Counted oscillator pulses which is equivalent to temperature without calibration and linearization */
  #define TEMP_TEMPRAW_ResetValue (0x00000000UL)     /*!< Reset value of TEMPRAW register.                                     */

/* TEMP @Bits 0..11 : Temperature in degC (0.25deg steps) */
  #define TEMP_TEMPRAW_TEMP_Pos (0UL)                /*!< Position of TEMP field.                                              */
  #define TEMP_TEMPRAW_TEMP_Msk (0xFFFUL << TEMP_TEMPRAW_TEMP_Pos) /*!< Bit mask of TEMP field.                                */


/* TEMP_DATA: Data after dec and calib */
  #define TEMP_DATA_ResetValue (0x00000000UL)        /*!< Reset value of DATA register.                                        */

/* DATA @Bits 0..31 : Data after dec and calib. 12 bits sign extended to 32 bits */
  #define TEMP_DATA_DATA_Pos (0UL)                   /*!< Position of DATA field.                                              */
  #define TEMP_DATA_DATA_Msk (0xFFFFFFFFUL << TEMP_DATA_DATA_Pos) /*!< Bit mask of DATA field.                                 */


/* TEMP_CALIB: Calibration value. */
  #define TEMP_CALIB_ResetValue (0x00000182UL)       /*!< Reset value of CALIB register.                                       */

