adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CALIB @Bits 0..9 : TBD */
  #define TEMP_CALIB_CALIB_Pos (0UL)                 /*!< Position of CALIB field.                                             */
  #define TEMP_CALIB_CALIB_Msk (0x3FFUL << TEMP_CALIB_CALIB_Pos) /*!< Bit mask of CALIB field.                                 */


/* TEMP_ANALOGCONF: Analog test bus control */
  #define TEMP_ANALOGCONF_ResetValue (0x00000000UL)  /*!< Reset value of ANALOGCONF register.                                  */

/* ATE @Bits 0..1 : Analog test bus control */
  #define TEMP_ANALOGCONF_ATE_Pos (0UL)              /*!< Position of ATE field.                                               */
  #define TEMP_ANALOGCONF_ATE_Msk (0x3UL << TEMP_ANALOGCONF_ATE_Pos) /*!< Bit mask of ATE field.                               */

/* PWR @Bit 8 : ANA power up override */
  #define TEMP_ANALOGCONF_PWR_Pos (8UL)              /*!< Position of PWR field.                                               */
  #define TEMP_ANALOGCONF_PWR_Msk (0x1UL << TEMP_ANALOGCONF_PWR_Pos) /*!< Bit mask of PWR field.                               */


/* TEMP_A0: Slope of 1st piece wise linear function */
  #define TEMP_A0_ResetValue (0x000002D9UL)          /*!< Reset value of A0 register.                                          */

/* A0 @Bits 0..11 : Slope of 1st piece wise linear function */
  #define TEMP_A0_A0_Pos (0UL)                       /*!< Position of A0 field.                                                */
  #define TEMP_A0_A0_Msk (0xFFFUL << TEMP_A0_A0_Pos) /*!< Bit mask of A0 field.                                                */


/* TEMP_A1: Slope of 2nd piece wise linear function */
  #define TEMP_A1_ResetValue (0x00000322UL)          /*!< Reset value of A1 register.                                          */

/* A1 @Bits 0..11 : Slope of 2nd piece wise linear function */
  #define TEMP_A1_A1_Pos (0UL)                       /*!< Position of A1 field.                                                */
  #define TEMP_A1_A1_Msk (0xFFFUL << TEMP_A1_A1_Pos) /*!< Bit mask of A1 field.                                                */


/* TEMP_A2: Slope of 3rd piece wise linear function */
  #define TEMP_A2_ResetValue (0x00000355UL)          /*!< Reset value of A2 register.                                          */

/* A2 @Bits 0..11 : Slope of 3rd piece wise linear function */
  #define TEMP_A2_A2_Pos (0UL)                       /*!< Position of A2 field.                                                */
  #define TEMP_A2_A2_Msk (0xFFFUL << TEMP_A2_A2_Pos) /*!< Bit mask of A2 field.                                                */


/* TEMP_A3: Slope of 4th piece wise linear function */
  #define TEMP_A3_ResetValue (0x000003DFUL)          /*!< Reset value of A3 register.                                          */

/* A3 @Bits 0..11 : Slope of 4th piece wise linear function */
  #define TEMP_A3_A3_Pos (0UL)                       /*!< Position of A3 field.                                                */
  #define TEMP_A3_A3_Msk (0xFFFUL << TEMP_A3_A3_Pos) /*!< Bit mask of A3 field.                                                */


/* TEMP_A4: Slope of 5th piece wise linear function */
  #define TEMP_A4_ResetValue (0x0000044EUL)          /*!< Reset value of A4 register.                                          */

/* A4 @Bits 0..11 : Slope of 5th piece wise linear function */
  #define TEMP_A4_A4_Pos (0UL)                       /*!< Position of A4 field.                                                */
  #define TEMP_A4_A4_Msk (0xFFFUL << TEMP_A4_A4_Pos) /*!< Bit mask of A4 field.                                                */


/* TEMP_A5: Slope of 6th piece wise linear function */
  #define TEMP_A5_ResetValue (0x000004B7UL)          /*!< Reset value of A5 register.                                          */

/* A5 @Bits 0..11 : Slope of 6th piece wise linear function */
  #define TEMP_A5_A5_Pos (0UL)                       /*!< Position of A5 field.                                                */
  #define TEMP_A5_A5_Msk (0xFFFUL << TEMP_A5_A5_Pos) /*!< Bit mask of A5 field.                                                */


/* TEMP_A6: Slope of 7th piece wise linear function */
  #define TEMP_A6_ResetValue (0x000004B7UL)          /*!< Reset value of A6 register.                                          */

/* A6 @Bits 0..11 : Slope of 7th piece wise linear function */
  #define TEMP_A6_A6_Pos (0UL)                       /*!< Position of A6 field.                                                */
  #define TEMP_A6_A6_Msk (0xFFFUL << TEMP_A6_A6_Pos) /*!< Bit mask of A6 field.                                                */


/* TEMP_B0: y-intercept of 1st piece wise linear function */
  #define TEMP_B0_ResetValue (0x00000FC7UL)          /*!< Reset value of B0 register.                                          */

/* B0 @Bits 0..11 : y-intercept of 1st piece wise linear function */
  #define TEMP_B0_B0_Pos (0UL)                       /*!< Position of B0 field.                                                */
  #define TEMP_B0_B0_Msk (0xFFFUL << TEMP_B0_B0_Pos) /*!< Bit mask of B0 field.                                                */


/* TEMP_B1: y-intercept of 2nd piece wise linear function */
  #define TEMP_B1_ResetValue (0x00000F71UL)          /*!< Reset value of B1 register.                                          */

/* B1 @Bits 0..11 : y-intercept of 2nd piece wise linear function */
  #define TEMP_B1_B1_Pos (0UL)                       /*!< Position of B1 field.                                                */
  #define TEMP_B1_B1_Msk (0xFFFUL << TEMP_B1_B1_Pos) /*!< Bit mask of B1 field.                                                */


/* TEMP_B2: y-intercept of 3rd piece wise linear function */
  #define TEMP_B2_ResetValue (0x00000F6CUL)          /*!< Reset value of B2 register.                                          */

/* B2 @Bits 0..11 : y-intercept of 3rd piece wise linear function */
  #define TEMP_B2_B2_Pos (0UL)                       /*!< Position of B2 field.                                                */
  #define TEMP_B2_B2_Msk (0xFFFUL << TEMP_B2_B2_Pos) /*!< Bit mask of B2 field.                                                */


/* TEMP_B3: y-intercept of 4th piece wise linear function */
  #define TEMP_B3_ResetValue (0x00000FCBUL)          /*!< Reset value of B3 register.                                          */

/* B3 @Bits 0..11 : y-intercept of 4th piece wise linear function */
  #define TEMP_B3_B3_Pos (0UL)                       /*!< Position of B3 field.                                                */
  #define TEMP_B3_B3_Msk (0xFFFUL << TEMP_B3_B3_Pos) /*!< Bit mask of B3 field.                                                */


/* TEMP_B4: y-intercept of 5th piece wise linear function */
  #define TEMP_B4_ResetValue (0x0000004BUL)          /*!< Reset value of B4 register.                                          */

