adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TIMER_EVENTS_COMPARE: Compare event on CC[n] match */
  #define TIMER_EVENTS_COMPARE_MaxCount (8UL)        /*!< Max size of EVENTS_COMPARE[8] array.                                 */
  #define TIMER_EVENTS_COMPARE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_COMPARE[8] register.                       */

/* EVENTS_COMPARE @Bit 0 : Compare event on CC[n] match */
  #define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Pos (0UL) /*!< Position of EVENTS_COMPARE field.                                 */
  #define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Msk (0x1UL << TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Pos) /*!< Bit mask of
                                                                            EVENTS_COMPARE field.*/                               
  #define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Min (0x0UL) /*!< Min enumerator value of EVENTS_COMPARE field.                   */
  #define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Max (0x1UL) /*!< Max enumerator value of EVENTS_COMPARE field.                   */
  #define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Generated (0x1UL) /*!< Event generated                                           */


/* TIMER_PUBLISH_COMPARE: Publish configuration for event COMPARE[n] */
  #define TIMER_PUBLISH_COMPARE_MaxCount (8UL)       /*!< Max size of PUBLISH_COMPARE[8] array.                                */
  #define TIMER_PUBLISH_COMPARE_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_COMPARE[8] register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that event COMPARE[n] will publish to */
  #define TIMER_PUBLISH_COMPARE_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define TIMER_PUBLISH_COMPARE_CHIDX_Msk (0xFFUL << TIMER_PUBLISH_COMPARE_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define TIMER_PUBLISH_COMPARE_CHIDX_Min (0x0UL)    /*!< Min value of CHIDX field.                                            */
  #define TIMER_PUBLISH_COMPARE_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TIMER_PUBLISH_COMPARE_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define TIMER_PUBLISH_COMPARE_EN_Msk (0x1UL << TIMER_PUBLISH_COMPARE_EN_Pos) /*!< Bit mask of EN field.                      */
  #define TIMER_PUBLISH_COMPARE_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define TIMER_PUBLISH_COMPARE_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define TIMER_PUBLISH_COMPARE_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define TIMER_PUBLISH_COMPARE_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* TIMER_SHORTS: Shortcuts between local events and tasks */
  #define TIMER_SHORTS_ResetValue (0x00000000UL)     /*!< Reset value of SHORTS register.                                      */

/* COMPARE0_CLEAR @Bit 0 : Shortcut between event COMPARE[0] and task CLEAR */
  #define TIMER_SHORTS_COMPARE0_CLEAR_Pos (0UL)      /*!< Position of COMPARE0_CLEAR field.                                    */
  #define TIMER_SHORTS_COMPARE0_CLEAR_Msk (0x1UL << TIMER_SHORTS_COMPARE0_CLEAR_Pos) /*!< Bit mask of COMPARE0_CLEAR field.    */
  #define TIMER_SHORTS_COMPARE0_CLEAR_Min (0x0UL)    /*!< Min enumerator value of COMPARE0_CLEAR field.                        */
  #define TIMER_SHORTS_COMPARE0_CLEAR_Max (0x1UL)    /*!< Max enumerator value of COMPARE0_CLEAR field.                        */
  #define TIMER_SHORTS_COMPARE0_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define TIMER_SHORTS_COMPARE0_CLEAR_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* COMPARE1_CLEAR @Bit 1 : Shortcut between event COMPARE[1] and task CLEAR */
  #define TIMER_SHORTS_COMPARE1_CLEAR_Pos (1UL)      /*!< Position of COMPARE1_CLEAR field.                                    */
  #define TIMER_SHORTS_COMPARE1_CLEAR_Msk (0x1UL << TIMER_SHORTS_COMPARE1_CLEAR_Pos) /*!< Bit mask of COMPARE1_CLEAR field.    */
  #define TIMER_SHORTS_COMPARE1_CLEAR_Min (0x0UL)    /*!< Min enumerator value of COMPARE1_CLEAR field.                        */
  #define TIMER_SHORTS_COMPARE1_CLEAR_Max (0x1UL)    /*!< Max enumerator value of COMPARE1_CLEAR field.                        */
  #define TIMER_SHORTS_COMPARE1_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define TIMER_SHORTS_COMPARE1_CLEAR_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* COMPARE2_CLEAR @Bit 2 : Shortcut between event COMPARE[2] and task CLEAR */
  #define TIMER_SHORTS_COMPARE2_CLEAR_Pos (2UL)      /*!< Position of COMPARE2_CLEAR field.                                    */
  #define TIMER_SHORTS_COMPARE2_CLEAR_Msk (0x1UL << TIMER_SHORTS_COMPARE2_CLEAR_Pos) /*!< Bit mask of COMPARE2_CLEAR field.    */
  #define TIMER_SHORTS_COMPARE2_CLEAR_Min (0x0UL)    /*!< Min enumerator value of COMPARE2_CLEAR field.                        */
  #define TIMER_SHORTS_COMPARE2_CLEAR_Max (0x1UL)    /*!< Max enumerator value of COMPARE2_CLEAR field.                        */
  #define TIMER_SHORTS_COMPARE2_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define TIMER_SHORTS_COMPARE2_CLEAR_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* COMPARE3_CLEAR @Bit 3 : Shortcut between event COMPARE[3] and task CLEAR */
  #define TIMER_SHORTS_COMPARE3_CLEAR_Pos (3UL)      /*!< Position of COMPARE3_CLEAR field.                                    */
  #define TIMER_SHORTS_COMPARE3_CLEAR_Msk (0x1UL << TIMER_SHORTS_COMPARE3_CLEAR_Pos) /*!< Bit mask of COMPARE3_CLEAR field.    */
  #define TIMER_SHORTS_COMPARE3_CLEAR_Min (0x0UL)    /*!< Min enumerator value of COMPARE3_CLEAR field.                        */
  #define TIMER_SHORTS_COMPARE3_CLEAR_Max (0x1UL)    /*!< Max enumerator value of COMPARE3_CLEAR field.                        */
  #define TIMER_SHORTS_COMPARE3_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define TIMER_SHORTS_COMPARE3_CLEAR_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* COMPARE4_CLEAR @Bit 4 : Shortcut between event COMPARE[4] and task CLEAR */
  #define TIMER_SHORTS_COMPARE4_CLEAR_Pos (4UL)      /*!< Position of COMPARE4_CLEAR field.                                    */
  #define TIMER_SHORTS_COMPARE4_CLEAR_Msk (0x1UL << TIMER_SHORTS_COMPARE4_CLEAR_Pos) /*!< Bit mask of COMPARE4_CLEAR field.    */
  #define TIMER_SHORTS_COMPARE4_CLEAR_Min (0x0UL)    /*!< Min enumerator value of COMPARE4_CLEAR field.                        */
  #define TIMER_SHORTS_COMPARE4_CLEAR_Max (0x1UL)    /*!< Max enumerator value of COMPARE4_CLEAR field.                        */
  #define TIMER_SHORTS_COMPARE4_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define TIMER_SHORTS_COMPARE4_CLEAR_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* COMPARE5_CLEAR @Bit 5 : Shortcut between event COMPARE[5] and task CLEAR */
  #define TIMER_SHORTS_COMPARE5_CLEAR_Pos (5UL)      /*!< Position of COMPARE5_CLEAR field.                                    */
  #define TIMER_SHORTS_COMPARE5_CLEAR_Msk (0x1UL << TIMER_SHORTS_COMPARE5_CLEAR_Pos) /*!< Bit mask of COMPARE5_CLEAR field.    */
  #define TIMER_SHORTS_COMPARE5_CLEAR_Min (0x0UL)    /*!< Min enumerator value of COMPARE5_CLEAR field.                        */
  #define TIMER_SHORTS_COMPARE5_CLEAR_Max (0x1UL)    /*!< Max enumerator value of COMPARE5_CLEAR field.                        */
  #define TIMER_SHORTS_COMPARE5_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define TIMER_SHORTS_COMPARE5_CLEAR_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* COMPARE6_CLEAR @Bit 6 : Shortcut between event COMPARE[6] and task CLEAR */
  #define TIMER_SHORTS_COMPARE6_CLEAR_Pos (6UL)      /*!< Position of COMPARE6_CLEAR field.                                    */
  #define TIMER_SHORTS_COMPARE6_CLEAR_Msk (0x1UL << TIMER_SHORTS_COMPARE6_CLEAR_Pos) /*!< Bit mask of COMPARE6_CLEAR field.    */
  #define TIMER_SHORTS_COMPARE6_CLEAR_Min (0x0UL)    /*!< Min enumerator value of COMPARE6_CLEAR field.                        */
  #define TIMER_SHORTS_COMPARE6_CLEAR_Max (0x1UL)    /*!< Max enumerator value of COMPARE6_CLEAR field.                        */
  #define TIMER_SHORTS_COMPARE6_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define TIMER_SHORTS_COMPARE6_CLEAR_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* COMPARE7_CLEAR @Bit 7 : Shortcut between event COMPARE[7] and task CLEAR */
  #define TIMER_SHORTS_COMPARE7_CLEAR_Pos (7UL)      /*!< Position of COMPARE7_CLEAR field.                                    */
  #define TIMER_SHORTS_COMPARE7_CLEAR_Msk (0x1UL << TIMER_SHORTS_COMPARE7_CLEAR_Pos) /*!< Bit mask of COMPARE7_CLEAR field.    */
  #define TIMER_SHORTS_COMPARE7_CLEAR_Min (0x0UL)    /*!< Min enumerator value of COMPARE7_CLEAR field.                        */
  #define TIMER_SHORTS_COMPARE7_CLEAR_Max (0x1UL)    /*!< Max enumerator value of COMPARE7_CLEAR field.                        */
  #define TIMER_SHORTS_COMPARE7_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define TIMER_SHORTS_COMPARE7_CLEAR_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* COMPARE0_STOP @Bit 16 : Shortcut between event COMPARE[0] and task STOP */
  #define TIMER_SHORTS_COMPARE0_STOP_Pos (16UL)      /*!< Position of COMPARE0_STOP field.                                     */
  #define TIMER_SHORTS_COMPARE0_STOP_Msk (0x1UL << TIMER_SHORTS_COMPARE0_STOP_Pos) /*!< Bit mask of COMPARE0_STOP field.       */
  #define TIMER_SHORTS_COMPARE0_STOP_Min (0x0UL)     /*!< Min enumerator value of COMPARE0_STOP field.                         */
  #define TIMER_SHORTS_COMPARE0_STOP_Max (0x1UL)     /*!< Max enumerator value of COMPARE0_STOP field.                         */
  #define TIMER_SHORTS_COMPARE0_STOP_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define TIMER_SHORTS_COMPARE0_STOP_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* COMPARE1_STOP @Bit 17 : Shortcut between event COMPARE[1] and task STOP */
  #define TIMER_SHORTS_COMPARE1_STOP_Pos (17UL)      /*!< Position of COMPARE1_STOP field.                                     */
  #define TIMER_SHORTS_COMPARE1_STOP_Msk (0x1UL << TIMER_SHORTS_COMPARE1_STOP_Pos) /*!< Bit mask of COMPARE1_STOP field.       */
  #define TIMER_SHORTS_COMPARE1_STOP_Min (0x0UL)     /*!< Min enumerator value of COMPARE1_STOP field.                         */
  #define TIMER_SHORTS_COMPARE1_STOP_Max (0x1UL)     /*!< Max enumerator value of COMPARE1_STOP field.                         */
  #define TIMER_SHORTS_COMPARE1_STOP_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define TIMER_SHORTS_COMPARE1_STOP_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* COMPARE2_STOP @Bit 18 : Shortcut between event COMPARE[2] and task STOP */
  #define TIMER_SHORTS_COMPARE2_STOP_Pos (18UL)      /*!< Position of COMPARE2_STOP field.                                     */
  #define TIMER_SHORTS_COMPARE2_STOP_Msk (0x1UL << TIMER_SHORTS_COMPARE2_STOP_Pos) /*!< Bit mask of COMPARE2_STOP field.       */
  #define TIMER_SHORTS_COMPARE2_STOP_Min (0x0UL)     /*!< Min enumerator value of COMPARE2_STOP field.                         */
  #define TIMER_SHORTS_COMPARE2_STOP_Max (0x1UL)     /*!< Max enumerator value of COMPARE2_STOP field.                         */
  #define TIMER_SHORTS_COMPARE2_STOP_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define TIMER_SHORTS_COMPARE2_STOP_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* COMPARE3_STOP @Bit 19 : Shortcut between event COMPARE[3] and task STOP */
  #define TIMER_SHORTS_COMPARE3_STOP_Pos (19UL)      /*!< Position of COMPARE3_STOP field.                                     */
  #define TIMER_SHORTS_COMPARE3_STOP_Msk (0x1UL << TIMER_SHORTS_COMPARE3_STOP_Pos) /*!< Bit mask of COMPARE3_STOP field.       */
  #define TIMER_SHORTS_COMPARE3_STOP_Min (0x0UL)     /*!< Min enumerator value of COMPARE3_STOP field.                         */
  #define TIMER_SHORTS_COMPARE3_STOP_Max (0x1UL)     /*!< Max enumerator value of COMPARE3_STOP field.                         */
  #define TIMER_SHORTS_COMPARE3_STOP_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define TIMER_SHORTS_COMPARE3_STOP_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* COMPARE4_STOP @Bit 20 : Shortcut between event COMPARE[4] and task STOP */
  #define TIMER_SHORTS_COMPARE4_STOP_Pos (20UL)      /*!< Position of COMPARE4_STOP field.                                     */
  #define TIMER_SHORTS_COMPARE4_STOP_Msk (0x1UL << TIMER_SHORTS_COMPARE4_STOP_Pos) /*!< Bit mask of COMPARE4_STOP field.       */
  #define TIMER_SHORTS_COMPARE4_STOP_Min (0x0UL)     /*!< Min enumerator value of COMPARE4_STOP field.                         */
  #define TIMER_SHORTS_COMPARE4_STOP_Max (0x1UL)     /*!< Max enumerator value of COMPARE4_STOP field.                         */
  #define TIMER_SHORTS_COMPARE4_STOP_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define TIMER_SHORTS_COMPARE4_STOP_Enabled (0x1UL) /*!< Enable shortcut                                                      */

