adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TPIU_EXTCTLOUTPORT: Two ports can be used as a control and feedback mechanism for any serializers, pin sharing multiplexers,
                        or other solutions that might be added to the trace output pins either for pin control or a high speed
                        trace port solution. These ports are raw register banks that sample or export the corresponding external
                        pins. */                                                                                                  
                                                                                                                                  
  #define TPIU_EXTCTLOUTPORT_ResetValue (0x00000000UL) /*!< Reset value of EXTCTLOUTPORT register.                             */

/* EXTCTLOUT0 @Bit 0 : EXTCTL outputs. */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT0_Pos (0UL)    /*!< Position of EXTCTLOUT0 field.                                        */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT0_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT0_Pos) /*!< Bit mask of EXTCTLOUT0 field.    */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT0_Min (0x0UL)  /*!< Min enumerator value of EXTCTLOUT0 field.                            */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT0_Max (0x1UL)  /*!< Max enumerator value of EXTCTLOUT0 field.                            */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT0_Low (0x0UL)  /*!< Output EXTCTL0 is low.                                               */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT0_High (0x1UL) /*!< Output EXTCTL0 is high.                                              */

/* EXTCTLOUT1 @Bit 1 : EXTCTL outputs. */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT1_Pos (1UL)    /*!< Position of EXTCTLOUT1 field.                                        */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT1_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT1_Pos) /*!< Bit mask of EXTCTLOUT1 field.    */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT1_Min (0x0UL)  /*!< Min enumerator value of EXTCTLOUT1 field.                            */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT1_Max (0x1UL)  /*!< Max enumerator value of EXTCTLOUT1 field.                            */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT1_Low (0x0UL)  /*!< Output EXTCTL1 is low.                                               */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT1_High (0x1UL) /*!< Output EXTCTL1 is high.                                              */

/* EXTCTLOUT2 @Bit 2 : EXTCTL outputs. */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT2_Pos (2UL)    /*!< Position of EXTCTLOUT2 field.                                        */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT2_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT2_Pos) /*!< Bit mask of EXTCTLOUT2 field.    */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT2_Min (0x0UL)  /*!< Min enumerator value of EXTCTLOUT2 field.                            */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT2_Max (0x1UL)  /*!< Max enumerator value of EXTCTLOUT2 field.                            */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT2_Low (0x0UL)  /*!< Output EXTCTL2 is low.                                               */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT2_High (0x1UL) /*!< Output EXTCTL2 is high.                                              */

/* EXTCTLOUT3 @Bit 3 : EXTCTL outputs. */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT3_Pos (3UL)    /*!< Position of EXTCTLOUT3 field.                                        */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT3_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT3_Pos) /*!< Bit mask of EXTCTLOUT3 field.    */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT3_Min (0x0UL)  /*!< Min enumerator value of EXTCTLOUT3 field.                            */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT3_Max (0x1UL)  /*!< Max enumerator value of EXTCTLOUT3 field.                            */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT3_Low (0x0UL)  /*!< Output EXTCTL3 is low.                                               */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT3_High (0x1UL) /*!< Output EXTCTL3 is high.                                              */

/* EXTCTLOUT4 @Bit 4 : EXTCTL outputs. */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT4_Pos (4UL)    /*!< Position of EXTCTLOUT4 field.                                        */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT4_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT4_Pos) /*!< Bit mask of EXTCTLOUT4 field.    */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT4_Min (0x0UL)  /*!< Min enumerator value of EXTCTLOUT4 field.                            */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT4_Max (0x1UL)  /*!< Max enumerator value of EXTCTLOUT4 field.                            */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT4_Low (0x0UL)  /*!< Output EXTCTL4 is low.                                               */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT4_High (0x1UL) /*!< Output EXTCTL4 is high.                                              */

/* EXTCTLOUT5 @Bit 5 : EXTCTL outputs. */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT5_Pos (5UL)    /*!< Position of EXTCTLOUT5 field.                                        */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT5_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT5_Pos) /*!< Bit mask of EXTCTLOUT5 field.    */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT5_Min (0x0UL)  /*!< Min enumerator value of EXTCTLOUT5 field.                            */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT5_Max (0x1UL)  /*!< Max enumerator value of EXTCTLOUT5 field.                            */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT5_Low (0x0UL)  /*!< Output EXTCTL5 is low.                                               */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT5_High (0x1UL) /*!< Output EXTCTL5 is high.                                              */

/* EXTCTLOUT6 @Bit 6 : EXTCTL outputs. */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT6_Pos (6UL)    /*!< Position of EXTCTLOUT6 field.                                        */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT6_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT6_Pos) /*!< Bit mask of EXTCTLOUT6 field.    */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT6_Min (0x0UL)  /*!< Min enumerator value of EXTCTLOUT6 field.                            */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT6_Max (0x1UL)  /*!< Max enumerator value of EXTCTLOUT6 field.                            */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT6_Low (0x0UL)  /*!< Output EXTCTL6 is low.                                               */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT6_High (0x1UL) /*!< Output EXTCTL6 is high.                                              */

