adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* BIT1 @Bit 1 : Set claim bit 1 and check if bit is implemented or not. */
  #define TPIU_CLAIMSET_BIT1_Pos (1UL)               /*!< Position of BIT1 field.                                              */
  #define TPIU_CLAIMSET_BIT1_Msk (0x1UL << TPIU_CLAIMSET_BIT1_Pos) /*!< Bit mask of BIT1 field.                                */
  #define TPIU_CLAIMSET_BIT1_Min (0x0UL)             /*!< Min enumerator value of BIT1 field.                                  */
  #define TPIU_CLAIMSET_BIT1_Max (0x1UL)             /*!< Max enumerator value of BIT1 field.                                  */
  #define TPIU_CLAIMSET_BIT1_NotImplemented (0x0UL)  /*!< Claim bit 1 is not implemented.                                      */
  #define TPIU_CLAIMSET_BIT1_Implemented (0x1UL)     /*!< Claim bit 1 is implemented.                                          */
  #define TPIU_CLAIMSET_BIT1_Set (0x1UL)             /*!< Set claim bit 1.                                                     */

/* BIT2 @Bit 2 : Set claim bit 2 and check if bit is implemented or not. */
  #define TPIU_CLAIMSET_BIT2_Pos (2UL)               /*!< Position of BIT2 field.                                              */
  #define TPIU_CLAIMSET_BIT2_Msk (0x1UL << TPIU_CLAIMSET_BIT2_Pos) /*!< Bit mask of BIT2 field.                                */
  #define TPIU_CLAIMSET_BIT2_Min (0x0UL)             /*!< Min enumerator value of BIT2 field.                                  */
  #define TPIU_CLAIMSET_BIT2_Max (0x1UL)             /*!< Max enumerator value of BIT2 field.                                  */
  #define TPIU_CLAIMSET_BIT2_NotImplemented (0x0UL)  /*!< Claim bit 2 is not implemented.                                      */
  #define TPIU_CLAIMSET_BIT2_Implemented (0x1UL)     /*!< Claim bit 2 is implemented.                                          */
  #define TPIU_CLAIMSET_BIT2_Set (0x1UL)             /*!< Set claim bit 2.                                                     */

/* BIT3 @Bit 3 : Set claim bit 3 and check if bit is implemented or not. */
  #define TPIU_CLAIMSET_BIT3_Pos (3UL)               /*!< Position of BIT3 field.                                              */
  #define TPIU_CLAIMSET_BIT3_Msk (0x1UL << TPIU_CLAIMSET_BIT3_Pos) /*!< Bit mask of BIT3 field.                                */
  #define TPIU_CLAIMSET_BIT3_Min (0x0UL)             /*!< Min enumerator value of BIT3 field.                                  */
  #define TPIU_CLAIMSET_BIT3_Max (0x1UL)             /*!< Max enumerator value of BIT3 field.                                  */
  #define TPIU_CLAIMSET_BIT3_NotImplemented (0x0UL)  /*!< Claim bit 3 is not implemented.                                      */
  #define TPIU_CLAIMSET_BIT3_Implemented (0x1UL)     /*!< Claim bit 3 is implemented.                                          */
  #define TPIU_CLAIMSET_BIT3_Set (0x1UL)             /*!< Set claim bit 3.                                                     */


/* TPIU_CLAIMCLR: Software can use the claim tag to coordinate application and debugger access to trace unit functionality. The
                   claim tags have no effect on the operation of the component. The CLAIMCLR register sets the bits in the claim
                   tag to 0 and determines the current value of the claim tag. */                                                 
                                                                                                                                  
  #define TPIU_CLAIMCLR_ResetValue (0x00000000UL)    /*!< Reset value of CLAIMCLR register.                                    */

/* BIT0 @Bit 0 : Read or clear claim bit 0. */
  #define TPIU_CLAIMCLR_BIT0_Pos (0UL)               /*!< Position of BIT0 field.                                              */
  #define TPIU_CLAIMCLR_BIT0_Msk (0x1UL << TPIU_CLAIMCLR_BIT0_Pos) /*!< Bit mask of BIT0 field.                                */
  #define TPIU_CLAIMCLR_BIT0_Min (0x0UL)             /*!< Min enumerator value of BIT0 field.                                  */
  #define TPIU_CLAIMCLR_BIT0_Max (0x1UL)             /*!< Max enumerator value of BIT0 field.                                  */
  #define TPIU_CLAIMCLR_BIT0_Cleared (0x0UL)         /*!< Claim bit 0 is not set.                                              */
  #define TPIU_CLAIMCLR_BIT0_Set (0x1UL)             /*!< Claim bit 0 is set.                                                  */
  #define TPIU_CLAIMCLR_BIT0_Clear (0x1UL)           /*!< Clear claim bit 0.                                                   */

/* BIT1 @Bit 1 : Read or clear claim bit 1. */
  #define TPIU_CLAIMCLR_BIT1_Pos (1UL)               /*!< Position of BIT1 field.                                              */
  #define TPIU_CLAIMCLR_BIT1_Msk (0x1UL << TPIU_CLAIMCLR_BIT1_Pos) /*!< Bit mask of BIT1 field.                                */
  #define TPIU_CLAIMCLR_BIT1_Min (0x0UL)             /*!< Min enumerator value of BIT1 field.                                  */
  #define TPIU_CLAIMCLR_BIT1_Max (0x1UL)             /*!< Max enumerator value of BIT1 field.                                  */
  #define TPIU_CLAIMCLR_BIT1_Cleared (0x0UL)         /*!< Claim bit 1 is not set.                                              */
  #define TPIU_CLAIMCLR_BIT1_Set (0x1UL)             /*!< Claim bit 1 is set.                                                  */
  #define TPIU_CLAIMCLR_BIT1_Clear (0x1UL)           /*!< Clear claim bit 1.                                                   */

/* BIT2 @Bit 2 : Read or clear claim bit 2. */
  #define TPIU_CLAIMCLR_BIT2_Pos (2UL)               /*!< Position of BIT2 field.                                              */
  #define TPIU_CLAIMCLR_BIT2_Msk (0x1UL << TPIU_CLAIMCLR_BIT2_Pos) /*!< Bit mask of BIT2 field.                                */
  #define TPIU_CLAIMCLR_BIT2_Min (0x0UL)             /*!< Min enumerator value of BIT2 field.                                  */
  #define TPIU_CLAIMCLR_BIT2_Max (0x1UL)             /*!< Max enumerator value of BIT2 field.                                  */
  #define TPIU_CLAIMCLR_BIT2_Cleared (0x0UL)         /*!< Claim bit 2 is not set.                                              */
  #define TPIU_CLAIMCLR_BIT2_Set (0x1UL)             /*!< Claim bit 2 is set.                                                  */
  #define TPIU_CLAIMCLR_BIT2_Clear (0x1UL)           /*!< Clear claim bit 2.                                                   */

/* BIT3 @Bit 3 : Read or clear claim bit 3. */
  #define TPIU_CLAIMCLR_BIT3_Pos (3UL)               /*!< Position of BIT3 field.                                              */
  #define TPIU_CLAIMCLR_BIT3_Msk (0x1UL << TPIU_CLAIMCLR_BIT3_Pos) /*!< Bit mask of BIT3 field.                                */
  #define TPIU_CLAIMCLR_BIT3_Min (0x0UL)             /*!< Min enumerator value of BIT3 field.                                  */
  #define TPIU_CLAIMCLR_BIT3_Max (0x1UL)             /*!< Max enumerator value of BIT3 field.                                  */
  #define TPIU_CLAIMCLR_BIT3_Cleared (0x0UL)         /*!< Claim bit 3 is not set.                                              */
  #define TPIU_CLAIMCLR_BIT3_Set (0x1UL)             /*!< Claim bit 3 is set.                                                  */
  #define TPIU_CLAIMCLR_BIT3_Clear (0x1UL)           /*!< Clear claim bit 3.                                                   */


/* TPIU_LAR: This is used to enable write access to device registers. */
  #define TPIU_LAR_ResetValue (0x00000000UL)         /*!< Reset value of LAR register.                                         */

