adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ACCESS @Bits 0..31 : A write of 0xC5ACCE55 enables further write access to this device. Any other write removes write access.
                        */                                                                                                        
                                                                                                                                  
  #define TPIU_LAR_ACCESS_Pos (0UL)                  /*!< Position of ACCESS field.                                            */
  #define TPIU_LAR_ACCESS_Msk (0xFFFFFFFFUL << TPIU_LAR_ACCESS_Pos) /*!< Bit mask of ACCESS field.                             */
  #define TPIU_LAR_ACCESS_Min (0xC5ACCE55UL)         /*!< Min enumerator value of ACCESS field.                                */
  #define TPIU_LAR_ACCESS_Max (0xC5ACCE55UL)         /*!< Max enumerator value of ACCESS field.                                */
  #define TPIU_LAR_ACCESS_UnLock (0xC5ACCE55UL)      /*!< Unlock register interface.                                           */


/* TPIU_LSR: This indicates the status of the lock control mechanism. This lock prevents accidental writes by code under debug.
              Accesses to the extended stimulus port registers are not affected by the lock mechanism. This register must always
              be present although there might not be any lock access control mechanism. The lock mechanism, where present and
              locked, must block write accesses to any control register, except the Lock Access Register. For most components
              this covers all registers except for the Lock Access Register. */                                                   
                                                                                                                                  
  #define TPIU_LSR_ResetValue (0x00000000UL)         /*!< Reset value of LSR register.                                         */

/* PRESENT @Bit 0 : Indicates that a lock control mechanism exists for this device. */
  #define TPIU_LSR_PRESENT_Pos (0UL)                 /*!< Position of PRESENT field.                                           */
  #define TPIU_LSR_PRESENT_Msk (0x1UL << TPIU_LSR_PRESENT_Pos) /*!< Bit mask of PRESENT field.                                 */
  #define TPIU_LSR_PRESENT_Min (0x0UL)               /*!< Min enumerator value of PRESENT field.                               */
  #define TPIU_LSR_PRESENT_Max (0x1UL)               /*!< Max enumerator value of PRESENT field.                               */
  #define TPIU_LSR_PRESENT_NotImplemented (0x0UL)    /*!< No lock control mechanism exists, writes to the Lock Access Register
                                                          are ignored.*/                                                          
  #define TPIU_LSR_PRESENT_Implemented (0x1UL)       /*!< Lock control mechanism is present.                                   */

/* LOCKED @Bit 1 : Returns the current status of the Lock. */
  #define TPIU_LSR_LOCKED_Pos (1UL)                  /*!< Position of LOCKED field.                                            */
  #define TPIU_LSR_LOCKED_Msk (0x1UL << TPIU_LSR_LOCKED_Pos) /*!< Bit mask of LOCKED field.                                    */
  #define TPIU_LSR_LOCKED_Min (0x0UL)                /*!< Min enumerator value of LOCKED field.                                */
  #define TPIU_LSR_LOCKED_Max (0x1UL)                /*!< Max enumerator value of LOCKED field.                                */
  #define TPIU_LSR_LOCKED_UnLocked (0x0UL)           /*!< Write access is allowed to this device.                              */
  #define TPIU_LSR_LOCKED_Locked (0x1UL)             /*!< Write access to the component is blocked. All writes to control
                                                          registers are ignored. Reads are permitted.*/                           

/* TYPE @Bit 2 : Indicates if the Lock Access Register is implemented as 8-bit or 32-bit. */
  #define TPIU_LSR_TYPE_Pos (2UL)                    /*!< Position of TYPE field.                                              */
  #define TPIU_LSR_TYPE_Msk (0x1UL << TPIU_LSR_TYPE_Pos) /*!< Bit mask of TYPE field.                                          */
  #define TPIU_LSR_TYPE_Min (0x0UL)                  /*!< Min enumerator value of TYPE field.                                  */
  #define TPIU_LSR_TYPE_Max (0x1UL)                  /*!< Max enumerator value of TYPE field.                                  */
  #define TPIU_LSR_TYPE_Bits32 (0x0UL)               /*!< This component implements a 32-bit Lock Access Register.             */
  #define TPIU_LSR_TYPE_Bits8 (0x1UL)                /*!< This component implements an 8-bit Lock Access Register.             */


/* TPIU_AUTHSTATUS: Indicates the current level of tracing permitted by the system */
  #define TPIU_AUTHSTATUS_ResetValue (0x00000000UL)  /*!< Reset value of AUTHSTATUS register.                                  */

/* NSID @Bits 0..1 : Non-secure Invasive Debug */
  #define TPIU_AUTHSTATUS_NSID_Pos (0UL)             /*!< Position of NSID field.                                              */
  #define TPIU_AUTHSTATUS_NSID_Msk (0x3UL << TPIU_AUTHSTATUS_NSID_Pos) /*!< Bit mask of NSID field.                            */
  #define TPIU_AUTHSTATUS_NSID_Min (0x0UL)           /*!< Min enumerator value of NSID field.                                  */
  #define TPIU_AUTHSTATUS_NSID_Max (0x1UL)           /*!< Max enumerator value of NSID field.                                  */
  #define TPIU_AUTHSTATUS_NSID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                     */
  #define TPIU_AUTHSTATUS_NSID_Implemented (0x1UL)   /*!< The feature is implemented.                                          */

/* NSNID @Bits 2..3 : Non-secure Non-Invasive Debug */
  #define TPIU_AUTHSTATUS_NSNID_Pos (2UL)            /*!< Position of NSNID field.                                             */
  #define TPIU_AUTHSTATUS_NSNID_Msk (0x3UL << TPIU_AUTHSTATUS_NSNID_Pos) /*!< Bit mask of NSNID field.                         */
  #define TPIU_AUTHSTATUS_NSNID_Min (0x0UL)          /*!< Min enumerator value of NSNID field.                                 */
  #define TPIU_AUTHSTATUS_NSNID_Max (0x1UL)          /*!< Max enumerator value of NSNID field.                                 */
  #define TPIU_AUTHSTATUS_NSNID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                    */
  #define TPIU_AUTHSTATUS_NSNID_Implemented (0x1UL)  /*!< The feature is implemented.                                          */

/* SID @Bits 4..5 : Secure Invasive Debug */
  #define TPIU_AUTHSTATUS_SID_Pos (4UL)              /*!< Position of SID field.                                               */
  #define TPIU_AUTHSTATUS_SID_Msk (0x3UL << TPIU_AUTHSTATUS_SID_Pos) /*!< Bit mask of SID field.                               */
  #define TPIU_AUTHSTATUS_SID_Min (0x0UL)            /*!< Min enumerator value of SID field.                                   */
  #define TPIU_AUTHSTATUS_SID_Max (0x1UL)            /*!< Max enumerator value of SID field.                                   */
  #define TPIU_AUTHSTATUS_SID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                      */
  #define TPIU_AUTHSTATUS_SID_Implemented (0x1UL)    /*!< The feature is implemented.                                          */

/* SNID @Bits 6..7 : Secure Non-Invasive Debug */
  #define TPIU_AUTHSTATUS_SNID_Pos (6UL)             /*!< Position of SNID field.                                              */
  #define TPIU_AUTHSTATUS_SNID_Msk (0x3UL << TPIU_AUTHSTATUS_SNID_Pos) /*!< Bit mask of SNID field.                            */
  #define TPIU_AUTHSTATUS_SNID_Min (0x0UL)           /*!< Min enumerator value of SNID field.                                  */
  #define TPIU_AUTHSTATUS_SNID_Max (0x1UL)           /*!< Max enumerator value of SNID field.                                  */
  #define TPIU_AUTHSTATUS_SNID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                     */
  #define TPIU_AUTHSTATUS_SNID_Implemented (0x1UL)   /*!< The feature is implemented.                                          */


/* TPIU_DEVID: Indicates the capabilities of the component. */
  #define TPIU_DEVID_ResetValue (0x00000000UL)       /*!< Reset value of DEVID register.                                       */

/* MUXNUM @Bits 0..4 : Indicates the hidden level of input multiplexing. When non-zero, this value indicates the type of
                       multiplexing on the input to the ATB. Currently only 0x00 is supported, that is, no multiplexing is
                       present. This value helps detect the ATB structure. */                                                     
                                                                                                                                  
  #define TPIU_DEVID_MUXNUM_Pos (0UL)                /*!< Position of MUXNUM field.                                            */
  #define TPIU_DEVID_MUXNUM_Msk (0x1FUL << TPIU_DEVID_MUXNUM_Pos) /*!< Bit mask of MUXNUM field.                               */

/* CLKRELAT @Bit 5 : Indicates the relationship between atclk and traceclkin. */
  #define TPIU_DEVID_CLKRELAT_Pos (5UL)              /*!< Position of CLKRELAT field.                                          */
  #define TPIU_DEVID_CLKRELAT_Msk (0x1UL << TPIU_DEVID_CLKRELAT_Pos) /*!< Bit mask of CLKRELAT field.                          */
  #define TPIU_DEVID_CLKRELAT_Min (0x0UL)            /*!< Min enumerator value of CLKRELAT field.                              */
  #define TPIU_DEVID_CLKRELAT_Max (0x1UL)            /*!< Max enumerator value of CLKRELAT field.                              */
  #define TPIU_DEVID_CLKRELAT_Synchronous (0x0UL)    /*!< atclk and traceclkin are synchronous.                                */
  #define TPIU_DEVID_CLKRELAT_ASynchronous (0x1UL)   /*!< atclk and traceclkin are asynchronous.                               */

