adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FIFOSIZE @Bits 6..8 : FIFO size in powers of 2. */
  #define TPIU_DEVID_FIFOSIZE_Pos (6UL)              /*!< Position of FIFOSIZE field.                                          */
  #define TPIU_DEVID_FIFOSIZE_Msk (0x7UL << TPIU_DEVID_FIFOSIZE_Pos) /*!< Bit mask of FIFOSIZE field.                          */
  #define TPIU_DEVID_FIFOSIZE_Min (0x2UL)            /*!< Min enumerator value of FIFOSIZE field.                              */
  #define TPIU_DEVID_FIFOSIZE_Max (0x2UL)            /*!< Max enumerator value of FIFOSIZE field.                              */
  #define TPIU_DEVID_FIFOSIZE_Entries4 (0x2UL)       /*!< FIFO size of 4 entries, that is, 16 bytes.                           */

/* TCLKDATA @Bit 9 : Indicates whether trace clock plus data is supported. */
  #define TPIU_DEVID_TCLKDATA_Pos (9UL)              /*!< Position of TCLKDATA field.                                          */
  #define TPIU_DEVID_TCLKDATA_Msk (0x1UL << TPIU_DEVID_TCLKDATA_Pos) /*!< Bit mask of TCLKDATA field.                          */
  #define TPIU_DEVID_TCLKDATA_Min (0x0UL)            /*!< Min enumerator value of TCLKDATA field.                              */
  #define TPIU_DEVID_TCLKDATA_Max (0x1UL)            /*!< Max enumerator value of TCLKDATA field.                              */
  #define TPIU_DEVID_TCLKDATA_Supported (0x0UL)      /*!< Trace clock and data is supported.                                   */
  #define TPIU_DEVID_TCLKDATA_NotSupported (0x1UL)   /*!< Trace clock and data is not supported.                               */

/* SWOMAN @Bit 10 : Indicates whether Serial Wire Output, Manchester encoded format, is supported. */
  #define TPIU_DEVID_SWOMAN_Pos (10UL)               /*!< Position of SWOMAN field.                                            */
  #define TPIU_DEVID_SWOMAN_Msk (0x1UL << TPIU_DEVID_SWOMAN_Pos) /*!< Bit mask of SWOMAN field.                                */
  #define TPIU_DEVID_SWOMAN_Min (0x0UL)              /*!< Min enumerator value of SWOMAN field.                                */
  #define TPIU_DEVID_SWOMAN_Max (0x1UL)              /*!< Max enumerator value of SWOMAN field.                                */
  #define TPIU_DEVID_SWOMAN_NotSupported (0x0UL)     /*!< Serial Wire Output, Manchester encoded format, is not supported.     */
  #define TPIU_DEVID_SWOMAN_Supported (0x1UL)        /*!< Serial Wire Output, Manchester encoded format, is supported.         */

/* SWOUARTNRZ @Bit 11 : Indicates whether Serial Wire Output, UART or NRZ, is supported. */
  #define TPIU_DEVID_SWOUARTNRZ_Pos (11UL)           /*!< Position of SWOUARTNRZ field.                                        */
  #define TPIU_DEVID_SWOUARTNRZ_Msk (0x1UL << TPIU_DEVID_SWOUARTNRZ_Pos) /*!< Bit mask of SWOUARTNRZ field.                    */
  #define TPIU_DEVID_SWOUARTNRZ_Min (0x0UL)          /*!< Min enumerator value of SWOUARTNRZ field.                            */
  #define TPIU_DEVID_SWOUARTNRZ_Max (0x1UL)          /*!< Max enumerator value of SWOUARTNRZ field.                            */
  #define TPIU_DEVID_SWOUARTNRZ_NotSupported (0x0UL) /*!< Serial Wire Output, UART or NRZ, is not supported.                   */
  #define TPIU_DEVID_SWOUARTNRZ_Supported (0x1UL)    /*!< Serial Wire Output, UART or NRZ, is supported.                       */


/* TPIU_DEVTYPE: The DEVTYPE register provides a debugger with information about the component when the Part Number field is not
                  recognized. The debugger can then report this information. */                                                   
                                                                                                                                  
  #define TPIU_DEVTYPE_ResetValue (0x00000000UL)     /*!< Reset value of DEVTYPE register.                                     */

/* MAJOR @Bits 0..3 : The main type of the component */
  #define TPIU_DEVTYPE_MAJOR_Pos (0UL)               /*!< Position of MAJOR field.                                             */
  #define TPIU_DEVTYPE_MAJOR_Msk (0xFUL << TPIU_DEVTYPE_MAJOR_Pos) /*!< Bit mask of MAJOR field.                               */
  #define TPIU_DEVTYPE_MAJOR_Min (0x1UL)             /*!< Min enumerator value of MAJOR field.                                 */
  #define TPIU_DEVTYPE_MAJOR_Max (0x1UL)             /*!< Max enumerator value of MAJOR field.                                 */
  #define TPIU_DEVTYPE_MAJOR_TraceSource (0x1UL)     /*!< Peripheral is a trace sink.                                          */

/* SUB @Bits 4..7 : The sub-type of the component */
  #define TPIU_DEVTYPE_SUB_Pos (4UL)                 /*!< Position of SUB field.                                               */
  #define TPIU_DEVTYPE_SUB_Msk (0xFUL << TPIU_DEVTYPE_SUB_Pos) /*!< Bit mask of SUB field.                                     */
  #define TPIU_DEVTYPE_SUB_Min (0x1UL)               /*!< Min enumerator value of SUB field.                                   */
  #define TPIU_DEVTYPE_SUB_Max (0x1UL)               /*!< Max enumerator value of SUB field.                                   */
  #define TPIU_DEVTYPE_SUB_TracePort (0x1UL)         /*!< Indicates that this component is a trace port component.             */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TWIM                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct TWIM_TASKS_DMA_RX ================================================= */
/**
  * @brief RX [TWIM_TASKS_DMA_RX] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  START;                             /*!< (@ 0x00000000) Starts operation using easyDMA to load the values. See
                                                                         peripheral description for operation using easyDMA.*/    
  __OM  uint32_t  STOP;                              /*!< (@ 0x00000004) Stops operation using easyDMA. This does not trigger an
                                                                         END event. After a STOP task, the easyDMA (channel)
                                                                         will also enter its lowest required power level.*/       
  __OM  uint32_t  ENABLEMATCH[4];                    /*!< (@ 0x00000008) Enables the MATCH[n] event by setting the ENABLE[n] bit
                                                                         in the CONFIG register.*/                                
  __OM  uint32_t  DISABLEMATCH[4];                   /*!< (@ 0x00000018) Disables the MATCH[n] event by clearing the ENABLE[n]
                                                                         bit in the CONFIG register.*/                            
} NRF_TWIM_TASKS_DMA_RX_Type;                        /*!< Size = 40 (0x028)                                                    */

