adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event LASTTX will publish to */
  #define TWIM_PUBLISH_LASTTX_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define TWIM_PUBLISH_LASTTX_CHIDX_Msk (0xFFUL << TWIM_PUBLISH_LASTTX_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define TWIM_PUBLISH_LASTTX_CHIDX_Min (0x0UL)      /*!< Min value of CHIDX field.                                            */
  #define TWIM_PUBLISH_LASTTX_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIM_PUBLISH_LASTTX_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define TWIM_PUBLISH_LASTTX_EN_Msk (0x1UL << TWIM_PUBLISH_LASTTX_EN_Pos) /*!< Bit mask of EN field.                          */
  #define TWIM_PUBLISH_LASTTX_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define TWIM_PUBLISH_LASTTX_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define TWIM_PUBLISH_LASTTX_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define TWIM_PUBLISH_LASTTX_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* TWIM_SHORTS: Shortcuts between local events and tasks */
  #define TWIM_SHORTS_ResetValue (0x00000000UL)      /*!< Reset value of SHORTS register.                                      */

/* LASTTX_STARTRX @Bit 7 : Shortcut between event LASTTX and task STARTRX */
  #define TWIM_SHORTS_LASTTX_STARTRX_Pos (7UL)       /*!< Position of LASTTX_STARTRX field.                                    */
  #define TWIM_SHORTS_LASTTX_STARTRX_Msk (0x1UL << TWIM_SHORTS_LASTTX_STARTRX_Pos) /*!< Bit mask of LASTTX_STARTRX field.      */
  #define TWIM_SHORTS_LASTTX_STARTRX_Min (0x0UL)     /*!< Min enumerator value of LASTTX_STARTRX field.                        */
  #define TWIM_SHORTS_LASTTX_STARTRX_Max (0x1UL)     /*!< Max enumerator value of LASTTX_STARTRX field.                        */
  #define TWIM_SHORTS_LASTTX_STARTRX_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define TWIM_SHORTS_LASTTX_STARTRX_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* LASTTX_SUSPEND @Bit 8 : Shortcut between event LASTTX and task SUSPEND */
  #define TWIM_SHORTS_LASTTX_SUSPEND_Pos (8UL)       /*!< Position of LASTTX_SUSPEND field.                                    */
  #define TWIM_SHORTS_LASTTX_SUSPEND_Msk (0x1UL << TWIM_SHORTS_LASTTX_SUSPEND_Pos) /*!< Bit mask of LASTTX_SUSPEND field.      */
  #define TWIM_SHORTS_LASTTX_SUSPEND_Min (0x0UL)     /*!< Min enumerator value of LASTTX_SUSPEND field.                        */
  #define TWIM_SHORTS_LASTTX_SUSPEND_Max (0x1UL)     /*!< Max enumerator value of LASTTX_SUSPEND field.                        */
  #define TWIM_SHORTS_LASTTX_SUSPEND_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define TWIM_SHORTS_LASTTX_SUSPEND_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* LASTTX_STOP @Bit 9 : Shortcut between event LASTTX and task STOP */
  #define TWIM_SHORTS_LASTTX_STOP_Pos (9UL)          /*!< Position of LASTTX_STOP field.                                       */
  #define TWIM_SHORTS_LASTTX_STOP_Msk (0x1UL << TWIM_SHORTS_LASTTX_STOP_Pos) /*!< Bit mask of LASTTX_STOP field.               */
  #define TWIM_SHORTS_LASTTX_STOP_Min (0x0UL)        /*!< Min enumerator value of LASTTX_STOP field.                           */
  #define TWIM_SHORTS_LASTTX_STOP_Max (0x1UL)        /*!< Max enumerator value of LASTTX_STOP field.                           */
  #define TWIM_SHORTS_LASTTX_STOP_Disabled (0x0UL)   /*!< Disable shortcut                                                     */
  #define TWIM_SHORTS_LASTTX_STOP_Enabled (0x1UL)    /*!< Enable shortcut                                                      */

/* LASTRX_STARTTX @Bit 10 : Shortcut between event LASTRX and task STARTTX */
  #define TWIM_SHORTS_LASTRX_STARTTX_Pos (10UL)      /*!< Position of LASTRX_STARTTX field.                                    */
  #define TWIM_SHORTS_LASTRX_STARTTX_Msk (0x1UL << TWIM_SHORTS_LASTRX_STARTTX_Pos) /*!< Bit mask of LASTRX_STARTTX field.      */
  #define TWIM_SHORTS_LASTRX_STARTTX_Min (0x0UL)     /*!< Min enumerator value of LASTRX_STARTTX field.                        */
  #define TWIM_SHORTS_LASTRX_STARTTX_Max (0x1UL)     /*!< Max enumerator value of LASTRX_STARTTX field.                        */
  #define TWIM_SHORTS_LASTRX_STARTTX_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define TWIM_SHORTS_LASTRX_STARTTX_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* LASTRX_SUSPEND @Bit 11 : Shortcut between event LASTRX and task SUSPEND */
  #define TWIM_SHORTS_LASTRX_SUSPEND_Pos (11UL)      /*!< Position of LASTRX_SUSPEND field.                                    */
  #define TWIM_SHORTS_LASTRX_SUSPEND_Msk (0x1UL << TWIM_SHORTS_LASTRX_SUSPEND_Pos) /*!< Bit mask of LASTRX_SUSPEND field.      */
  #define TWIM_SHORTS_LASTRX_SUSPEND_Min (0x0UL)     /*!< Min enumerator value of LASTRX_SUSPEND field.                        */
  #define TWIM_SHORTS_LASTRX_SUSPEND_Max (0x1UL)     /*!< Max enumerator value of LASTRX_SUSPEND field.                        */
  #define TWIM_SHORTS_LASTRX_SUSPEND_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define TWIM_SHORTS_LASTRX_SUSPEND_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* LASTRX_STOP @Bit 12 : Shortcut between event LASTRX and task STOP */
  #define TWIM_SHORTS_LASTRX_STOP_Pos (12UL)         /*!< Position of LASTRX_STOP field.                                       */
  #define TWIM_SHORTS_LASTRX_STOP_Msk (0x1UL << TWIM_SHORTS_LASTRX_STOP_Pos) /*!< Bit mask of LASTRX_STOP field.               */
  #define TWIM_SHORTS_LASTRX_STOP_Min (0x0UL)        /*!< Min enumerator value of LASTRX_STOP field.                           */
  #define TWIM_SHORTS_LASTRX_STOP_Max (0x1UL)        /*!< Max enumerator value of LASTRX_STOP field.                           */
  #define TWIM_SHORTS_LASTRX_STOP_Disabled (0x0UL)   /*!< Disable shortcut                                                     */
  #define TWIM_SHORTS_LASTRX_STOP_Enabled (0x1UL)    /*!< Enable shortcut                                                      */

/* DMA_RX_BUSERROR_STOP @Bit 19 : Shortcut between event DMA.RX.BUSERROR and task STOP */
  #define TWIM_SHORTS_DMA_RX_BUSERROR_STOP_Pos (19UL) /*!< Position of DMA_RX_BUSERROR_STOP field.                             */
  #define TWIM_SHORTS_DMA_RX_BUSERROR_STOP_Msk (0x1UL << TWIM_SHORTS_DMA_RX_BUSERROR_STOP_Pos) /*!< Bit mask of
                                                                            DMA_RX_BUSERROR_STOP field.*/                         
  #define TWIM_SHORTS_DMA_RX_BUSERROR_STOP_Min (0x0UL) /*!< Min enumerator value of DMA_RX_BUSERROR_STOP field.                */
  #define TWIM_SHORTS_DMA_RX_BUSERROR_STOP_Max (0x1UL) /*!< Max enumerator value of DMA_RX_BUSERROR_STOP field.                */
  #define TWIM_SHORTS_DMA_RX_BUSERROR_STOP_Disabled (0x0UL) /*!< Disable shortcut                                              */
  #define TWIM_SHORTS_DMA_RX_BUSERROR_STOP_Enabled (0x1UL) /*!< Enable shortcut                                                */

/* DMA_TX_BUSERROR_STOP @Bit 20 : Shortcut between event DMA.TX.BUSERROR and task STOP */
  #define TWIM_SHORTS_DMA_TX_BUSERROR_STOP_Pos (20UL) /*!< Position of DMA_TX_BUSERROR_STOP field.                             */
  #define TWIM_SHORTS_DMA_TX_BUSERROR_STOP_Msk (0x1UL << TWIM_SHORTS_DMA_TX_BUSERROR_STOP_Pos) /*!< Bit mask of
                                                                            DMA_TX_BUSERROR_STOP field.*/                         
  #define TWIM_SHORTS_DMA_TX_BUSERROR_STOP_Min (0x0UL) /*!< Min enumerator value of DMA_TX_BUSERROR_STOP field.                */
  #define TWIM_SHORTS_DMA_TX_BUSERROR_STOP_Max (0x1UL) /*!< Max enumerator value of DMA_TX_BUSERROR_STOP field.                */
  #define TWIM_SHORTS_DMA_TX_BUSERROR_STOP_Disabled (0x0UL) /*!< Disable shortcut                                              */
  #define TWIM_SHORTS_DMA_TX_BUSERROR_STOP_Enabled (0x1UL) /*!< Enable shortcut                                                */

/* DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 @Bit 21 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[1] */
  #define TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Pos (21UL) /*!< Position of DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.   */
  #define TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Msk (0x1UL << TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1
                                                                            field.*/                                              
  #define TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Min (0x0UL) /*!< Min enumerator value of
                                                                         DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.*/               
  #define TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Max (0x1UL) /*!< Max enumerator value of
                                                                         DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.*/               
  #define TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Disabled (0x0UL) /*!< Disable shortcut                                 */
  #define TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Enabled (0x1UL) /*!< Enable shortcut                                   */

/* DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 @Bit 22 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[2] */
  #define TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Pos (22UL) /*!< Position of DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 field.   */
  #define TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Msk (0x1UL << TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2
                                                                            field.*/                                              
  #define TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Min (0x0UL) /*!< Min enumerator value of
                                                                         DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 field.*/               
  #define TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Max (0x1UL) /*!< Max enumerator value of
                                                                         DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 field.*/               
  #define TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Disabled (0x0UL) /*!< Disable shortcut                                 */
  #define TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Enabled (0x1UL) /*!< Enable shortcut                                   */

/* DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0 @Bit 23 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[0] */
  #define TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Pos (23UL) /*!< Position of DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0 field.   */
  #define TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Msk (0x1UL << TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0
                                                                            field.*/                                              
  #define TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Min (0x0UL) /*!< Min enumerator value of
                                                                         DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0 field.*/               
  #define TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Max (0x1UL) /*!< Max enumerator value of
                                                                         DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0 field.*/               
  #define TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Disabled (0x0UL) /*!< Disable shortcut                                 */
  #define TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Enabled (0x1UL) /*!< Enable shortcut                                   */

/* DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1 @Bit 24 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[1] */
  #define TWIM_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Pos (24UL) /*!< Position of DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1 field.   */
  #define TWIM_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Msk (0x1UL << TWIM_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1
                                                                            field.*/                                              
  #define TWIM_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Min (0x0UL) /*!< Min enumerator value of
                                                                         DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1 field.*/               
  #define TWIM_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Max (0x1UL) /*!< Max enumerator value of
                                                                         DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1 field.*/               
  #define TWIM_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Disabled (0x0UL) /*!< Disable shortcut                                 */
  #define TWIM_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Enabled (0x1UL) /*!< Enable shortcut                                   */

/* DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0 @Bit 25 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.DISABLEMATCH[n] */
  #define TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Pos (25UL) /*!< Position of DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0 field. */
  #define TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Msk (0x1UL << TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0
                                                                            field.*/                                              
  #define TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Min (0x0UL) /*!< Min enumerator value of
                                                                          DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0 field.*/             
  #define TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Max (0x1UL) /*!< Max enumerator value of
                                                                          DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0 field.*/             
  #define TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Disabled (0x0UL) /*!< Disable shortcut                                */
  #define TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Enabled (0x1UL) /*!< Enable shortcut                                  */

/* DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1 @Bit 26 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.DISABLEMATCH[n] */
  #define TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Pos (26UL) /*!< Position of DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1 field. */
  #define TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Msk (0x1UL << TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1
                                                                            field.*/                                              
  #define TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Min (0x0UL) /*!< Min enumerator value of
                                                                          DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1 field.*/             
  #define TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Max (0x1UL) /*!< Max enumerator value of
                                                                          DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1 field.*/             
  #define TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Disabled (0x0UL) /*!< Disable shortcut                                */
  #define TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Enabled (0x1UL) /*!< Enable shortcut                                  */

/* DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2 @Bit 27 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.DISABLEMATCH[n] */
  #define TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Pos (27UL) /*!< Position of DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2 field. */
  #define TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Msk (0x1UL << TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2
                                                                            field.*/                                              
  #define TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Min (0x0UL) /*!< Min enumerator value of
                                                                          DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2 field.*/             
  #define TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Max (0x1UL) /*!< Max enumerator value of
                                                                          DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2 field.*/             
  #define TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Disabled (0x0UL) /*!< Disable shortcut                                */
  #define TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Enabled (0x1UL) /*!< Enable shortcut                                  */

/* DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3 @Bit 28 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.DISABLEMATCH[n] */
  #define TWIM_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Pos (28UL) /*!< Position of DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3 field. */
  #define TWIM_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Msk (0x1UL << TWIM_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3
                                                                            field.*/                                              
  #define TWIM_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Min (0x0UL) /*!< Min enumerator value of
                                                                          DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3 field.*/             
  #define TWIM_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Max (0x1UL) /*!< Max enumerator value of
                                                                          DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3 field.*/             
  #define TWIM_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Disabled (0x0UL) /*!< Disable shortcut                                */
  #define TWIM_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Enabled (0x1UL) /*!< Enable shortcut                                  */


