adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TWIS_SUBSCRIBE_RESUME: Subscribe configuration for task RESUME */
  #define TWIS_SUBSCRIBE_RESUME_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_RESUME register.                       */

/* CHIDX @Bits 0..7 : DPPI channel that task RESUME will subscribe to */
  #define TWIS_SUBSCRIBE_RESUME_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define TWIS_SUBSCRIBE_RESUME_CHIDX_Msk (0xFFUL << TWIS_SUBSCRIBE_RESUME_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define TWIS_SUBSCRIBE_RESUME_CHIDX_Min (0x0UL)    /*!< Min value of CHIDX field.                                            */
  #define TWIS_SUBSCRIBE_RESUME_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_SUBSCRIBE_RESUME_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define TWIS_SUBSCRIBE_RESUME_EN_Msk (0x1UL << TWIS_SUBSCRIBE_RESUME_EN_Pos) /*!< Bit mask of EN field.                      */
  #define TWIS_SUBSCRIBE_RESUME_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define TWIS_SUBSCRIBE_RESUME_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define TWIS_SUBSCRIBE_RESUME_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define TWIS_SUBSCRIBE_RESUME_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* TWIS_SUBSCRIBE_PREPARERX: Subscribe configuration for task PREPARERX */
  #define TWIS_SUBSCRIBE_PREPARERX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_PREPARERX register.                 */

/* CHIDX @Bits 0..7 : DPPI channel that task PREPARERX will subscribe to */
  #define TWIS_SUBSCRIBE_PREPARERX_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define TWIS_SUBSCRIBE_PREPARERX_CHIDX_Msk (0xFFUL << TWIS_SUBSCRIBE_PREPARERX_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define TWIS_SUBSCRIBE_PREPARERX_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                            */
  #define TWIS_SUBSCRIBE_PREPARERX_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_SUBSCRIBE_PREPARERX_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define TWIS_SUBSCRIBE_PREPARERX_EN_Msk (0x1UL << TWIS_SUBSCRIBE_PREPARERX_EN_Pos) /*!< Bit mask of EN field.                */
  #define TWIS_SUBSCRIBE_PREPARERX_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define TWIS_SUBSCRIBE_PREPARERX_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define TWIS_SUBSCRIBE_PREPARERX_EN_Disabled (0x0UL) /*!< Disable subscription                                               */
  #define TWIS_SUBSCRIBE_PREPARERX_EN_Enabled (0x1UL) /*!< Enable subscription                                                 */


/* TWIS_SUBSCRIBE_PREPARETX: Subscribe configuration for task PREPARETX */
  #define TWIS_SUBSCRIBE_PREPARETX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_PREPARETX register.                 */

/* CHIDX @Bits 0..7 : DPPI channel that task PREPARETX will subscribe to */
  #define TWIS_SUBSCRIBE_PREPARETX_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define TWIS_SUBSCRIBE_PREPARETX_CHIDX_Msk (0xFFUL << TWIS_SUBSCRIBE_PREPARETX_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define TWIS_SUBSCRIBE_PREPARETX_CHIDX_Min (0x0UL) /*!< Min value of CHIDX field.                                            */
  #define TWIS_SUBSCRIBE_PREPARETX_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_SUBSCRIBE_PREPARETX_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define TWIS_SUBSCRIBE_PREPARETX_EN_Msk (0x1UL << TWIS_SUBSCRIBE_PREPARETX_EN_Pos) /*!< Bit mask of EN field.                */
  #define TWIS_SUBSCRIBE_PREPARETX_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define TWIS_SUBSCRIBE_PREPARETX_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define TWIS_SUBSCRIBE_PREPARETX_EN_Disabled (0x0UL) /*!< Disable subscription                                               */
  #define TWIS_SUBSCRIBE_PREPARETX_EN_Enabled (0x1UL) /*!< Enable subscription                                                 */


/* TWIS_EVENTS_STARTED: TWI started */
  #define TWIS_EVENTS_STARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STARTED register.                           */

/* EVENTS_STARTED @Bit 0 : TWI started */
  #define TWIS_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL) /*!< Position of EVENTS_STARTED field.                                  */
  #define TWIS_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << TWIS_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/                               
  #define TWIS_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STARTED field.                    */
  #define TWIS_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STARTED field.                    */
  #define TWIS_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define TWIS_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL) /*!< Event generated                                            */


/* TWIS_EVENTS_STOPPED: TWI stopped */
  #define TWIS_EVENTS_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STOPPED register.                           */

/* EVENTS_STOPPED @Bit 0 : TWI stopped */
  #define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL) /*!< Position of EVENTS_STOPPED field.                                  */
  #define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_STOPPED field.*/                               
  #define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STOPPED field.                    */
  #define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STOPPED field.                    */
  #define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL) /*!< Event generated                                            */


/* TWIS_EVENTS_ERROR: TWI error */
  #define TWIS_EVENTS_ERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERROR register.                               */

/* EVENTS_ERROR @Bit 0 : TWI error */
  #define TWIS_EVENTS_ERROR_EVENTS_ERROR_Pos (0UL)   /*!< Position of EVENTS_ERROR field.                                      */
  #define TWIS_EVENTS_ERROR_EVENTS_ERROR_Msk (0x1UL << TWIS_EVENTS_ERROR_EVENTS_ERROR_Pos) /*!< Bit mask of EVENTS_ERROR field.*/
  #define TWIS_EVENTS_ERROR_EVENTS_ERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERROR field.                          */
  #define TWIS_EVENTS_ERROR_EVENTS_ERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERROR field.                          */
  #define TWIS_EVENTS_ERROR_EVENTS_ERROR_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define TWIS_EVENTS_ERROR_EVENTS_ERROR_Generated (0x1UL) /*!< Event generated                                                */


/* TWIS_EVENTS_NACKTX: NACK on TX */
  #define TWIS_EVENTS_NACKTX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_NACKTX register.                             */

