adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TWIS_PUBLISH_STARTED: Publish configuration for event STARTED */
  #define TWIS_PUBLISH_STARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STARTED register.                         */

/* CHIDX @Bits 0..7 : DPPI channel that event STARTED will publish to */
  #define TWIS_PUBLISH_STARTED_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_STARTED_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_STARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define TWIS_PUBLISH_STARTED_CHIDX_Min (0x0UL)     /*!< Min value of CHIDX field.                                            */
  #define TWIS_PUBLISH_STARTED_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_STARTED_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_STARTED_EN_Msk (0x1UL << TWIS_PUBLISH_STARTED_EN_Pos) /*!< Bit mask of EN field.                        */
  #define TWIS_PUBLISH_STARTED_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_STARTED_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_STARTED_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define TWIS_PUBLISH_STARTED_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* TWIS_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define TWIS_PUBLISH_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STOPPED register.                         */

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define TWIS_PUBLISH_STOPPED_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_STOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define TWIS_PUBLISH_STOPPED_CHIDX_Min (0x0UL)     /*!< Min value of CHIDX field.                                            */
  #define TWIS_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_STOPPED_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_STOPPED_EN_Msk (0x1UL << TWIS_PUBLISH_STOPPED_EN_Pos) /*!< Bit mask of EN field.                        */
  #define TWIS_PUBLISH_STOPPED_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_STOPPED_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_STOPPED_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define TWIS_PUBLISH_STOPPED_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* TWIS_PUBLISH_ERROR: Publish configuration for event ERROR */
  #define TWIS_PUBLISH_ERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ERROR register.                             */

/* CHIDX @Bits 0..7 : DPPI channel that event ERROR will publish to */
  #define TWIS_PUBLISH_ERROR_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_ERROR_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_ERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define TWIS_PUBLISH_ERROR_CHIDX_Min (0x0UL)       /*!< Min value of CHIDX field.                                            */
  #define TWIS_PUBLISH_ERROR_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_ERROR_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_ERROR_EN_Msk (0x1UL << TWIS_PUBLISH_ERROR_EN_Pos) /*!< Bit mask of EN field.                            */
  #define TWIS_PUBLISH_ERROR_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_ERROR_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_ERROR_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define TWIS_PUBLISH_ERROR_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* TWIS_PUBLISH_NACKTX: Publish configuration for event NACKTX */
  #define TWIS_PUBLISH_NACKTX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_NACKTX register.                           */

/* CHIDX @Bits 0..7 : DPPI channel that event NACKTX will publish to */
  #define TWIS_PUBLISH_NACKTX_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_NACKTX_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_NACKTX_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define TWIS_PUBLISH_NACKTX_CHIDX_Min (0x0UL)      /*!< Min value of CHIDX field.                                            */
  #define TWIS_PUBLISH_NACKTX_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_NACKTX_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_NACKTX_EN_Msk (0x1UL << TWIS_PUBLISH_NACKTX_EN_Pos) /*!< Bit mask of EN field.                          */
  #define TWIS_PUBLISH_NACKTX_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_NACKTX_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_NACKTX_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define TWIS_PUBLISH_NACKTX_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


