adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TWIS_PUBLISH_CSSTOPPED: Publish configuration for event CSSTOPPED */
  #define TWIS_PUBLISH_CSSTOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_CSSTOPPED register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that event CSSTOPPED will publish to */
  #define TWIS_PUBLISH_CSSTOPPED_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_CSSTOPPED_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_CSSTOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define TWIS_PUBLISH_CSSTOPPED_CHIDX_Min (0x0UL)   /*!< Min value of CHIDX field.                                            */
  #define TWIS_PUBLISH_CSSTOPPED_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_CSSTOPPED_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_CSSTOPPED_EN_Msk (0x1UL << TWIS_PUBLISH_CSSTOPPED_EN_Pos) /*!< Bit mask of EN field.                    */
  #define TWIS_PUBLISH_CSSTOPPED_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_CSSTOPPED_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_CSSTOPPED_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define TWIS_PUBLISH_CSSTOPPED_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* TWIS_SHORTS: Shortcuts between local events and tasks */
  #define TWIS_SHORTS_ResetValue (0x00000000UL)      /*!< Reset value of SHORTS register.                                      */

/* WRITE_SUSPEND @Bit 13 : Shortcut between event WRITE and task SUSPEND */
  #define TWIS_SHORTS_WRITE_SUSPEND_Pos (13UL)       /*!< Position of WRITE_SUSPEND field.                                     */
  #define TWIS_SHORTS_WRITE_SUSPEND_Msk (0x1UL << TWIS_SHORTS_WRITE_SUSPEND_Pos) /*!< Bit mask of WRITE_SUSPEND field.         */
  #define TWIS_SHORTS_WRITE_SUSPEND_Min (0x0UL)      /*!< Min enumerator value of WRITE_SUSPEND field.                         */
  #define TWIS_SHORTS_WRITE_SUSPEND_Max (0x1UL)      /*!< Max enumerator value of WRITE_SUSPEND field.                         */
  #define TWIS_SHORTS_WRITE_SUSPEND_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define TWIS_SHORTS_WRITE_SUSPEND_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* READ_SUSPEND @Bit 14 : Shortcut between event READ and task SUSPEND */
  #define TWIS_SHORTS_READ_SUSPEND_Pos (14UL)        /*!< Position of READ_SUSPEND field.                                      */
  #define TWIS_SHORTS_READ_SUSPEND_Msk (0x1UL << TWIS_SHORTS_READ_SUSPEND_Pos) /*!< Bit mask of READ_SUSPEND field.            */
  #define TWIS_SHORTS_READ_SUSPEND_Min (0x0UL)       /*!< Min enumerator value of READ_SUSPEND field.                          */
  #define TWIS_SHORTS_READ_SUSPEND_Max (0x1UL)       /*!< Max enumerator value of READ_SUSPEND field.                          */
  #define TWIS_SHORTS_READ_SUSPEND_Disabled (0x0UL)  /*!< Disable shortcut                                                     */
  #define TWIS_SHORTS_READ_SUSPEND_Enabled (0x1UL)   /*!< Enable shortcut                                                      */

/* WRITE_PREPARERX @Bit 15 : Shortcut between event WRITE and task PREPARERX */
  #define TWIS_SHORTS_WRITE_PREPARERX_Pos (15UL)     /*!< Position of WRITE_PREPARERX field.                                   */
  #define TWIS_SHORTS_WRITE_PREPARERX_Msk (0x1UL << TWIS_SHORTS_WRITE_PREPARERX_Pos) /*!< Bit mask of WRITE_PREPARERX field.   */
  #define TWIS_SHORTS_WRITE_PREPARERX_Min (0x0UL)    /*!< Min enumerator value of WRITE_PREPARERX field.                       */
  #define TWIS_SHORTS_WRITE_PREPARERX_Max (0x1UL)    /*!< Max enumerator value of WRITE_PREPARERX field.                       */
  #define TWIS_SHORTS_WRITE_PREPARERX_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define TWIS_SHORTS_WRITE_PREPARERX_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* READ_PREPARETX @Bit 16 : Shortcut between event READ and task PREPARETX */
  #define TWIS_SHORTS_READ_PREPARETX_Pos (16UL)      /*!< Position of READ_PREPARETX field.                                    */
  #define TWIS_SHORTS_READ_PREPARETX_Msk (0x1UL << TWIS_SHORTS_READ_PREPARETX_Pos) /*!< Bit mask of READ_PREPARETX field.      */
  #define TWIS_SHORTS_READ_PREPARETX_Min (0x0UL)     /*!< Min enumerator value of READ_PREPARETX field.                        */
  #define TWIS_SHORTS_READ_PREPARETX_Max (0x1UL)     /*!< Max enumerator value of READ_PREPARETX field.                        */
  #define TWIS_SHORTS_READ_PREPARETX_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define TWIS_SHORTS_READ_PREPARETX_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* DMA_RX_BUSERROR_STOP @Bit 19 : Shortcut between event DMA.RX.BUSERROR and task STOP */
  #define TWIS_SHORTS_DMA_RX_BUSERROR_STOP_Pos (19UL) /*!< Position of DMA_RX_BUSERROR_STOP field.                             */
  #define TWIS_SHORTS_DMA_RX_BUSERROR_STOP_Msk (0x1UL << TWIS_SHORTS_DMA_RX_BUSERROR_STOP_Pos) /*!< Bit mask of
                                                                            DMA_RX_BUSERROR_STOP field.*/                         
  #define TWIS_SHORTS_DMA_RX_BUSERROR_STOP_Min (0x0UL) /*!< Min enumerator value of DMA_RX_BUSERROR_STOP field.                */
  #define TWIS_SHORTS_DMA_RX_BUSERROR_STOP_Max (0x1UL) /*!< Max enumerator value of DMA_RX_BUSERROR_STOP field.                */
  #define TWIS_SHORTS_DMA_RX_BUSERROR_STOP_Disabled (0x0UL) /*!< Disable shortcut                                              */
  #define TWIS_SHORTS_DMA_RX_BUSERROR_STOP_Enabled (0x1UL) /*!< Enable shortcut                                                */

/* DMA_TX_BUSERROR_STOP @Bit 20 : Shortcut between event DMA.TX.BUSERROR and task STOP */
  #define TWIS_SHORTS_DMA_TX_BUSERROR_STOP_Pos (20UL) /*!< Position of DMA_TX_BUSERROR_STOP field.                             */
  #define TWIS_SHORTS_DMA_TX_BUSERROR_STOP_Msk (0x1UL << TWIS_SHORTS_DMA_TX_BUSERROR_STOP_Pos) /*!< Bit mask of
                                                                            DMA_TX_BUSERROR_STOP field.*/                         
  #define TWIS_SHORTS_DMA_TX_BUSERROR_STOP_Min (0x0UL) /*!< Min enumerator value of DMA_TX_BUSERROR_STOP field.                */
  #define TWIS_SHORTS_DMA_TX_BUSERROR_STOP_Max (0x1UL) /*!< Max enumerator value of DMA_TX_BUSERROR_STOP field.                */
  #define TWIS_SHORTS_DMA_TX_BUSERROR_STOP_Disabled (0x0UL) /*!< Disable shortcut                                              */
  #define TWIS_SHORTS_DMA_TX_BUSERROR_STOP_Enabled (0x1UL) /*!< Enable shortcut                                                */

/* DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 @Bit 21 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[1] */
  #define TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Pos (21UL) /*!< Position of DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.   */
  #define TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Msk (0x1UL << TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1
                                                                            field.*/                                              
  #define TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Min (0x0UL) /*!< Min enumerator value of
                                                                         DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.*/               
  #define TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Max (0x1UL) /*!< Max enumerator value of
                                                                         DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.*/               
  #define TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Disabled (0x0UL) /*!< Disable shortcut                                 */
  #define TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Enabled (0x1UL) /*!< Enable shortcut                                   */

/* DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 @Bit 22 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[2] */
  #define TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Pos (22UL) /*!< Position of DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 field.   */
  #define TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Msk (0x1UL << TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2
                                                                            field.*/                                              
  #define TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Min (0x0UL) /*!< Min enumerator value of
                                                                         DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 field.*/               
  #define TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Max (0x1UL) /*!< Max enumerator value of
                                                                         DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 field.*/               
  #define TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Disabled (0x0UL) /*!< Disable shortcut                                 */
  #define TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Enabled (0x1UL) /*!< Enable shortcut                                   */

/* DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0 @Bit 23 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[0] */
  #define TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Pos (23UL) /*!< Position of DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0 field.   */
  #define TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Msk (0x1UL << TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0
                                                                            field.*/                                              
  #define TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Min (0x0UL) /*!< Min enumerator value of
                                                                         DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0 field.*/               
  #define TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Max (0x1UL) /*!< Max enumerator value of
                                                                         DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0 field.*/               
  #define TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Disabled (0x0UL) /*!< Disable shortcut                                 */
  #define TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Enabled (0x1UL) /*!< Enable shortcut                                   */

/* DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1 @Bit 24 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[1] */
  #define TWIS_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Pos (24UL) /*!< Position of DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1 field.   */
  #define TWIS_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Msk (0x1UL << TWIS_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1
                                                                            field.*/                                              
  #define TWIS_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Min (0x0UL) /*!< Min enumerator value of
                                                                         DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1 field.*/               
  #define TWIS_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Max (0x1UL) /*!< Max enumerator value of
                                                                         DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1 field.*/               
  #define TWIS_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Disabled (0x0UL) /*!< Disable shortcut                                 */
  #define TWIS_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Enabled (0x1UL) /*!< Enable shortcut                                   */

/* DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0 @Bit 25 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.DISABLEMATCH[n] */
  #define TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Pos (25UL) /*!< Position of DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0 field. */
  #define TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Msk (0x1UL << TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0
                                                                            field.*/                                              
  #define TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Min (0x0UL) /*!< Min enumerator value of
                                                                          DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0 field.*/             
  #define TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Max (0x1UL) /*!< Max enumerator value of
                                                                          DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0 field.*/             
  #define TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Disabled (0x0UL) /*!< Disable shortcut                                */
  #define TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Enabled (0x1UL) /*!< Enable shortcut                                  */

/* DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1 @Bit 26 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.DISABLEMATCH[n] */
  #define TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Pos (26UL) /*!< Position of DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1 field. */
  #define TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Msk (0x1UL << TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1
                                                                            field.*/                                              
  #define TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Min (0x0UL) /*!< Min enumerator value of
                                                                          DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1 field.*/             
  #define TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Max (0x1UL) /*!< Max enumerator value of
                                                                          DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1 field.*/             
  #define TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Disabled (0x0UL) /*!< Disable shortcut                                */
  #define TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Enabled (0x1UL) /*!< Enable shortcut                                  */

/* DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2 @Bit 27 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.DISABLEMATCH[n] */
  #define TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Pos (27UL) /*!< Position of DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2 field. */
  #define TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Msk (0x1UL << TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2
                                                                            field.*/                                              
  #define TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Min (0x0UL) /*!< Min enumerator value of
                                                                          DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2 field.*/             
  #define TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Max (0x1UL) /*!< Max enumerator value of
                                                                          DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2 field.*/             
  #define TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Disabled (0x0UL) /*!< Disable shortcut                                */
  #define TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Enabled (0x1UL) /*!< Enable shortcut                                  */

/* DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3 @Bit 28 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.DISABLEMATCH[n] */
  #define TWIS_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Pos (28UL) /*!< Position of DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3 field. */
  #define TWIS_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Msk (0x1UL << TWIS_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3
                                                                            field.*/                                              
  #define TWIS_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Min (0x0UL) /*!< Min enumerator value of
                                                                          DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3 field.*/             
  #define TWIS_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Max (0x1UL) /*!< Max enumerator value of
                                                                          DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3 field.*/             
  #define TWIS_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Disabled (0x0UL) /*!< Disable shortcut                                */
  #define TWIS_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Enabled (0x1UL) /*!< Enable shortcut                                  */


/* TWIS_INTEN: Enable or disable interrupt */
  #define TWIS_INTEN_ResetValue (0x00000000UL)       /*!< Reset value of INTEN register.                                       */

/* STARTED @Bit 0 : Enable or disable interrupt for event STARTED */
  #define TWIS_INTEN_STARTED_Pos (0UL)               /*!< Position of STARTED field.                                           */
  #define TWIS_INTEN_STARTED_Msk (0x1UL << TWIS_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field.                             */
  #define TWIS_INTEN_STARTED_Min (0x0UL)             /*!< Min enumerator value of STARTED field.                               */
  #define TWIS_INTEN_STARTED_Max (0x1UL)             /*!< Max enumerator value of STARTED field.                               */
  #define TWIS_INTEN_STARTED_Disabled (0x0UL)        /*!< Disable                                                              */
  #define TWIS_INTEN_STARTED_Enabled (0x1UL)         /*!< Enable                                                               */

