adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* STOPPED @Bit 1 : Enable or disable interrupt for event STOPPED */
  #define TWIS_INTEN_STOPPED_Pos (1UL)               /*!< Position of STOPPED field.                                           */
  #define TWIS_INTEN_STOPPED_Msk (0x1UL << TWIS_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                             */
  #define TWIS_INTEN_STOPPED_Min (0x0UL)             /*!< Min enumerator value of STOPPED field.                               */
  #define TWIS_INTEN_STOPPED_Max (0x1UL)             /*!< Max enumerator value of STOPPED field.                               */
  #define TWIS_INTEN_STOPPED_Disabled (0x0UL)        /*!< Disable                                                              */
  #define TWIS_INTEN_STOPPED_Enabled (0x1UL)         /*!< Enable                                                               */

/* ERROR @Bit 5 : Enable or disable interrupt for event ERROR */
  #define TWIS_INTEN_ERROR_Pos (5UL)                 /*!< Position of ERROR field.                                             */
  #define TWIS_INTEN_ERROR_Msk (0x1UL << TWIS_INTEN_ERROR_Pos) /*!< Bit mask of ERROR field.                                   */
  #define TWIS_INTEN_ERROR_Min (0x0UL)               /*!< Min enumerator value of ERROR field.                                 */
  #define TWIS_INTEN_ERROR_Max (0x1UL)               /*!< Max enumerator value of ERROR field.                                 */
  #define TWIS_INTEN_ERROR_Disabled (0x0UL)          /*!< Disable                                                              */
  #define TWIS_INTEN_ERROR_Enabled (0x1UL)           /*!< Enable                                                               */

/* NACKTX @Bit 7 : Enable or disable interrupt for event NACKTX */
  #define TWIS_INTEN_NACKTX_Pos (7UL)                /*!< Position of NACKTX field.                                            */
  #define TWIS_INTEN_NACKTX_Msk (0x1UL << TWIS_INTEN_NACKTX_Pos) /*!< Bit mask of NACKTX field.                                */
  #define TWIS_INTEN_NACKTX_Min (0x0UL)              /*!< Min enumerator value of NACKTX field.                                */
  #define TWIS_INTEN_NACKTX_Max (0x1UL)              /*!< Max enumerator value of NACKTX field.                                */
  #define TWIS_INTEN_NACKTX_Disabled (0x0UL)         /*!< Disable                                                              */
  #define TWIS_INTEN_NACKTX_Enabled (0x1UL)          /*!< Enable                                                               */

/* BB @Bit 8 : Enable or disable interrupt for event BB */
  #define TWIS_INTEN_BB_Pos (8UL)                    /*!< Position of BB field.                                                */
  #define TWIS_INTEN_BB_Msk (0x1UL << TWIS_INTEN_BB_Pos) /*!< Bit mask of BB field.                                            */
  #define TWIS_INTEN_BB_Min (0x0UL)                  /*!< Min enumerator value of BB field.                                    */
  #define TWIS_INTEN_BB_Max (0x1UL)                  /*!< Max enumerator value of BB field.                                    */
  #define TWIS_INTEN_BB_Disabled (0x0UL)             /*!< Disable                                                              */
  #define TWIS_INTEN_BB_Enabled (0x1UL)              /*!< Enable                                                               */

/* WRITE @Bit 15 : Enable or disable interrupt for event WRITE */
  #define TWIS_INTEN_WRITE_Pos (15UL)                /*!< Position of WRITE field.                                             */
  #define TWIS_INTEN_WRITE_Msk (0x1UL << TWIS_INTEN_WRITE_Pos) /*!< Bit mask of WRITE field.                                   */
  #define TWIS_INTEN_WRITE_Min (0x0UL)               /*!< Min enumerator value of WRITE field.                                 */
  #define TWIS_INTEN_WRITE_Max (0x1UL)               /*!< Max enumerator value of WRITE field.                                 */
  #define TWIS_INTEN_WRITE_Disabled (0x0UL)          /*!< Disable                                                              */
  #define TWIS_INTEN_WRITE_Enabled (0x1UL)           /*!< Enable                                                               */

/* READ @Bit 16 : Enable or disable interrupt for event READ */
  #define TWIS_INTEN_READ_Pos (16UL)                 /*!< Position of READ field.                                              */
  #define TWIS_INTEN_READ_Msk (0x1UL << TWIS_INTEN_READ_Pos) /*!< Bit mask of READ field.                                      */
  #define TWIS_INTEN_READ_Min (0x0UL)                /*!< Min enumerator value of READ field.                                  */
  #define TWIS_INTEN_READ_Max (0x1UL)                /*!< Max enumerator value of READ field.                                  */
  #define TWIS_INTEN_READ_Disabled (0x0UL)           /*!< Disable                                                              */
  #define TWIS_INTEN_READ_Enabled (0x1UL)            /*!< Enable                                                               */

/* CSSTARTED @Bit 17 : Enable or disable interrupt for event CSSTARTED */
  #define TWIS_INTEN_CSSTARTED_Pos (17UL)            /*!< Position of CSSTARTED field.                                         */
  #define TWIS_INTEN_CSSTARTED_Msk (0x1UL << TWIS_INTEN_CSSTARTED_Pos) /*!< Bit mask of CSSTARTED field.                       */
  #define TWIS_INTEN_CSSTARTED_Min (0x0UL)           /*!< Min enumerator value of CSSTARTED field.                             */
  #define TWIS_INTEN_CSSTARTED_Max (0x1UL)           /*!< Max enumerator value of CSSTARTED field.                             */
  #define TWIS_INTEN_CSSTARTED_Disabled (0x0UL)      /*!< Disable                                                              */
  #define TWIS_INTEN_CSSTARTED_Enabled (0x1UL)       /*!< Enable                                                               */

/* CSSTOPPED @Bit 18 : Enable or disable interrupt for event CSSTOPPED */
  #define TWIS_INTEN_CSSTOPPED_Pos (18UL)            /*!< Position of CSSTOPPED field.                                         */
  #define TWIS_INTEN_CSSTOPPED_Msk (0x1UL << TWIS_INTEN_CSSTOPPED_Pos) /*!< Bit mask of CSSTOPPED field.                       */
  #define TWIS_INTEN_CSSTOPPED_Min (0x0UL)           /*!< Min enumerator value of CSSTOPPED field.                             */
  #define TWIS_INTEN_CSSTOPPED_Max (0x1UL)           /*!< Max enumerator value of CSSTOPPED field.                             */
  #define TWIS_INTEN_CSSTOPPED_Disabled (0x0UL)      /*!< Disable                                                              */
  #define TWIS_INTEN_CSSTOPPED_Enabled (0x1UL)       /*!< Enable                                                               */

/* DMARXEND @Bit 19 : Enable or disable interrupt for event DMARXEND */
  #define TWIS_INTEN_DMARXEND_Pos (19UL)             /*!< Position of DMARXEND field.                                          */
  #define TWIS_INTEN_DMARXEND_Msk (0x1UL << TWIS_INTEN_DMARXEND_Pos) /*!< Bit mask of DMARXEND field.                          */
  #define TWIS_INTEN_DMARXEND_Min (0x0UL)            /*!< Min enumerator value of DMARXEND field.                              */
  #define TWIS_INTEN_DMARXEND_Max (0x1UL)            /*!< Max enumerator value of DMARXEND field.                              */
  #define TWIS_INTEN_DMARXEND_Disabled (0x0UL)       /*!< Disable                                                              */
  #define TWIS_INTEN_DMARXEND_Enabled (0x1UL)        /*!< Enable                                                               */

