adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DMARXREADY @Bit 20 : Enable or disable interrupt for event DMARXREADY */
  #define TWIS_INTEN_DMARXREADY_Pos (20UL)           /*!< Position of DMARXREADY field.                                        */
  #define TWIS_INTEN_DMARXREADY_Msk (0x1UL << TWIS_INTEN_DMARXREADY_Pos) /*!< Bit mask of DMARXREADY field.                    */
  #define TWIS_INTEN_DMARXREADY_Min (0x0UL)          /*!< Min enumerator value of DMARXREADY field.                            */
  #define TWIS_INTEN_DMARXREADY_Max (0x1UL)          /*!< Max enumerator value of DMARXREADY field.                            */
  #define TWIS_INTEN_DMARXREADY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define TWIS_INTEN_DMARXREADY_Enabled (0x1UL)      /*!< Enable                                                               */

/* DMARXBUSERROR @Bit 21 : Enable or disable interrupt for event DMARXBUSERROR */
  #define TWIS_INTEN_DMARXBUSERROR_Pos (21UL)        /*!< Position of DMARXBUSERROR field.                                     */
  #define TWIS_INTEN_DMARXBUSERROR_Msk (0x1UL << TWIS_INTEN_DMARXBUSERROR_Pos) /*!< Bit mask of DMARXBUSERROR field.           */
  #define TWIS_INTEN_DMARXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of DMARXBUSERROR field.                         */
  #define TWIS_INTEN_DMARXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of DMARXBUSERROR field.                         */
  #define TWIS_INTEN_DMARXBUSERROR_Disabled (0x0UL)  /*!< Disable                                                              */
  #define TWIS_INTEN_DMARXBUSERROR_Enabled (0x1UL)   /*!< Enable                                                               */

/* DMARXMATCH0 @Bit 22 : Enable or disable interrupt for event DMARXMATCH[0] */
  #define TWIS_INTEN_DMARXMATCH0_Pos (22UL)          /*!< Position of DMARXMATCH0 field.                                       */
  #define TWIS_INTEN_DMARXMATCH0_Msk (0x1UL << TWIS_INTEN_DMARXMATCH0_Pos) /*!< Bit mask of DMARXMATCH0 field.                 */
  #define TWIS_INTEN_DMARXMATCH0_Min (0x0UL)         /*!< Min enumerator value of DMARXMATCH0 field.                           */
  #define TWIS_INTEN_DMARXMATCH0_Max (0x1UL)         /*!< Max enumerator value of DMARXMATCH0 field.                           */
  #define TWIS_INTEN_DMARXMATCH0_Disabled (0x0UL)    /*!< Disable                                                              */
  #define TWIS_INTEN_DMARXMATCH0_Enabled (0x1UL)     /*!< Enable                                                               */

/* DMARXMATCH1 @Bit 23 : Enable or disable interrupt for event DMARXMATCH[1] */
  #define TWIS_INTEN_DMARXMATCH1_Pos (23UL)          /*!< Position of DMARXMATCH1 field.                                       */
  #define TWIS_INTEN_DMARXMATCH1_Msk (0x1UL << TWIS_INTEN_DMARXMATCH1_Pos) /*!< Bit mask of DMARXMATCH1 field.                 */
  #define TWIS_INTEN_DMARXMATCH1_Min (0x0UL)         /*!< Min enumerator value of DMARXMATCH1 field.                           */
  #define TWIS_INTEN_DMARXMATCH1_Max (0x1UL)         /*!< Max enumerator value of DMARXMATCH1 field.                           */
  #define TWIS_INTEN_DMARXMATCH1_Disabled (0x0UL)    /*!< Disable                                                              */
  #define TWIS_INTEN_DMARXMATCH1_Enabled (0x1UL)     /*!< Enable                                                               */

/* DMARXMATCH2 @Bit 24 : Enable or disable interrupt for event DMARXMATCH[2] */
  #define TWIS_INTEN_DMARXMATCH2_Pos (24UL)          /*!< Position of DMARXMATCH2 field.                                       */
  #define TWIS_INTEN_DMARXMATCH2_Msk (0x1UL << TWIS_INTEN_DMARXMATCH2_Pos) /*!< Bit mask of DMARXMATCH2 field.                 */
  #define TWIS_INTEN_DMARXMATCH2_Min (0x0UL)         /*!< Min enumerator value of DMARXMATCH2 field.                           */
  #define TWIS_INTEN_DMARXMATCH2_Max (0x1UL)         /*!< Max enumerator value of DMARXMATCH2 field.                           */
  #define TWIS_INTEN_DMARXMATCH2_Disabled (0x0UL)    /*!< Disable                                                              */
  #define TWIS_INTEN_DMARXMATCH2_Enabled (0x1UL)     /*!< Enable                                                               */

/* DMARXMATCH3 @Bit 25 : Enable or disable interrupt for event DMARXMATCH[3] */
  #define TWIS_INTEN_DMARXMATCH3_Pos (25UL)          /*!< Position of DMARXMATCH3 field.                                       */
  #define TWIS_INTEN_DMARXMATCH3_Msk (0x1UL << TWIS_INTEN_DMARXMATCH3_Pos) /*!< Bit mask of DMARXMATCH3 field.                 */
  #define TWIS_INTEN_DMARXMATCH3_Min (0x0UL)         /*!< Min enumerator value of DMARXMATCH3 field.                           */
  #define TWIS_INTEN_DMARXMATCH3_Max (0x1UL)         /*!< Max enumerator value of DMARXMATCH3 field.                           */
  #define TWIS_INTEN_DMARXMATCH3_Disabled (0x0UL)    /*!< Disable                                                              */
  #define TWIS_INTEN_DMARXMATCH3_Enabled (0x1UL)     /*!< Enable                                                               */

/* DMATXEND @Bit 26 : Enable or disable interrupt for event DMATXEND */
  #define TWIS_INTEN_DMATXEND_Pos (26UL)             /*!< Position of DMATXEND field.                                          */
  #define TWIS_INTEN_DMATXEND_Msk (0x1UL << TWIS_INTEN_DMATXEND_Pos) /*!< Bit mask of DMATXEND field.                          */
  #define TWIS_INTEN_DMATXEND_Min (0x0UL)            /*!< Min enumerator value of DMATXEND field.                              */
  #define TWIS_INTEN_DMATXEND_Max (0x1UL)            /*!< Max enumerator value of DMATXEND field.                              */
  #define TWIS_INTEN_DMATXEND_Disabled (0x0UL)       /*!< Disable                                                              */
  #define TWIS_INTEN_DMATXEND_Enabled (0x1UL)        /*!< Enable                                                               */

