adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DMATXREADY @Bit 27 : Enable or disable interrupt for event DMATXREADY */
  #define TWIS_INTEN_DMATXREADY_Pos (27UL)           /*!< Position of DMATXREADY field.                                        */
  #define TWIS_INTEN_DMATXREADY_Msk (0x1UL << TWIS_INTEN_DMATXREADY_Pos) /*!< Bit mask of DMATXREADY field.                    */
  #define TWIS_INTEN_DMATXREADY_Min (0x0UL)          /*!< Min enumerator value of DMATXREADY field.                            */
  #define TWIS_INTEN_DMATXREADY_Max (0x1UL)          /*!< Max enumerator value of DMATXREADY field.                            */
  #define TWIS_INTEN_DMATXREADY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define TWIS_INTEN_DMATXREADY_Enabled (0x1UL)      /*!< Enable                                                               */

/* DMATXBUSERROR @Bit 28 : Enable or disable interrupt for event DMATXBUSERROR */
  #define TWIS_INTEN_DMATXBUSERROR_Pos (28UL)        /*!< Position of DMATXBUSERROR field.                                     */
  #define TWIS_INTEN_DMATXBUSERROR_Msk (0x1UL << TWIS_INTEN_DMATXBUSERROR_Pos) /*!< Bit mask of DMATXBUSERROR field.           */
  #define TWIS_INTEN_DMATXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of DMATXBUSERROR field.                         */
  #define TWIS_INTEN_DMATXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of DMATXBUSERROR field.                         */
  #define TWIS_INTEN_DMATXBUSERROR_Disabled (0x0UL)  /*!< Disable                                                              */
  #define TWIS_INTEN_DMATXBUSERROR_Enabled (0x1UL)   /*!< Enable                                                               */


/* TWIS_INTENSET: Enable interrupt */
  #define TWIS_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* STARTED @Bit 0 : Write '1' to enable interrupt for event STARTED */
  #define TWIS_INTENSET_STARTED_Pos (0UL)            /*!< Position of STARTED field.                                           */
  #define TWIS_INTENSET_STARTED_Msk (0x1UL << TWIS_INTENSET_STARTED_Pos) /*!< Bit mask of STARTED field.                       */
  #define TWIS_INTENSET_STARTED_Min (0x0UL)          /*!< Min enumerator value of STARTED field.                               */
  #define TWIS_INTENSET_STARTED_Max (0x1UL)          /*!< Max enumerator value of STARTED field.                               */
  #define TWIS_INTENSET_STARTED_Set (0x1UL)          /*!< Enable                                                               */
  #define TWIS_INTENSET_STARTED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_STARTED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define TWIS_INTENSET_STOPPED_Pos (1UL)            /*!< Position of STOPPED field.                                           */
  #define TWIS_INTENSET_STOPPED_Msk (0x1UL << TWIS_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                       */
  #define TWIS_INTENSET_STOPPED_Min (0x0UL)          /*!< Min enumerator value of STOPPED field.                               */
  #define TWIS_INTENSET_STOPPED_Max (0x1UL)          /*!< Max enumerator value of STOPPED field.                               */
  #define TWIS_INTENSET_STOPPED_Set (0x1UL)          /*!< Enable                                                               */
  #define TWIS_INTENSET_STOPPED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_STOPPED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ERROR @Bit 5 : Write '1' to enable interrupt for event ERROR */
  #define TWIS_INTENSET_ERROR_Pos (5UL)              /*!< Position of ERROR field.                                             */
  #define TWIS_INTENSET_ERROR_Msk (0x1UL << TWIS_INTENSET_ERROR_Pos) /*!< Bit mask of ERROR field.                             */
  #define TWIS_INTENSET_ERROR_Min (0x0UL)            /*!< Min enumerator value of ERROR field.                                 */
  #define TWIS_INTENSET_ERROR_Max (0x1UL)            /*!< Max enumerator value of ERROR field.                                 */
  #define TWIS_INTENSET_ERROR_Set (0x1UL)            /*!< Enable                                                               */
  #define TWIS_INTENSET_ERROR_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_ERROR_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* NACKTX @Bit 7 : Write '1' to enable interrupt for event NACKTX */
  #define TWIS_INTENSET_NACKTX_Pos (7UL)             /*!< Position of NACKTX field.                                            */
  #define TWIS_INTENSET_NACKTX_Msk (0x1UL << TWIS_INTENSET_NACKTX_Pos) /*!< Bit mask of NACKTX field.                          */
  #define TWIS_INTENSET_NACKTX_Min (0x0UL)           /*!< Min enumerator value of NACKTX field.                                */
  #define TWIS_INTENSET_NACKTX_Max (0x1UL)           /*!< Max enumerator value of NACKTX field.                                */
  #define TWIS_INTENSET_NACKTX_Set (0x1UL)           /*!< Enable                                                               */
  #define TWIS_INTENSET_NACKTX_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_NACKTX_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* BB @Bit 8 : Write '1' to enable interrupt for event BB */
  #define TWIS_INTENSET_BB_Pos (8UL)                 /*!< Position of BB field.                                                */
  #define TWIS_INTENSET_BB_Msk (0x1UL << TWIS_INTENSET_BB_Pos) /*!< Bit mask of BB field.                                      */
  #define TWIS_INTENSET_BB_Min (0x0UL)               /*!< Min enumerator value of BB field.                                    */
  #define TWIS_INTENSET_BB_Max (0x1UL)               /*!< Max enumerator value of BB field.                                    */
  #define TWIS_INTENSET_BB_Set (0x1UL)               /*!< Enable                                                               */
  #define TWIS_INTENSET_BB_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_BB_Enabled (0x1UL)           /*!< Read: Enabled                                                        */

/* WRITE @Bit 15 : Write '1' to enable interrupt for event WRITE */
  #define TWIS_INTENSET_WRITE_Pos (15UL)             /*!< Position of WRITE field.                                             */
  #define TWIS_INTENSET_WRITE_Msk (0x1UL << TWIS_INTENSET_WRITE_Pos) /*!< Bit mask of WRITE field.                             */
  #define TWIS_INTENSET_WRITE_Min (0x0UL)            /*!< Min enumerator value of WRITE field.                                 */
  #define TWIS_INTENSET_WRITE_Max (0x1UL)            /*!< Max enumerator value of WRITE field.                                 */
  #define TWIS_INTENSET_WRITE_Set (0x1UL)            /*!< Enable                                                               */
  #define TWIS_INTENSET_WRITE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_WRITE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

