adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* READ @Bit 16 : Write '1' to enable interrupt for event READ */
  #define TWIS_INTENSET_READ_Pos (16UL)              /*!< Position of READ field.                                              */
  #define TWIS_INTENSET_READ_Msk (0x1UL << TWIS_INTENSET_READ_Pos) /*!< Bit mask of READ field.                                */
  #define TWIS_INTENSET_READ_Min (0x0UL)             /*!< Min enumerator value of READ field.                                  */
  #define TWIS_INTENSET_READ_Max (0x1UL)             /*!< Max enumerator value of READ field.                                  */
  #define TWIS_INTENSET_READ_Set (0x1UL)             /*!< Enable                                                               */
  #define TWIS_INTENSET_READ_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_READ_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* CSSTARTED @Bit 17 : Write '1' to enable interrupt for event CSSTARTED */
  #define TWIS_INTENSET_CSSTARTED_Pos (17UL)         /*!< Position of CSSTARTED field.                                         */
  #define TWIS_INTENSET_CSSTARTED_Msk (0x1UL << TWIS_INTENSET_CSSTARTED_Pos) /*!< Bit mask of CSSTARTED field.                 */
  #define TWIS_INTENSET_CSSTARTED_Min (0x0UL)        /*!< Min enumerator value of CSSTARTED field.                             */
  #define TWIS_INTENSET_CSSTARTED_Max (0x1UL)        /*!< Max enumerator value of CSSTARTED field.                             */
  #define TWIS_INTENSET_CSSTARTED_Set (0x1UL)        /*!< Enable                                                               */
  #define TWIS_INTENSET_CSSTARTED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_CSSTARTED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* CSSTOPPED @Bit 18 : Write '1' to enable interrupt for event CSSTOPPED */
  #define TWIS_INTENSET_CSSTOPPED_Pos (18UL)         /*!< Position of CSSTOPPED field.                                         */
  #define TWIS_INTENSET_CSSTOPPED_Msk (0x1UL << TWIS_INTENSET_CSSTOPPED_Pos) /*!< Bit mask of CSSTOPPED field.                 */
  #define TWIS_INTENSET_CSSTOPPED_Min (0x0UL)        /*!< Min enumerator value of CSSTOPPED field.                             */
  #define TWIS_INTENSET_CSSTOPPED_Max (0x1UL)        /*!< Max enumerator value of CSSTOPPED field.                             */
  #define TWIS_INTENSET_CSSTOPPED_Set (0x1UL)        /*!< Enable                                                               */
  #define TWIS_INTENSET_CSSTOPPED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_CSSTOPPED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* DMARXEND @Bit 19 : Write '1' to enable interrupt for event DMARXEND */
  #define TWIS_INTENSET_DMARXEND_Pos (19UL)          /*!< Position of DMARXEND field.                                          */
  #define TWIS_INTENSET_DMARXEND_Msk (0x1UL << TWIS_INTENSET_DMARXEND_Pos) /*!< Bit mask of DMARXEND field.                    */
  #define TWIS_INTENSET_DMARXEND_Min (0x0UL)         /*!< Min enumerator value of DMARXEND field.                              */
  #define TWIS_INTENSET_DMARXEND_Max (0x1UL)         /*!< Max enumerator value of DMARXEND field.                              */
  #define TWIS_INTENSET_DMARXEND_Set (0x1UL)         /*!< Enable                                                               */
  #define TWIS_INTENSET_DMARXEND_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_DMARXEND_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* DMARXREADY @Bit 20 : Write '1' to enable interrupt for event DMARXREADY */
  #define TWIS_INTENSET_DMARXREADY_Pos (20UL)        /*!< Position of DMARXREADY field.                                        */
  #define TWIS_INTENSET_DMARXREADY_Msk (0x1UL << TWIS_INTENSET_DMARXREADY_Pos) /*!< Bit mask of DMARXREADY field.              */
  #define TWIS_INTENSET_DMARXREADY_Min (0x0UL)       /*!< Min enumerator value of DMARXREADY field.                            */
  #define TWIS_INTENSET_DMARXREADY_Max (0x1UL)       /*!< Max enumerator value of DMARXREADY field.                            */
  #define TWIS_INTENSET_DMARXREADY_Set (0x1UL)       /*!< Enable                                                               */
  #define TWIS_INTENSET_DMARXREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_DMARXREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* DMARXBUSERROR @Bit 21 : Write '1' to enable interrupt for event DMARXBUSERROR */
  #define TWIS_INTENSET_DMARXBUSERROR_Pos (21UL)     /*!< Position of DMARXBUSERROR field.                                     */
  #define TWIS_INTENSET_DMARXBUSERROR_Msk (0x1UL << TWIS_INTENSET_DMARXBUSERROR_Pos) /*!< Bit mask of DMARXBUSERROR field.     */
  #define TWIS_INTENSET_DMARXBUSERROR_Min (0x0UL)    /*!< Min enumerator value of DMARXBUSERROR field.                         */
  #define TWIS_INTENSET_DMARXBUSERROR_Max (0x1UL)    /*!< Max enumerator value of DMARXBUSERROR field.                         */
  #define TWIS_INTENSET_DMARXBUSERROR_Set (0x1UL)    /*!< Enable                                                               */
  #define TWIS_INTENSET_DMARXBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define TWIS_INTENSET_DMARXBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* DMARXMATCH0 @Bit 22 : Write '1' to enable interrupt for event DMARXMATCH[0] */
  #define TWIS_INTENSET_DMARXMATCH0_Pos (22UL)       /*!< Position of DMARXMATCH0 field.                                       */
  #define TWIS_INTENSET_DMARXMATCH0_Msk (0x1UL << TWIS_INTENSET_DMARXMATCH0_Pos) /*!< Bit mask of DMARXMATCH0 field.           */
  #define TWIS_INTENSET_DMARXMATCH0_Min (0x0UL)      /*!< Min enumerator value of DMARXMATCH0 field.                           */
  #define TWIS_INTENSET_DMARXMATCH0_Max (0x1UL)      /*!< Max enumerator value of DMARXMATCH0 field.                           */
  #define TWIS_INTENSET_DMARXMATCH0_Set (0x1UL)      /*!< Enable                                                               */
  #define TWIS_INTENSET_DMARXMATCH0_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_DMARXMATCH0_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMARXMATCH1 @Bit 23 : Write '1' to enable interrupt for event DMARXMATCH[1] */
  #define TWIS_INTENSET_DMARXMATCH1_Pos (23UL)       /*!< Position of DMARXMATCH1 field.                                       */
  #define TWIS_INTENSET_DMARXMATCH1_Msk (0x1UL << TWIS_INTENSET_DMARXMATCH1_Pos) /*!< Bit mask of DMARXMATCH1 field.           */
  #define TWIS_INTENSET_DMARXMATCH1_Min (0x0UL)      /*!< Min enumerator value of DMARXMATCH1 field.                           */
  #define TWIS_INTENSET_DMARXMATCH1_Max (0x1UL)      /*!< Max enumerator value of DMARXMATCH1 field.                           */
  #define TWIS_INTENSET_DMARXMATCH1_Set (0x1UL)      /*!< Enable                                                               */
  #define TWIS_INTENSET_DMARXMATCH1_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_DMARXMATCH1_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMARXMATCH2 @Bit 24 : Write '1' to enable interrupt for event DMARXMATCH[2] */
  #define TWIS_INTENSET_DMARXMATCH2_Pos (24UL)       /*!< Position of DMARXMATCH2 field.                                       */
  #define TWIS_INTENSET_DMARXMATCH2_Msk (0x1UL << TWIS_INTENSET_DMARXMATCH2_Pos) /*!< Bit mask of DMARXMATCH2 field.           */
  #define TWIS_INTENSET_DMARXMATCH2_Min (0x0UL)      /*!< Min enumerator value of DMARXMATCH2 field.                           */
  #define TWIS_INTENSET_DMARXMATCH2_Max (0x1UL)      /*!< Max enumerator value of DMARXMATCH2 field.                           */
  #define TWIS_INTENSET_DMARXMATCH2_Set (0x1UL)      /*!< Enable                                                               */
  #define TWIS_INTENSET_DMARXMATCH2_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_DMARXMATCH2_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMARXMATCH3 @Bit 25 : Write '1' to enable interrupt for event DMARXMATCH[3] */
  #define TWIS_INTENSET_DMARXMATCH3_Pos (25UL)       /*!< Position of DMARXMATCH3 field.                                       */
  #define TWIS_INTENSET_DMARXMATCH3_Msk (0x1UL << TWIS_INTENSET_DMARXMATCH3_Pos) /*!< Bit mask of DMARXMATCH3 field.           */
  #define TWIS_INTENSET_DMARXMATCH3_Min (0x0UL)      /*!< Min enumerator value of DMARXMATCH3 field.                           */
  #define TWIS_INTENSET_DMARXMATCH3_Max (0x1UL)      /*!< Max enumerator value of DMARXMATCH3 field.                           */
  #define TWIS_INTENSET_DMARXMATCH3_Set (0x1UL)      /*!< Enable                                                               */
  #define TWIS_INTENSET_DMARXMATCH3_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_DMARXMATCH3_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMATXEND @Bit 26 : Write '1' to enable interrupt for event DMATXEND */
  #define TWIS_INTENSET_DMATXEND_Pos (26UL)          /*!< Position of DMATXEND field.                                          */
  #define TWIS_INTENSET_DMATXEND_Msk (0x1UL << TWIS_INTENSET_DMATXEND_Pos) /*!< Bit mask of DMATXEND field.                    */
  #define TWIS_INTENSET_DMATXEND_Min (0x0UL)         /*!< Min enumerator value of DMATXEND field.                              */
  #define TWIS_INTENSET_DMATXEND_Max (0x1UL)         /*!< Max enumerator value of DMATXEND field.                              */
  #define TWIS_INTENSET_DMATXEND_Set (0x1UL)         /*!< Enable                                                               */
  #define TWIS_INTENSET_DMATXEND_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_DMATXEND_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* DMATXREADY @Bit 27 : Write '1' to enable interrupt for event DMATXREADY */
  #define TWIS_INTENSET_DMATXREADY_Pos (27UL)        /*!< Position of DMATXREADY field.                                        */
  #define TWIS_INTENSET_DMATXREADY_Msk (0x1UL << TWIS_INTENSET_DMATXREADY_Pos) /*!< Bit mask of DMATXREADY field.              */
  #define TWIS_INTENSET_DMATXREADY_Min (0x0UL)       /*!< Min enumerator value of DMATXREADY field.                            */
  #define TWIS_INTENSET_DMATXREADY_Max (0x1UL)       /*!< Max enumerator value of DMATXREADY field.                            */
  #define TWIS_INTENSET_DMATXREADY_Set (0x1UL)       /*!< Enable                                                               */
  #define TWIS_INTENSET_DMATXREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_DMATXREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* DMATXBUSERROR @Bit 28 : Write '1' to enable interrupt for event DMATXBUSERROR */
  #define TWIS_INTENSET_DMATXBUSERROR_Pos (28UL)     /*!< Position of DMATXBUSERROR field.                                     */
  #define TWIS_INTENSET_DMATXBUSERROR_Msk (0x1UL << TWIS_INTENSET_DMATXBUSERROR_Pos) /*!< Bit mask of DMATXBUSERROR field.     */
  #define TWIS_INTENSET_DMATXBUSERROR_Min (0x0UL)    /*!< Min enumerator value of DMATXBUSERROR field.                         */
  #define TWIS_INTENSET_DMATXBUSERROR_Max (0x1UL)    /*!< Max enumerator value of DMATXBUSERROR field.                         */
  #define TWIS_INTENSET_DMATXBUSERROR_Set (0x1UL)    /*!< Enable                                                               */
  #define TWIS_INTENSET_DMATXBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define TWIS_INTENSET_DMATXBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* TWIS_INTENCLR: Disable interrupt */
  #define TWIS_INTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of INTENCLR register.                                    */

/* STARTED @Bit 0 : Write '1' to disable interrupt for event STARTED */
  #define TWIS_INTENCLR_STARTED_Pos (0UL)            /*!< Position of STARTED field.                                           */
  #define TWIS_INTENCLR_STARTED_Msk (0x1UL << TWIS_INTENCLR_STARTED_Pos) /*!< Bit mask of STARTED field.                       */
  #define TWIS_INTENCLR_STARTED_Min (0x0UL)          /*!< Min enumerator value of STARTED field.                               */
  #define TWIS_INTENCLR_STARTED_Max (0x1UL)          /*!< Max enumerator value of STARTED field.                               */
  #define TWIS_INTENCLR_STARTED_Clear (0x1UL)        /*!< Disable                                                              */
  #define TWIS_INTENCLR_STARTED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_STARTED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define TWIS_INTENCLR_STOPPED_Pos (1UL)            /*!< Position of STOPPED field.                                           */
  #define TWIS_INTENCLR_STOPPED_Msk (0x1UL << TWIS_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                       */
  #define TWIS_INTENCLR_STOPPED_Min (0x0UL)          /*!< Min enumerator value of STOPPED field.                               */
  #define TWIS_INTENCLR_STOPPED_Max (0x1UL)          /*!< Max enumerator value of STOPPED field.                               */
  #define TWIS_INTENCLR_STOPPED_Clear (0x1UL)        /*!< Disable                                                              */
  #define TWIS_INTENCLR_STOPPED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_STOPPED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ERROR @Bit 5 : Write '1' to disable interrupt for event ERROR */
  #define TWIS_INTENCLR_ERROR_Pos (5UL)              /*!< Position of ERROR field.                                             */
  #define TWIS_INTENCLR_ERROR_Msk (0x1UL << TWIS_INTENCLR_ERROR_Pos) /*!< Bit mask of ERROR field.                             */
  #define TWIS_INTENCLR_ERROR_Min (0x0UL)            /*!< Min enumerator value of ERROR field.                                 */
  #define TWIS_INTENCLR_ERROR_Max (0x1UL)            /*!< Max enumerator value of ERROR field.                                 */
  #define TWIS_INTENCLR_ERROR_Clear (0x1UL)          /*!< Disable                                                              */
  #define TWIS_INTENCLR_ERROR_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_ERROR_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* NACKTX @Bit 7 : Write '1' to disable interrupt for event NACKTX */
  #define TWIS_INTENCLR_NACKTX_Pos (7UL)             /*!< Position of NACKTX field.                                            */
  #define TWIS_INTENCLR_NACKTX_Msk (0x1UL << TWIS_INTENCLR_NACKTX_Pos) /*!< Bit mask of NACKTX field.                          */
  #define TWIS_INTENCLR_NACKTX_Min (0x0UL)           /*!< Min enumerator value of NACKTX field.                                */
  #define TWIS_INTENCLR_NACKTX_Max (0x1UL)           /*!< Max enumerator value of NACKTX field.                                */
  #define TWIS_INTENCLR_NACKTX_Clear (0x1UL)         /*!< Disable                                                              */
  #define TWIS_INTENCLR_NACKTX_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_NACKTX_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

