adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* BB @Bit 8 : Write '1' to disable interrupt for event BB */
  #define TWIS_INTENCLR_BB_Pos (8UL)                 /*!< Position of BB field.                                                */
  #define TWIS_INTENCLR_BB_Msk (0x1UL << TWIS_INTENCLR_BB_Pos) /*!< Bit mask of BB field.                                      */
  #define TWIS_INTENCLR_BB_Min (0x0UL)               /*!< Min enumerator value of BB field.                                    */
  #define TWIS_INTENCLR_BB_Max (0x1UL)               /*!< Max enumerator value of BB field.                                    */
  #define TWIS_INTENCLR_BB_Clear (0x1UL)             /*!< Disable                                                              */
  #define TWIS_INTENCLR_BB_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_BB_Enabled (0x1UL)           /*!< Read: Enabled                                                        */

/* WRITE @Bit 15 : Write '1' to disable interrupt for event WRITE */
  #define TWIS_INTENCLR_WRITE_Pos (15UL)             /*!< Position of WRITE field.                                             */
  #define TWIS_INTENCLR_WRITE_Msk (0x1UL << TWIS_INTENCLR_WRITE_Pos) /*!< Bit mask of WRITE field.                             */
  #define TWIS_INTENCLR_WRITE_Min (0x0UL)            /*!< Min enumerator value of WRITE field.                                 */
  #define TWIS_INTENCLR_WRITE_Max (0x1UL)            /*!< Max enumerator value of WRITE field.                                 */
  #define TWIS_INTENCLR_WRITE_Clear (0x1UL)          /*!< Disable                                                              */
  #define TWIS_INTENCLR_WRITE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_WRITE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* READ @Bit 16 : Write '1' to disable interrupt for event READ */
  #define TWIS_INTENCLR_READ_Pos (16UL)              /*!< Position of READ field.                                              */
  #define TWIS_INTENCLR_READ_Msk (0x1UL << TWIS_INTENCLR_READ_Pos) /*!< Bit mask of READ field.                                */
  #define TWIS_INTENCLR_READ_Min (0x0UL)             /*!< Min enumerator value of READ field.                                  */
  #define TWIS_INTENCLR_READ_Max (0x1UL)             /*!< Max enumerator value of READ field.                                  */
  #define TWIS_INTENCLR_READ_Clear (0x1UL)           /*!< Disable                                                              */
  #define TWIS_INTENCLR_READ_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_READ_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* CSSTARTED @Bit 17 : Write '1' to disable interrupt for event CSSTARTED */
  #define TWIS_INTENCLR_CSSTARTED_Pos (17UL)         /*!< Position of CSSTARTED field.                                         */
  #define TWIS_INTENCLR_CSSTARTED_Msk (0x1UL << TWIS_INTENCLR_CSSTARTED_Pos) /*!< Bit mask of CSSTARTED field.                 */
  #define TWIS_INTENCLR_CSSTARTED_Min (0x0UL)        /*!< Min enumerator value of CSSTARTED field.                             */
  #define TWIS_INTENCLR_CSSTARTED_Max (0x1UL)        /*!< Max enumerator value of CSSTARTED field.                             */
  #define TWIS_INTENCLR_CSSTARTED_Clear (0x1UL)      /*!< Disable                                                              */
  #define TWIS_INTENCLR_CSSTARTED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_CSSTARTED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* CSSTOPPED @Bit 18 : Write '1' to disable interrupt for event CSSTOPPED */
  #define TWIS_INTENCLR_CSSTOPPED_Pos (18UL)         /*!< Position of CSSTOPPED field.                                         */
  #define TWIS_INTENCLR_CSSTOPPED_Msk (0x1UL << TWIS_INTENCLR_CSSTOPPED_Pos) /*!< Bit mask of CSSTOPPED field.                 */
  #define TWIS_INTENCLR_CSSTOPPED_Min (0x0UL)        /*!< Min enumerator value of CSSTOPPED field.                             */
  #define TWIS_INTENCLR_CSSTOPPED_Max (0x1UL)        /*!< Max enumerator value of CSSTOPPED field.                             */
  #define TWIS_INTENCLR_CSSTOPPED_Clear (0x1UL)      /*!< Disable                                                              */
  #define TWIS_INTENCLR_CSSTOPPED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_CSSTOPPED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* DMARXEND @Bit 19 : Write '1' to disable interrupt for event DMARXEND */
  #define TWIS_INTENCLR_DMARXEND_Pos (19UL)          /*!< Position of DMARXEND field.                                          */
  #define TWIS_INTENCLR_DMARXEND_Msk (0x1UL << TWIS_INTENCLR_DMARXEND_Pos) /*!< Bit mask of DMARXEND field.                    */
  #define TWIS_INTENCLR_DMARXEND_Min (0x0UL)         /*!< Min enumerator value of DMARXEND field.                              */
  #define TWIS_INTENCLR_DMARXEND_Max (0x1UL)         /*!< Max enumerator value of DMARXEND field.                              */
  #define TWIS_INTENCLR_DMARXEND_Clear (0x1UL)       /*!< Disable                                                              */
  #define TWIS_INTENCLR_DMARXEND_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_DMARXEND_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* DMARXREADY @Bit 20 : Write '1' to disable interrupt for event DMARXREADY */
  #define TWIS_INTENCLR_DMARXREADY_Pos (20UL)        /*!< Position of DMARXREADY field.                                        */
  #define TWIS_INTENCLR_DMARXREADY_Msk (0x1UL << TWIS_INTENCLR_DMARXREADY_Pos) /*!< Bit mask of DMARXREADY field.              */
  #define TWIS_INTENCLR_DMARXREADY_Min (0x0UL)       /*!< Min enumerator value of DMARXREADY field.                            */
  #define TWIS_INTENCLR_DMARXREADY_Max (0x1UL)       /*!< Max enumerator value of DMARXREADY field.                            */
  #define TWIS_INTENCLR_DMARXREADY_Clear (0x1UL)     /*!< Disable                                                              */
  #define TWIS_INTENCLR_DMARXREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_DMARXREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

