adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* OVERFLOW @Bit 0 : RX buffer overflow detected, and prevented */
  #define TWIS_ERRORSRC_OVERFLOW_Pos (0UL)           /*!< Position of OVERFLOW field.                                          */
  #define TWIS_ERRORSRC_OVERFLOW_Msk (0x1UL << TWIS_ERRORSRC_OVERFLOW_Pos) /*!< Bit mask of OVERFLOW field.                    */
  #define TWIS_ERRORSRC_OVERFLOW_Min (0x0UL)         /*!< Min enumerator value of OVERFLOW field.                              */
  #define TWIS_ERRORSRC_OVERFLOW_Max (0x1UL)         /*!< Max enumerator value of OVERFLOW field.                              */
  #define TWIS_ERRORSRC_OVERFLOW_NotDetected (0x0UL) /*!< Error did not occur                                                  */
  #define TWIS_ERRORSRC_OVERFLOW_Detected (0x1UL)    /*!< Error occurred                                                       */

/* DNACK @Bit 2 : NACK sent after receiving a data byte */
  #define TWIS_ERRORSRC_DNACK_Pos (2UL)              /*!< Position of DNACK field.                                             */
  #define TWIS_ERRORSRC_DNACK_Msk (0x1UL << TWIS_ERRORSRC_DNACK_Pos) /*!< Bit mask of DNACK field.                             */
  #define TWIS_ERRORSRC_DNACK_Min (0x0UL)            /*!< Min enumerator value of DNACK field.                                 */
  #define TWIS_ERRORSRC_DNACK_Max (0x1UL)            /*!< Max enumerator value of DNACK field.                                 */
  #define TWIS_ERRORSRC_DNACK_NotReceived (0x0UL)    /*!< Error did not occur                                                  */
  #define TWIS_ERRORSRC_DNACK_Received (0x1UL)       /*!< Error occurred                                                       */

/* OVERREAD @Bit 3 : TX buffer over-read detected, and prevented */
  #define TWIS_ERRORSRC_OVERREAD_Pos (3UL)           /*!< Position of OVERREAD field.                                          */
  #define TWIS_ERRORSRC_OVERREAD_Msk (0x1UL << TWIS_ERRORSRC_OVERREAD_Pos) /*!< Bit mask of OVERREAD field.                    */
  #define TWIS_ERRORSRC_OVERREAD_Min (0x0UL)         /*!< Min enumerator value of OVERREAD field.                              */
  #define TWIS_ERRORSRC_OVERREAD_Max (0x1UL)         /*!< Max enumerator value of OVERREAD field.                              */
  #define TWIS_ERRORSRC_OVERREAD_NotDetected (0x0UL) /*!< Error did not occur                                                  */
  #define TWIS_ERRORSRC_OVERREAD_Detected (0x1UL)    /*!< Error occurred                                                       */


/* TWIS_MATCH: Status register indicating which address had a match */
  #define TWIS_MATCH_ResetValue (0x00000000UL)       /*!< Reset value of MATCH register.                                       */

/* MATCH @Bit 0 : Indication of which address in ADDRESS that matched the incoming address */
  #define TWIS_MATCH_MATCH_Pos (0UL)                 /*!< Position of MATCH field.                                             */
  #define TWIS_MATCH_MATCH_Msk (0x1UL << TWIS_MATCH_MATCH_Pos) /*!< Bit mask of MATCH field.                                   */
  #define TWIS_MATCH_MATCH_Min (0x0UL)               /*!< Min value of MATCH field.                                            */
  #define TWIS_MATCH_MATCH_Max (0x1UL)               /*!< Max size of MATCH field.                                             */


/* TWIS_PINSTATUS: Returns state of signals reflecting the SDA and SCL line status. All fields will return a '0' if DEBUGENABLE
                    is not Enabled. */                                                                                            
                                                                                                                                  
  #define TWIS_PINSTATUS_ResetValue (0x00000000UL)   /*!< Reset value of PINSTATUS register.                                   */

/* SCLIFILTERED @Bit 0 : State of SCL line, signal taken after the filer but without synchronizing to the 16 MHz clock */
  #define TWIS_PINSTATUS_SCLIFILTERED_Pos (0UL)      /*!< Position of SCLIFILTERED field.                                      */
  #define TWIS_PINSTATUS_SCLIFILTERED_Msk (0x1UL << TWIS_PINSTATUS_SCLIFILTERED_Pos) /*!< Bit mask of SCLIFILTERED field.      */

/* SDAIFILTERED @Bit 1 : State of SDA line, signal taken after the filer but without synchronizing to the 16 MHz clock */
  #define TWIS_PINSTATUS_SDAIFILTERED_Pos (1UL)      /*!< Position of SDAIFILTERED field.                                      */
  #define TWIS_PINSTATUS_SDAIFILTERED_Msk (0x1UL << TWIS_PINSTATUS_SDAIFILTERED_Pos) /*!< Bit mask of SDAIFILTERED field.      */

/* SCLO @Bit 2 : State of SCLO register in dataHandler */
  #define TWIS_PINSTATUS_SCLO_Pos (2UL)              /*!< Position of SCLO field.                                              */
  #define TWIS_PINSTATUS_SCLO_Msk (0x1UL << TWIS_PINSTATUS_SCLO_Pos) /*!< Bit mask of SCLO field.                              */

/* SDAO @Bit 3 : State of SDAO register in dataHandler */
  #define TWIS_PINSTATUS_SDAO_Pos (3UL)              /*!< Position of SDAO field.                                              */
  #define TWIS_PINSTATUS_SDAO_Msk (0x1UL << TWIS_PINSTATUS_SDAO_Pos) /*!< Bit mask of SDAO field.                              */


/* TWIS_ENABLE: Enable TWIS */
  #define TWIS_ENABLE_ResetValue (0x00000000UL)      /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bits 0..3 : Enable or disable TWIS */
  #define TWIS_ENABLE_ENABLE_Pos (0UL)               /*!< Position of ENABLE field.                                            */
  #define TWIS_ENABLE_ENABLE_Msk (0xFUL << TWIS_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                              */
  #define TWIS_ENABLE_ENABLE_Min (0x0UL)             /*!< Min enumerator value of ENABLE field.                                */
  #define TWIS_ENABLE_ENABLE_Max (0x9UL)             /*!< Max enumerator value of ENABLE field.                                */
  #define TWIS_ENABLE_ENABLE_Disabled (0x0UL)        /*!< Disable TWIS                                                         */
  #define TWIS_ENABLE_ENABLE_Enabled (0x9UL)         /*!< Enable TWIS                                                          */


/* TWIS_ADDRESS: TWI slave address n */
  #define TWIS_ADDRESS_MaxCount (2UL)                /*!< Max size of ADDRESS[2] array.                                        */
  #define TWIS_ADDRESS_ResetValue (0x00000000UL)     /*!< Reset value of ADDRESS[2] register.                                  */

/* ADDRESS @Bits 0..6 : TWI slave address */
  #define TWIS_ADDRESS_ADDRESS_Pos (0UL)             /*!< Position of ADDRESS field.                                           */
  #define TWIS_ADDRESS_ADDRESS_Msk (0x7FUL << TWIS_ADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.                        */


/* TWIS_CONFIG: Configuration register for the address match mechanism */
  #define TWIS_CONFIG_ResetValue (0x00000001UL)      /*!< Reset value of CONFIG register.                                      */

