adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ADDRESS0 @Bit 0 : Enable or disable address matching on ADDRESS[0] */
  #define TWIS_CONFIG_ADDRESS0_Pos (0UL)             /*!< Position of ADDRESS0 field.                                          */
  #define TWIS_CONFIG_ADDRESS0_Msk (0x1UL << TWIS_CONFIG_ADDRESS0_Pos) /*!< Bit mask of ADDRESS0 field.                        */
  #define TWIS_CONFIG_ADDRESS0_Min (0x0UL)           /*!< Min enumerator value of ADDRESS0 field.                              */
  #define TWIS_CONFIG_ADDRESS0_Max (0x1UL)           /*!< Max enumerator value of ADDRESS0 field.                              */
  #define TWIS_CONFIG_ADDRESS0_Disabled (0x0UL)      /*!< Disabled                                                             */
  #define TWIS_CONFIG_ADDRESS0_Enabled (0x1UL)       /*!< Enabled                                                              */

/* ADDRESS1 @Bit 1 : Enable or disable address matching on ADDRESS[1] */
  #define TWIS_CONFIG_ADDRESS1_Pos (1UL)             /*!< Position of ADDRESS1 field.                                          */
  #define TWIS_CONFIG_ADDRESS1_Msk (0x1UL << TWIS_CONFIG_ADDRESS1_Pos) /*!< Bit mask of ADDRESS1 field.                        */
  #define TWIS_CONFIG_ADDRESS1_Min (0x0UL)           /*!< Min enumerator value of ADDRESS1 field.                              */
  #define TWIS_CONFIG_ADDRESS1_Max (0x1UL)           /*!< Max enumerator value of ADDRESS1 field.                              */
  #define TWIS_CONFIG_ADDRESS1_Disabled (0x0UL)      /*!< Disabled                                                             */
  #define TWIS_CONFIG_ADDRESS1_Enabled (0x1UL)       /*!< Enabled                                                              */


/* TWIS_INPUTMODE: Input mode */
  #define TWIS_INPUTMODE_ResetValue (0x00000000UL)   /*!< Reset value of INPUTMODE register.                                   */

/* INPUTMODE @Bits 0..1 : Input mode */
  #define TWIS_INPUTMODE_INPUTMODE_Pos (0UL)         /*!< Position of INPUTMODE field.                                         */
  #define TWIS_INPUTMODE_INPUTMODE_Msk (0x3UL << TWIS_INPUTMODE_INPUTMODE_Pos) /*!< Bit mask of INPUTMODE field.               */
  #define TWIS_INPUTMODE_INPUTMODE_Min (0x0UL)       /*!< Min enumerator value of INPUTMODE field.                             */
  #define TWIS_INPUTMODE_INPUTMODE_Max (0x2UL)       /*!< Max enumerator value of INPUTMODE field.                             */
  #define TWIS_INPUTMODE_INPUTMODE_Analog (0x0UL)    /*!< Analog filtering                                                     */
  #define TWIS_INPUTMODE_INPUTMODE_Digital (0x1UL)   /*!< Digital filtering                                                    */
  #define TWIS_INPUTMODE_INPUTMODE_Disabled (0x2UL)  /*!< No filtering                                                         */


/* TWIS_DEBUGENABLE: Enable TWIS debug features (PINSTATUS register) */
  #define TWIS_DEBUGENABLE_ResetValue (0x00000000UL) /*!< Reset value of DEBUGENABLE register.                                 */

/* ENABLE @Bit 0 : Enable or disable TWIS */
  #define TWIS_DEBUGENABLE_ENABLE_Pos (0UL)          /*!< Position of ENABLE field.                                            */
  #define TWIS_DEBUGENABLE_ENABLE_Msk (0x1UL << TWIS_DEBUGENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                    */
  #define TWIS_DEBUGENABLE_ENABLE_Min (0x0UL)        /*!< Min enumerator value of ENABLE field.                                */
  #define TWIS_DEBUGENABLE_ENABLE_Max (0x1UL)        /*!< Max enumerator value of ENABLE field.                                */
  #define TWIS_DEBUGENABLE_ENABLE_Disabled (0x0UL)   /*!< Disable TWIS                                                         */
  #define TWIS_DEBUGENABLE_ENABLE_Enabled (0x1UL)    /*!< Enable TWIS debug features                                           */


/* TWIS_ORC: Over-read character. Character sent out in case of an over-read of the transmit buffer. */
  #define TWIS_ORC_ResetValue (0x00000000UL)         /*!< Reset value of ORC register.                                         */

/* ORC @Bits 0..7 : Over-read character. Character sent out in case of an over-read of the transmit buffer. */
  #define TWIS_ORC_ORC_Pos (0UL)                     /*!< Position of ORC field.                                               */
  #define TWIS_ORC_ORC_Msk (0xFFUL << TWIS_ORC_ORC_Pos) /*!< Bit mask of ORC field.                                            */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           UARTE                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct UARTE_TASKS_DMA_RX ================================================ */
/**
  * @brief RX [UARTE_TASKS_DMA_RX] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  START;                             /*!< (@ 0x00000000) Starts operation using easyDMA to load the values. See
                                                                         peripheral description for operation using easyDMA.*/    
  __OM  uint32_t  STOP;                              /*!< (@ 0x00000004) Stops operation using easyDMA. This does not trigger an
                                                                         END event. After a STOP task, the easyDMA (channel)
                                                                         will also enter its lowest required power level.*/       
  __OM  uint32_t  ENABLEMATCH[4];                    /*!< (@ 0x00000008) Enables the MATCH[n] event by setting the ENABLE[n] bit
                                                                         in the CONFIG register.*/                                
  __OM  uint32_t  DISABLEMATCH[4];                   /*!< (@ 0x00000018) Disables the MATCH[n] event by clearing the ENABLE[n]
                                                                         bit in the CONFIG register.*/                            
} NRF_UARTE_TASKS_DMA_RX_Type;                       /*!< Size = 40 (0x028)                                                    */

/* UARTE_TASKS_DMA_RX_START: Starts operation using easyDMA to load the values. See peripheral description for operation using
                              easyDMA. */                                                                                         
                                                                                                                                  
  #define UARTE_TASKS_DMA_RX_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                               */

/* START @Bit 0 : Starts operation using easyDMA to load the values. See peripheral description for operation using easyDMA. */
  #define UARTE_TASKS_DMA_RX_START_START_Pos (0UL)   /*!< Position of START field.                                             */
  #define UARTE_TASKS_DMA_RX_START_START_Msk (0x1UL << UARTE_TASKS_DMA_RX_START_START_Pos) /*!< Bit mask of START field.       */
  #define UARTE_TASKS_DMA_RX_START_START_Min (0x1UL) /*!< Min enumerator value of START field.                                 */
  #define UARTE_TASKS_DMA_RX_START_START_Max (0x1UL) /*!< Max enumerator value of START field.                                 */
  #define UARTE_TASKS_DMA_RX_START_START_Trigger (0x1UL) /*!< Trigger task                                                     */


/* UARTE_TASKS_DMA_RX_STOP: Stops operation using easyDMA. This does not trigger an END event. After a STOP task, the easyDMA
                             (channel) will also enter its lowest required power level. */                                        
                                                                                                                                  
  #define UARTE_TASKS_DMA_RX_STOP_ResetValue (0x00000000UL) /*!< Reset value of STOP register.                                 */

/* STOP @Bit 0 : Stops operation using easyDMA. This does not trigger an END event. After a STOP task, the easyDMA (channel)
                 will also enter its lowest required power level. */                                                              
                                                                                                                                  
