adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* UARTE_DMA_RX_MAXCNT: Maximum number of bytes in receive buffer */
  #define UARTE_DMA_RX_MAXCNT_ResetValue (0x00000000UL) /*!< Reset value of MAXCNT register.                                   */

/* MAXCNT @Bits 0..15 : Maximum number of bytes in receive buffer */
  #define UARTE_DMA_RX_MAXCNT_MAXCNT_Pos (0UL)       /*!< Position of MAXCNT field.                                            */
  #define UARTE_DMA_RX_MAXCNT_MAXCNT_Msk (0xFFFFUL << UARTE_DMA_RX_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.           */
  #define UARTE_DMA_RX_MAXCNT_MAXCNT_Min (0x1UL)     /*!< Min value of MAXCNT field.                                           */
  #define UARTE_DMA_RX_MAXCNT_MAXCNT_Max (0xFFFFUL)  /*!< Max size of MAXCNT field.                                            */


/* UARTE_DMA_RX_AMOUNT: Number of bytes transferred in the last transaction, updated after the END event. Also updated after
                         each MATCH event. */                                                                                     
                                                                                                                                  
  #define UARTE_DMA_RX_AMOUNT_ResetValue (0x00000000UL) /*!< Reset value of AMOUNT register.                                   */

/* AMOUNT @Bits 0..15 : Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte. */
  #define UARTE_DMA_RX_AMOUNT_AMOUNT_Pos (0UL)       /*!< Position of AMOUNT field.                                            */
  #define UARTE_DMA_RX_AMOUNT_AMOUNT_Msk (0xFFFFUL << UARTE_DMA_RX_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.           */
  #define UARTE_DMA_RX_AMOUNT_AMOUNT_Min (0x1UL)     /*!< Min value of AMOUNT field.                                           */
  #define UARTE_DMA_RX_AMOUNT_AMOUNT_Max (0xFFFFUL)  /*!< Max size of AMOUNT field.                                            */


/* UARTE_DMA_RX_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of TERMINATEONBUSERROR register.         */

/* ENABLE @Bit 0 : (unspecified) */
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                     */
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of
                                                                            ENABLE field.*/                                       
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                       */
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                       */
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL) /*!< Disable                                                */
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL) /*!< Enable                                                  */


/* UARTE_DMA_RX_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define UARTE_DMA_RX_BUSERRORADDRESS_ResetValue (0x00000000UL) /*!< Reset value of BUSERRORADDRESS register.                 */

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define UARTE_DMA_RX_BUSERRORADDRESS_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                       */
  #define UARTE_DMA_RX_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << UARTE_DMA_RX_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/                                      



/* =================================================== Struct UARTE_DMA_TX =================================================== */
/**
  * @brief TX [UARTE_DMA_TX] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ENABLE;                            /*!< (@ 0x00000000) Register doesn't do anything. Can be written and read,
                                                                         but has no functionality attached.*/                     
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000004) RAM buffer start address                              */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000008) Maximum number of bytes in receive buffer             */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x0000000C) Number of bytes transferred in the last transaction,
                                                                         updated after the END event. Also updated after each
                                                                         MATCH event.*/                                           
  __IM  uint32_t  RESERVED[3];
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x0000001C) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/                                              
  __IOM uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000020) Address of transaction that generated the last BUSERROR
                                                                         event.*/                                                 
} NRF_UARTE_DMA_TX_Type;                             /*!< Size = 36 (0x024)                                                    */

/* UARTE_DMA_TX_ENABLE: Register doesn't do anything. Can be written and read, but has no functionality attached. */
  #define UARTE_DMA_TX_ENABLE_ResetValue (0x00000000UL) /*!< Reset value of ENABLE register.                                   */

/* ENABLE @Bit 0 : Register doesn't do anything. Can be written and read, but has no functionality attached. */
  #define UARTE_DMA_TX_ENABLE_ENABLE_Pos (0UL)       /*!< Position of ENABLE field.                                            */
  #define UARTE_DMA_TX_ENABLE_ENABLE_Msk (0x1UL << UARTE_DMA_TX_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.              */
  #define UARTE_DMA_TX_ENABLE_ENABLE_Min (0x0UL)     /*!< Min enumerator value of ENABLE field.                                */
  #define UARTE_DMA_TX_ENABLE_ENABLE_Max (0x1UL)     /*!< Max enumerator value of ENABLE field.                                */
  #define UARTE_DMA_TX_ENABLE_ENABLE_Disabled (0x0UL) /*!< Disable                                                             */
  #define UARTE_DMA_TX_ENABLE_ENABLE_Enabled (0x1UL) /*!< Enable                                                               */


/* UARTE_DMA_TX_PTR: RAM buffer start address */
  #define UARTE_DMA_TX_PTR_ResetValue (0x00000000UL) /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : RAM buffer start address for this EasyDMA channel. This address is a word aligned Data RAM address. */
  #define UARTE_DMA_TX_PTR_PTR_Pos (0UL)             /*!< Position of PTR field.                                               */
  #define UARTE_DMA_TX_PTR_PTR_Msk (0xFFFFFFFFUL << UARTE_DMA_TX_PTR_PTR_Pos) /*!< Bit mask of PTR field.                      */


