adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CTS_STARTRX @Bit 3 : Shortcut between event CTS and task STARTRX */
  #define UARTE_SHORTS_CTS_STARTRX_Pos (3UL)         /*!< Position of CTS_STARTRX field.                                       */
  #define UARTE_SHORTS_CTS_STARTRX_Msk (0x1UL << UARTE_SHORTS_CTS_STARTRX_Pos) /*!< Bit mask of CTS_STARTRX field.             */
  #define UARTE_SHORTS_CTS_STARTRX_Min (0x0UL)       /*!< Min enumerator value of CTS_STARTRX field.                           */
  #define UARTE_SHORTS_CTS_STARTRX_Max (0x1UL)       /*!< Max enumerator value of CTS_STARTRX field.                           */
  #define UARTE_SHORTS_CTS_STARTRX_Disabled (0x0UL)  /*!< Disable shortcut                                                     */
  #define UARTE_SHORTS_CTS_STARTRX_Enabled (0x1UL)   /*!< Enable shortcut                                                      */

/* NCTS_STOPRX @Bit 4 : Shortcut between event NCTS and task STOPRX */
  #define UARTE_SHORTS_NCTS_STOPRX_Pos (4UL)         /*!< Position of NCTS_STOPRX field.                                       */
  #define UARTE_SHORTS_NCTS_STOPRX_Msk (0x1UL << UARTE_SHORTS_NCTS_STOPRX_Pos) /*!< Bit mask of NCTS_STOPRX field.             */
  #define UARTE_SHORTS_NCTS_STOPRX_Min (0x0UL)       /*!< Min enumerator value of NCTS_STOPRX field.                           */
  #define UARTE_SHORTS_NCTS_STOPRX_Max (0x1UL)       /*!< Max enumerator value of NCTS_STOPRX field.                           */
  #define UARTE_SHORTS_NCTS_STOPRX_Disabled (0x0UL)  /*!< Disable shortcut                                                     */
  #define UARTE_SHORTS_NCTS_STOPRX_Enabled (0x1UL)   /*!< Enable shortcut                                                      */

/* ENDRX_STARTRX @Bit 5 : Shortcut between event ENDRX and task STARTRX */
  #define UARTE_SHORTS_ENDRX_STARTRX_Pos (5UL)       /*!< Position of ENDRX_STARTRX field.                                     */
  #define UARTE_SHORTS_ENDRX_STARTRX_Msk (0x1UL << UARTE_SHORTS_ENDRX_STARTRX_Pos) /*!< Bit mask of ENDRX_STARTRX field.       */
  #define UARTE_SHORTS_ENDRX_STARTRX_Min (0x0UL)     /*!< Min enumerator value of ENDRX_STARTRX field.                         */
  #define UARTE_SHORTS_ENDRX_STARTRX_Max (0x1UL)     /*!< Max enumerator value of ENDRX_STARTRX field.                         */
  #define UARTE_SHORTS_ENDRX_STARTRX_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define UARTE_SHORTS_ENDRX_STARTRX_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* ENDRX_STOPRX @Bit 6 : Shortcut between event ENDRX and task STOPRX */
  #define UARTE_SHORTS_ENDRX_STOPRX_Pos (6UL)        /*!< Position of ENDRX_STOPRX field.                                      */
  #define UARTE_SHORTS_ENDRX_STOPRX_Msk (0x1UL << UARTE_SHORTS_ENDRX_STOPRX_Pos) /*!< Bit mask of ENDRX_STOPRX field.          */
  #define UARTE_SHORTS_ENDRX_STOPRX_Min (0x0UL)      /*!< Min enumerator value of ENDRX_STOPRX field.                          */
  #define UARTE_SHORTS_ENDRX_STOPRX_Max (0x1UL)      /*!< Max enumerator value of ENDRX_STOPRX field.                          */
  #define UARTE_SHORTS_ENDRX_STOPRX_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define UARTE_SHORTS_ENDRX_STOPRX_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* ENDTX_STOPTX @Bit 18 : Shortcut between event ENDTX and task STOPTX */
  #define UARTE_SHORTS_ENDTX_STOPTX_Pos (18UL)       /*!< Position of ENDTX_STOPTX field.                                      */
  #define UARTE_SHORTS_ENDTX_STOPTX_Msk (0x1UL << UARTE_SHORTS_ENDTX_STOPTX_Pos) /*!< Bit mask of ENDTX_STOPTX field.          */
  #define UARTE_SHORTS_ENDTX_STOPTX_Min (0x0UL)      /*!< Min enumerator value of ENDTX_STOPTX field.                          */
  #define UARTE_SHORTS_ENDTX_STOPTX_Max (0x1UL)      /*!< Max enumerator value of ENDTX_STOPTX field.                          */
  #define UARTE_SHORTS_ENDTX_STOPTX_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define UARTE_SHORTS_ENDTX_STOPTX_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* DMA_RX_BUSERROR_STOPRX @Bit 19 : Shortcut between event DMA.RX.BUSERROR and task STOPRX */
  #define UARTE_SHORTS_DMA_RX_BUSERROR_STOPRX_Pos (19UL) /*!< Position of DMA_RX_BUSERROR_STOPRX field.                        */
  #define UARTE_SHORTS_DMA_RX_BUSERROR_STOPRX_Msk (0x1UL << UARTE_SHORTS_DMA_RX_BUSERROR_STOPRX_Pos) /*!< Bit mask of
                                                                            DMA_RX_BUSERROR_STOPRX field.*/                       
  #define UARTE_SHORTS_DMA_RX_BUSERROR_STOPRX_Min (0x0UL) /*!< Min enumerator value of DMA_RX_BUSERROR_STOPRX field.           */
  #define UARTE_SHORTS_DMA_RX_BUSERROR_STOPRX_Max (0x1UL) /*!< Max enumerator value of DMA_RX_BUSERROR_STOPRX field.           */
  #define UARTE_SHORTS_DMA_RX_BUSERROR_STOPRX_Disabled (0x0UL) /*!< Disable shortcut                                           */
  #define UARTE_SHORTS_DMA_RX_BUSERROR_STOPRX_Enabled (0x1UL) /*!< Enable shortcut                                             */

/* DMA_TX_BUSERROR_STOPTX @Bit 20 : Shortcut between event DMA.TX.BUSERROR and task STOPTX */
  #define UARTE_SHORTS_DMA_TX_BUSERROR_STOPTX_Pos (20UL) /*!< Position of DMA_TX_BUSERROR_STOPTX field.                        */
  #define UARTE_SHORTS_DMA_TX_BUSERROR_STOPTX_Msk (0x1UL << UARTE_SHORTS_DMA_TX_BUSERROR_STOPTX_Pos) /*!< Bit mask of
                                                                            DMA_TX_BUSERROR_STOPTX field.*/                       
  #define UARTE_SHORTS_DMA_TX_BUSERROR_STOPTX_Min (0x0UL) /*!< Min enumerator value of DMA_TX_BUSERROR_STOPTX field.           */
  #define UARTE_SHORTS_DMA_TX_BUSERROR_STOPTX_Max (0x1UL) /*!< Max enumerator value of DMA_TX_BUSERROR_STOPTX field.           */
  #define UARTE_SHORTS_DMA_TX_BUSERROR_STOPTX_Disabled (0x0UL) /*!< Disable shortcut                                           */
  #define UARTE_SHORTS_DMA_TX_BUSERROR_STOPTX_Enabled (0x1UL) /*!< Enable shortcut                                             */

/* DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 @Bit 21 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[1] */
  #define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Pos (21UL) /*!< Position of DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.  */
  #define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Msk (0x1UL << UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1
                                                                            field.*/                                              
  #define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Min (0x0UL) /*!< Min enumerator value of
                                                                          DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.*/              
  #define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Max (0x1UL) /*!< Max enumerator value of
                                                                          DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.*/              
  #define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Disabled (0x0UL) /*!< Disable shortcut                                */
  #define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Enabled (0x1UL) /*!< Enable shortcut                                  */

/* DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 @Bit 22 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[2] */
  #define UARTE_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Pos (22UL) /*!< Position of DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 field.  */
  #define UARTE_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Msk (0x1UL << UARTE_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2
                                                                            field.*/                                              
  #define UARTE_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Min (0x0UL) /*!< Min enumerator value of
                                                                          DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 field.*/              
  #define UARTE_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Max (0x1UL) /*!< Max enumerator value of
                                                                          DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 field.*/              
  #define UARTE_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Disabled (0x0UL) /*!< Disable shortcut                                */
  #define UARTE_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Enabled (0x1UL) /*!< Enable shortcut                                  */

/* DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0 @Bit 23 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[0] */
  #define UARTE_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Pos (23UL) /*!< Position of DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0 field.  */
  #define UARTE_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Msk (0x1UL << UARTE_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0
                                                                            field.*/                                              
  #define UARTE_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Min (0x0UL) /*!< Min enumerator value of
                                                                          DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0 field.*/              
  #define UARTE_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Max (0x1UL) /*!< Max enumerator value of
                                                                          DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0 field.*/              
  #define UARTE_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Disabled (0x0UL) /*!< Disable shortcut                                */
  #define UARTE_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH0_Enabled (0x1UL) /*!< Enable shortcut                                  */

/* DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1 @Bit 24 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[1] */
  #define UARTE_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Pos (24UL) /*!< Position of DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1 field.  */
  #define UARTE_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Msk (0x1UL << UARTE_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1
                                                                            field.*/                                              
  #define UARTE_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Min (0x0UL) /*!< Min enumerator value of
                                                                          DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1 field.*/              
  #define UARTE_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Max (0x1UL) /*!< Max enumerator value of
                                                                          DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1 field.*/              
  #define UARTE_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Disabled (0x0UL) /*!< Disable shortcut                                */
  #define UARTE_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH1_Enabled (0x1UL) /*!< Enable shortcut                                  */

/* DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0 @Bit 25 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.DISABLEMATCH[n] */
  #define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Pos (25UL) /*!< Position of DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0 field.*/
  #define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Msk (0x1UL << UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Pos)
                                                                            /*!< Bit mask of DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0
                                                                            field.*/                                              
  #define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Min (0x0UL) /*!< Min enumerator value of
                                                                           DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0 field.*/            
  #define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Max (0x1UL) /*!< Max enumerator value of
                                                                           DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0 field.*/            
  #define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Disabled (0x0UL) /*!< Disable shortcut                               */
  #define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0_Enabled (0x1UL) /*!< Enable shortcut                                 */

/* DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1 @Bit 26 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.DISABLEMATCH[n] */
  #define UARTE_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Pos (26UL) /*!< Position of DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1 field.*/
  #define UARTE_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Msk (0x1UL << UARTE_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Pos)
                                                                            /*!< Bit mask of DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1
                                                                            field.*/                                              
  #define UARTE_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Min (0x0UL) /*!< Min enumerator value of
                                                                           DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1 field.*/            
  #define UARTE_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Max (0x1UL) /*!< Max enumerator value of
                                                                           DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1 field.*/            
  #define UARTE_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Disabled (0x0UL) /*!< Disable shortcut                               */
  #define UARTE_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1_Enabled (0x1UL) /*!< Enable shortcut                                 */

/* DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2 @Bit 27 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.DISABLEMATCH[n] */
  #define UARTE_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Pos (27UL) /*!< Position of DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2 field.*/
  #define UARTE_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Msk (0x1UL << UARTE_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Pos)
                                                                            /*!< Bit mask of DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2
                                                                            field.*/                                              
  #define UARTE_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Min (0x0UL) /*!< Min enumerator value of
                                                                           DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2 field.*/            
  #define UARTE_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Max (0x1UL) /*!< Max enumerator value of
                                                                           DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2 field.*/            
  #define UARTE_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Disabled (0x0UL) /*!< Disable shortcut                               */
  #define UARTE_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2_Enabled (0x1UL) /*!< Enable shortcut                                 */

/* DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3 @Bit 28 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.DISABLEMATCH[n] */
  #define UARTE_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Pos (28UL) /*!< Position of DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3 field.*/
  #define UARTE_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Msk (0x1UL << UARTE_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Pos)
                                                                            /*!< Bit mask of DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3
                                                                            field.*/                                              
  #define UARTE_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Min (0x0UL) /*!< Min enumerator value of
                                                                           DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3 field.*/            
  #define UARTE_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Max (0x1UL) /*!< Max enumerator value of
                                                                           DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3 field.*/            
  #define UARTE_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Disabled (0x0UL) /*!< Disable shortcut                               */
  #define UARTE_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3_Enabled (0x1UL) /*!< Enable shortcut                                 */

/* FRAMETIMEOUT_DMA_RX_STOP @Bit 29 : Shortcut between event FRAMETIMEOUT and task DMA.RX.STOP */
  #define UARTE_SHORTS_FRAMETIMEOUT_DMA_RX_STOP_Pos (29UL) /*!< Position of FRAMETIMEOUT_DMA_RX_STOP field.                    */
  #define UARTE_SHORTS_FRAMETIMEOUT_DMA_RX_STOP_Msk (0x1UL << UARTE_SHORTS_FRAMETIMEOUT_DMA_RX_STOP_Pos) /*!< Bit mask of
                                                                            FRAMETIMEOUT_DMA_RX_STOP field.*/                     
  #define UARTE_SHORTS_FRAMETIMEOUT_DMA_RX_STOP_Min (0x0UL) /*!< Min enumerator value of FRAMETIMEOUT_DMA_RX_STOP field.       */
  #define UARTE_SHORTS_FRAMETIMEOUT_DMA_RX_STOP_Max (0x1UL) /*!< Max enumerator value of FRAMETIMEOUT_DMA_RX_STOP field.       */
  #define UARTE_SHORTS_FRAMETIMEOUT_DMA_RX_STOP_Disabled (0x0UL) /*!< Disable shortcut                                         */
  #define UARTE_SHORTS_FRAMETIMEOUT_DMA_RX_STOP_Enabled (0x1UL) /*!< Enable shortcut                                           */


/* UARTE_INTEN: Enable or disable interrupt */
  #define UARTE_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* CTS @Bit 0 : Enable or disable interrupt for event CTS */
  #define UARTE_INTEN_CTS_Pos (0UL)                  /*!< Position of CTS field.                                               */
  #define UARTE_INTEN_CTS_Msk (0x1UL << UARTE_INTEN_CTS_Pos) /*!< Bit mask of CTS field.                                       */
  #define UARTE_INTEN_CTS_Min (0x0UL)                /*!< Min enumerator value of CTS field.                                   */
  #define UARTE_INTEN_CTS_Max (0x1UL)                /*!< Max enumerator value of CTS field.                                   */
  #define UARTE_INTEN_CTS_Disabled (0x0UL)           /*!< Disable                                                              */
  #define UARTE_INTEN_CTS_Enabled (0x1UL)            /*!< Enable                                                               */

/* NCTS @Bit 1 : Enable or disable interrupt for event NCTS */
  #define UARTE_INTEN_NCTS_Pos (1UL)                 /*!< Position of NCTS field.                                              */
  #define UARTE_INTEN_NCTS_Msk (0x1UL << UARTE_INTEN_NCTS_Pos) /*!< Bit mask of NCTS field.                                    */
  #define UARTE_INTEN_NCTS_Min (0x0UL)               /*!< Min enumerator value of NCTS field.                                  */
  #define UARTE_INTEN_NCTS_Max (0x1UL)               /*!< Max enumerator value of NCTS field.                                  */
  #define UARTE_INTEN_NCTS_Disabled (0x0UL)          /*!< Disable                                                              */
  #define UARTE_INTEN_NCTS_Enabled (0x1UL)           /*!< Enable                                                               */

