adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* NSC @Bit 4 : (unspecified) */
  #define UICR_MEM_CONFIG_NSC_Pos (4UL)              /*!< Position of NSC field.                                               */
  #define UICR_MEM_CONFIG_NSC_Msk (0x1UL << UICR_MEM_CONFIG_NSC_Pos) /*!< Bit mask of NSC field.                               */
  #define UICR_MEM_CONFIG_NSC_Min (0x0UL)            /*!< Min enumerator value of NSC field.                                   */
  #define UICR_MEM_CONFIG_NSC_Max (0x1UL)            /*!< Max enumerator value of NSC field.                                   */
  #define UICR_MEM_CONFIG_NSC_Disabled (0x1UL)       /*!< Memory region is not non-secure callable                             */
  #define UICR_MEM_CONFIG_NSC_Enabled (0x0UL)        /*!< Memory region is non-secure callable                                 */

/* OWNERID @Bits 8..11 : Memory owner identification */
  #define UICR_MEM_CONFIG_OWNERID_Pos (8UL)          /*!< Position of OWNERID field.                                           */
  #define UICR_MEM_CONFIG_OWNERID_Msk (0xFUL << UICR_MEM_CONFIG_OWNERID_Pos) /*!< Bit mask of OWNERID field.                   */
  #define UICR_MEM_CONFIG_OWNERID_Min (0x0UL)        /*!< Min value of OWNERID field.                                          */
  #define UICR_MEM_CONFIG_OWNERID_Max (0xFUL)        /*!< Max size of OWNERID field.                                           */

/* ADDRESS @Bits 12..31 : Memory region start address, bits [31:12] */
  #define UICR_MEM_CONFIG_ADDRESS_Pos (12UL)         /*!< Position of ADDRESS field.                                           */
  #define UICR_MEM_CONFIG_ADDRESS_Msk (0xFFFFFUL << UICR_MEM_CONFIG_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.               */


/* UICR_MEM_SIZE: Size of the memory region */
  #define UICR_MEM_SIZE_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of SIZE register.                                        */

/* SIZE @Bits 0..31 : Memory size in bytes */
  #define UICR_MEM_SIZE_SIZE_Pos (0UL)               /*!< Position of SIZE field.                                              */
  #define UICR_MEM_SIZE_SIZE_Msk (0xFFFFFFFFUL << UICR_MEM_SIZE_SIZE_Pos) /*!< Bit mask of SIZE field.                         */



/* =================================================== Struct UICR_PERIPH ==================================================== */
/**
  * @brief PERIPH [UICR_PERIPH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) Peripheral configuration                              */
} NRF_UICR_PERIPH_Type;                              /*!< Size = 4 (0x004)                                                     */
  #define UICR_PERIPH_MaxCount (192UL)               /*!< Max size of PERIPH[192] array.                                       */

/* UICR_PERIPH_CONFIG: Peripheral configuration */
  #define UICR_PERIPH_CONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONFIG register.                                    */

/* SECURE @Bit 3 : Peripheral security mapping */
  #define UICR_PERIPH_CONFIG_SECURE_Pos (3UL)        /*!< Position of SECURE field.                                            */
  #define UICR_PERIPH_CONFIG_SECURE_Msk (0x1UL << UICR_PERIPH_CONFIG_SECURE_Pos) /*!< Bit mask of SECURE field.                */
  #define UICR_PERIPH_CONFIG_SECURE_Min (0x0UL)      /*!< Min enumerator value of SECURE field.                                */
  #define UICR_PERIPH_CONFIG_SECURE_Max (0x1UL)      /*!< Max enumerator value of SECURE field.                                */
  #define UICR_PERIPH_CONFIG_SECURE_Secure (0x1UL)   /*!< Peripheral is mapped in secure peripheral address space              */
  #define UICR_PERIPH_CONFIG_SECURE_NonSecure (0x0UL) /*!< Peripheral is mapped in non-secure peripheral address space.        */

/* DMASEC @Bit 5 : Security attribution for the DMA transfer */
  #define UICR_PERIPH_CONFIG_DMASEC_Pos (5UL)        /*!< Position of DMASEC field.                                            */
  #define UICR_PERIPH_CONFIG_DMASEC_Msk (0x1UL << UICR_PERIPH_CONFIG_DMASEC_Pos) /*!< Bit mask of DMASEC field.                */
  #define UICR_PERIPH_CONFIG_DMASEC_Min (0x0UL)      /*!< Min enumerator value of DMASEC field.                                */
  #define UICR_PERIPH_CONFIG_DMASEC_Max (0x1UL)      /*!< Max enumerator value of DMASEC field.                                */
  #define UICR_PERIPH_CONFIG_DMASEC_Secure (0x1UL)   /*!< DMA transfers initiated by this peripheral have the secure attribute
                                                          set*/                                                                   
  #define UICR_PERIPH_CONFIG_DMASEC_NonSecure (0x0UL) /*!< DMA transfers initiated by this peripheral have the non-secure
                                                           attribute set*/                                                        

/* PROCESSOR @Bits 8..11 : Processor ID of the processor that will receive the peripheral IRQ */
  #define UICR_PERIPH_CONFIG_PROCESSOR_Pos (8UL)     /*!< Position of PROCESSOR field.                                         */
  #define UICR_PERIPH_CONFIG_PROCESSOR_Msk (0xFUL << UICR_PERIPH_CONFIG_PROCESSOR_Pos) /*!< Bit mask of PROCESSOR field.       */

/* ADDRESS @Bits 12..31 : Peripheral address, bits [31:12] */
  #define UICR_PERIPH_CONFIG_ADDRESS_Pos (12UL)      /*!< Position of ADDRESS field.                                           */
  #define UICR_PERIPH_CONFIG_ADDRESS_Msk (0xFFFFFUL << UICR_PERIPH_CONFIG_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.         */



/* ==================================================== Struct UICR_GPIO ===================================================== */
/**
  * @brief GPIO [UICR_GPIO] (unspecified)
  */
typedef struct {
  __IOM uint32_t  OWN;                               /*!< (@ 0x00000000) Request ownership of the pins at GPIO port P[n]       */
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000004) Request permission for the pins at GPIO port P[n]     */
} NRF_UICR_GPIO_Type;                                /*!< Size = 8 (0x008)                                                     */
  #define UICR_GPIO_MaxCount (16UL)                  /*!< Max size of GPIO[16] array.                                          */

