adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* UICR_GPIO_OWN: Request ownership of the pins at GPIO port P[n] */
  #define UICR_GPIO_OWN_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of OWN register.                                         */

/* PIN0 @Bit 0 : Pin number */
  #define UICR_GPIO_OWN_PIN0_Pos (0UL)               /*!< Position of PIN0 field.                                              */
  #define UICR_GPIO_OWN_PIN0_Msk (0x1UL << UICR_GPIO_OWN_PIN0_Pos) /*!< Bit mask of PIN0 field.                                */
  #define UICR_GPIO_OWN_PIN0_Min (0x0UL)             /*!< Min enumerator value of PIN0 field.                                  */
  #define UICR_GPIO_OWN_PIN0_Max (0x1UL)             /*!< Max enumerator value of PIN0 field.                                  */
  #define UICR_GPIO_OWN_PIN0_NotOwn (0x1UL)          /*!< Do not own the pin 0                                                 */
  #define UICR_GPIO_OWN_PIN0_Own (0x0UL)             /*!< Own the pin 0                                                        */

/* PIN1 @Bit 1 : Pin number */
  #define UICR_GPIO_OWN_PIN1_Pos (1UL)               /*!< Position of PIN1 field.                                              */
  #define UICR_GPIO_OWN_PIN1_Msk (0x1UL << UICR_GPIO_OWN_PIN1_Pos) /*!< Bit mask of PIN1 field.                                */
  #define UICR_GPIO_OWN_PIN1_Min (0x0UL)             /*!< Min enumerator value of PIN1 field.                                  */
  #define UICR_GPIO_OWN_PIN1_Max (0x1UL)             /*!< Max enumerator value of PIN1 field.                                  */
  #define UICR_GPIO_OWN_PIN1_NotOwn (0x1UL)          /*!< Do not own the pin 1                                                 */
  #define UICR_GPIO_OWN_PIN1_Own (0x0UL)             /*!< Own the pin 1                                                        */

/* PIN2 @Bit 2 : Pin number */
  #define UICR_GPIO_OWN_PIN2_Pos (2UL)               /*!< Position of PIN2 field.                                              */
  #define UICR_GPIO_OWN_PIN2_Msk (0x1UL << UICR_GPIO_OWN_PIN2_Pos) /*!< Bit mask of PIN2 field.                                */
  #define UICR_GPIO_OWN_PIN2_Min (0x0UL)             /*!< Min enumerator value of PIN2 field.                                  */
  #define UICR_GPIO_OWN_PIN2_Max (0x1UL)             /*!< Max enumerator value of PIN2 field.                                  */
  #define UICR_GPIO_OWN_PIN2_NotOwn (0x1UL)          /*!< Do not own the pin 2                                                 */
  #define UICR_GPIO_OWN_PIN2_Own (0x0UL)             /*!< Own the pin 2                                                        */

/* PIN3 @Bit 3 : Pin number */
  #define UICR_GPIO_OWN_PIN3_Pos (3UL)               /*!< Position of PIN3 field.                                              */
  #define UICR_GPIO_OWN_PIN3_Msk (0x1UL << UICR_GPIO_OWN_PIN3_Pos) /*!< Bit mask of PIN3 field.                                */
  #define UICR_GPIO_OWN_PIN3_Min (0x0UL)             /*!< Min enumerator value of PIN3 field.                                  */
  #define UICR_GPIO_OWN_PIN3_Max (0x1UL)             /*!< Max enumerator value of PIN3 field.                                  */
  #define UICR_GPIO_OWN_PIN3_NotOwn (0x1UL)          /*!< Do not own the pin 3                                                 */
  #define UICR_GPIO_OWN_PIN3_Own (0x0UL)             /*!< Own the pin 3                                                        */

/* PIN4 @Bit 4 : Pin number */
  #define UICR_GPIO_OWN_PIN4_Pos (4UL)               /*!< Position of PIN4 field.                                              */
  #define UICR_GPIO_OWN_PIN4_Msk (0x1UL << UICR_GPIO_OWN_PIN4_Pos) /*!< Bit mask of PIN4 field.                                */
  #define UICR_GPIO_OWN_PIN4_Min (0x0UL)             /*!< Min enumerator value of PIN4 field.                                  */
  #define UICR_GPIO_OWN_PIN4_Max (0x1UL)             /*!< Max enumerator value of PIN4 field.                                  */
  #define UICR_GPIO_OWN_PIN4_NotOwn (0x1UL)          /*!< Do not own the pin 4                                                 */
  #define UICR_GPIO_OWN_PIN4_Own (0x0UL)             /*!< Own the pin 4                                                        */

/* PIN5 @Bit 5 : Pin number */
  #define UICR_GPIO_OWN_PIN5_Pos (5UL)               /*!< Position of PIN5 field.                                              */
  #define UICR_GPIO_OWN_PIN5_Msk (0x1UL << UICR_GPIO_OWN_PIN5_Pos) /*!< Bit mask of PIN5 field.                                */
  #define UICR_GPIO_OWN_PIN5_Min (0x0UL)             /*!< Min enumerator value of PIN5 field.                                  */
  #define UICR_GPIO_OWN_PIN5_Max (0x1UL)             /*!< Max enumerator value of PIN5 field.                                  */
  #define UICR_GPIO_OWN_PIN5_NotOwn (0x1UL)          /*!< Do not own the pin 5                                                 */
  #define UICR_GPIO_OWN_PIN5_Own (0x0UL)             /*!< Own the pin 5                                                        */

/* PIN6 @Bit 6 : Pin number */
  #define UICR_GPIO_OWN_PIN6_Pos (6UL)               /*!< Position of PIN6 field.                                              */
  #define UICR_GPIO_OWN_PIN6_Msk (0x1UL << UICR_GPIO_OWN_PIN6_Pos) /*!< Bit mask of PIN6 field.                                */
  #define UICR_GPIO_OWN_PIN6_Min (0x0UL)             /*!< Min enumerator value of PIN6 field.                                  */
  #define UICR_GPIO_OWN_PIN6_Max (0x1UL)             /*!< Max enumerator value of PIN6 field.                                  */
  #define UICR_GPIO_OWN_PIN6_NotOwn (0x1UL)          /*!< Do not own the pin 6                                                 */
  #define UICR_GPIO_OWN_PIN6_Own (0x0UL)             /*!< Own the pin 6                                                        */

/* PIN7 @Bit 7 : Pin number */
  #define UICR_GPIO_OWN_PIN7_Pos (7UL)               /*!< Position of PIN7 field.                                              */
  #define UICR_GPIO_OWN_PIN7_Msk (0x1UL << UICR_GPIO_OWN_PIN7_Pos) /*!< Bit mask of PIN7 field.                                */
  #define UICR_GPIO_OWN_PIN7_Min (0x0UL)             /*!< Min enumerator value of PIN7 field.                                  */
  #define UICR_GPIO_OWN_PIN7_Max (0x1UL)             /*!< Max enumerator value of PIN7 field.                                  */
  #define UICR_GPIO_OWN_PIN7_NotOwn (0x1UL)          /*!< Do not own the pin 7                                                 */
  #define UICR_GPIO_OWN_PIN7_Own (0x0UL)             /*!< Own the pin 7                                                        */

/* PIN8 @Bit 8 : Pin number */
  #define UICR_GPIO_OWN_PIN8_Pos (8UL)               /*!< Position of PIN8 field.                                              */
  #define UICR_GPIO_OWN_PIN8_Msk (0x1UL << UICR_GPIO_OWN_PIN8_Pos) /*!< Bit mask of PIN8 field.                                */
  #define UICR_GPIO_OWN_PIN8_Min (0x0UL)             /*!< Min enumerator value of PIN8 field.                                  */
  #define UICR_GPIO_OWN_PIN8_Max (0x1UL)             /*!< Max enumerator value of PIN8 field.                                  */
  #define UICR_GPIO_OWN_PIN8_NotOwn (0x1UL)          /*!< Do not own the pin 8                                                 */
  #define UICR_GPIO_OWN_PIN8_Own (0x0UL)             /*!< Own the pin 8                                                        */

/* PIN9 @Bit 9 : Pin number */
  #define UICR_GPIO_OWN_PIN9_Pos (9UL)               /*!< Position of PIN9 field.                                              */
  #define UICR_GPIO_OWN_PIN9_Msk (0x1UL << UICR_GPIO_OWN_PIN9_Pos) /*!< Bit mask of PIN9 field.                                */
  #define UICR_GPIO_OWN_PIN9_Min (0x0UL)             /*!< Min enumerator value of PIN9 field.                                  */
  #define UICR_GPIO_OWN_PIN9_Max (0x1UL)             /*!< Max enumerator value of PIN9 field.                                  */
  #define UICR_GPIO_OWN_PIN9_NotOwn (0x1UL)          /*!< Do not own the pin 9                                                 */
  #define UICR_GPIO_OWN_PIN9_Own (0x0UL)             /*!< Own the pin 9                                                        */

