adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PIN10 @Bit 10 : Pin number */
  #define UICR_GPIO_OWN_PIN10_Pos (10UL)             /*!< Position of PIN10 field.                                             */
  #define UICR_GPIO_OWN_PIN10_Msk (0x1UL << UICR_GPIO_OWN_PIN10_Pos) /*!< Bit mask of PIN10 field.                             */
  #define UICR_GPIO_OWN_PIN10_Min (0x0UL)            /*!< Min enumerator value of PIN10 field.                                 */
  #define UICR_GPIO_OWN_PIN10_Max (0x1UL)            /*!< Max enumerator value of PIN10 field.                                 */
  #define UICR_GPIO_OWN_PIN10_NotOwn (0x1UL)         /*!< Do not own the pin 10                                                */
  #define UICR_GPIO_OWN_PIN10_Own (0x0UL)            /*!< Own the pin 10                                                       */

/* PIN11 @Bit 11 : Pin number */
  #define UICR_GPIO_OWN_PIN11_Pos (11UL)             /*!< Position of PIN11 field.                                             */
  #define UICR_GPIO_OWN_PIN11_Msk (0x1UL << UICR_GPIO_OWN_PIN11_Pos) /*!< Bit mask of PIN11 field.                             */
  #define UICR_GPIO_OWN_PIN11_Min (0x0UL)            /*!< Min enumerator value of PIN11 field.                                 */
  #define UICR_GPIO_OWN_PIN11_Max (0x1UL)            /*!< Max enumerator value of PIN11 field.                                 */
  #define UICR_GPIO_OWN_PIN11_NotOwn (0x1UL)         /*!< Do not own the pin 11                                                */
  #define UICR_GPIO_OWN_PIN11_Own (0x0UL)            /*!< Own the pin 11                                                       */

/* PIN12 @Bit 12 : Pin number */
  #define UICR_GPIO_OWN_PIN12_Pos (12UL)             /*!< Position of PIN12 field.                                             */
  #define UICR_GPIO_OWN_PIN12_Msk (0x1UL << UICR_GPIO_OWN_PIN12_Pos) /*!< Bit mask of PIN12 field.                             */
  #define UICR_GPIO_OWN_PIN12_Min (0x0UL)            /*!< Min enumerator value of PIN12 field.                                 */
  #define UICR_GPIO_OWN_PIN12_Max (0x1UL)            /*!< Max enumerator value of PIN12 field.                                 */
  #define UICR_GPIO_OWN_PIN12_NotOwn (0x1UL)         /*!< Do not own the pin 12                                                */
  #define UICR_GPIO_OWN_PIN12_Own (0x0UL)            /*!< Own the pin 12                                                       */

/* PIN13 @Bit 13 : Pin number */
  #define UICR_GPIO_OWN_PIN13_Pos (13UL)             /*!< Position of PIN13 field.                                             */
  #define UICR_GPIO_OWN_PIN13_Msk (0x1UL << UICR_GPIO_OWN_PIN13_Pos) /*!< Bit mask of PIN13 field.                             */
  #define UICR_GPIO_OWN_PIN13_Min (0x0UL)            /*!< Min enumerator value of PIN13 field.                                 */
  #define UICR_GPIO_OWN_PIN13_Max (0x1UL)            /*!< Max enumerator value of PIN13 field.                                 */
  #define UICR_GPIO_OWN_PIN13_NotOwn (0x1UL)         /*!< Do not own the pin 13                                                */
  #define UICR_GPIO_OWN_PIN13_Own (0x0UL)            /*!< Own the pin 13                                                       */

/* PIN14 @Bit 14 : Pin number */
  #define UICR_GPIO_OWN_PIN14_Pos (14UL)             /*!< Position of PIN14 field.                                             */
  #define UICR_GPIO_OWN_PIN14_Msk (0x1UL << UICR_GPIO_OWN_PIN14_Pos) /*!< Bit mask of PIN14 field.                             */
  #define UICR_GPIO_OWN_PIN14_Min (0x0UL)            /*!< Min enumerator value of PIN14 field.                                 */
  #define UICR_GPIO_OWN_PIN14_Max (0x1UL)            /*!< Max enumerator value of PIN14 field.                                 */
  #define UICR_GPIO_OWN_PIN14_NotOwn (0x1UL)         /*!< Do not own the pin 14                                                */
  #define UICR_GPIO_OWN_PIN14_Own (0x0UL)            /*!< Own the pin 14                                                       */

/* PIN15 @Bit 15 : Pin number */
  #define UICR_GPIO_OWN_PIN15_Pos (15UL)             /*!< Position of PIN15 field.                                             */
  #define UICR_GPIO_OWN_PIN15_Msk (0x1UL << UICR_GPIO_OWN_PIN15_Pos) /*!< Bit mask of PIN15 field.                             */
  #define UICR_GPIO_OWN_PIN15_Min (0x0UL)            /*!< Min enumerator value of PIN15 field.                                 */
  #define UICR_GPIO_OWN_PIN15_Max (0x1UL)            /*!< Max enumerator value of PIN15 field.                                 */
  #define UICR_GPIO_OWN_PIN15_NotOwn (0x1UL)         /*!< Do not own the pin 15                                                */
  #define UICR_GPIO_OWN_PIN15_Own (0x0UL)            /*!< Own the pin 15                                                       */

/* PIN16 @Bit 16 : Pin number */
  #define UICR_GPIO_OWN_PIN16_Pos (16UL)             /*!< Position of PIN16 field.                                             */
  #define UICR_GPIO_OWN_PIN16_Msk (0x1UL << UICR_GPIO_OWN_PIN16_Pos) /*!< Bit mask of PIN16 field.                             */
  #define UICR_GPIO_OWN_PIN16_Min (0x0UL)            /*!< Min enumerator value of PIN16 field.                                 */
  #define UICR_GPIO_OWN_PIN16_Max (0x1UL)            /*!< Max enumerator value of PIN16 field.                                 */
  #define UICR_GPIO_OWN_PIN16_NotOwn (0x1UL)         /*!< Do not own the pin 16                                                */
  #define UICR_GPIO_OWN_PIN16_Own (0x0UL)            /*!< Own the pin 16                                                       */

/* PIN17 @Bit 17 : Pin number */
  #define UICR_GPIO_OWN_PIN17_Pos (17UL)             /*!< Position of PIN17 field.                                             */
  #define UICR_GPIO_OWN_PIN17_Msk (0x1UL << UICR_GPIO_OWN_PIN17_Pos) /*!< Bit mask of PIN17 field.                             */
  #define UICR_GPIO_OWN_PIN17_Min (0x0UL)            /*!< Min enumerator value of PIN17 field.                                 */
  #define UICR_GPIO_OWN_PIN17_Max (0x1UL)            /*!< Max enumerator value of PIN17 field.                                 */
  #define UICR_GPIO_OWN_PIN17_NotOwn (0x1UL)         /*!< Do not own the pin 17                                                */
  #define UICR_GPIO_OWN_PIN17_Own (0x0UL)            /*!< Own the pin 17                                                       */

/* PIN18 @Bit 18 : Pin number */
  #define UICR_GPIO_OWN_PIN18_Pos (18UL)             /*!< Position of PIN18 field.                                             */
  #define UICR_GPIO_OWN_PIN18_Msk (0x1UL << UICR_GPIO_OWN_PIN18_Pos) /*!< Bit mask of PIN18 field.                             */
  #define UICR_GPIO_OWN_PIN18_Min (0x0UL)            /*!< Min enumerator value of PIN18 field.                                 */
  #define UICR_GPIO_OWN_PIN18_Max (0x1UL)            /*!< Max enumerator value of PIN18 field.                                 */
  #define UICR_GPIO_OWN_PIN18_NotOwn (0x1UL)         /*!< Do not own the pin 18                                                */
  #define UICR_GPIO_OWN_PIN18_Own (0x0UL)            /*!< Own the pin 18                                                       */

