adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PIN19 @Bit 19 : Pin number */
  #define UICR_GPIO_OWN_PIN19_Pos (19UL)             /*!< Position of PIN19 field.                                             */
  #define UICR_GPIO_OWN_PIN19_Msk (0x1UL << UICR_GPIO_OWN_PIN19_Pos) /*!< Bit mask of PIN19 field.                             */
  #define UICR_GPIO_OWN_PIN19_Min (0x0UL)            /*!< Min enumerator value of PIN19 field.                                 */
  #define UICR_GPIO_OWN_PIN19_Max (0x1UL)            /*!< Max enumerator value of PIN19 field.                                 */
  #define UICR_GPIO_OWN_PIN19_NotOwn (0x1UL)         /*!< Do not own the pin 19                                                */
  #define UICR_GPIO_OWN_PIN19_Own (0x0UL)            /*!< Own the pin 19                                                       */

/* PIN20 @Bit 20 : Pin number */
  #define UICR_GPIO_OWN_PIN20_Pos (20UL)             /*!< Position of PIN20 field.                                             */
  #define UICR_GPIO_OWN_PIN20_Msk (0x1UL << UICR_GPIO_OWN_PIN20_Pos) /*!< Bit mask of PIN20 field.                             */
  #define UICR_GPIO_OWN_PIN20_Min (0x0UL)            /*!< Min enumerator value of PIN20 field.                                 */
  #define UICR_GPIO_OWN_PIN20_Max (0x1UL)            /*!< Max enumerator value of PIN20 field.                                 */
  #define UICR_GPIO_OWN_PIN20_NotOwn (0x1UL)         /*!< Do not own the pin 20                                                */
  #define UICR_GPIO_OWN_PIN20_Own (0x0UL)            /*!< Own the pin 20                                                       */

/* PIN21 @Bit 21 : Pin number */
  #define UICR_GPIO_OWN_PIN21_Pos (21UL)             /*!< Position of PIN21 field.                                             */
  #define UICR_GPIO_OWN_PIN21_Msk (0x1UL << UICR_GPIO_OWN_PIN21_Pos) /*!< Bit mask of PIN21 field.                             */
  #define UICR_GPIO_OWN_PIN21_Min (0x0UL)            /*!< Min enumerator value of PIN21 field.                                 */
  #define UICR_GPIO_OWN_PIN21_Max (0x1UL)            /*!< Max enumerator value of PIN21 field.                                 */
  #define UICR_GPIO_OWN_PIN21_NotOwn (0x1UL)         /*!< Do not own the pin 21                                                */
  #define UICR_GPIO_OWN_PIN21_Own (0x0UL)            /*!< Own the pin 21                                                       */

/* PIN22 @Bit 22 : Pin number */
  #define UICR_GPIO_OWN_PIN22_Pos (22UL)             /*!< Position of PIN22 field.                                             */
  #define UICR_GPIO_OWN_PIN22_Msk (0x1UL << UICR_GPIO_OWN_PIN22_Pos) /*!< Bit mask of PIN22 field.                             */
  #define UICR_GPIO_OWN_PIN22_Min (0x0UL)            /*!< Min enumerator value of PIN22 field.                                 */
  #define UICR_GPIO_OWN_PIN22_Max (0x1UL)            /*!< Max enumerator value of PIN22 field.                                 */
  #define UICR_GPIO_OWN_PIN22_NotOwn (0x1UL)         /*!< Do not own the pin 22                                                */
  #define UICR_GPIO_OWN_PIN22_Own (0x0UL)            /*!< Own the pin 22                                                       */

/* PIN23 @Bit 23 : Pin number */
  #define UICR_GPIO_OWN_PIN23_Pos (23UL)             /*!< Position of PIN23 field.                                             */
  #define UICR_GPIO_OWN_PIN23_Msk (0x1UL << UICR_GPIO_OWN_PIN23_Pos) /*!< Bit mask of PIN23 field.                             */
  #define UICR_GPIO_OWN_PIN23_Min (0x0UL)            /*!< Min enumerator value of PIN23 field.                                 */
  #define UICR_GPIO_OWN_PIN23_Max (0x1UL)            /*!< Max enumerator value of PIN23 field.                                 */
  #define UICR_GPIO_OWN_PIN23_NotOwn (0x1UL)         /*!< Do not own the pin 23                                                */
  #define UICR_GPIO_OWN_PIN23_Own (0x0UL)            /*!< Own the pin 23                                                       */

/* PIN24 @Bit 24 : Pin number */
  #define UICR_GPIO_OWN_PIN24_Pos (24UL)             /*!< Position of PIN24 field.                                             */
  #define UICR_GPIO_OWN_PIN24_Msk (0x1UL << UICR_GPIO_OWN_PIN24_Pos) /*!< Bit mask of PIN24 field.                             */
  #define UICR_GPIO_OWN_PIN24_Min (0x0UL)            /*!< Min enumerator value of PIN24 field.                                 */
  #define UICR_GPIO_OWN_PIN24_Max (0x1UL)            /*!< Max enumerator value of PIN24 field.                                 */
  #define UICR_GPIO_OWN_PIN24_NotOwn (0x1UL)         /*!< Do not own the pin 24                                                */
  #define UICR_GPIO_OWN_PIN24_Own (0x0UL)            /*!< Own the pin 24                                                       */

/* PIN25 @Bit 25 : Pin number */
  #define UICR_GPIO_OWN_PIN25_Pos (25UL)             /*!< Position of PIN25 field.                                             */
  #define UICR_GPIO_OWN_PIN25_Msk (0x1UL << UICR_GPIO_OWN_PIN25_Pos) /*!< Bit mask of PIN25 field.                             */
  #define UICR_GPIO_OWN_PIN25_Min (0x0UL)            /*!< Min enumerator value of PIN25 field.                                 */
  #define UICR_GPIO_OWN_PIN25_Max (0x1UL)            /*!< Max enumerator value of PIN25 field.                                 */
  #define UICR_GPIO_OWN_PIN25_NotOwn (0x1UL)         /*!< Do not own the pin 25                                                */
  #define UICR_GPIO_OWN_PIN25_Own (0x0UL)            /*!< Own the pin 25                                                       */

/* PIN26 @Bit 26 : Pin number */
  #define UICR_GPIO_OWN_PIN26_Pos (26UL)             /*!< Position of PIN26 field.                                             */
  #define UICR_GPIO_OWN_PIN26_Msk (0x1UL << UICR_GPIO_OWN_PIN26_Pos) /*!< Bit mask of PIN26 field.                             */
  #define UICR_GPIO_OWN_PIN26_Min (0x0UL)            /*!< Min enumerator value of PIN26 field.                                 */
  #define UICR_GPIO_OWN_PIN26_Max (0x1UL)            /*!< Max enumerator value of PIN26 field.                                 */
  #define UICR_GPIO_OWN_PIN26_NotOwn (0x1UL)         /*!< Do not own the pin 26                                                */
  #define UICR_GPIO_OWN_PIN26_Own (0x0UL)            /*!< Own the pin 26                                                       */

/* PIN27 @Bit 27 : Pin number */
  #define UICR_GPIO_OWN_PIN27_Pos (27UL)             /*!< Position of PIN27 field.                                             */
  #define UICR_GPIO_OWN_PIN27_Msk (0x1UL << UICR_GPIO_OWN_PIN27_Pos) /*!< Bit mask of PIN27 field.                             */
  #define UICR_GPIO_OWN_PIN27_Min (0x0UL)            /*!< Min enumerator value of PIN27 field.                                 */
  #define UICR_GPIO_OWN_PIN27_Max (0x1UL)            /*!< Max enumerator value of PIN27 field.                                 */
  #define UICR_GPIO_OWN_PIN27_NotOwn (0x1UL)         /*!< Do not own the pin 27                                                */
  #define UICR_GPIO_OWN_PIN27_Own (0x0UL)            /*!< Own the pin 27                                                       */

/* PIN28 @Bit 28 : Pin number */
  #define UICR_GPIO_OWN_PIN28_Pos (28UL)             /*!< Position of PIN28 field.                                             */
  #define UICR_GPIO_OWN_PIN28_Msk (0x1UL << UICR_GPIO_OWN_PIN28_Pos) /*!< Bit mask of PIN28 field.                             */
  #define UICR_GPIO_OWN_PIN28_Min (0x0UL)            /*!< Min enumerator value of PIN28 field.                                 */
  #define UICR_GPIO_OWN_PIN28_Max (0x1UL)            /*!< Max enumerator value of PIN28 field.                                 */
  #define UICR_GPIO_OWN_PIN28_NotOwn (0x1UL)         /*!< Do not own the pin 28                                                */
  #define UICR_GPIO_OWN_PIN28_Own (0x0UL)            /*!< Own the pin 28                                                       */

/* PIN29 @Bit 29 : Pin number */
  #define UICR_GPIO_OWN_PIN29_Pos (29UL)             /*!< Position of PIN29 field.                                             */
  #define UICR_GPIO_OWN_PIN29_Msk (0x1UL << UICR_GPIO_OWN_PIN29_Pos) /*!< Bit mask of PIN29 field.                             */
  #define UICR_GPIO_OWN_PIN29_Min (0x0UL)            /*!< Min enumerator value of PIN29 field.                                 */
  #define UICR_GPIO_OWN_PIN29_Max (0x1UL)            /*!< Max enumerator value of PIN29 field.                                 */
  #define UICR_GPIO_OWN_PIN29_NotOwn (0x1UL)         /*!< Do not own the pin 29                                                */
  #define UICR_GPIO_OWN_PIN29_Own (0x0UL)            /*!< Own the pin 29                                                       */

