adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PIN10 @Bit 10 : Pin number */
  #define UICR_GPIO_SECURE_PIN10_Pos (10UL)          /*!< Position of PIN10 field.                                             */
  #define UICR_GPIO_SECURE_PIN10_Msk (0x1UL << UICR_GPIO_SECURE_PIN10_Pos) /*!< Bit mask of PIN10 field.                       */
  #define UICR_GPIO_SECURE_PIN10_Min (0x0UL)         /*!< Min enumerator value of PIN10 field.                                 */
  #define UICR_GPIO_SECURE_PIN10_Max (0x1UL)         /*!< Max enumerator value of PIN10 field.                                 */
  #define UICR_GPIO_SECURE_PIN10_Secure (0x1UL)      /*!< The pin 10 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN10_NonSecure (0x0UL)   /*!< The pin 10 is non-secure                                             */

/* PIN11 @Bit 11 : Pin number */
  #define UICR_GPIO_SECURE_PIN11_Pos (11UL)          /*!< Position of PIN11 field.                                             */
  #define UICR_GPIO_SECURE_PIN11_Msk (0x1UL << UICR_GPIO_SECURE_PIN11_Pos) /*!< Bit mask of PIN11 field.                       */
  #define UICR_GPIO_SECURE_PIN11_Min (0x0UL)         /*!< Min enumerator value of PIN11 field.                                 */
  #define UICR_GPIO_SECURE_PIN11_Max (0x1UL)         /*!< Max enumerator value of PIN11 field.                                 */
  #define UICR_GPIO_SECURE_PIN11_Secure (0x1UL)      /*!< The pin 11 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN11_NonSecure (0x0UL)   /*!< The pin 11 is non-secure                                             */

/* PIN12 @Bit 12 : Pin number */
  #define UICR_GPIO_SECURE_PIN12_Pos (12UL)          /*!< Position of PIN12 field.                                             */
  #define UICR_GPIO_SECURE_PIN12_Msk (0x1UL << UICR_GPIO_SECURE_PIN12_Pos) /*!< Bit mask of PIN12 field.                       */
  #define UICR_GPIO_SECURE_PIN12_Min (0x0UL)         /*!< Min enumerator value of PIN12 field.                                 */
  #define UICR_GPIO_SECURE_PIN12_Max (0x1UL)         /*!< Max enumerator value of PIN12 field.                                 */
  #define UICR_GPIO_SECURE_PIN12_Secure (0x1UL)      /*!< The pin 12 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN12_NonSecure (0x0UL)   /*!< The pin 12 is non-secure                                             */

/* PIN13 @Bit 13 : Pin number */
  #define UICR_GPIO_SECURE_PIN13_Pos (13UL)          /*!< Position of PIN13 field.                                             */
  #define UICR_GPIO_SECURE_PIN13_Msk (0x1UL << UICR_GPIO_SECURE_PIN13_Pos) /*!< Bit mask of PIN13 field.                       */
  #define UICR_GPIO_SECURE_PIN13_Min (0x0UL)         /*!< Min enumerator value of PIN13 field.                                 */
  #define UICR_GPIO_SECURE_PIN13_Max (0x1UL)         /*!< Max enumerator value of PIN13 field.                                 */
  #define UICR_GPIO_SECURE_PIN13_Secure (0x1UL)      /*!< The pin 13 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN13_NonSecure (0x0UL)   /*!< The pin 13 is non-secure                                             */

/* PIN14 @Bit 14 : Pin number */
  #define UICR_GPIO_SECURE_PIN14_Pos (14UL)          /*!< Position of PIN14 field.                                             */
  #define UICR_GPIO_SECURE_PIN14_Msk (0x1UL << UICR_GPIO_SECURE_PIN14_Pos) /*!< Bit mask of PIN14 field.                       */
  #define UICR_GPIO_SECURE_PIN14_Min (0x0UL)         /*!< Min enumerator value of PIN14 field.                                 */
  #define UICR_GPIO_SECURE_PIN14_Max (0x1UL)         /*!< Max enumerator value of PIN14 field.                                 */
  #define UICR_GPIO_SECURE_PIN14_Secure (0x1UL)      /*!< The pin 14 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN14_NonSecure (0x0UL)   /*!< The pin 14 is non-secure                                             */

/* PIN15 @Bit 15 : Pin number */
  #define UICR_GPIO_SECURE_PIN15_Pos (15UL)          /*!< Position of PIN15 field.                                             */
  #define UICR_GPIO_SECURE_PIN15_Msk (0x1UL << UICR_GPIO_SECURE_PIN15_Pos) /*!< Bit mask of PIN15 field.                       */
  #define UICR_GPIO_SECURE_PIN15_Min (0x0UL)         /*!< Min enumerator value of PIN15 field.                                 */
  #define UICR_GPIO_SECURE_PIN15_Max (0x1UL)         /*!< Max enumerator value of PIN15 field.                                 */
  #define UICR_GPIO_SECURE_PIN15_Secure (0x1UL)      /*!< The pin 15 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN15_NonSecure (0x0UL)   /*!< The pin 15 is non-secure                                             */

/* PIN16 @Bit 16 : Pin number */
  #define UICR_GPIO_SECURE_PIN16_Pos (16UL)          /*!< Position of PIN16 field.                                             */
  #define UICR_GPIO_SECURE_PIN16_Msk (0x1UL << UICR_GPIO_SECURE_PIN16_Pos) /*!< Bit mask of PIN16 field.                       */
  #define UICR_GPIO_SECURE_PIN16_Min (0x0UL)         /*!< Min enumerator value of PIN16 field.                                 */
  #define UICR_GPIO_SECURE_PIN16_Max (0x1UL)         /*!< Max enumerator value of PIN16 field.                                 */
  #define UICR_GPIO_SECURE_PIN16_Secure (0x1UL)      /*!< The pin 16 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN16_NonSecure (0x0UL)   /*!< The pin 16 is non-secure                                             */

/* PIN17 @Bit 17 : Pin number */
  #define UICR_GPIO_SECURE_PIN17_Pos (17UL)          /*!< Position of PIN17 field.                                             */
  #define UICR_GPIO_SECURE_PIN17_Msk (0x1UL << UICR_GPIO_SECURE_PIN17_Pos) /*!< Bit mask of PIN17 field.                       */
  #define UICR_GPIO_SECURE_PIN17_Min (0x0UL)         /*!< Min enumerator value of PIN17 field.                                 */
  #define UICR_GPIO_SECURE_PIN17_Max (0x1UL)         /*!< Max enumerator value of PIN17 field.                                 */
  #define UICR_GPIO_SECURE_PIN17_Secure (0x1UL)      /*!< The pin 17 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN17_NonSecure (0x0UL)   /*!< The pin 17 is non-secure                                             */

/* PIN18 @Bit 18 : Pin number */
  #define UICR_GPIO_SECURE_PIN18_Pos (18UL)          /*!< Position of PIN18 field.                                             */
  #define UICR_GPIO_SECURE_PIN18_Msk (0x1UL << UICR_GPIO_SECURE_PIN18_Pos) /*!< Bit mask of PIN18 field.                       */
  #define UICR_GPIO_SECURE_PIN18_Min (0x0UL)         /*!< Min enumerator value of PIN18 field.                                 */
  #define UICR_GPIO_SECURE_PIN18_Max (0x1UL)         /*!< Max enumerator value of PIN18 field.                                 */
  #define UICR_GPIO_SECURE_PIN18_Secure (0x1UL)      /*!< The pin 18 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN18_NonSecure (0x0UL)   /*!< The pin 18 is non-secure                                             */

