adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PIN19 @Bit 19 : Pin number */
  #define UICR_GPIO_SECURE_PIN19_Pos (19UL)          /*!< Position of PIN19 field.                                             */
  #define UICR_GPIO_SECURE_PIN19_Msk (0x1UL << UICR_GPIO_SECURE_PIN19_Pos) /*!< Bit mask of PIN19 field.                       */
  #define UICR_GPIO_SECURE_PIN19_Min (0x0UL)         /*!< Min enumerator value of PIN19 field.                                 */
  #define UICR_GPIO_SECURE_PIN19_Max (0x1UL)         /*!< Max enumerator value of PIN19 field.                                 */
  #define UICR_GPIO_SECURE_PIN19_Secure (0x1UL)      /*!< The pin 19 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN19_NonSecure (0x0UL)   /*!< The pin 19 is non-secure                                             */

/* PIN20 @Bit 20 : Pin number */
  #define UICR_GPIO_SECURE_PIN20_Pos (20UL)          /*!< Position of PIN20 field.                                             */
  #define UICR_GPIO_SECURE_PIN20_Msk (0x1UL << UICR_GPIO_SECURE_PIN20_Pos) /*!< Bit mask of PIN20 field.                       */
  #define UICR_GPIO_SECURE_PIN20_Min (0x0UL)         /*!< Min enumerator value of PIN20 field.                                 */
  #define UICR_GPIO_SECURE_PIN20_Max (0x1UL)         /*!< Max enumerator value of PIN20 field.                                 */
  #define UICR_GPIO_SECURE_PIN20_Secure (0x1UL)      /*!< The pin 20 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN20_NonSecure (0x0UL)   /*!< The pin 20 is non-secure                                             */

/* PIN21 @Bit 21 : Pin number */
  #define UICR_GPIO_SECURE_PIN21_Pos (21UL)          /*!< Position of PIN21 field.                                             */
  #define UICR_GPIO_SECURE_PIN21_Msk (0x1UL << UICR_GPIO_SECURE_PIN21_Pos) /*!< Bit mask of PIN21 field.                       */
  #define UICR_GPIO_SECURE_PIN21_Min (0x0UL)         /*!< Min enumerator value of PIN21 field.                                 */
  #define UICR_GPIO_SECURE_PIN21_Max (0x1UL)         /*!< Max enumerator value of PIN21 field.                                 */
  #define UICR_GPIO_SECURE_PIN21_Secure (0x1UL)      /*!< The pin 21 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN21_NonSecure (0x0UL)   /*!< The pin 21 is non-secure                                             */

/* PIN22 @Bit 22 : Pin number */
  #define UICR_GPIO_SECURE_PIN22_Pos (22UL)          /*!< Position of PIN22 field.                                             */
  #define UICR_GPIO_SECURE_PIN22_Msk (0x1UL << UICR_GPIO_SECURE_PIN22_Pos) /*!< Bit mask of PIN22 field.                       */
  #define UICR_GPIO_SECURE_PIN22_Min (0x0UL)         /*!< Min enumerator value of PIN22 field.                                 */
  #define UICR_GPIO_SECURE_PIN22_Max (0x1UL)         /*!< Max enumerator value of PIN22 field.                                 */
  #define UICR_GPIO_SECURE_PIN22_Secure (0x1UL)      /*!< The pin 22 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN22_NonSecure (0x0UL)   /*!< The pin 22 is non-secure                                             */

/* PIN23 @Bit 23 : Pin number */
  #define UICR_GPIO_SECURE_PIN23_Pos (23UL)          /*!< Position of PIN23 field.                                             */
  #define UICR_GPIO_SECURE_PIN23_Msk (0x1UL << UICR_GPIO_SECURE_PIN23_Pos) /*!< Bit mask of PIN23 field.                       */
  #define UICR_GPIO_SECURE_PIN23_Min (0x0UL)         /*!< Min enumerator value of PIN23 field.                                 */
  #define UICR_GPIO_SECURE_PIN23_Max (0x1UL)         /*!< Max enumerator value of PIN23 field.                                 */
  #define UICR_GPIO_SECURE_PIN23_Secure (0x1UL)      /*!< The pin 23 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN23_NonSecure (0x0UL)   /*!< The pin 23 is non-secure                                             */

/* PIN24 @Bit 24 : Pin number */
  #define UICR_GPIO_SECURE_PIN24_Pos (24UL)          /*!< Position of PIN24 field.                                             */
  #define UICR_GPIO_SECURE_PIN24_Msk (0x1UL << UICR_GPIO_SECURE_PIN24_Pos) /*!< Bit mask of PIN24 field.                       */
  #define UICR_GPIO_SECURE_PIN24_Min (0x0UL)         /*!< Min enumerator value of PIN24 field.                                 */
  #define UICR_GPIO_SECURE_PIN24_Max (0x1UL)         /*!< Max enumerator value of PIN24 field.                                 */
  #define UICR_GPIO_SECURE_PIN24_Secure (0x1UL)      /*!< The pin 24 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN24_NonSecure (0x0UL)   /*!< The pin 24 is non-secure                                             */

/* PIN25 @Bit 25 : Pin number */
  #define UICR_GPIO_SECURE_PIN25_Pos (25UL)          /*!< Position of PIN25 field.                                             */
  #define UICR_GPIO_SECURE_PIN25_Msk (0x1UL << UICR_GPIO_SECURE_PIN25_Pos) /*!< Bit mask of PIN25 field.                       */
  #define UICR_GPIO_SECURE_PIN25_Min (0x0UL)         /*!< Min enumerator value of PIN25 field.                                 */
  #define UICR_GPIO_SECURE_PIN25_Max (0x1UL)         /*!< Max enumerator value of PIN25 field.                                 */
  #define UICR_GPIO_SECURE_PIN25_Secure (0x1UL)      /*!< The pin 25 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN25_NonSecure (0x0UL)   /*!< The pin 25 is non-secure                                             */

/* PIN26 @Bit 26 : Pin number */
  #define UICR_GPIO_SECURE_PIN26_Pos (26UL)          /*!< Position of PIN26 field.                                             */
  #define UICR_GPIO_SECURE_PIN26_Msk (0x1UL << UICR_GPIO_SECURE_PIN26_Pos) /*!< Bit mask of PIN26 field.                       */
  #define UICR_GPIO_SECURE_PIN26_Min (0x0UL)         /*!< Min enumerator value of PIN26 field.                                 */
  #define UICR_GPIO_SECURE_PIN26_Max (0x1UL)         /*!< Max enumerator value of PIN26 field.                                 */
  #define UICR_GPIO_SECURE_PIN26_Secure (0x1UL)      /*!< The pin 26 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN26_NonSecure (0x0UL)   /*!< The pin 26 is non-secure                                             */

/* PIN27 @Bit 27 : Pin number */
  #define UICR_GPIO_SECURE_PIN27_Pos (27UL)          /*!< Position of PIN27 field.                                             */
  #define UICR_GPIO_SECURE_PIN27_Msk (0x1UL << UICR_GPIO_SECURE_PIN27_Pos) /*!< Bit mask of PIN27 field.                       */
  #define UICR_GPIO_SECURE_PIN27_Min (0x0UL)         /*!< Min enumerator value of PIN27 field.                                 */
  #define UICR_GPIO_SECURE_PIN27_Max (0x1UL)         /*!< Max enumerator value of PIN27 field.                                 */
  #define UICR_GPIO_SECURE_PIN27_Secure (0x1UL)      /*!< The pin 27 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN27_NonSecure (0x0UL)   /*!< The pin 27 is non-secure                                             */

/* PIN28 @Bit 28 : Pin number */
  #define UICR_GPIO_SECURE_PIN28_Pos (28UL)          /*!< Position of PIN28 field.                                             */
  #define UICR_GPIO_SECURE_PIN28_Msk (0x1UL << UICR_GPIO_SECURE_PIN28_Pos) /*!< Bit mask of PIN28 field.                       */
  #define UICR_GPIO_SECURE_PIN28_Min (0x0UL)         /*!< Min enumerator value of PIN28 field.                                 */
  #define UICR_GPIO_SECURE_PIN28_Max (0x1UL)         /*!< Max enumerator value of PIN28 field.                                 */
  #define UICR_GPIO_SECURE_PIN28_Secure (0x1UL)      /*!< The pin 28 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN28_NonSecure (0x0UL)   /*!< The pin 28 is non-secure                                             */

/* PIN29 @Bit 29 : Pin number */
  #define UICR_GPIO_SECURE_PIN29_Pos (29UL)          /*!< Position of PIN29 field.                                             */
  #define UICR_GPIO_SECURE_PIN29_Msk (0x1UL << UICR_GPIO_SECURE_PIN29_Pos) /*!< Bit mask of PIN29 field.                       */
  #define UICR_GPIO_SECURE_PIN29_Min (0x0UL)         /*!< Min enumerator value of PIN29 field.                                 */
  #define UICR_GPIO_SECURE_PIN29_Max (0x1UL)         /*!< Max enumerator value of PIN29 field.                                 */
  #define UICR_GPIO_SECURE_PIN29_Secure (0x1UL)      /*!< The pin 29 is secure                                                 */
  #define UICR_GPIO_SECURE_PIN29_NonSecure (0x0UL)   /*!< The pin 29 is non-secure                                             */

