adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* UICR_IPCT_LOCAL_CH_SECURE: Request permission for the channels of IPCT in the local domain */
  #define UICR_IPCT_LOCAL_CH_SECURE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of SECURE register.                             */

/* CH0 @Bit 0 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH0_Pos (0UL)    /*!< Position of CH0 field.                                               */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH0_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH0_Pos) /*!< Bit mask of CH0 field.           */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH0_Min (0x0UL)  /*!< Min enumerator value of CH0 field.                                   */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH0_Max (0x1UL)  /*!< Max enumerator value of CH0 field.                                   */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH0_Secure (0x1UL) /*!< The channel 0 is secure                                            */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH0_NonSecure (0x0UL) /*!< The channel 0 is non-secure                                     */

/* CH1 @Bit 1 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH1_Pos (1UL)    /*!< Position of CH1 field.                                               */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH1_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH1_Pos) /*!< Bit mask of CH1 field.           */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH1_Min (0x0UL)  /*!< Min enumerator value of CH1 field.                                   */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH1_Max (0x1UL)  /*!< Max enumerator value of CH1 field.                                   */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH1_Secure (0x1UL) /*!< The channel 1 is secure                                            */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH1_NonSecure (0x0UL) /*!< The channel 1 is non-secure                                     */

/* CH2 @Bit 2 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH2_Pos (2UL)    /*!< Position of CH2 field.                                               */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH2_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH2_Pos) /*!< Bit mask of CH2 field.           */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH2_Min (0x0UL)  /*!< Min enumerator value of CH2 field.                                   */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH2_Max (0x1UL)  /*!< Max enumerator value of CH2 field.                                   */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH2_Secure (0x1UL) /*!< The channel 2 is secure                                            */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH2_NonSecure (0x0UL) /*!< The channel 2 is non-secure                                     */

/* CH3 @Bit 3 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH3_Pos (3UL)    /*!< Position of CH3 field.                                               */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH3_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH3_Pos) /*!< Bit mask of CH3 field.           */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH3_Min (0x0UL)  /*!< Min enumerator value of CH3 field.                                   */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH3_Max (0x1UL)  /*!< Max enumerator value of CH3 field.                                   */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH3_Secure (0x1UL) /*!< The channel 3 is secure                                            */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH3_NonSecure (0x0UL) /*!< The channel 3 is non-secure                                     */

/* CH4 @Bit 4 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH4_Pos (4UL)    /*!< Position of CH4 field.                                               */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH4_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH4_Pos) /*!< Bit mask of CH4 field.           */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH4_Min (0x0UL)  /*!< Min enumerator value of CH4 field.                                   */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH4_Max (0x1UL)  /*!< Max enumerator value of CH4 field.                                   */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH4_Secure (0x1UL) /*!< The channel 4 is secure                                            */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH4_NonSecure (0x0UL) /*!< The channel 4 is non-secure                                     */

/* CH5 @Bit 5 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH5_Pos (5UL)    /*!< Position of CH5 field.                                               */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH5_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH5_Pos) /*!< Bit mask of CH5 field.           */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH5_Min (0x0UL)  /*!< Min enumerator value of CH5 field.                                   */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH5_Max (0x1UL)  /*!< Max enumerator value of CH5 field.                                   */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH5_Secure (0x1UL) /*!< The channel 5 is secure                                            */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH5_NonSecure (0x0UL) /*!< The channel 5 is non-secure                                     */

/* CH6 @Bit 6 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH6_Pos (6UL)    /*!< Position of CH6 field.                                               */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH6_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH6_Pos) /*!< Bit mask of CH6 field.           */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH6_Min (0x0UL)  /*!< Min enumerator value of CH6 field.                                   */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH6_Max (0x1UL)  /*!< Max enumerator value of CH6 field.                                   */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH6_Secure (0x1UL) /*!< The channel 6 is secure                                            */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH6_NonSecure (0x0UL) /*!< The channel 6 is non-secure                                     */

/* CH7 @Bit 7 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH7_Pos (7UL)    /*!< Position of CH7 field.                                               */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH7_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH7_Pos) /*!< Bit mask of CH7 field.           */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH7_Min (0x0UL)  /*!< Min enumerator value of CH7 field.                                   */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH7_Max (0x1UL)  /*!< Max enumerator value of CH7 field.                                   */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH7_Secure (0x1UL) /*!< The channel 7 is secure                                            */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH7_NonSecure (0x0UL) /*!< The channel 7 is non-secure                                     */

