adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* INT16 @Bit 16 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT16_Pos (16UL) /*!< Position of INT16 field.                                      */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT16_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT16_Pos) /*!< Bit mask of
                                                                            INT16 field.*/                                        
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT16_Min (0x0UL) /*!< Min enumerator value of INT16 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT16_Max (0x1UL) /*!< Max enumerator value of INT16 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT16_Secure (0x1UL) /*!< The interrupt 16 is secure                                */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT16_NonSecure (0x0UL) /*!< The interrupt 16 is non-secure                         */

/* INT17 @Bit 17 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT17_Pos (17UL) /*!< Position of INT17 field.                                      */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT17_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT17_Pos) /*!< Bit mask of
                                                                            INT17 field.*/                                        
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT17_Min (0x0UL) /*!< Min enumerator value of INT17 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT17_Max (0x1UL) /*!< Max enumerator value of INT17 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT17_Secure (0x1UL) /*!< The interrupt 17 is secure                                */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT17_NonSecure (0x0UL) /*!< The interrupt 17 is non-secure                         */

/* INT18 @Bit 18 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT18_Pos (18UL) /*!< Position of INT18 field.                                      */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT18_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT18_Pos) /*!< Bit mask of
                                                                            INT18 field.*/                                        
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT18_Min (0x0UL) /*!< Min enumerator value of INT18 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT18_Max (0x1UL) /*!< Max enumerator value of INT18 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT18_Secure (0x1UL) /*!< The interrupt 18 is secure                                */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT18_NonSecure (0x0UL) /*!< The interrupt 18 is non-secure                         */

/* INT19 @Bit 19 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT19_Pos (19UL) /*!< Position of INT19 field.                                      */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT19_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT19_Pos) /*!< Bit mask of
                                                                            INT19 field.*/                                        
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT19_Min (0x0UL) /*!< Min enumerator value of INT19 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT19_Max (0x1UL) /*!< Max enumerator value of INT19 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT19_Secure (0x1UL) /*!< The interrupt 19 is secure                                */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT19_NonSecure (0x0UL) /*!< The interrupt 19 is non-secure                         */

/* INT20 @Bit 20 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT20_Pos (20UL) /*!< Position of INT20 field.                                      */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT20_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT20_Pos) /*!< Bit mask of
                                                                            INT20 field.*/                                        
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT20_Min (0x0UL) /*!< Min enumerator value of INT20 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT20_Max (0x1UL) /*!< Max enumerator value of INT20 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT20_Secure (0x1UL) /*!< The interrupt 20 is secure                                */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT20_NonSecure (0x0UL) /*!< The interrupt 20 is non-secure                         */

/* INT21 @Bit 21 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT21_Pos (21UL) /*!< Position of INT21 field.                                      */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT21_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT21_Pos) /*!< Bit mask of
                                                                            INT21 field.*/                                        
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT21_Min (0x0UL) /*!< Min enumerator value of INT21 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT21_Max (0x1UL) /*!< Max enumerator value of INT21 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT21_Secure (0x1UL) /*!< The interrupt 21 is secure                                */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT21_NonSecure (0x0UL) /*!< The interrupt 21 is non-secure                         */

/* INT22 @Bit 22 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT22_Pos (22UL) /*!< Position of INT22 field.                                      */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT22_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT22_Pos) /*!< Bit mask of
                                                                            INT22 field.*/                                        
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT22_Min (0x0UL) /*!< Min enumerator value of INT22 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT22_Max (0x1UL) /*!< Max enumerator value of INT22 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT22_Secure (0x1UL) /*!< The interrupt 22 is secure                                */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT22_NonSecure (0x0UL) /*!< The interrupt 22 is non-secure                         */

/* INT23 @Bit 23 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT23_Pos (23UL) /*!< Position of INT23 field.                                      */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT23_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT23_Pos) /*!< Bit mask of
                                                                            INT23 field.*/                                        
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT23_Min (0x0UL) /*!< Min enumerator value of INT23 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT23_Max (0x1UL) /*!< Max enumerator value of INT23 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT23_Secure (0x1UL) /*!< The interrupt 23 is secure                                */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT23_NonSecure (0x0UL) /*!< The interrupt 23 is non-secure                         */

