adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ============================================= Struct UICR_DPPI_LOCAL_CH_LINK ============================================== */
/**
  * @brief LINK [UICR_DPPI_LOCAL_CH_LINK] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SOURCE;                            /*!< (@ 0x00000000) Request linking the channels of DPPI[n] in the local
                                                                         domain as source Source channels send PPI events to the
                                                                         other side of the link*/                                 
  __IOM uint32_t  SINK;                              /*!< (@ 0x00000004) Request linking the channels of DPPI[n] in the local
                                                                         domain as sink Sink channels receive PPI events from
                                                                         the other side of the link*/                             
} NRF_UICR_DPPI_LOCAL_CH_LINK_Type;                  /*!< Size = 8 (0x008)                                                     */

/* UICR_DPPI_LOCAL_CH_LINK_SOURCE: Request linking the channels of DPPI[n] in the local domain as source Source channels send
                                    PPI events to the other side of the link */                                                   
                                                                                                                                  
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of SOURCE register.                        */

/* CH0 @Bit 0 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH0_Pos (0UL) /*!< Position of CH0 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH0_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH0_Pos) /*!< Bit mask of CH0 field. */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH0_Min (0x0UL) /*!< Min enumerator value of CH0 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH0_Max (0x1UL) /*!< Max enumerator value of CH0 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH0_NotLinked (0x1UL) /*!< The channel 0 is not linked as source                      */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH0_Linked (0x0UL) /*!< The channel 0 is linked as source                             */

/* CH1 @Bit 1 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH1_Pos (1UL) /*!< Position of CH1 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH1_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH1_Pos) /*!< Bit mask of CH1 field. */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH1_Min (0x0UL) /*!< Min enumerator value of CH1 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH1_Max (0x1UL) /*!< Max enumerator value of CH1 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH1_NotLinked (0x1UL) /*!< The channel 1 is not linked as source                      */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH1_Linked (0x0UL) /*!< The channel 1 is linked as source                             */

/* CH2 @Bit 2 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH2_Pos (2UL) /*!< Position of CH2 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH2_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH2_Pos) /*!< Bit mask of CH2 field. */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH2_Min (0x0UL) /*!< Min enumerator value of CH2 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH2_Max (0x1UL) /*!< Max enumerator value of CH2 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH2_NotLinked (0x1UL) /*!< The channel 2 is not linked as source                      */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH2_Linked (0x0UL) /*!< The channel 2 is linked as source                             */

/* CH3 @Bit 3 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH3_Pos (3UL) /*!< Position of CH3 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH3_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH3_Pos) /*!< Bit mask of CH3 field. */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH3_Min (0x0UL) /*!< Min enumerator value of CH3 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH3_Max (0x1UL) /*!< Max enumerator value of CH3 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH3_NotLinked (0x1UL) /*!< The channel 3 is not linked as source                      */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH3_Linked (0x0UL) /*!< The channel 3 is linked as source                             */

/* CH4 @Bit 4 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH4_Pos (4UL) /*!< Position of CH4 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH4_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH4_Pos) /*!< Bit mask of CH4 field. */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH4_Min (0x0UL) /*!< Min enumerator value of CH4 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH4_Max (0x1UL) /*!< Max enumerator value of CH4 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH4_NotLinked (0x1UL) /*!< The channel 4 is not linked as source                      */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH4_Linked (0x0UL) /*!< The channel 4 is linked as source                             */

/* CH5 @Bit 5 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH5_Pos (5UL) /*!< Position of CH5 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH5_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH5_Pos) /*!< Bit mask of CH5 field. */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH5_Min (0x0UL) /*!< Min enumerator value of CH5 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH5_Max (0x1UL) /*!< Max enumerator value of CH5 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH5_NotLinked (0x1UL) /*!< The channel 5 is not linked as source                      */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH5_Linked (0x0UL) /*!< The channel 5 is linked as source                             */

