adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CH6 @Bit 6 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH6_Pos (6UL) /*!< Position of CH6 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH6_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH6_Pos) /*!< Bit mask of CH6 field. */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH6_Min (0x0UL) /*!< Min enumerator value of CH6 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH6_Max (0x1UL) /*!< Max enumerator value of CH6 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH6_NotLinked (0x1UL) /*!< The channel 6 is not linked as source                      */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH6_Linked (0x0UL) /*!< The channel 6 is linked as source                             */

/* CH7 @Bit 7 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH7_Pos (7UL) /*!< Position of CH7 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH7_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH7_Pos) /*!< Bit mask of CH7 field. */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH7_Min (0x0UL) /*!< Min enumerator value of CH7 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH7_Max (0x1UL) /*!< Max enumerator value of CH7 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH7_NotLinked (0x1UL) /*!< The channel 7 is not linked as source                      */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH7_Linked (0x0UL) /*!< The channel 7 is linked as source                             */

/* CH8 @Bit 8 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH8_Pos (8UL) /*!< Position of CH8 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH8_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH8_Pos) /*!< Bit mask of CH8 field. */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH8_Min (0x0UL) /*!< Min enumerator value of CH8 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH8_Max (0x1UL) /*!< Max enumerator value of CH8 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH8_NotLinked (0x1UL) /*!< The channel 8 is not linked as source                      */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH8_Linked (0x0UL) /*!< The channel 8 is linked as source                             */

/* CH9 @Bit 9 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH9_Pos (9UL) /*!< Position of CH9 field.                                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH9_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH9_Pos) /*!< Bit mask of CH9 field. */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH9_Min (0x0UL) /*!< Min enumerator value of CH9 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH9_Max (0x1UL) /*!< Max enumerator value of CH9 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH9_NotLinked (0x1UL) /*!< The channel 9 is not linked as source                      */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH9_Linked (0x0UL) /*!< The channel 9 is linked as source                             */

/* CH10 @Bit 10 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH10_Pos (10UL) /*!< Position of CH10 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH10_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH10_Pos) /*!< Bit mask of CH10
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH10_Min (0x0UL) /*!< Min enumerator value of CH10 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH10_Max (0x1UL) /*!< Max enumerator value of CH10 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH10_NotLinked (0x1UL) /*!< The channel 10 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH10_Linked (0x0UL) /*!< The channel 10 is linked as source                           */

/* CH11 @Bit 11 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH11_Pos (11UL) /*!< Position of CH11 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH11_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH11_Pos) /*!< Bit mask of CH11
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH11_Min (0x0UL) /*!< Min enumerator value of CH11 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH11_Max (0x1UL) /*!< Max enumerator value of CH11 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH11_NotLinked (0x1UL) /*!< The channel 11 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH11_Linked (0x0UL) /*!< The channel 11 is linked as source                           */

/* CH12 @Bit 12 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH12_Pos (12UL) /*!< Position of CH12 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH12_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH12_Pos) /*!< Bit mask of CH12
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH12_Min (0x0UL) /*!< Min enumerator value of CH12 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH12_Max (0x1UL) /*!< Max enumerator value of CH12 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH12_NotLinked (0x1UL) /*!< The channel 12 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH12_Linked (0x0UL) /*!< The channel 12 is linked as source                           */

/* CH13 @Bit 13 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH13_Pos (13UL) /*!< Position of CH13 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH13_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH13_Pos) /*!< Bit mask of CH13
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH13_Min (0x0UL) /*!< Min enumerator value of CH13 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH13_Max (0x1UL) /*!< Max enumerator value of CH13 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH13_NotLinked (0x1UL) /*!< The channel 13 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH13_Linked (0x0UL) /*!< The channel 13 is linked as source                           */

/* CH14 @Bit 14 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH14_Pos (14UL) /*!< Position of CH14 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH14_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH14_Pos) /*!< Bit mask of CH14
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH14_Min (0x0UL) /*!< Min enumerator value of CH14 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH14_Max (0x1UL) /*!< Max enumerator value of CH14 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH14_NotLinked (0x1UL) /*!< The channel 14 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH14_Linked (0x0UL) /*!< The channel 14 is linked as source                           */

/* CH15 @Bit 15 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH15_Pos (15UL) /*!< Position of CH15 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH15_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH15_Pos) /*!< Bit mask of CH15
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH15_Min (0x0UL) /*!< Min enumerator value of CH15 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH15_Max (0x1UL) /*!< Max enumerator value of CH15 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH15_NotLinked (0x1UL) /*!< The channel 15 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH15_Linked (0x0UL) /*!< The channel 15 is linked as source                           */

