adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CH16 @Bit 16 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH16_Pos (16UL) /*!< Position of CH16 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH16_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH16_Pos) /*!< Bit mask of CH16
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH16_Min (0x0UL) /*!< Min enumerator value of CH16 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH16_Max (0x1UL) /*!< Max enumerator value of CH16 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH16_NotLinked (0x1UL) /*!< The channel 16 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH16_Linked (0x0UL) /*!< The channel 16 is linked as source                           */

/* CH17 @Bit 17 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH17_Pos (17UL) /*!< Position of CH17 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH17_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH17_Pos) /*!< Bit mask of CH17
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH17_Min (0x0UL) /*!< Min enumerator value of CH17 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH17_Max (0x1UL) /*!< Max enumerator value of CH17 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH17_NotLinked (0x1UL) /*!< The channel 17 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH17_Linked (0x0UL) /*!< The channel 17 is linked as source                           */

/* CH18 @Bit 18 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH18_Pos (18UL) /*!< Position of CH18 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH18_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH18_Pos) /*!< Bit mask of CH18
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH18_Min (0x0UL) /*!< Min enumerator value of CH18 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH18_Max (0x1UL) /*!< Max enumerator value of CH18 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH18_NotLinked (0x1UL) /*!< The channel 18 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH18_Linked (0x0UL) /*!< The channel 18 is linked as source                           */

/* CH19 @Bit 19 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH19_Pos (19UL) /*!< Position of CH19 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH19_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH19_Pos) /*!< Bit mask of CH19
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH19_Min (0x0UL) /*!< Min enumerator value of CH19 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH19_Max (0x1UL) /*!< Max enumerator value of CH19 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH19_NotLinked (0x1UL) /*!< The channel 19 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH19_Linked (0x0UL) /*!< The channel 19 is linked as source                           */

/* CH20 @Bit 20 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH20_Pos (20UL) /*!< Position of CH20 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH20_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH20_Pos) /*!< Bit mask of CH20
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH20_Min (0x0UL) /*!< Min enumerator value of CH20 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH20_Max (0x1UL) /*!< Max enumerator value of CH20 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH20_NotLinked (0x1UL) /*!< The channel 20 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH20_Linked (0x0UL) /*!< The channel 20 is linked as source                           */

/* CH21 @Bit 21 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH21_Pos (21UL) /*!< Position of CH21 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH21_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH21_Pos) /*!< Bit mask of CH21
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH21_Min (0x0UL) /*!< Min enumerator value of CH21 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH21_Max (0x1UL) /*!< Max enumerator value of CH21 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH21_NotLinked (0x1UL) /*!< The channel 21 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH21_Linked (0x0UL) /*!< The channel 21 is linked as source                           */

/* CH22 @Bit 22 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH22_Pos (22UL) /*!< Position of CH22 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH22_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH22_Pos) /*!< Bit mask of CH22
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH22_Min (0x0UL) /*!< Min enumerator value of CH22 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH22_Max (0x1UL) /*!< Max enumerator value of CH22 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH22_NotLinked (0x1UL) /*!< The channel 22 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH22_Linked (0x0UL) /*!< The channel 22 is linked as source                           */

/* CH23 @Bit 23 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH23_Pos (23UL) /*!< Position of CH23 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH23_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH23_Pos) /*!< Bit mask of CH23
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH23_Min (0x0UL) /*!< Min enumerator value of CH23 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH23_Max (0x1UL) /*!< Max enumerator value of CH23 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH23_NotLinked (0x1UL) /*!< The channel 23 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH23_Linked (0x0UL) /*!< The channel 23 is linked as source                           */

/* CH24 @Bit 24 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH24_Pos (24UL) /*!< Position of CH24 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH24_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH24_Pos) /*!< Bit mask of CH24
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH24_Min (0x0UL) /*!< Min enumerator value of CH24 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH24_Max (0x1UL) /*!< Max enumerator value of CH24 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH24_NotLinked (0x1UL) /*!< The channel 24 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH24_Linked (0x0UL) /*!< The channel 24 is linked as source                           */

/* CH25 @Bit 25 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH25_Pos (25UL) /*!< Position of CH25 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH25_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH25_Pos) /*!< Bit mask of CH25
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH25_Min (0x0UL) /*!< Min enumerator value of CH25 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH25_Max (0x1UL) /*!< Max enumerator value of CH25 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH25_NotLinked (0x1UL) /*!< The channel 25 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH25_Linked (0x0UL) /*!< The channel 25 is linked as source                           */

/* CH26 @Bit 26 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH26_Pos (26UL) /*!< Position of CH26 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH26_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH26_Pos) /*!< Bit mask of CH26
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH26_Min (0x0UL) /*!< Min enumerator value of CH26 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH26_Max (0x1UL) /*!< Max enumerator value of CH26 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH26_NotLinked (0x1UL) /*!< The channel 26 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH26_Linked (0x0UL) /*!< The channel 26 is linked as source                           */

