adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CH27 @Bit 27 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH27_Pos (27UL) /*!< Position of CH27 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH27_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH27_Pos) /*!< Bit mask of CH27
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH27_Min (0x0UL) /*!< Min enumerator value of CH27 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH27_Max (0x1UL) /*!< Max enumerator value of CH27 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH27_NotLinked (0x1UL) /*!< The channel 27 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH27_Linked (0x0UL) /*!< The channel 27 is linked as source                           */

/* CH28 @Bit 28 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH28_Pos (28UL) /*!< Position of CH28 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH28_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH28_Pos) /*!< Bit mask of CH28
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH28_Min (0x0UL) /*!< Min enumerator value of CH28 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH28_Max (0x1UL) /*!< Max enumerator value of CH28 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH28_NotLinked (0x1UL) /*!< The channel 28 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH28_Linked (0x0UL) /*!< The channel 28 is linked as source                           */

/* CH29 @Bit 29 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH29_Pos (29UL) /*!< Position of CH29 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH29_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH29_Pos) /*!< Bit mask of CH29
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH29_Min (0x0UL) /*!< Min enumerator value of CH29 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH29_Max (0x1UL) /*!< Max enumerator value of CH29 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH29_NotLinked (0x1UL) /*!< The channel 29 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH29_Linked (0x0UL) /*!< The channel 29 is linked as source                           */

/* CH30 @Bit 30 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH30_Pos (30UL) /*!< Position of CH30 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH30_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH30_Pos) /*!< Bit mask of CH30
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH30_Min (0x0UL) /*!< Min enumerator value of CH30 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH30_Max (0x1UL) /*!< Max enumerator value of CH30 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH30_NotLinked (0x1UL) /*!< The channel 30 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH30_Linked (0x0UL) /*!< The channel 30 is linked as source                           */

/* CH31 @Bit 31 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH31_Pos (31UL) /*!< Position of CH31 field.                                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH31_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH31_Pos) /*!< Bit mask of CH31
                                                                            field.*/                                              
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH31_Min (0x0UL) /*!< Min enumerator value of CH31 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH31_Max (0x1UL) /*!< Max enumerator value of CH31 field.                             */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH31_NotLinked (0x1UL) /*!< The channel 31 is not linked as source                    */
  #define UICR_DPPI_LOCAL_CH_LINK_SOURCE_CH31_Linked (0x0UL) /*!< The channel 31 is linked as source                           */


/* UICR_DPPI_LOCAL_CH_LINK_SINK: Request linking the channels of DPPI[n] in the local domain as sink Sink channels receive PPI
                                  events from the other side of the link */                                                       
                                                                                                                                  
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_ResetValue (0xFFFFFFFFUL) /*!< Reset value of SINK register.                            */

/* CH0 @Bit 0 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH0_Pos (0UL) /*!< Position of CH0 field.                                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH0_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH0_Pos) /*!< Bit mask of CH0 field.     */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH0_Min (0x0UL) /*!< Min enumerator value of CH0 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH0_Max (0x1UL) /*!< Max enumerator value of CH0 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH0_NotLinked (0x1UL) /*!< The channel 0 is not linked as sink                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH0_Linked (0x0UL) /*!< The channel 0 is linked as sink                                 */

/* CH1 @Bit 1 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH1_Pos (1UL) /*!< Position of CH1 field.                                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH1_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH1_Pos) /*!< Bit mask of CH1 field.     */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH1_Min (0x0UL) /*!< Min enumerator value of CH1 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH1_Max (0x1UL) /*!< Max enumerator value of CH1 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH1_NotLinked (0x1UL) /*!< The channel 1 is not linked as sink                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH1_Linked (0x0UL) /*!< The channel 1 is linked as sink                                 */

