adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CH2 @Bit 2 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH2_Pos (2UL) /*!< Position of CH2 field.                                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH2_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH2_Pos) /*!< Bit mask of CH2 field.     */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH2_Min (0x0UL) /*!< Min enumerator value of CH2 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH2_Max (0x1UL) /*!< Max enumerator value of CH2 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH2_NotLinked (0x1UL) /*!< The channel 2 is not linked as sink                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH2_Linked (0x0UL) /*!< The channel 2 is linked as sink                                 */

/* CH3 @Bit 3 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH3_Pos (3UL) /*!< Position of CH3 field.                                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH3_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH3_Pos) /*!< Bit mask of CH3 field.     */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH3_Min (0x0UL) /*!< Min enumerator value of CH3 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH3_Max (0x1UL) /*!< Max enumerator value of CH3 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH3_NotLinked (0x1UL) /*!< The channel 3 is not linked as sink                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH3_Linked (0x0UL) /*!< The channel 3 is linked as sink                                 */

/* CH4 @Bit 4 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH4_Pos (4UL) /*!< Position of CH4 field.                                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH4_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH4_Pos) /*!< Bit mask of CH4 field.     */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH4_Min (0x0UL) /*!< Min enumerator value of CH4 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH4_Max (0x1UL) /*!< Max enumerator value of CH4 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH4_NotLinked (0x1UL) /*!< The channel 4 is not linked as sink                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH4_Linked (0x0UL) /*!< The channel 4 is linked as sink                                 */

/* CH5 @Bit 5 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH5_Pos (5UL) /*!< Position of CH5 field.                                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH5_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH5_Pos) /*!< Bit mask of CH5 field.     */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH5_Min (0x0UL) /*!< Min enumerator value of CH5 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH5_Max (0x1UL) /*!< Max enumerator value of CH5 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH5_NotLinked (0x1UL) /*!< The channel 5 is not linked as sink                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH5_Linked (0x0UL) /*!< The channel 5 is linked as sink                                 */

/* CH6 @Bit 6 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH6_Pos (6UL) /*!< Position of CH6 field.                                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH6_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH6_Pos) /*!< Bit mask of CH6 field.     */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH6_Min (0x0UL) /*!< Min enumerator value of CH6 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH6_Max (0x1UL) /*!< Max enumerator value of CH6 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH6_NotLinked (0x1UL) /*!< The channel 6 is not linked as sink                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH6_Linked (0x0UL) /*!< The channel 6 is linked as sink                                 */

/* CH7 @Bit 7 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH7_Pos (7UL) /*!< Position of CH7 field.                                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH7_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH7_Pos) /*!< Bit mask of CH7 field.     */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH7_Min (0x0UL) /*!< Min enumerator value of CH7 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH7_Max (0x1UL) /*!< Max enumerator value of CH7 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH7_NotLinked (0x1UL) /*!< The channel 7 is not linked as sink                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH7_Linked (0x0UL) /*!< The channel 7 is linked as sink                                 */

/* CH8 @Bit 8 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH8_Pos (8UL) /*!< Position of CH8 field.                                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH8_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH8_Pos) /*!< Bit mask of CH8 field.     */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH8_Min (0x0UL) /*!< Min enumerator value of CH8 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH8_Max (0x1UL) /*!< Max enumerator value of CH8 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH8_NotLinked (0x1UL) /*!< The channel 8 is not linked as sink                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH8_Linked (0x0UL) /*!< The channel 8 is linked as sink                                 */

/* CH9 @Bit 9 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH9_Pos (9UL) /*!< Position of CH9 field.                                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH9_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH9_Pos) /*!< Bit mask of CH9 field.     */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH9_Min (0x0UL) /*!< Min enumerator value of CH9 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH9_Max (0x1UL) /*!< Max enumerator value of CH9 field.                                 */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH9_NotLinked (0x1UL) /*!< The channel 9 is not linked as sink                          */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH9_Linked (0x0UL) /*!< The channel 9 is linked as sink                                 */

/* CH10 @Bit 10 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH10_Pos (10UL) /*!< Position of CH10 field.                                            */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH10_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH10_Pos) /*!< Bit mask of CH10 field.  */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH10_Min (0x0UL) /*!< Min enumerator value of CH10 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH10_Max (0x1UL) /*!< Max enumerator value of CH10 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH10_NotLinked (0x1UL) /*!< The channel 10 is not linked as sink                        */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH10_Linked (0x0UL) /*!< The channel 10 is linked as sink                               */

