adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CH20 @Bit 20 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH20_Pos (20UL) /*!< Position of CH20 field.                                            */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH20_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH20_Pos) /*!< Bit mask of CH20 field.  */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH20_Min (0x0UL) /*!< Min enumerator value of CH20 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH20_Max (0x1UL) /*!< Max enumerator value of CH20 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH20_NotLinked (0x1UL) /*!< The channel 20 is not linked as sink                        */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH20_Linked (0x0UL) /*!< The channel 20 is linked as sink                               */

/* CH21 @Bit 21 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH21_Pos (21UL) /*!< Position of CH21 field.                                            */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH21_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH21_Pos) /*!< Bit mask of CH21 field.  */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH21_Min (0x0UL) /*!< Min enumerator value of CH21 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH21_Max (0x1UL) /*!< Max enumerator value of CH21 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH21_NotLinked (0x1UL) /*!< The channel 21 is not linked as sink                        */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH21_Linked (0x0UL) /*!< The channel 21 is linked as sink                               */

/* CH22 @Bit 22 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH22_Pos (22UL) /*!< Position of CH22 field.                                            */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH22_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH22_Pos) /*!< Bit mask of CH22 field.  */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH22_Min (0x0UL) /*!< Min enumerator value of CH22 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH22_Max (0x1UL) /*!< Max enumerator value of CH22 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH22_NotLinked (0x1UL) /*!< The channel 22 is not linked as sink                        */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH22_Linked (0x0UL) /*!< The channel 22 is linked as sink                               */

/* CH23 @Bit 23 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH23_Pos (23UL) /*!< Position of CH23 field.                                            */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH23_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH23_Pos) /*!< Bit mask of CH23 field.  */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH23_Min (0x0UL) /*!< Min enumerator value of CH23 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH23_Max (0x1UL) /*!< Max enumerator value of CH23 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH23_NotLinked (0x1UL) /*!< The channel 23 is not linked as sink                        */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH23_Linked (0x0UL) /*!< The channel 23 is linked as sink                               */

/* CH24 @Bit 24 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH24_Pos (24UL) /*!< Position of CH24 field.                                            */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH24_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH24_Pos) /*!< Bit mask of CH24 field.  */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH24_Min (0x0UL) /*!< Min enumerator value of CH24 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH24_Max (0x1UL) /*!< Max enumerator value of CH24 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH24_NotLinked (0x1UL) /*!< The channel 24 is not linked as sink                        */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH24_Linked (0x0UL) /*!< The channel 24 is linked as sink                               */

/* CH25 @Bit 25 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH25_Pos (25UL) /*!< Position of CH25 field.                                            */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH25_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH25_Pos) /*!< Bit mask of CH25 field.  */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH25_Min (0x0UL) /*!< Min enumerator value of CH25 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH25_Max (0x1UL) /*!< Max enumerator value of CH25 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH25_NotLinked (0x1UL) /*!< The channel 25 is not linked as sink                        */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH25_Linked (0x0UL) /*!< The channel 25 is linked as sink                               */

/* CH26 @Bit 26 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH26_Pos (26UL) /*!< Position of CH26 field.                                            */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH26_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH26_Pos) /*!< Bit mask of CH26 field.  */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH26_Min (0x0UL) /*!< Min enumerator value of CH26 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH26_Max (0x1UL) /*!< Max enumerator value of CH26 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH26_NotLinked (0x1UL) /*!< The channel 26 is not linked as sink                        */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH26_Linked (0x0UL) /*!< The channel 26 is linked as sink                               */

/* CH27 @Bit 27 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH27_Pos (27UL) /*!< Position of CH27 field.                                            */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH27_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH27_Pos) /*!< Bit mask of CH27 field.  */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH27_Min (0x0UL) /*!< Min enumerator value of CH27 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH27_Max (0x1UL) /*!< Max enumerator value of CH27 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH27_NotLinked (0x1UL) /*!< The channel 27 is not linked as sink                        */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH27_Linked (0x0UL) /*!< The channel 27 is linked as sink                               */

/* CH28 @Bit 28 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH28_Pos (28UL) /*!< Position of CH28 field.                                            */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH28_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH28_Pos) /*!< Bit mask of CH28 field.  */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH28_Min (0x0UL) /*!< Min enumerator value of CH28 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH28_Max (0x1UL) /*!< Max enumerator value of CH28 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH28_NotLinked (0x1UL) /*!< The channel 28 is not linked as sink                        */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH28_Linked (0x0UL) /*!< The channel 28 is linked as sink                               */

/* CH29 @Bit 29 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH29_Pos (29UL) /*!< Position of CH29 field.                                            */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH29_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH29_Pos) /*!< Bit mask of CH29 field.  */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH29_Min (0x0UL) /*!< Min enumerator value of CH29 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH29_Max (0x1UL) /*!< Max enumerator value of CH29 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH29_NotLinked (0x1UL) /*!< The channel 29 is not linked as sink                        */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH29_Linked (0x0UL) /*!< The channel 29 is linked as sink                               */

/* CH30 @Bit 30 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH30_Pos (30UL) /*!< Position of CH30 field.                                            */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH30_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH30_Pos) /*!< Bit mask of CH30 field.  */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH30_Min (0x0UL) /*!< Min enumerator value of CH30 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH30_Max (0x1UL) /*!< Max enumerator value of CH30 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH30_NotLinked (0x1UL) /*!< The channel 30 is not linked as sink                        */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH30_Linked (0x0UL) /*!< The channel 30 is linked as sink                               */

/* CH31 @Bit 31 : Link property */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH31_Pos (31UL) /*!< Position of CH31 field.                                            */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH31_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_SINK_CH31_Pos) /*!< Bit mask of CH31 field.  */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH31_Min (0x0UL) /*!< Min enumerator value of CH31 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH31_Max (0x1UL) /*!< Max enumerator value of CH31 field.                               */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH31_NotLinked (0x1UL) /*!< The channel 31 is not linked as sink                        */
  #define UICR_DPPI_LOCAL_CH_LINK_SINK_CH31_Linked (0x0UL) /*!< The channel 31 is linked as sink                               */



/* ================================================ Struct UICR_DPPI_LOCAL_CH ================================================ */
/**
  * @brief CH [UICR_DPPI_LOCAL_CH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000000) Request permission for the channels of DPPI[n] in the
                                                                         local domain*/                                           
  __IOM NRF_UICR_DPPI_LOCAL_CH_LINK_Type LINK;       /*!< (@ 0x00000004) (unspecified)                                         */
} NRF_UICR_DPPI_LOCAL_CH_Type;                       /*!< Size = 12 (0x00C)                                                    */

/* UICR_DPPI_LOCAL_CH_SECURE: Request permission for the channels of DPPI[n] in the local domain */
  #define UICR_DPPI_LOCAL_CH_SECURE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of SECURE register.                             */

/* CH0 @Bit 0 : Channel number */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH0_Pos (0UL)    /*!< Position of CH0 field.                                               */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH0_Msk (0x1UL << UICR_DPPI_LOCAL_CH_SECURE_CH0_Pos) /*!< Bit mask of CH0 field.           */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH0_Min (0x0UL)  /*!< Min enumerator value of CH0 field.                                   */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH0_Max (0x1UL)  /*!< Max enumerator value of CH0 field.                                   */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH0_Secure (0x1UL) /*!< The channel 0 is secure                                            */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH0_NonSecure (0x0UL) /*!< The channel 0 is non-secure                                     */

/* CH1 @Bit 1 : Channel number */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH1_Pos (1UL)    /*!< Position of CH1 field.                                               */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH1_Msk (0x1UL << UICR_DPPI_LOCAL_CH_SECURE_CH1_Pos) /*!< Bit mask of CH1 field.           */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH1_Min (0x0UL)  /*!< Min enumerator value of CH1 field.                                   */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH1_Max (0x1UL)  /*!< Max enumerator value of CH1 field.                                   */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH1_Secure (0x1UL) /*!< The channel 1 is secure                                            */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH1_NonSecure (0x0UL) /*!< The channel 1 is non-secure                                     */

/* CH2 @Bit 2 : Channel number */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH2_Pos (2UL)    /*!< Position of CH2 field.                                               */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH2_Msk (0x1UL << UICR_DPPI_LOCAL_CH_SECURE_CH2_Pos) /*!< Bit mask of CH2 field.           */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH2_Min (0x0UL)  /*!< Min enumerator value of CH2 field.                                   */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH2_Max (0x1UL)  /*!< Max enumerator value of CH2 field.                                   */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH2_Secure (0x1UL) /*!< The channel 2 is secure                                            */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH2_NonSecure (0x0UL) /*!< The channel 2 is non-secure                                     */

/* CH3 @Bit 3 : Channel number */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH3_Pos (3UL)    /*!< Position of CH3 field.                                               */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH3_Msk (0x1UL << UICR_DPPI_LOCAL_CH_SECURE_CH3_Pos) /*!< Bit mask of CH3 field.           */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH3_Min (0x0UL)  /*!< Min enumerator value of CH3 field.                                   */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH3_Max (0x1UL)  /*!< Max enumerator value of CH3 field.                                   */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH3_Secure (0x1UL) /*!< The channel 3 is secure                                            */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH3_NonSecure (0x0UL) /*!< The channel 3 is non-secure                                     */

/* CH4 @Bit 4 : Channel number */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH4_Pos (4UL)    /*!< Position of CH4 field.                                               */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH4_Msk (0x1UL << UICR_DPPI_LOCAL_CH_SECURE_CH4_Pos) /*!< Bit mask of CH4 field.           */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH4_Min (0x0UL)  /*!< Min enumerator value of CH4 field.                                   */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH4_Max (0x1UL)  /*!< Max enumerator value of CH4 field.                                   */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH4_Secure (0x1UL) /*!< The channel 4 is secure                                            */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH4_NonSecure (0x0UL) /*!< The channel 4 is non-secure                                     */

/* CH5 @Bit 5 : Channel number */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH5_Pos (5UL)    /*!< Position of CH5 field.                                               */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH5_Msk (0x1UL << UICR_DPPI_LOCAL_CH_SECURE_CH5_Pos) /*!< Bit mask of CH5 field.           */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH5_Min (0x0UL)  /*!< Min enumerator value of CH5 field.                                   */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH5_Max (0x1UL)  /*!< Max enumerator value of CH5 field.                                   */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH5_Secure (0x1UL) /*!< The channel 5 is secure                                            */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH5_NonSecure (0x0UL) /*!< The channel 5 is non-secure                                     */

/* CH6 @Bit 6 : Channel number */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH6_Pos (6UL)    /*!< Position of CH6 field.                                               */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH6_Msk (0x1UL << UICR_DPPI_LOCAL_CH_SECURE_CH6_Pos) /*!< Bit mask of CH6 field.           */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH6_Min (0x0UL)  /*!< Min enumerator value of CH6 field.                                   */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH6_Max (0x1UL)  /*!< Max enumerator value of CH6 field.                                   */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH6_Secure (0x1UL) /*!< The channel 6 is secure                                            */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH6_NonSecure (0x0UL) /*!< The channel 6 is non-secure                                     */

/* CH7 @Bit 7 : Channel number */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH7_Pos (7UL)    /*!< Position of CH7 field.                                               */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH7_Msk (0x1UL << UICR_DPPI_LOCAL_CH_SECURE_CH7_Pos) /*!< Bit mask of CH7 field.           */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH7_Min (0x0UL)  /*!< Min enumerator value of CH7 field.                                   */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH7_Max (0x1UL)  /*!< Max enumerator value of CH7 field.                                   */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH7_Secure (0x1UL) /*!< The channel 7 is secure                                            */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH7_NonSecure (0x0UL) /*!< The channel 7 is non-secure                                     */

