adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CHG22 @Bit 22 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG22_Pos (22UL) /*!< Position of CHG22 field.                                            */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG22_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG22_Pos) /*!< Bit mask of CHG22 field.   */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG22_Min (0x0UL) /*!< Min enumerator value of CHG22 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG22_Max (0x1UL) /*!< Max enumerator value of CHG22 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG22_Secure (0x1UL) /*!< The channel group 22 is secure                                  */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG22_NonSecure (0x0UL) /*!< The channel group 22 is non-secure                           */

/* CHG23 @Bit 23 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG23_Pos (23UL) /*!< Position of CHG23 field.                                            */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG23_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG23_Pos) /*!< Bit mask of CHG23 field.   */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG23_Min (0x0UL) /*!< Min enumerator value of CHG23 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG23_Max (0x1UL) /*!< Max enumerator value of CHG23 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG23_Secure (0x1UL) /*!< The channel group 23 is secure                                  */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG23_NonSecure (0x0UL) /*!< The channel group 23 is non-secure                           */

/* CHG24 @Bit 24 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG24_Pos (24UL) /*!< Position of CHG24 field.                                            */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG24_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG24_Pos) /*!< Bit mask of CHG24 field.   */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG24_Min (0x0UL) /*!< Min enumerator value of CHG24 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG24_Max (0x1UL) /*!< Max enumerator value of CHG24 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG24_Secure (0x1UL) /*!< The channel group 24 is secure                                  */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG24_NonSecure (0x0UL) /*!< The channel group 24 is non-secure                           */

/* CHG25 @Bit 25 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG25_Pos (25UL) /*!< Position of CHG25 field.                                            */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG25_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG25_Pos) /*!< Bit mask of CHG25 field.   */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG25_Min (0x0UL) /*!< Min enumerator value of CHG25 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG25_Max (0x1UL) /*!< Max enumerator value of CHG25 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG25_Secure (0x1UL) /*!< The channel group 25 is secure                                  */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG25_NonSecure (0x0UL) /*!< The channel group 25 is non-secure                           */

/* CHG26 @Bit 26 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG26_Pos (26UL) /*!< Position of CHG26 field.                                            */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG26_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG26_Pos) /*!< Bit mask of CHG26 field.   */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG26_Min (0x0UL) /*!< Min enumerator value of CHG26 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG26_Max (0x1UL) /*!< Max enumerator value of CHG26 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG26_Secure (0x1UL) /*!< The channel group 26 is secure                                  */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG26_NonSecure (0x0UL) /*!< The channel group 26 is non-secure                           */

/* CHG27 @Bit 27 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG27_Pos (27UL) /*!< Position of CHG27 field.                                            */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG27_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG27_Pos) /*!< Bit mask of CHG27 field.   */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG27_Min (0x0UL) /*!< Min enumerator value of CHG27 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG27_Max (0x1UL) /*!< Max enumerator value of CHG27 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG27_Secure (0x1UL) /*!< The channel group 27 is secure                                  */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG27_NonSecure (0x0UL) /*!< The channel group 27 is non-secure                           */

/* CHG28 @Bit 28 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG28_Pos (28UL) /*!< Position of CHG28 field.                                            */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG28_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG28_Pos) /*!< Bit mask of CHG28 field.   */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG28_Min (0x0UL) /*!< Min enumerator value of CHG28 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG28_Max (0x1UL) /*!< Max enumerator value of CHG28 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG28_Secure (0x1UL) /*!< The channel group 28 is secure                                  */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG28_NonSecure (0x0UL) /*!< The channel group 28 is non-secure                           */

/* CHG29 @Bit 29 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG29_Pos (29UL) /*!< Position of CHG29 field.                                            */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG29_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG29_Pos) /*!< Bit mask of CHG29 field.   */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG29_Min (0x0UL) /*!< Min enumerator value of CHG29 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG29_Max (0x1UL) /*!< Max enumerator value of CHG29 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG29_Secure (0x1UL) /*!< The channel group 29 is secure                                  */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG29_NonSecure (0x0UL) /*!< The channel group 29 is non-secure                           */

/* CHG30 @Bit 30 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG30_Pos (30UL) /*!< Position of CHG30 field.                                            */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG30_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG30_Pos) /*!< Bit mask of CHG30 field.   */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG30_Min (0x0UL) /*!< Min enumerator value of CHG30 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG30_Max (0x1UL) /*!< Max enumerator value of CHG30 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG30_Secure (0x1UL) /*!< The channel group 30 is secure                                  */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG30_NonSecure (0x0UL) /*!< The channel group 30 is non-secure                           */

/* CHG31 @Bit 31 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG31_Pos (31UL) /*!< Position of CHG31 field.                                            */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG31_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG31_Pos) /*!< Bit mask of CHG31 field.   */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG31_Min (0x0UL) /*!< Min enumerator value of CHG31 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG31_Max (0x1UL) /*!< Max enumerator value of CHG31 field.                               */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG31_Secure (0x1UL) /*!< The channel group 31 is secure                                  */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG31_NonSecure (0x0UL) /*!< The channel group 31 is non-secure                           */



/* ================================================= Struct UICR_DPPI_LOCAL ================================================== */
/**
  * @brief LOCAL [UICR_DPPI_LOCAL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INSTANCE;                          /*!< (@ 0x00000000) Address of the DPPI instance associated with
                                                                         DPPI[n].LOCAL*/                                          
  __IOM NRF_UICR_DPPI_LOCAL_CH_Type CH;              /*!< (@ 0x00000004) (unspecified)                                         */
  __IOM NRF_UICR_DPPI_LOCAL_CHG_Type CHG;            /*!< (@ 0x00000010) (unspecified)                                         */
} NRF_UICR_DPPI_LOCAL_Type;                          /*!< Size = 20 (0x014)                                                    */
  #define UICR_DPPI_LOCAL_MaxCount (2UL)             /*!< Max size of LOCAL[2] array.                                          */

/* UICR_DPPI_LOCAL_INSTANCE: Address of the DPPI instance associated with DPPI[n].LOCAL */
  #define UICR_DPPI_LOCAL_INSTANCE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of INSTANCE register.                            */

/* ADDRESS @Bits 0..31 : Instance address */
  #define UICR_DPPI_LOCAL_INSTANCE_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                           */
  #define UICR_DPPI_LOCAL_INSTANCE_ADDRESS_Msk (0xFFFFFFFFUL << UICR_DPPI_LOCAL_INSTANCE_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/                                              



/* ============================================= Struct UICR_DPPI_GLOBAL_CH_LINK ============================================= */
/**
  * @brief LINK [UICR_DPPI_GLOBAL_CH_LINK] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SOURCE;                            /*!< (@ 0x00000000) Request linking the channels of DPPI[n] in Global
                                                                         domain as source Source channels send PPI events to the
                                                                         other side of the link*/                                 
  __IOM uint32_t  SINK;                              /*!< (@ 0x00000004) Request linking the channels of DPPI[n] in Global
                                                                         domain as sink Sink channels receive PPI events from
                                                                         the other side of the link*/                             
} NRF_UICR_DPPI_GLOBAL_CH_LINK_Type;                 /*!< Size = 8 (0x008)                                                     */

/* UICR_DPPI_GLOBAL_CH_LINK_SOURCE: Request linking the channels of DPPI[n] in Global domain as source Source channels send PPI
                                     events to the other side of the link */                                                      
                                                                                                                                  
  #define UICR_DPPI_GLOBAL_CH_LINK_SOURCE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of SOURCE register.                       */

/* CH0 @Bit 0 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SOURCE_CH0_Pos (0UL) /*!< Position of CH0 field.                                            */
  #define UICR_DPPI_GLOBAL_CH_LINK_SOURCE_CH0_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SOURCE_CH0_Pos) /*!< Bit mask of CH0
                                                                            field.*/                                              
  #define UICR_DPPI_GLOBAL_CH_LINK_SOURCE_CH0_Min (0x0UL) /*!< Min enumerator value of CH0 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SOURCE_CH0_Max (0x1UL) /*!< Max enumerator value of CH0 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SOURCE_CH0_NotLinked (0x1UL) /*!< The channel 0 is not linked as source                     */
  #define UICR_DPPI_GLOBAL_CH_LINK_SOURCE_CH0_Linked (0x0UL) /*!< The channel 0 is linked as source                            */

/* CH1 @Bit 1 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SOURCE_CH1_Pos (1UL) /*!< Position of CH1 field.                                            */
  #define UICR_DPPI_GLOBAL_CH_LINK_SOURCE_CH1_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SOURCE_CH1_Pos) /*!< Bit mask of CH1
                                                                            field.*/                                              
  #define UICR_DPPI_GLOBAL_CH_LINK_SOURCE_CH1_Min (0x0UL) /*!< Min enumerator value of CH1 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SOURCE_CH1_Max (0x1UL) /*!< Max enumerator value of CH1 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SOURCE_CH1_NotLinked (0x1UL) /*!< The channel 1 is not linked as source                     */
  #define UICR_DPPI_GLOBAL_CH_LINK_SOURCE_CH1_Linked (0x0UL) /*!< The channel 1 is linked as source                            */

