adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CH11 @Bit 11 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH11_Pos (11UL) /*!< Position of CH11 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH11_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH11_Pos) /*!< Bit mask of CH11 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH11_Min (0x0UL) /*!< Min enumerator value of CH11 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH11_Max (0x1UL) /*!< Max enumerator value of CH11 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH11_NotLinked (0x1UL) /*!< The channel 11 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH11_Linked (0x0UL) /*!< The channel 11 is linked as sink                              */

/* CH12 @Bit 12 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH12_Pos (12UL) /*!< Position of CH12 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH12_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH12_Pos) /*!< Bit mask of CH12 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH12_Min (0x0UL) /*!< Min enumerator value of CH12 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH12_Max (0x1UL) /*!< Max enumerator value of CH12 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH12_NotLinked (0x1UL) /*!< The channel 12 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH12_Linked (0x0UL) /*!< The channel 12 is linked as sink                              */

/* CH13 @Bit 13 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH13_Pos (13UL) /*!< Position of CH13 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH13_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH13_Pos) /*!< Bit mask of CH13 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH13_Min (0x0UL) /*!< Min enumerator value of CH13 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH13_Max (0x1UL) /*!< Max enumerator value of CH13 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH13_NotLinked (0x1UL) /*!< The channel 13 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH13_Linked (0x0UL) /*!< The channel 13 is linked as sink                              */

/* CH14 @Bit 14 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH14_Pos (14UL) /*!< Position of CH14 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH14_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH14_Pos) /*!< Bit mask of CH14 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH14_Min (0x0UL) /*!< Min enumerator value of CH14 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH14_Max (0x1UL) /*!< Max enumerator value of CH14 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH14_NotLinked (0x1UL) /*!< The channel 14 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH14_Linked (0x0UL) /*!< The channel 14 is linked as sink                              */

/* CH15 @Bit 15 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH15_Pos (15UL) /*!< Position of CH15 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH15_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH15_Pos) /*!< Bit mask of CH15 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH15_Min (0x0UL) /*!< Min enumerator value of CH15 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH15_Max (0x1UL) /*!< Max enumerator value of CH15 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH15_NotLinked (0x1UL) /*!< The channel 15 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH15_Linked (0x0UL) /*!< The channel 15 is linked as sink                              */

/* CH16 @Bit 16 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH16_Pos (16UL) /*!< Position of CH16 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH16_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH16_Pos) /*!< Bit mask of CH16 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH16_Min (0x0UL) /*!< Min enumerator value of CH16 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH16_Max (0x1UL) /*!< Max enumerator value of CH16 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH16_NotLinked (0x1UL) /*!< The channel 16 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH16_Linked (0x0UL) /*!< The channel 16 is linked as sink                              */

/* CH17 @Bit 17 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH17_Pos (17UL) /*!< Position of CH17 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH17_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH17_Pos) /*!< Bit mask of CH17 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH17_Min (0x0UL) /*!< Min enumerator value of CH17 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH17_Max (0x1UL) /*!< Max enumerator value of CH17 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH17_NotLinked (0x1UL) /*!< The channel 17 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH17_Linked (0x0UL) /*!< The channel 17 is linked as sink                              */

/* CH18 @Bit 18 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH18_Pos (18UL) /*!< Position of CH18 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH18_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH18_Pos) /*!< Bit mask of CH18 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH18_Min (0x0UL) /*!< Min enumerator value of CH18 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH18_Max (0x1UL) /*!< Max enumerator value of CH18 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH18_NotLinked (0x1UL) /*!< The channel 18 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH18_Linked (0x0UL) /*!< The channel 18 is linked as sink                              */

/* CH19 @Bit 19 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH19_Pos (19UL) /*!< Position of CH19 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH19_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH19_Pos) /*!< Bit mask of CH19 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH19_Min (0x0UL) /*!< Min enumerator value of CH19 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH19_Max (0x1UL) /*!< Max enumerator value of CH19 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH19_NotLinked (0x1UL) /*!< The channel 19 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH19_Linked (0x0UL) /*!< The channel 19 is linked as sink                              */

