adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CH20 @Bit 20 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH20_Pos (20UL) /*!< Position of CH20 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH20_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH20_Pos) /*!< Bit mask of CH20 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH20_Min (0x0UL) /*!< Min enumerator value of CH20 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH20_Max (0x1UL) /*!< Max enumerator value of CH20 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH20_NotLinked (0x1UL) /*!< The channel 20 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH20_Linked (0x0UL) /*!< The channel 20 is linked as sink                              */

/* CH21 @Bit 21 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH21_Pos (21UL) /*!< Position of CH21 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH21_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH21_Pos) /*!< Bit mask of CH21 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH21_Min (0x0UL) /*!< Min enumerator value of CH21 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH21_Max (0x1UL) /*!< Max enumerator value of CH21 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH21_NotLinked (0x1UL) /*!< The channel 21 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH21_Linked (0x0UL) /*!< The channel 21 is linked as sink                              */

/* CH22 @Bit 22 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH22_Pos (22UL) /*!< Position of CH22 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH22_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH22_Pos) /*!< Bit mask of CH22 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH22_Min (0x0UL) /*!< Min enumerator value of CH22 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH22_Max (0x1UL) /*!< Max enumerator value of CH22 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH22_NotLinked (0x1UL) /*!< The channel 22 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH22_Linked (0x0UL) /*!< The channel 22 is linked as sink                              */

/* CH23 @Bit 23 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH23_Pos (23UL) /*!< Position of CH23 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH23_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH23_Pos) /*!< Bit mask of CH23 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH23_Min (0x0UL) /*!< Min enumerator value of CH23 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH23_Max (0x1UL) /*!< Max enumerator value of CH23 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH23_NotLinked (0x1UL) /*!< The channel 23 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH23_Linked (0x0UL) /*!< The channel 23 is linked as sink                              */

/* CH24 @Bit 24 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH24_Pos (24UL) /*!< Position of CH24 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH24_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH24_Pos) /*!< Bit mask of CH24 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH24_Min (0x0UL) /*!< Min enumerator value of CH24 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH24_Max (0x1UL) /*!< Max enumerator value of CH24 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH24_NotLinked (0x1UL) /*!< The channel 24 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH24_Linked (0x0UL) /*!< The channel 24 is linked as sink                              */

/* CH25 @Bit 25 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH25_Pos (25UL) /*!< Position of CH25 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH25_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH25_Pos) /*!< Bit mask of CH25 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH25_Min (0x0UL) /*!< Min enumerator value of CH25 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH25_Max (0x1UL) /*!< Max enumerator value of CH25 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH25_NotLinked (0x1UL) /*!< The channel 25 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH25_Linked (0x0UL) /*!< The channel 25 is linked as sink                              */

/* CH26 @Bit 26 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH26_Pos (26UL) /*!< Position of CH26 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH26_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH26_Pos) /*!< Bit mask of CH26 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH26_Min (0x0UL) /*!< Min enumerator value of CH26 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH26_Max (0x1UL) /*!< Max enumerator value of CH26 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH26_NotLinked (0x1UL) /*!< The channel 26 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH26_Linked (0x0UL) /*!< The channel 26 is linked as sink                              */

/* CH27 @Bit 27 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH27_Pos (27UL) /*!< Position of CH27 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH27_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH27_Pos) /*!< Bit mask of CH27 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH27_Min (0x0UL) /*!< Min enumerator value of CH27 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH27_Max (0x1UL) /*!< Max enumerator value of CH27 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH27_NotLinked (0x1UL) /*!< The channel 27 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH27_Linked (0x0UL) /*!< The channel 27 is linked as sink                              */

/* CH28 @Bit 28 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH28_Pos (28UL) /*!< Position of CH28 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH28_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH28_Pos) /*!< Bit mask of CH28 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH28_Min (0x0UL) /*!< Min enumerator value of CH28 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH28_Max (0x1UL) /*!< Max enumerator value of CH28 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH28_NotLinked (0x1UL) /*!< The channel 28 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH28_Linked (0x0UL) /*!< The channel 28 is linked as sink                              */

/* CH29 @Bit 29 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH29_Pos (29UL) /*!< Position of CH29 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH29_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH29_Pos) /*!< Bit mask of CH29 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH29_Min (0x0UL) /*!< Min enumerator value of CH29 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH29_Max (0x1UL) /*!< Max enumerator value of CH29 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH29_NotLinked (0x1UL) /*!< The channel 29 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH29_Linked (0x0UL) /*!< The channel 29 is linked as sink                              */

/* CH30 @Bit 30 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH30_Pos (30UL) /*!< Position of CH30 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH30_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH30_Pos) /*!< Bit mask of CH30 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH30_Min (0x0UL) /*!< Min enumerator value of CH30 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH30_Max (0x1UL) /*!< Max enumerator value of CH30 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH30_NotLinked (0x1UL) /*!< The channel 30 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH30_Linked (0x0UL) /*!< The channel 30 is linked as sink                              */

/* CH31 @Bit 31 : Link property */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH31_Pos (31UL) /*!< Position of CH31 field.                                           */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH31_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_SINK_CH31_Pos) /*!< Bit mask of CH31 field.*/
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH31_Min (0x0UL) /*!< Min enumerator value of CH31 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH31_Max (0x1UL) /*!< Max enumerator value of CH31 field.                              */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH31_NotLinked (0x1UL) /*!< The channel 31 is not linked as sink                       */
  #define UICR_DPPI_GLOBAL_CH_LINK_SINK_CH31_Linked (0x0UL) /*!< The channel 31 is linked as sink                              */



