adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CH8 @Bit 8 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH8_Pos (8UL)   /*!< Position of CH8 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH8_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_SECURE_CH8_Pos) /*!< Bit mask of CH8 field.         */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH8_Min (0x0UL) /*!< Min enumerator value of CH8 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH8_Max (0x1UL) /*!< Max enumerator value of CH8 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH8_Secure (0x1UL) /*!< The channel 8 is secure                                           */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH8_NonSecure (0x0UL) /*!< The channel 8 is non-secure                                    */

/* CH9 @Bit 9 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH9_Pos (9UL)   /*!< Position of CH9 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH9_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_SECURE_CH9_Pos) /*!< Bit mask of CH9 field.         */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH9_Min (0x0UL) /*!< Min enumerator value of CH9 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH9_Max (0x1UL) /*!< Max enumerator value of CH9 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH9_Secure (0x1UL) /*!< The channel 9 is secure                                           */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH9_NonSecure (0x0UL) /*!< The channel 9 is non-secure                                    */

/* CH10 @Bit 10 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH10_Pos (10UL) /*!< Position of CH10 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH10_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_SECURE_CH10_Pos) /*!< Bit mask of CH10 field.      */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH10_Min (0x0UL) /*!< Min enumerator value of CH10 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH10_Max (0x1UL) /*!< Max enumerator value of CH10 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH10_Secure (0x1UL) /*!< The channel 10 is secure                                         */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH10_NonSecure (0x0UL) /*!< The channel 10 is non-secure                                  */

/* CH11 @Bit 11 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH11_Pos (11UL) /*!< Position of CH11 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH11_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_SECURE_CH11_Pos) /*!< Bit mask of CH11 field.      */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH11_Min (0x0UL) /*!< Min enumerator value of CH11 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH11_Max (0x1UL) /*!< Max enumerator value of CH11 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH11_Secure (0x1UL) /*!< The channel 11 is secure                                         */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH11_NonSecure (0x0UL) /*!< The channel 11 is non-secure                                  */

/* CH12 @Bit 12 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH12_Pos (12UL) /*!< Position of CH12 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH12_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_SECURE_CH12_Pos) /*!< Bit mask of CH12 field.      */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH12_Min (0x0UL) /*!< Min enumerator value of CH12 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH12_Max (0x1UL) /*!< Max enumerator value of CH12 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH12_Secure (0x1UL) /*!< The channel 12 is secure                                         */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH12_NonSecure (0x0UL) /*!< The channel 12 is non-secure                                  */

/* CH13 @Bit 13 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH13_Pos (13UL) /*!< Position of CH13 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH13_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_SECURE_CH13_Pos) /*!< Bit mask of CH13 field.      */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH13_Min (0x0UL) /*!< Min enumerator value of CH13 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH13_Max (0x1UL) /*!< Max enumerator value of CH13 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH13_Secure (0x1UL) /*!< The channel 13 is secure                                         */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH13_NonSecure (0x0UL) /*!< The channel 13 is non-secure                                  */

/* CH14 @Bit 14 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH14_Pos (14UL) /*!< Position of CH14 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH14_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_SECURE_CH14_Pos) /*!< Bit mask of CH14 field.      */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH14_Min (0x0UL) /*!< Min enumerator value of CH14 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH14_Max (0x1UL) /*!< Max enumerator value of CH14 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH14_Secure (0x1UL) /*!< The channel 14 is secure                                         */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH14_NonSecure (0x0UL) /*!< The channel 14 is non-secure                                  */

/* CH15 @Bit 15 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH15_Pos (15UL) /*!< Position of CH15 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH15_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_SECURE_CH15_Pos) /*!< Bit mask of CH15 field.      */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH15_Min (0x0UL) /*!< Min enumerator value of CH15 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH15_Max (0x1UL) /*!< Max enumerator value of CH15 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH15_Secure (0x1UL) /*!< The channel 15 is secure                                         */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH15_NonSecure (0x0UL) /*!< The channel 15 is non-secure                                  */

/* CH16 @Bit 16 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH16_Pos (16UL) /*!< Position of CH16 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH16_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_SECURE_CH16_Pos) /*!< Bit mask of CH16 field.      */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH16_Min (0x0UL) /*!< Min enumerator value of CH16 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH16_Max (0x1UL) /*!< Max enumerator value of CH16 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH16_Secure (0x1UL) /*!< The channel 16 is secure                                         */
  #define UICR_DPPI_GLOBAL_CH_SECURE_CH16_NonSecure (0x0UL) /*!< The channel 16 is non-secure                                  */

