adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CHG13 @Bit 13 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG13_Pos (13UL) /*!< Position of CHG13 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG13_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG13_Pos) /*!< Bit mask of CHG13 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG13_Min (0x0UL) /*!< Min enumerator value of CHG13 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG13_Max (0x1UL) /*!< Max enumerator value of CHG13 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG13_Secure (0x1UL) /*!< The channel group 13 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG13_NonSecure (0x0UL) /*!< The channel group 13 is non-secure                          */

/* CHG14 @Bit 14 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG14_Pos (14UL) /*!< Position of CHG14 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG14_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG14_Pos) /*!< Bit mask of CHG14 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG14_Min (0x0UL) /*!< Min enumerator value of CHG14 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG14_Max (0x1UL) /*!< Max enumerator value of CHG14 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG14_Secure (0x1UL) /*!< The channel group 14 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG14_NonSecure (0x0UL) /*!< The channel group 14 is non-secure                          */

/* CHG15 @Bit 15 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG15_Pos (15UL) /*!< Position of CHG15 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG15_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG15_Pos) /*!< Bit mask of CHG15 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG15_Min (0x0UL) /*!< Min enumerator value of CHG15 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG15_Max (0x1UL) /*!< Max enumerator value of CHG15 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG15_Secure (0x1UL) /*!< The channel group 15 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG15_NonSecure (0x0UL) /*!< The channel group 15 is non-secure                          */

/* CHG16 @Bit 16 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG16_Pos (16UL) /*!< Position of CHG16 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG16_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG16_Pos) /*!< Bit mask of CHG16 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG16_Min (0x0UL) /*!< Min enumerator value of CHG16 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG16_Max (0x1UL) /*!< Max enumerator value of CHG16 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG16_Secure (0x1UL) /*!< The channel group 16 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG16_NonSecure (0x0UL) /*!< The channel group 16 is non-secure                          */

/* CHG17 @Bit 17 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG17_Pos (17UL) /*!< Position of CHG17 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG17_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG17_Pos) /*!< Bit mask of CHG17 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG17_Min (0x0UL) /*!< Min enumerator value of CHG17 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG17_Max (0x1UL) /*!< Max enumerator value of CHG17 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG17_Secure (0x1UL) /*!< The channel group 17 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG17_NonSecure (0x0UL) /*!< The channel group 17 is non-secure                          */

/* CHG18 @Bit 18 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG18_Pos (18UL) /*!< Position of CHG18 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG18_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG18_Pos) /*!< Bit mask of CHG18 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG18_Min (0x0UL) /*!< Min enumerator value of CHG18 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG18_Max (0x1UL) /*!< Max enumerator value of CHG18 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG18_Secure (0x1UL) /*!< The channel group 18 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG18_NonSecure (0x0UL) /*!< The channel group 18 is non-secure                          */

/* CHG19 @Bit 19 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG19_Pos (19UL) /*!< Position of CHG19 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG19_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG19_Pos) /*!< Bit mask of CHG19 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG19_Min (0x0UL) /*!< Min enumerator value of CHG19 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG19_Max (0x1UL) /*!< Max enumerator value of CHG19 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG19_Secure (0x1UL) /*!< The channel group 19 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG19_NonSecure (0x0UL) /*!< The channel group 19 is non-secure                          */

/* CHG20 @Bit 20 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG20_Pos (20UL) /*!< Position of CHG20 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG20_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG20_Pos) /*!< Bit mask of CHG20 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG20_Min (0x0UL) /*!< Min enumerator value of CHG20 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG20_Max (0x1UL) /*!< Max enumerator value of CHG20 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG20_Secure (0x1UL) /*!< The channel group 20 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG20_NonSecure (0x0UL) /*!< The channel group 20 is non-secure                          */

/* CHG21 @Bit 21 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG21_Pos (21UL) /*!< Position of CHG21 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG21_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG21_Pos) /*!< Bit mask of CHG21 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG21_Min (0x0UL) /*!< Min enumerator value of CHG21 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG21_Max (0x1UL) /*!< Max enumerator value of CHG21 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG21_Secure (0x1UL) /*!< The channel group 21 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG21_NonSecure (0x0UL) /*!< The channel group 21 is non-secure                          */

