adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CHG22 @Bit 22 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG22_Pos (22UL) /*!< Position of CHG22 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG22_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG22_Pos) /*!< Bit mask of CHG22 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG22_Min (0x0UL) /*!< Min enumerator value of CHG22 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG22_Max (0x1UL) /*!< Max enumerator value of CHG22 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG22_Secure (0x1UL) /*!< The channel group 22 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG22_NonSecure (0x0UL) /*!< The channel group 22 is non-secure                          */

/* CHG23 @Bit 23 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG23_Pos (23UL) /*!< Position of CHG23 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG23_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG23_Pos) /*!< Bit mask of CHG23 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG23_Min (0x0UL) /*!< Min enumerator value of CHG23 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG23_Max (0x1UL) /*!< Max enumerator value of CHG23 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG23_Secure (0x1UL) /*!< The channel group 23 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG23_NonSecure (0x0UL) /*!< The channel group 23 is non-secure                          */

/* CHG24 @Bit 24 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG24_Pos (24UL) /*!< Position of CHG24 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG24_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG24_Pos) /*!< Bit mask of CHG24 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG24_Min (0x0UL) /*!< Min enumerator value of CHG24 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG24_Max (0x1UL) /*!< Max enumerator value of CHG24 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG24_Secure (0x1UL) /*!< The channel group 24 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG24_NonSecure (0x0UL) /*!< The channel group 24 is non-secure                          */

/* CHG25 @Bit 25 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG25_Pos (25UL) /*!< Position of CHG25 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG25_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG25_Pos) /*!< Bit mask of CHG25 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG25_Min (0x0UL) /*!< Min enumerator value of CHG25 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG25_Max (0x1UL) /*!< Max enumerator value of CHG25 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG25_Secure (0x1UL) /*!< The channel group 25 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG25_NonSecure (0x0UL) /*!< The channel group 25 is non-secure                          */

/* CHG26 @Bit 26 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG26_Pos (26UL) /*!< Position of CHG26 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG26_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG26_Pos) /*!< Bit mask of CHG26 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG26_Min (0x0UL) /*!< Min enumerator value of CHG26 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG26_Max (0x1UL) /*!< Max enumerator value of CHG26 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG26_Secure (0x1UL) /*!< The channel group 26 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG26_NonSecure (0x0UL) /*!< The channel group 26 is non-secure                          */

/* CHG27 @Bit 27 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG27_Pos (27UL) /*!< Position of CHG27 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG27_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG27_Pos) /*!< Bit mask of CHG27 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG27_Min (0x0UL) /*!< Min enumerator value of CHG27 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG27_Max (0x1UL) /*!< Max enumerator value of CHG27 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG27_Secure (0x1UL) /*!< The channel group 27 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG27_NonSecure (0x0UL) /*!< The channel group 27 is non-secure                          */

/* CHG28 @Bit 28 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG28_Pos (28UL) /*!< Position of CHG28 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG28_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG28_Pos) /*!< Bit mask of CHG28 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG28_Min (0x0UL) /*!< Min enumerator value of CHG28 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG28_Max (0x1UL) /*!< Max enumerator value of CHG28 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG28_Secure (0x1UL) /*!< The channel group 28 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG28_NonSecure (0x0UL) /*!< The channel group 28 is non-secure                          */

/* CHG29 @Bit 29 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG29_Pos (29UL) /*!< Position of CHG29 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG29_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG29_Pos) /*!< Bit mask of CHG29 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG29_Min (0x0UL) /*!< Min enumerator value of CHG29 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG29_Max (0x1UL) /*!< Max enumerator value of CHG29 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG29_Secure (0x1UL) /*!< The channel group 29 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG29_NonSecure (0x0UL) /*!< The channel group 29 is non-secure                          */

/* CHG30 @Bit 30 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG30_Pos (30UL) /*!< Position of CHG30 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG30_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG30_Pos) /*!< Bit mask of CHG30 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG30_Min (0x0UL) /*!< Min enumerator value of CHG30 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG30_Max (0x1UL) /*!< Max enumerator value of CHG30 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG30_Secure (0x1UL) /*!< The channel group 30 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG30_NonSecure (0x0UL) /*!< The channel group 30 is non-secure                          */

/* CHG31 @Bit 31 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG31_Pos (31UL) /*!< Position of CHG31 field.                                           */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG31_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG31_Pos) /*!< Bit mask of CHG31 field. */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG31_Min (0x0UL) /*!< Min enumerator value of CHG31 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG31_Max (0x1UL) /*!< Max enumerator value of CHG31 field.                              */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG31_Secure (0x1UL) /*!< The channel group 31 is secure                                 */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG31_NonSecure (0x0UL) /*!< The channel group 31 is non-secure                          */



/* ================================================= Struct UICR_DPPI_GLOBAL ================================================= */
/**
  * @brief GLOBAL [UICR_DPPI_GLOBAL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INSTANCE;                          /*!< (@ 0x00000000) Address of the DPPI instance associated with
                                                                         DPPI[n].GLOBAL*/                                         
  __IOM NRF_UICR_DPPI_GLOBAL_CH_Type CH;             /*!< (@ 0x00000004) (unspecified)                                         */
  __IOM NRF_UICR_DPPI_GLOBAL_CHG_Type CHG;           /*!< (@ 0x00000014) (unspecified)                                         */
} NRF_UICR_DPPI_GLOBAL_Type;                         /*!< Size = 28 (0x01C)                                                    */
  #define UICR_DPPI_GLOBAL_MaxCount (12UL)           /*!< Max size of GLOBAL[12] array.                                        */

/* UICR_DPPI_GLOBAL_INSTANCE: Address of the DPPI instance associated with DPPI[n].GLOBAL */
  #define UICR_DPPI_GLOBAL_INSTANCE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of INSTANCE register.                           */

/* ADDRESS @Bits 0..31 : Instance address */
  #define UICR_DPPI_GLOBAL_INSTANCE_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                          */
  #define UICR_DPPI_GLOBAL_INSTANCE_ADDRESS_Msk (0xFFFFFFFFUL << UICR_DPPI_GLOBAL_INSTANCE_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/                                              



/* ==================================================== Struct UICR_DPPI ===================================================== */
/**
  * @brief DPPI [UICR_DPPI] (unspecified)
  */
typedef struct {
  __IOM NRF_UICR_DPPI_LOCAL_Type LOCAL[2];           /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_UICR_DPPI_GLOBAL_Type GLOBAL[12];        /*!< (@ 0x00000028) (unspecified)                                         */
} NRF_UICR_DPPI_Type;                                /*!< Size = 376 (0x178)                                                   */


/* =================================================== Struct UICR_GRTC_CC =================================================== */
/**
  * @brief CC [UICR_GRTC_CC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  OWN;                               /*!< (@ 0x00000000) Request ownership of the CCs of GRTCGRTC              */
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000004) Request permission for the CCs of GRTC                */
} NRF_UICR_GRTC_CC_Type;                             /*!< Size = 8 (0x008)                                                     */

/* UICR_GRTC_CC_OWN: Request ownership of the CCs of GRTCGRTC */
  #define UICR_GRTC_CC_OWN_ResetValue (0xFFFFFFFFUL) /*!< Reset value of OWN register.                                         */

/* CC0 @Bit 0 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC0_Pos (0UL)             /*!< Position of CC0 field.                                               */
  #define UICR_GRTC_CC_OWN_CC0_Msk (0x1UL << UICR_GRTC_CC_OWN_CC0_Pos) /*!< Bit mask of CC0 field.                             */
  #define UICR_GRTC_CC_OWN_CC0_Min (0x0UL)           /*!< Min enumerator value of CC0 field.                                   */
  #define UICR_GRTC_CC_OWN_CC0_Max (0x1UL)           /*!< Max enumerator value of CC0 field.                                   */
  #define UICR_GRTC_CC_OWN_CC0_NotOwn (0x1UL)        /*!< Do not own the CC register 0                                         */
  #define UICR_GRTC_CC_OWN_CC0_Own (0x0UL)           /*!< Own the CC register 0                                                */

/* CC1 @Bit 1 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC1_Pos (1UL)             /*!< Position of CC1 field.                                               */
  #define UICR_GRTC_CC_OWN_CC1_Msk (0x1UL << UICR_GRTC_CC_OWN_CC1_Pos) /*!< Bit mask of CC1 field.                             */
  #define UICR_GRTC_CC_OWN_CC1_Min (0x0UL)           /*!< Min enumerator value of CC1 field.                                   */
  #define UICR_GRTC_CC_OWN_CC1_Max (0x1UL)           /*!< Max enumerator value of CC1 field.                                   */
  #define UICR_GRTC_CC_OWN_CC1_NotOwn (0x1UL)        /*!< Do not own the CC register 1                                         */
  #define UICR_GRTC_CC_OWN_CC1_Own (0x0UL)           /*!< Own the CC register 1                                                */

/* CC2 @Bit 2 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC2_Pos (2UL)             /*!< Position of CC2 field.                                               */
  #define UICR_GRTC_CC_OWN_CC2_Msk (0x1UL << UICR_GRTC_CC_OWN_CC2_Pos) /*!< Bit mask of CC2 field.                             */
  #define UICR_GRTC_CC_OWN_CC2_Min (0x0UL)           /*!< Min enumerator value of CC2 field.                                   */
  #define UICR_GRTC_CC_OWN_CC2_Max (0x1UL)           /*!< Max enumerator value of CC2 field.                                   */
  #define UICR_GRTC_CC_OWN_CC2_NotOwn (0x1UL)        /*!< Do not own the CC register 2                                         */
  #define UICR_GRTC_CC_OWN_CC2_Own (0x0UL)           /*!< Own the CC register 2                                                */

/* CC3 @Bit 3 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC3_Pos (3UL)             /*!< Position of CC3 field.                                               */
  #define UICR_GRTC_CC_OWN_CC3_Msk (0x1UL << UICR_GRTC_CC_OWN_CC3_Pos) /*!< Bit mask of CC3 field.                             */
  #define UICR_GRTC_CC_OWN_CC3_Min (0x0UL)           /*!< Min enumerator value of CC3 field.                                   */
  #define UICR_GRTC_CC_OWN_CC3_Max (0x1UL)           /*!< Max enumerator value of CC3 field.                                   */
  #define UICR_GRTC_CC_OWN_CC3_NotOwn (0x1UL)        /*!< Do not own the CC register 3                                         */
  #define UICR_GRTC_CC_OWN_CC3_Own (0x0UL)           /*!< Own the CC register 3                                                */

/* CC4 @Bit 4 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC4_Pos (4UL)             /*!< Position of CC4 field.                                               */
  #define UICR_GRTC_CC_OWN_CC4_Msk (0x1UL << UICR_GRTC_CC_OWN_CC4_Pos) /*!< Bit mask of CC4 field.                             */
  #define UICR_GRTC_CC_OWN_CC4_Min (0x0UL)           /*!< Min enumerator value of CC4 field.                                   */
  #define UICR_GRTC_CC_OWN_CC4_Max (0x1UL)           /*!< Max enumerator value of CC4 field.                                   */
  #define UICR_GRTC_CC_OWN_CC4_NotOwn (0x1UL)        /*!< Do not own the CC register 4                                         */
  #define UICR_GRTC_CC_OWN_CC4_Own (0x0UL)           /*!< Own the CC register 4                                                */

/* CC5 @Bit 5 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC5_Pos (5UL)             /*!< Position of CC5 field.                                               */
  #define UICR_GRTC_CC_OWN_CC5_Msk (0x1UL << UICR_GRTC_CC_OWN_CC5_Pos) /*!< Bit mask of CC5 field.                             */
  #define UICR_GRTC_CC_OWN_CC5_Min (0x0UL)           /*!< Min enumerator value of CC5 field.                                   */
  #define UICR_GRTC_CC_OWN_CC5_Max (0x1UL)           /*!< Max enumerator value of CC5 field.                                   */
  #define UICR_GRTC_CC_OWN_CC5_NotOwn (0x1UL)        /*!< Do not own the CC register 5                                         */
  #define UICR_GRTC_CC_OWN_CC5_Own (0x0UL)           /*!< Own the CC register 5                                                */

/* CC6 @Bit 6 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC6_Pos (6UL)             /*!< Position of CC6 field.                                               */
  #define UICR_GRTC_CC_OWN_CC6_Msk (0x1UL << UICR_GRTC_CC_OWN_CC6_Pos) /*!< Bit mask of CC6 field.                             */
  #define UICR_GRTC_CC_OWN_CC6_Min (0x0UL)           /*!< Min enumerator value of CC6 field.                                   */
  #define UICR_GRTC_CC_OWN_CC6_Max (0x1UL)           /*!< Max enumerator value of CC6 field.                                   */
  #define UICR_GRTC_CC_OWN_CC6_NotOwn (0x1UL)        /*!< Do not own the CC register 6                                         */
  #define UICR_GRTC_CC_OWN_CC6_Own (0x0UL)           /*!< Own the CC register 6                                                */

/* CC7 @Bit 7 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC7_Pos (7UL)             /*!< Position of CC7 field.                                               */
  #define UICR_GRTC_CC_OWN_CC7_Msk (0x1UL << UICR_GRTC_CC_OWN_CC7_Pos) /*!< Bit mask of CC7 field.                             */
  #define UICR_GRTC_CC_OWN_CC7_Min (0x0UL)           /*!< Min enumerator value of CC7 field.                                   */
  #define UICR_GRTC_CC_OWN_CC7_Max (0x1UL)           /*!< Max enumerator value of CC7 field.                                   */
  #define UICR_GRTC_CC_OWN_CC7_NotOwn (0x1UL)        /*!< Do not own the CC register 7                                         */
  #define UICR_GRTC_CC_OWN_CC7_Own (0x0UL)           /*!< Own the CC register 7                                                */

/* CC8 @Bit 8 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC8_Pos (8UL)             /*!< Position of CC8 field.                                               */
  #define UICR_GRTC_CC_OWN_CC8_Msk (0x1UL << UICR_GRTC_CC_OWN_CC8_Pos) /*!< Bit mask of CC8 field.                             */
  #define UICR_GRTC_CC_OWN_CC8_Min (0x0UL)           /*!< Min enumerator value of CC8 field.                                   */
  #define UICR_GRTC_CC_OWN_CC8_Max (0x1UL)           /*!< Max enumerator value of CC8 field.                                   */
  #define UICR_GRTC_CC_OWN_CC8_NotOwn (0x1UL)        /*!< Do not own the CC register 8                                         */
  #define UICR_GRTC_CC_OWN_CC8_Own (0x0UL)           /*!< Own the CC register 8                                                */

