adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* UICR_MAILBOX_CONFIG: Configuration of mailbox n */
  #define UICR_MAILBOX_CONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONFIG register.                                   */

/* SECURE @Bit 3 : Permission */
  #define UICR_MAILBOX_CONFIG_SECURE_Pos (3UL)       /*!< Position of SECURE field.                                            */
  #define UICR_MAILBOX_CONFIG_SECURE_Msk (0x1UL << UICR_MAILBOX_CONFIG_SECURE_Pos) /*!< Bit mask of SECURE field.              */
  #define UICR_MAILBOX_CONFIG_SECURE_Min (0x0UL)     /*!< Min enumerator value of SECURE field.                                */
  #define UICR_MAILBOX_CONFIG_SECURE_Max (0x1UL)     /*!< Max enumerator value of SECURE field.                                */
  #define UICR_MAILBOX_CONFIG_SECURE_Secure (0x1UL)  /*!< The mailbox memory is secure                                         */
  #define UICR_MAILBOX_CONFIG_SECURE_NonSecure (0x0UL) /*!< The mailbox memory is non-secure                                   */

/* OWNERID @Bits 8..11 : Remote owner identification */
  #define UICR_MAILBOX_CONFIG_OWNERID_Pos (8UL)      /*!< Position of OWNERID field.                                           */
  #define UICR_MAILBOX_CONFIG_OWNERID_Msk (0xFUL << UICR_MAILBOX_CONFIG_OWNERID_Pos) /*!< Bit mask of OWNERID field.           */
  #define UICR_MAILBOX_CONFIG_OWNERID_Min (0x0UL)    /*!< Min value of OWNERID field.                                          */
  #define UICR_MAILBOX_CONFIG_OWNERID_Max (0xFUL)    /*!< Max size of OWNERID field.                                           */

/* SIZE @Bits 16..31 : Memory size */
  #define UICR_MAILBOX_CONFIG_SIZE_Pos (16UL)        /*!< Position of SIZE field.                                              */
  #define UICR_MAILBOX_CONFIG_SIZE_Msk (0xFFFFUL << UICR_MAILBOX_CONFIG_SIZE_Pos) /*!< Bit mask of SIZE field.                 */


/* ======================================================= Struct UICR ======================================================= */
/**
  * @brief User information configuration registers
  */
  typedef struct {                                   /*!< UICR Structure                                                       */
    __IOM NRF_UICR_MEM_Type MEM[16];                 /*!< (@ 0x00000000) (unspecified)                                         */
    __IM uint32_t RESERVED[32];
    __IOM NRF_UICR_PERIPH_Type PERIPH[192];          /*!< (@ 0x00000100) (unspecified)                                         */
    __IOM NRF_UICR_GPIO_Type GPIO[16];               /*!< (@ 0x00000400) (unspecified)                                         */
    __IOM NRF_UICR_GPIOTE_Type GPIOTE[4];            /*!< (@ 0x00000480) (unspecified)                                         */
    __IOM NRF_UICR_IPCT_Type IPCT;                   /*!< (@ 0x000004B0) (unspecified)                                         */
    __IOM NRF_UICR_DPPI_Type DPPI;                   /*!< (@ 0x000004E0) (unspecified)                                         */
    __IM uint32_t RESERVED1[2];
    __IOM NRF_UICR_GRTC_Type GRTC;                   /*!< (@ 0x00000660) (unspecified)                                         */
    __IM uint32_t RESERVED2[6];
    __IOM uint32_t IPCMAP[16];                       /*!< (@ 0x00000680) Request configuration for the channel n of IPCMAP     */
    __IM uint32_t RESERVED3[16];
    __IOM NRF_UICR_MAILBOX_Type MAILBOX[8];          /*!< (@ 0x00000700) (unspecified)                                         */
    __IM uint32_t RESERVED4[16];
    __IOM uint32_t INITSVTOR;                        /*!< (@ 0x00000780) Initial value of the secure VTOR (Vector Table Offset
                                                                         Register) after CPU reset.*/                             
    __IOM uint32_t INITNSVTOR;                       /*!< (@ 0x00000784) Initial value of the non-secure VTOR (Vector Table
                                                                         Offset Register).*/                                      
    __IM uint32_t RESERVED5[29];
    __IOM uint32_t PTREXTUICR;                       /*!< (@ 0x000007FC) Pointer to extended UICR.                             */
  } NRF_UICR_Type;                                   /*!< Size = 2048 (0x800)                                                  */

/* UICR_IPCMAP: Request configuration for the channel n of IPCMAP */
  #define UICR_IPCMAP_MaxCount (16UL)                /*!< Max size of IPCMAP[16] array.                                        */
  #define UICR_IPCMAP_ResetValue (0xFFFFFFFFUL)      /*!< Reset value of IPCMAP[16] register.                                  */

/* IPCTCHSINK @Bits 0..7 : IPCT channel number (sink side) */
  #define UICR_IPCMAP_IPCTCHSINK_Pos (0UL)           /*!< Position of IPCTCHSINK field.                                        */
  #define UICR_IPCMAP_IPCTCHSINK_Msk (0xFFUL << UICR_IPCMAP_IPCTCHSINK_Pos) /*!< Bit mask of IPCTCHSINK field.                 */

/* DOMAINIDSINK @Bits 8..11 : Domain ID (sink side) */
  #define UICR_IPCMAP_DOMAINIDSINK_Pos (8UL)         /*!< Position of DOMAINIDSINK field.                                      */
  #define UICR_IPCMAP_DOMAINIDSINK_Msk (0xFUL << UICR_IPCMAP_DOMAINIDSINK_Pos) /*!< Bit mask of DOMAINIDSINK field.            */

/* IPCTCHSOURCE @Bits 16..23 : IPCT channel number (source side) */
  #define UICR_IPCMAP_IPCTCHSOURCE_Pos (16UL)        /*!< Position of IPCTCHSOURCE field.                                      */
  #define UICR_IPCMAP_IPCTCHSOURCE_Msk (0xFFUL << UICR_IPCMAP_IPCTCHSOURCE_Pos) /*!< Bit mask of IPCTCHSOURCE field.           */

/* DOMAINIDSOURCE @Bits 24..27 : Domain ID (source side) */
  #define UICR_IPCMAP_DOMAINIDSOURCE_Pos (24UL)      /*!< Position of DOMAINIDSOURCE field.                                    */
  #define UICR_IPCMAP_DOMAINIDSOURCE_Msk (0xFUL << UICR_IPCMAP_DOMAINIDSOURCE_Pos) /*!< Bit mask of DOMAINIDSOURCE field.      */


/* UICR_INITSVTOR: Initial value of the secure VTOR (Vector Table Offset Register) after CPU reset. */
  #define UICR_INITSVTOR_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of INITSVTOR register.                                   */

