adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* INITSVTOR @Bits 0..31 : Initial value of the VTOR. */
  #define UICR_INITSVTOR_INITSVTOR_Pos (0UL)         /*!< Position of INITSVTOR field.                                         */
  #define UICR_INITSVTOR_INITSVTOR_Msk (0xFFFFFFFFUL << UICR_INITSVTOR_INITSVTOR_Pos) /*!< Bit mask of INITSVTOR field.        */


/* UICR_INITNSVTOR: Initial value of the non-secure VTOR (Vector Table Offset Register). */
  #define UICR_INITNSVTOR_ResetValue (0xFFFFFFFFUL)  /*!< Reset value of INITNSVTOR register.                                  */

/* INITNSVTOR @Bits 0..31 : Initial value of the VTOR. */
  #define UICR_INITNSVTOR_INITNSVTOR_Pos (0UL)       /*!< Position of INITNSVTOR field.                                        */
  #define UICR_INITNSVTOR_INITNSVTOR_Msk (0xFFFFFFFFUL << UICR_INITNSVTOR_INITNSVTOR_Pos) /*!< Bit mask of INITNSVTOR field.   */


/* UICR_PTREXTUICR: Pointer to extended UICR. */
  #define UICR_PTREXTUICR_ResetValue (0xFFFFFFFFUL)  /*!< Reset value of PTREXTUICR register.                                  */

/* PTREXTUICR @Bits 0..31 : Pointer to extended UICR. */
  #define UICR_PTREXTUICR_PTREXTUICR_Pos (0UL)       /*!< Position of PTREXTUICR field.                                        */
  #define UICR_PTREXTUICR_PTREXTUICR_Msk (0xFFFFFFFFUL << UICR_PTREXTUICR_PTREXTUICR_Pos) /*!< Bit mask of PTREXTUICR field.   */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           USBHS                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct USBHS_PHY ===================================================== */
/**
  * @brief PHY [USBHS_PHY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) USB PHY parameter overrides                           */
  __IOM uint32_t  CLOCK;                             /*!< (@ 0x00000004) USB PHY clock configurations                          */
  __IOM uint32_t  BATTCHRG;                          /*!< (@ 0x00000008) Battery Charging Configuration                        */
  __IOM uint32_t  VREGBYPASS;                        /*!< (@ 0x0000000C) Vreg18 bypass control                                 */
  __IOM uint32_t  VREGBYPASSLOCK;                    /*!< (@ 0x00000010) Enables the lock for the PHY.VREGBYPASS               */
  __IOM uint32_t  INPUTOVERRIDE;                     /*!< (@ 0x00000014) Enables overriding of the input signals to the PHY,
                                                                         used for PHY Built In Self Test (BIST).*/                
  __IOM uint32_t  OVERRIDEVALUES;                    /*!< (@ 0x00000018) Values that are used to override the input signals to
                                                                         the PHY.*/                                               
} NRF_USBHS_PHY_Type;                                /*!< Size = 28 (0x01C)                                                    */

/* USBHS_PHY_CONFIG: USB PHY parameter overrides */
  #define USBHS_PHY_CONFIG_ResetValue (0x5533D6F0UL) /*!< Reset value of CONFIG register.                                      */

/* PLLITUNE @Bits 0..1 : PLL Integral Path Tune */
  #define USBHS_PHY_CONFIG_PLLITUNE_Pos (0UL)        /*!< Position of PLLITUNE field.                                          */
  #define USBHS_PHY_CONFIG_PLLITUNE_Msk (0x3UL << USBHS_PHY_CONFIG_PLLITUNE_Pos) /*!< Bit mask of PLLITUNE field.              */
  #define USBHS_PHY_CONFIG_PLLITUNE_Min (0x0UL)      /*!< Min value of PLLITUNE field.                                         */
  #define USBHS_PHY_CONFIG_PLLITUNE_Max (0x3UL)      /*!< Max size of PLLITUNE field.                                          */

/* PLLPTUNE @Bits 2..5 : PLL Proportional Path Tune */
  #define USBHS_PHY_CONFIG_PLLPTUNE_Pos (2UL)        /*!< Position of PLLPTUNE field.                                          */
  #define USBHS_PHY_CONFIG_PLLPTUNE_Msk (0xFUL << USBHS_PHY_CONFIG_PLLPTUNE_Pos) /*!< Bit mask of PLLPTUNE field.              */
  #define USBHS_PHY_CONFIG_PLLPTUNE_Min (0x0UL)      /*!< Min value of PLLPTUNE field.                                         */
  #define USBHS_PHY_CONFIG_PLLPTUNE_Max (0xFUL)      /*!< Max size of PLLPTUNE field.                                          */

/* COMPDISTUNE0 @Bits 6..8 : Disconnect Threshold Adjustment */
  #define USBHS_PHY_CONFIG_COMPDISTUNE0_Pos (6UL)    /*!< Position of COMPDISTUNE0 field.                                      */
  #define USBHS_PHY_CONFIG_COMPDISTUNE0_Msk (0x7UL << USBHS_PHY_CONFIG_COMPDISTUNE0_Pos) /*!< Bit mask of COMPDISTUNE0 field.  */
  #define USBHS_PHY_CONFIG_COMPDISTUNE0_Min (0x0UL)  /*!< Min value of COMPDISTUNE0 field.                                     */
  #define USBHS_PHY_CONFIG_COMPDISTUNE0_Max (0x7UL)  /*!< Max size of COMPDISTUNE0 field.                                      */

/* SQRXTUNE0 @Bits 9..11 : Squelch Threshold Adjustment */
  #define USBHS_PHY_CONFIG_SQRXTUNE0_Pos (9UL)       /*!< Position of SQRXTUNE0 field.                                         */
  #define USBHS_PHY_CONFIG_SQRXTUNE0_Msk (0x7UL << USBHS_PHY_CONFIG_SQRXTUNE0_Pos) /*!< Bit mask of SQRXTUNE0 field.           */
  #define USBHS_PHY_CONFIG_SQRXTUNE0_Min (0x0UL)     /*!< Min value of SQRXTUNE0 field.                                        */
  #define USBHS_PHY_CONFIG_SQRXTUNE0_Max (0x3UL)     /*!< Max size of SQRXTUNE0 field.                                         */

/* VDATREFTUNE0 @Bits 12..13 : Data Detect Voltage Adjustment */
  #define USBHS_PHY_CONFIG_VDATREFTUNE0_Pos (12UL)   /*!< Position of VDATREFTUNE0 field.                                      */
  #define USBHS_PHY_CONFIG_VDATREFTUNE0_Msk (0x3UL << USBHS_PHY_CONFIG_VDATREFTUNE0_Pos) /*!< Bit mask of VDATREFTUNE0 field.  */
  #define USBHS_PHY_CONFIG_VDATREFTUNE0_Min (0x0UL)  /*!< Min value of VDATREFTUNE0 field.                                     */
  #define USBHS_PHY_CONFIG_VDATREFTUNE0_Max (0x3UL)  /*!< Max size of VDATREFTUNE0 field.                                      */

/* TXHSXVTUNE0 @Bits 14..15 : Transmitter High-Speed Crossover Adjustment */
  #define USBHS_PHY_CONFIG_TXHSXVTUNE0_Pos (14UL)    /*!< Position of TXHSXVTUNE0 field.                                       */
  #define USBHS_PHY_CONFIG_TXHSXVTUNE0_Msk (0x3UL << USBHS_PHY_CONFIG_TXHSXVTUNE0_Pos) /*!< Bit mask of TXHSXVTUNE0 field.     */
  #define USBHS_PHY_CONFIG_TXHSXVTUNE0_Min (0x0UL)   /*!< Min value of TXHSXVTUNE0 field.                                      */
  #define USBHS_PHY_CONFIG_TXHSXVTUNE0_Max (0x2UL)   /*!< Max size of TXHSXVTUNE0 field.                                       */

