adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TXFSLSTUNE0 @Bits 16..19 : FS/LS Source Impedance Adjustment */
  #define USBHS_PHY_CONFIG_TXFSLSTUNE0_Pos (16UL)    /*!< Position of TXFSLSTUNE0 field.                                       */
  #define USBHS_PHY_CONFIG_TXFSLSTUNE0_Msk (0xFUL << USBHS_PHY_CONFIG_TXFSLSTUNE0_Pos) /*!< Bit mask of TXFSLSTUNE0 field.     */
  #define USBHS_PHY_CONFIG_TXFSLSTUNE0_Min (0x0UL)   /*!< Min value of TXFSLSTUNE0 field.                                      */
  #define USBHS_PHY_CONFIG_TXFSLSTUNE0_Max (0x7UL)   /*!< Max size of TXFSLSTUNE0 field.                                       */

/* TXVREFTUNE0 @Bits 20..23 : HS DC Voltage Level Adjustment */
  #define USBHS_PHY_CONFIG_TXVREFTUNE0_Pos (20UL)    /*!< Position of TXVREFTUNE0 field.                                       */
  #define USBHS_PHY_CONFIG_TXVREFTUNE0_Msk (0xFUL << USBHS_PHY_CONFIG_TXVREFTUNE0_Pos) /*!< Bit mask of TXVREFTUNE0 field.     */
  #define USBHS_PHY_CONFIG_TXVREFTUNE0_Min (0x0UL)   /*!< Min value of TXVREFTUNE0 field.                                      */
  #define USBHS_PHY_CONFIG_TXVREFTUNE0_Max (0x7UL)   /*!< Max size of TXVREFTUNE0 field.                                       */

/* TXRISETUNE0 @Bits 24..25 : HS Transmitter Rise/Fall Time Adjustment */
  #define USBHS_PHY_CONFIG_TXRISETUNE0_Pos (24UL)    /*!< Position of TXRISETUNE0 field.                                       */
  #define USBHS_PHY_CONFIG_TXRISETUNE0_Msk (0x3UL << USBHS_PHY_CONFIG_TXRISETUNE0_Pos) /*!< Bit mask of TXRISETUNE0 field.     */
  #define USBHS_PHY_CONFIG_TXRISETUNE0_Min (0x0UL)   /*!< Min value of TXRISETUNE0 field.                                      */
  #define USBHS_PHY_CONFIG_TXRISETUNE0_Max (0x2UL)   /*!< Max size of TXRISETUNE0 field.                                       */

/* TXRESTUNE0 @Bits 26..27 : USB Source Impedance Adjustment */
  #define USBHS_PHY_CONFIG_TXRESTUNE0_Pos (26UL)     /*!< Position of TXRESTUNE0 field.                                        */
  #define USBHS_PHY_CONFIG_TXRESTUNE0_Msk (0x3UL << USBHS_PHY_CONFIG_TXRESTUNE0_Pos) /*!< Bit mask of TXRESTUNE0 field.        */
  #define USBHS_PHY_CONFIG_TXRESTUNE0_Min (0x0UL)    /*!< Min value of TXRESTUNE0 field.                                       */
  #define USBHS_PHY_CONFIG_TXRESTUNE0_Max (0x2UL)    /*!< Max size of TXRESTUNE0 field.                                        */

/* TXPREEMPAMPTUNE0 @Bits 28..29 : HS Transmitter Pre-Emphasis Current Control */
  #define USBHS_PHY_CONFIG_TXPREEMPAMPTUNE0_Pos (28UL) /*!< Position of TXPREEMPAMPTUNE0 field.                                */
  #define USBHS_PHY_CONFIG_TXPREEMPAMPTUNE0_Msk (0x3UL << USBHS_PHY_CONFIG_TXPREEMPAMPTUNE0_Pos) /*!< Bit mask of
                                                                            TXPREEMPAMPTUNE0 field.*/                             
  #define USBHS_PHY_CONFIG_TXPREEMPAMPTUNE0_Min (0x0UL) /*!< Min value of TXPREEMPAMPTUNE0 field.                              */
  #define USBHS_PHY_CONFIG_TXPREEMPAMPTUNE0_Max (0x2UL) /*!< Max size of TXPREEMPAMPTUNE0 field.                               */

/* TXPREEMPPULSETUNE0 @Bit 30 : HS Transmitter Pre-Emphasis Duration Control */
  #define USBHS_PHY_CONFIG_TXPREEMPPULSETUNE0_Pos (30UL) /*!< Position of TXPREEMPPULSETUNE0 field.                            */
  #define USBHS_PHY_CONFIG_TXPREEMPPULSETUNE0_Msk (0x1UL << USBHS_PHY_CONFIG_TXPREEMPPULSETUNE0_Pos) /*!< Bit mask of
                                                                            TXPREEMPPULSETUNE0 field.*/                           
  #define USBHS_PHY_CONFIG_TXPREEMPPULSETUNE0_Min (0x0UL) /*!< Min value of TXPREEMPPULSETUNE0 field.                          */
  #define USBHS_PHY_CONFIG_TXPREEMPPULSETUNE0_Max (0x1UL) /*!< Max size of TXPREEMPPULSETUNE0 field.                           */


/* USBHS_PHY_CLOCK: USB PHY clock configurations */
  #define USBHS_PHY_CLOCK_ResetValue (0x0000001AUL)  /*!< Reset value of CLOCK register.                                       */

/* FSEL @Bits 0..2 : Select reference clock frequency */
  #define USBHS_PHY_CLOCK_FSEL_Pos (0UL)             /*!< Position of FSEL field.                                              */
  #define USBHS_PHY_CLOCK_FSEL_Msk (0x7UL << USBHS_PHY_CLOCK_FSEL_Pos) /*!< Bit mask of FSEL field.                            */
  #define USBHS_PHY_CLOCK_FSEL_Min (0x0UL)           /*!< Min enumerator value of FSEL field.                                  */
  #define USBHS_PHY_CLOCK_FSEL_Max (0x7UL)           /*!< Max enumerator value of FSEL field.                                  */
  #define USBHS_PHY_CLOCK_FSEL_Clock19200KHz (0x0UL) /*!< Reference clock is 19.2MHz.                                          */
  #define USBHS_PHY_CLOCK_FSEL_Clock20000KHz (0x1UL) /*!< Reference clock is 20MHz.                                            */
  #define USBHS_PHY_CLOCK_FSEL_Clock24000KHz (0x2UL) /*!< Reference clock is 24MHz.                                            */
  #define USBHS_PHY_CLOCK_FSEL_Clock50000KHz (0x7UL) /*!< Reference clock is 50MHz.                                            */

/* PLLBTUNE @Bit 3 : PLL bandwidth adjustment */
  #define USBHS_PHY_CLOCK_PLLBTUNE_Pos (3UL)         /*!< Position of PLLBTUNE field.                                          */
  #define USBHS_PHY_CLOCK_PLLBTUNE_Msk (0x1UL << USBHS_PHY_CLOCK_PLLBTUNE_Pos) /*!< Bit mask of PLLBTUNE field.                */
  #define USBHS_PHY_CLOCK_PLLBTUNE_Min (0x0UL)       /*!< Min enumerator value of PLLBTUNE field.                              */
  #define USBHS_PHY_CLOCK_PLLBTUNE_Max (0x1UL)       /*!< Max enumerator value of PLLBTUNE field.                              */
  #define USBHS_PHY_CLOCK_PLLBTUNE_Disabled (0x0UL)  /*!< PLL bandwidth adjustment disabled.                                   */
  #define USBHS_PHY_CLOCK_PLLBTUNE_Enabled (0x1UL)   /*!< PLL bandwidth adjustment enabled.                                    */

/* COMMONONN @Bit 4 : Common block power down control */
  #define USBHS_PHY_CLOCK_COMMONONN_Pos (4UL)        /*!< Position of COMMONONN field.                                         */
  #define USBHS_PHY_CLOCK_COMMONONN_Msk (0x1UL << USBHS_PHY_CLOCK_COMMONONN_Pos) /*!< Bit mask of COMMONONN field.             */
  #define USBHS_PHY_CLOCK_COMMONONN_Min (0x0UL)      /*!< Min enumerator value of COMMONONN field.                             */
  #define USBHS_PHY_CLOCK_COMMONONN_Max (0x1UL)      /*!< Max enumerator value of COMMONONN field.                             */
  #define USBHS_PHY_CLOCK_COMMONONN_POWERED (0x0UL)  /*!< The REFCLOCK_LOGIC,bias and PLL blocks are powered in sleep or suspend
                                                          mode.*/                                                                 
  #define USBHS_PHY_CLOCK_COMMONONN_SUSPEND (0x1UL)  /*!< The REFCLOCK_LOGIC, bias and PLL blocks are powered down in suspend
                                                          mode and bias and PLL blocks are powered down in sleep mode.*/          


/* USBHS_PHY_BATTCHRG: Battery Charging Configuration */
  #define USBHS_PHY_BATTCHRG_ResetValue (0x00000000UL) /*!< Reset value of BATTCHRG register.                                  */

/* CHRGSEL0 @Bit 0 : Battery charging source select */
  #define USBHS_PHY_BATTCHRG_CHRGSEL0_Pos (0UL)      /*!< Position of CHRGSEL0 field.                                          */
  #define USBHS_PHY_BATTCHRG_CHRGSEL0_Msk (0x1UL << USBHS_PHY_BATTCHRG_CHRGSEL0_Pos) /*!< Bit mask of CHRGSEL0 field.          */
  #define USBHS_PHY_BATTCHRG_CHRGSEL0_Min (0x0UL)    /*!< Min enumerator value of CHRGSEL0 field.                              */
  #define USBHS_PHY_BATTCHRG_CHRGSEL0_Max (0x1UL)    /*!< Max enumerator value of CHRGSEL0 field.                              */
  #define USBHS_PHY_BATTCHRG_CHRGSEL0_SourceDP0SinkDM0 (0x0UL) /*!< Data source voltage (VDAT_SRC) is sourced onto DP0 and sunk
                                                                    from DM0*/                                                    
  #define USBHS_PHY_BATTCHRG_CHRGSEL0_SourceDM0SinkDP0 (0x1UL) /*!< Data source voltage (VDAT_SRC) is sourced onto DM0 and sunk
                                                                    from DP0*/                                                    

/* VDATENB0 @Bit 1 : Attach/Connect Detection Enable */
  #define USBHS_PHY_BATTCHRG_VDATENB0_Pos (1UL)      /*!< Position of VDATENB0 field.                                          */
  #define USBHS_PHY_BATTCHRG_VDATENB0_Msk (0x1UL << USBHS_PHY_BATTCHRG_VDATENB0_Pos) /*!< Bit mask of VDATENB0 field.          */
  #define USBHS_PHY_BATTCHRG_VDATENB0_Min (0x0UL)    /*!< Min enumerator value of VDATENB0 field.                              */
  #define USBHS_PHY_BATTCHRG_VDATENB0_Max (0x1UL)    /*!< Max enumerator value of VDATENB0 field.                              */
  #define USBHS_PHY_BATTCHRG_VDATENB0_Disabled (0x0UL) /*!< Data detect voltage (CHG_DET) is disabled                          */
  #define USBHS_PHY_BATTCHRG_VDATENB0_Enabled (0x1UL) /*!< Data detect voltage (CHG_DET) is enabled                            */

/* VDATSRCENB0 @Bit 2 : Battery Charging Source Select */
  #define USBHS_PHY_BATTCHRG_VDATSRCENB0_Pos (2UL)   /*!< Position of VDATSRCENB0 field.                                       */
  #define USBHS_PHY_BATTCHRG_VDATSRCENB0_Msk (0x1UL << USBHS_PHY_BATTCHRG_VDATSRCENB0_Pos) /*!< Bit mask of VDATSRCENB0 field. */
  #define USBHS_PHY_BATTCHRG_VDATSRCENB0_Min (0x0UL) /*!< Min enumerator value of VDATSRCENB0 field.                           */
  #define USBHS_PHY_BATTCHRG_VDATSRCENB0_Max (0x1UL) /*!< Max enumerator value of VDATSRCENB0 field.                           */
  #define USBHS_PHY_BATTCHRG_VDATSRCENB0_Disabled (0x0UL) /*!< Data source voltage (VDAT_SRC) is disabled                      */
  #define USBHS_PHY_BATTCHRG_VDATSRCENB0_Enabled (0x1UL) /*!< Data source voltage (VDAT_SRC) is enabled                        */

/* DCDENB0 @Bit 3 : Enhanced Data Contact Detection Enable */
  #define USBHS_PHY_BATTCHRG_DCDENB0_Pos (3UL)       /*!< Position of DCDENB0 field.                                           */
  #define USBHS_PHY_BATTCHRG_DCDENB0_Msk (0x1UL << USBHS_PHY_BATTCHRG_DCDENB0_Pos) /*!< Bit mask of DCDENB0 field.             */
  #define USBHS_PHY_BATTCHRG_DCDENB0_Min (0x0UL)     /*!< Min enumerator value of DCDENB0 field.                               */
  #define USBHS_PHY_BATTCHRG_DCDENB0_Max (0x1UL)     /*!< Max enumerator value of DCDENB0 field.                               */
  #define USBHS_PHY_BATTCHRG_DCDENB0_Disabled (0x0UL) /*!< IDP_SRC current is disabled                                         */
  #define USBHS_PHY_BATTCHRG_DCDENB0_Enabled (0x1UL) /*!< IDP_SRC current is sourced onto DP0                                  */


