adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* USBHS_PHY_VREGBYPASS: Vreg18 bypass control */
  #define USBHS_PHY_VREGBYPASS_ResetValue (0x00000000UL) /*!< Reset value of VREGBYPASS register.                              */

/* EN @Bit 0 : Vreg18 bypass enable */
  #define USBHS_PHY_VREGBYPASS_EN_Pos (0UL)          /*!< Position of EN field.                                                */
  #define USBHS_PHY_VREGBYPASS_EN_Msk (0x1UL << USBHS_PHY_VREGBYPASS_EN_Pos) /*!< Bit mask of EN field.                        */
  #define USBHS_PHY_VREGBYPASS_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define USBHS_PHY_VREGBYPASS_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define USBHS_PHY_VREGBYPASS_EN_Vreg18Enabled (0x0UL) /*!< A 3.3V supply must be provided on VDDH0. Internal 1.8V supply is
                                                             generated by Vreg18*/                                                
  #define USBHS_PHY_VREGBYPASS_EN_Vreg18Bypassed (0x1UL) /*!< A 1.8V supply must be provided on VDDH0. Vreg18 is bypassed      */


/* USBHS_PHY_VREGBYPASSLOCK: Enables the lock for the PHY.VREGBYPASS */
  #define USBHS_PHY_VREGBYPASSLOCK_ResetValue (0x00000000UL) /*!< Reset value of VREGBYPASSLOCK register.                      */

/* EnableLock @Bit 0 : Enables the lock. */
  #define USBHS_PHY_VREGBYPASSLOCK_EnableLock_Pos (0UL) /*!< Position of EnableLock field.                                     */
  #define USBHS_PHY_VREGBYPASSLOCK_EnableLock_Msk (0x1UL << USBHS_PHY_VREGBYPASSLOCK_EnableLock_Pos) /*!< Bit mask of EnableLock
                                                                            field.*/                                              
  #define USBHS_PHY_VREGBYPASSLOCK_EnableLock_Min (0x0UL) /*!< Min enumerator value of EnableLock field.                       */
  #define USBHS_PHY_VREGBYPASSLOCK_EnableLock_Max (0x1UL) /*!< Max enumerator value of EnableLock field.                       */
  #define USBHS_PHY_VREGBYPASSLOCK_EnableLock_LockDisabled (0x0UL) /*!< Read: PHY.VREGBYPASS is not locked.                    */
  #define USBHS_PHY_VREGBYPASSLOCK_EnableLock_LockEnabled (0x1UL) /*!< Read: PHY.VREGBYPASS is locked.                         */
  #define USBHS_PHY_VREGBYPASSLOCK_EnableLock_EnableLock (0x1UL) /*!< Write: Enables the lock (Ignores any other value
                                                                      written).*/                                                 


/* USBHS_PHY_INPUTOVERRIDE: Enables overriding of the input signals to the PHY, used for PHY Built In Self Test (BIST). */
  #define USBHS_PHY_INPUTOVERRIDE_ResetValue (0x00000000UL) /*!< Reset value of INPUTOVERRIDE register.                        */

/* ENABLE @Bit 0 : Enable or disable overriding of PHY input signals. */
  #define USBHS_PHY_INPUTOVERRIDE_ENABLE_Pos (0UL)   /*!< Position of ENABLE field.                                            */
  #define USBHS_PHY_INPUTOVERRIDE_ENABLE_Msk (0x1UL << USBHS_PHY_INPUTOVERRIDE_ENABLE_Pos) /*!< Bit mask of ENABLE field.      */
  #define USBHS_PHY_INPUTOVERRIDE_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                                */
  #define USBHS_PHY_INPUTOVERRIDE_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                                */
  #define USBHS_PHY_INPUTOVERRIDE_ENABLE_Disabled (0x0UL) /*!< Disable                                                         */
  #define USBHS_PHY_INPUTOVERRIDE_ENABLE_Enabled (0x1UL) /*!< Enable                                                           */


/* USBHS_PHY_OVERRIDEVALUES: Values that are used to override the input signals to the PHY. */
  #define USBHS_PHY_OVERRIDEVALUES_ResetValue (0x06000000UL) /*!< Reset value of OVERRIDEVALUES register.                      */

/* DATAIN0 @Bits 0..7 : (unspecified) */
  #define USBHS_PHY_OVERRIDEVALUES_DATAIN0_Pos (0UL) /*!< Position of DATAIN0 field.                                           */
  #define USBHS_PHY_OVERRIDEVALUES_DATAIN0_Msk (0xFFUL << USBHS_PHY_OVERRIDEVALUES_DATAIN0_Pos) /*!< Bit mask of DATAIN0 field.*/

/* DATAINH0 @Bits 8..15 : (unspecified) */
  #define USBHS_PHY_OVERRIDEVALUES_DATAINH0_Pos (8UL) /*!< Position of DATAINH0 field.                                         */
  #define USBHS_PHY_OVERRIDEVALUES_DATAINH0_Msk (0xFFUL << USBHS_PHY_OVERRIDEVALUES_DATAINH0_Pos) /*!< Bit mask of DATAINH0
                                                                            field.*/                                              

/* TXVALID0 @Bit 16 : (unspecified) */
  #define USBHS_PHY_OVERRIDEVALUES_TXVALID0_Pos (16UL) /*!< Position of TXVALID0 field.                                        */
  #define USBHS_PHY_OVERRIDEVALUES_TXVALID0_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_TXVALID0_Pos) /*!< Bit mask of TXVALID0
                                                                            field.*/                                              

/* TXVALIDH0 @Bit 17 : (unspecified) */
  #define USBHS_PHY_OVERRIDEVALUES_TXVALIDH0_Pos (17UL) /*!< Position of TXVALIDH0 field.                                      */
  #define USBHS_PHY_OVERRIDEVALUES_TXVALIDH0_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_TXVALIDH0_Pos) /*!< Bit mask of TXVALIDH0
                                                                            field.*/                                              

/* OPMODE0 @Bits 18..19 : (unspecified) */
  #define USBHS_PHY_OVERRIDEVALUES_OPMODE0_Pos (18UL) /*!< Position of OPMODE0 field.                                          */
  #define USBHS_PHY_OVERRIDEVALUES_OPMODE0_Msk (0x3UL << USBHS_PHY_OVERRIDEVALUES_OPMODE0_Pos) /*!< Bit mask of OPMODE0 field. */

/* XCVRSEL0 @Bits 20..21 : (unspecified) */
  #define USBHS_PHY_OVERRIDEVALUES_XCVRSEL0_Pos (20UL) /*!< Position of XCVRSEL0 field.                                        */
  #define USBHS_PHY_OVERRIDEVALUES_XCVRSEL0_Msk (0x3UL << USBHS_PHY_OVERRIDEVALUES_XCVRSEL0_Pos) /*!< Bit mask of XCVRSEL0
                                                                            field.*/                                              

/* TERMSEL0 @Bit 22 : (unspecified) */
  #define USBHS_PHY_OVERRIDEVALUES_TERMSEL0_Pos (22UL) /*!< Position of TERMSEL0 field.                                        */
  #define USBHS_PHY_OVERRIDEVALUES_TERMSEL0_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_TERMSEL0_Pos) /*!< Bit mask of TERMSEL0
                                                                            field.*/                                              

/* DPPULLDOWN0 @Bit 23 : (unspecified) */
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN0_Pos (23UL) /*!< Position of DPPULLDOWN0 field.                                  */
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN0_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN0_Pos) /*!< Bit mask of
                                                                            DPPULLDOWN0 field.*/                                  

/* DMPULLDOWN0 @Bit 24 : (unspecified) */
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN0_Pos (24UL) /*!< Position of DMPULLDOWN0 field.                                  */
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN0_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN0_Pos) /*!< Bit mask of
                                                                            DMPULLDOWN0 field.*/                                  

/* SUSPENDM0 @Bit 25 : (unspecified) */
  #define USBHS_PHY_OVERRIDEVALUES_SUSPENDM0_Pos (25UL) /*!< Position of SUSPENDM0 field.                                      */
  #define USBHS_PHY_OVERRIDEVALUES_SUSPENDM0_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_SUSPENDM0_Pos) /*!< Bit mask of SUSPENDM0
                                                                            field.*/                                              

