adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VATESTENB @Bits 2..3 : Analog Test Pin Select */
  #define USBHS_DFT_TCFG_VATESTENB_Pos (2UL)         /*!< Position of VATESTENB field.                                         */
  #define USBHS_DFT_TCFG_VATESTENB_Msk (0x3UL << USBHS_DFT_TCFG_VATESTENB_Pos) /*!< Bit mask of VATESTENB field.               */
  #define USBHS_DFT_TCFG_VATESTENB_Min (0x0UL)       /*!< Min enumerator value of VATESTENB field.                             */
  #define USBHS_DFT_TCFG_VATESTENB_Max (0x3UL)       /*!< Max enumerator value of VATESTENB field.                             */
  #define USBHS_DFT_TCFG_VATESTENB_Disabled (0x0UL)  /*!< Analog test voltages cannot be viewed or applied                     */
  #define USBHS_DFT_TCFG_VATESTENB_ID0 (0x1UL)       /*!< Analog test voltages cannot be viewed or applied on ID0              */
  #define USBHS_DFT_TCFG_VATESTENB_ANALOGTEST (0x2UL) /*!< Analog test voltages cannot be viewed or applied on ANALOGTEST      */
  #define USBHS_DFT_TCFG_VATESTENB_Unused (0x3UL)    /*!< Invalid setting                                                      */

/* LOOPBACKENB0 @Bit 4 : Loopback Test. enables receive and transmit logic concurrently */
  #define USBHS_DFT_TCFG_LOOPBACKENB0_Pos (4UL)      /*!< Position of LOOPBACKENB0 field.                                      */
  #define USBHS_DFT_TCFG_LOOPBACKENB0_Msk (0x1UL << USBHS_DFT_TCFG_LOOPBACKENB0_Pos) /*!< Bit mask of LOOPBACKENB0 field.      */
  #define USBHS_DFT_TCFG_LOOPBACKENB0_Min (0x0UL)    /*!< Min enumerator value of LOOPBACKENB0 field.                          */
  #define USBHS_DFT_TCFG_LOOPBACKENB0_Max (0x1UL)    /*!< Max enumerator value of LOOPBACKENB0 field.                          */
  #define USBHS_DFT_TCFG_LOOPBACKENB0_Disabled (0x0UL) /*!< During data transmission, the receive logic is disabled            */
  #define USBHS_DFT_TCFG_LOOPBACKENB0_Enabled (0x1UL) /*!< During data transmission, the receive logic is enabled              */

/* TESTBURNIN @Bit 5 : Burn-In Test Enable */
  #define USBHS_DFT_TCFG_TESTBURNIN_Pos (5UL)        /*!< Position of TESTBURNIN field.                                        */
  #define USBHS_DFT_TCFG_TESTBURNIN_Msk (0x1UL << USBHS_DFT_TCFG_TESTBURNIN_Pos) /*!< Bit mask of TESTBURNIN field.            */
  #define USBHS_DFT_TCFG_TESTBURNIN_Min (0x0UL)      /*!< Min enumerator value of TESTBURNIN field.                            */
  #define USBHS_DFT_TCFG_TESTBURNIN_Max (0x1UL)      /*!< Max enumerator value of TESTBURNIN field.                            */
  #define USBHS_DFT_TCFG_TESTBURNIN_Disabled (0x0UL) /*!< Burn-in test disabled                                                */
  #define USBHS_DFT_TCFG_TESTBURNIN_Enabled (0x1UL)  /*!< Burn-in test enabled. Requires 50MHz reference clock on CLKCORE      */

/* TESTIFENABLE @Bit 6 : Enable the test interface. */
  #define USBHS_DFT_TCFG_TESTIFENABLE_Pos (6UL)      /*!< Position of TESTIFENABLE field.                                      */
  #define USBHS_DFT_TCFG_TESTIFENABLE_Msk (0x1UL << USBHS_DFT_TCFG_TESTIFENABLE_Pos) /*!< Bit mask of TESTIFENABLE field.      */
  #define USBHS_DFT_TCFG_TESTIFENABLE_Min (0x0UL)    /*!< Min enumerator value of TESTIFENABLE field.                          */
  #define USBHS_DFT_TCFG_TESTIFENABLE_Max (0x1UL)    /*!< Max enumerator value of TESTIFENABLE field.                          */
  #define USBHS_DFT_TCFG_TESTIFENABLE_Disabled (0x0UL) /*!< Test interface synchronizer clock disabled.                        */
  #define USBHS_DFT_TCFG_TESTIFENABLE_Enabled (0x1UL) /*!< Test interface synchronizer clock enabled.                          */


/* USBHS_DFT_TESTADDR: Test data address */
  #define USBHS_DFT_TESTADDR_ResetValue (0x00000000UL) /*!< Reset value of TESTADDR register.                                  */

/* TESTADDR0 @Bits 0..3 : Test Interface Register Address */
  #define USBHS_DFT_TESTADDR_TESTADDR0_Pos (0UL)     /*!< Position of TESTADDR0 field.                                         */
  #define USBHS_DFT_TESTADDR_TESTADDR0_Msk (0xFUL << USBHS_DFT_TESTADDR_TESTADDR0_Pos) /*!< Bit mask of TESTADDR0 field.       */


/* USBHS_DFT_TESTDATAIN: Test data input */
  #define USBHS_DFT_TESTDATAIN_ResetValue (0x00000000UL) /*!< Reset value of TESTDATAIN register.                              */

/* TESTDATAIN0 @Bits 0..7 : Test Data Write Bus */
  #define USBHS_DFT_TESTDATAIN_TESTDATAIN0_Pos (0UL) /*!< Position of TESTDATAIN0 field.                                       */
  #define USBHS_DFT_TESTDATAIN_TESTDATAIN0_Msk (0xFFUL << USBHS_DFT_TESTDATAIN_TESTDATAIN0_Pos) /*!< Bit mask of TESTDATAIN0
                                                                            field.*/                                              


/* USBHS_DFT_TESTDATAOUTSEL: Test data out select */
  #define USBHS_DFT_TESTDATAOUTSEL_ResetValue (0x00000000UL) /*!< Reset value of TESTDATAOUTSEL register.                      */

/* TESTDATAOUTSEL0 @Bit 0 : Determines which signals appear on TESDATAOUT */
  #define USBHS_DFT_TESTDATAOUTSEL_TESTDATAOUTSEL0_Pos (0UL) /*!< Position of TESTDATAOUTSEL0 field.                           */
  #define USBHS_DFT_TESTDATAOUTSEL_TESTDATAOUTSEL0_Msk (0x1UL << USBHS_DFT_TESTDATAOUTSEL_TESTDATAOUTSEL0_Pos) /*!< Bit mask of
                                                                            TESTDATAOUTSEL0 field.*/                              
  #define USBHS_DFT_TESTDATAOUTSEL_TESTDATAOUTSEL0_Min (0x0UL) /*!< Min enumerator value of TESTDATAOUTSEL0 field.             */
  #define USBHS_DFT_TESTDATAOUTSEL_TESTDATAOUTSEL0_Max (0x1UL) /*!< Max enumerator value of TESTDATAOUTSEL0 field.             */
  #define USBHS_DFT_TESTDATAOUTSEL_TESTDATAOUTSEL0_InternalSignal (0x0UL) /*!< Mode-defined, internally generated signals are
                                                                            output*/                                              
  #define USBHS_DFT_TESTDATAOUTSEL_TESTDATAOUTSEL0_TestRegister (0x1UL) /*!< Mode-defined test register contents are output    */


