adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* USBHS_DFT_TESTDATAOUT: Test data output */
  #define USBHS_DFT_TESTDATAOUT_ResetValue (0x00000000UL) /*!< Reset value of TESTDATAOUT register.                            */

/* TESTDATAOUT0 @Bits 0..3 : Test Data Read Bus */
  #define USBHS_DFT_TESTDATAOUT_TESTDATAOUT0_Pos (0UL) /*!< Position of TESTDATAOUT0 field.                                    */
  #define USBHS_DFT_TESTDATAOUT_TESTDATAOUT0_Msk (0xFUL << USBHS_DFT_TESTDATAOUT_TESTDATAOUT0_Pos) /*!< Bit mask of TESTDATAOUT0
                                                                            field.*/                                              


/* USBHS_DFT_TLATCH: Test data latch */
  #define USBHS_DFT_TLATCH_ResetValue (0x00000000UL) /*!< Reset value of TLATCH register.                                      */

/* TESTCLK0 @Bit 0 : PHY uses the positive edge of TESTCLK0 to latch TESTDATAIN[7:0] */
  #define USBHS_DFT_TLATCH_TESTCLK0_Pos (0UL)        /*!< Position of TESTCLK0 field.                                          */
  #define USBHS_DFT_TLATCH_TESTCLK0_Msk (0x1UL << USBHS_DFT_TLATCH_TESTCLK0_Pos) /*!< Bit mask of TESTCLK0 field.              */


/* ====================================================== Struct USBHS ======================================================= */
/**
  * @brief USBHS
  */
  typedef struct {                                   /*!< USBHS Structure                                                      */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start the USB peripheral.                             */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop the USB peripheral                               */
    __IM uint32_t RESERVED[62];
    __IOM uint32_t EVENTS_CORE;                      /*!< (@ 0x00000100) Event indicating that interrupt triggered at USBHS
                                                                         core*/                                                   
    __IM uint32_t RESERVED1[127];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000400) Enable USB peripheral.                                */
    __IOM uint32_t DEBOUNCEFILTER;                   /*!< (@ 0x00000404) Configuration of debounce filters for avalid, bvalid,
                                                                         vbusvalid, sessend and iddig signals*/                   
    __IM uint32_t RESERVED3[14];
    __IOM NRF_USBHS_PHY_Type PHY;                    /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED4[105];
    __IOM NRF_USBHS_DFT_Type DFT;                    /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_USBHS_Type;                                  /*!< Size = 1608 (0x648)                                                  */

/* USBHS_TASKS_START: Start the USB peripheral. */
  #define USBHS_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                */

/* TASKS_START @Bit 0 : Start the USB peripheral. */
  #define USBHS_TASKS_START_TASKS_START_Pos (0UL)    /*!< Position of TASKS_START field.                                       */
  #define USBHS_TASKS_START_TASKS_START_Msk (0x1UL << USBHS_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.   */
  #define USBHS_TASKS_START_TASKS_START_Min (0x1UL)  /*!< Min enumerator value of TASKS_START field.                           */
  #define USBHS_TASKS_START_TASKS_START_Max (0x1UL)  /*!< Max enumerator value of TASKS_START field.                           */
  #define USBHS_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* USBHS_TASKS_STOP: Stop the USB peripheral */
  #define USBHS_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop the USB peripheral */
  #define USBHS_TASKS_STOP_TASKS_STOP_Pos (0UL)      /*!< Position of TASKS_STOP field.                                        */
  #define USBHS_TASKS_STOP_TASKS_STOP_Msk (0x1UL << USBHS_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.        */
  #define USBHS_TASKS_STOP_TASKS_STOP_Min (0x1UL)    /*!< Min enumerator value of TASKS_STOP field.                            */
  #define USBHS_TASKS_STOP_TASKS_STOP_Max (0x1UL)    /*!< Max enumerator value of TASKS_STOP field.                            */
  #define USBHS_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* USBHS_EVENTS_CORE: Event indicating that interrupt triggered at USBHS core */
  #define USBHS_EVENTS_CORE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CORE register.                                */

/* EVENTS_CORE @Bit 0 : Event indicating that interrupt triggered at USBHS core */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Pos (0UL)    /*!< Position of EVENTS_CORE field.                                       */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Msk (0x1UL << USBHS_EVENTS_CORE_EVENTS_CORE_Pos) /*!< Bit mask of EVENTS_CORE field.   */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Min (0x0UL)  /*!< Min enumerator value of EVENTS_CORE field.                           */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Max (0x1UL)  /*!< Max enumerator value of EVENTS_CORE field.                           */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Generated (0x1UL) /*!< Event generated                                                 */


/* USBHS_INTEN: Enable or disable interrupt */
  #define USBHS_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* CORE @Bit 0 : Enable or disable interrupt for event CORE */
  #define USBHS_INTEN_CORE_Pos (0UL)                 /*!< Position of CORE field.                                              */
  #define USBHS_INTEN_CORE_Msk (0x1UL << USBHS_INTEN_CORE_Pos) /*!< Bit mask of CORE field.                                    */
  #define USBHS_INTEN_CORE_Min (0x0UL)               /*!< Min enumerator value of CORE field.                                  */
  #define USBHS_INTEN_CORE_Max (0x1UL)               /*!< Max enumerator value of CORE field.                                  */
  #define USBHS_INTEN_CORE_Disabled (0x0UL)          /*!< Disable                                                              */
  #define USBHS_INTEN_CORE_Enabled (0x1UL)           /*!< Enable                                                               */


/* USBHS_INTENSET: Enable interrupt */
  #define USBHS_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

