adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CORE @Bit 0 : Write '1' to enable interrupt for event CORE */
  #define USBHS_INTENSET_CORE_Pos (0UL)              /*!< Position of CORE field.                                              */
  #define USBHS_INTENSET_CORE_Msk (0x1UL << USBHS_INTENSET_CORE_Pos) /*!< Bit mask of CORE field.                              */
  #define USBHS_INTENSET_CORE_Min (0x0UL)            /*!< Min enumerator value of CORE field.                                  */
  #define USBHS_INTENSET_CORE_Max (0x1UL)            /*!< Max enumerator value of CORE field.                                  */
  #define USBHS_INTENSET_CORE_Set (0x1UL)            /*!< Enable                                                               */
  #define USBHS_INTENSET_CORE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define USBHS_INTENSET_CORE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */


/* USBHS_INTENCLR: Disable interrupt */
  #define USBHS_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* CORE @Bit 0 : Write '1' to disable interrupt for event CORE */
  #define USBHS_INTENCLR_CORE_Pos (0UL)              /*!< Position of CORE field.                                              */
  #define USBHS_INTENCLR_CORE_Msk (0x1UL << USBHS_INTENCLR_CORE_Pos) /*!< Bit mask of CORE field.                              */
  #define USBHS_INTENCLR_CORE_Min (0x0UL)            /*!< Min enumerator value of CORE field.                                  */
  #define USBHS_INTENCLR_CORE_Max (0x1UL)            /*!< Max enumerator value of CORE field.                                  */
  #define USBHS_INTENCLR_CORE_Clear (0x1UL)          /*!< Disable                                                              */
  #define USBHS_INTENCLR_CORE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define USBHS_INTENCLR_CORE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */


/* USBHS_INTPEND: Pending interrupts */
  #define USBHS_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* CORE @Bit 0 : Read pending status of interrupt for event CORE */
  #define USBHS_INTPEND_CORE_Pos (0UL)               /*!< Position of CORE field.                                              */
  #define USBHS_INTPEND_CORE_Msk (0x1UL << USBHS_INTPEND_CORE_Pos) /*!< Bit mask of CORE field.                                */
  #define USBHS_INTPEND_CORE_Min (0x0UL)             /*!< Min enumerator value of CORE field.                                  */
  #define USBHS_INTPEND_CORE_Max (0x1UL)             /*!< Max enumerator value of CORE field.                                  */
  #define USBHS_INTPEND_CORE_NotPending (0x0UL)      /*!< Read: Not pending                                                    */
  #define USBHS_INTPEND_CORE_Pending (0x1UL)         /*!< Read: Pending                                                        */


/* USBHS_ENABLE: Enable USB peripheral. */
  #define USBHS_ENABLE_ResetValue (0x00000000UL)     /*!< Reset value of ENABLE register.                                      */

/* CORE @Bit 0 : Enable USB Controller */
  #define USBHS_ENABLE_CORE_Pos (0UL)                /*!< Position of CORE field.                                              */
  #define USBHS_ENABLE_CORE_Msk (0x1UL << USBHS_ENABLE_CORE_Pos) /*!< Bit mask of CORE field.                                  */
  #define USBHS_ENABLE_CORE_Min (0x0UL)              /*!< Min enumerator value of CORE field.                                  */
  #define USBHS_ENABLE_CORE_Max (0x1UL)              /*!< Max enumerator value of CORE field.                                  */
  #define USBHS_ENABLE_CORE_Disabled (0x0UL)         /*!< USB Controller disabled.                                             */
  #define USBHS_ENABLE_CORE_Enabled (0x1UL)          /*!< USB Controller enabled.                                              */

/* PHY @Bit 1 : Enable USB PHY */
  #define USBHS_ENABLE_PHY_Pos (1UL)                 /*!< Position of PHY field.                                               */
  #define USBHS_ENABLE_PHY_Msk (0x1UL << USBHS_ENABLE_PHY_Pos) /*!< Bit mask of PHY field.                                     */
  #define USBHS_ENABLE_PHY_Min (0x0UL)               /*!< Min enumerator value of PHY field.                                   */
  #define USBHS_ENABLE_PHY_Max (0x1UL)               /*!< Max enumerator value of PHY field.                                   */
  #define USBHS_ENABLE_PHY_Disabled (0x0UL)          /*!< USB PHY disabled.                                                    */
  #define USBHS_ENABLE_PHY_Enabled (0x1UL)           /*!< USB PHY enabled.                                                     */


/* USBHS_DEBOUNCEFILTER: Configuration of debounce filters for avalid, bvalid, vbusvalid, sessend and iddig signals */
  #define USBHS_DEBOUNCEFILTER_ResetValue (0x00000000UL) /*!< Reset value of DEBOUNCEFILTER register.                          */

/* BYPASS @Bit 0 : Bypass debounce filters */
  #define USBHS_DEBOUNCEFILTER_BYPASS_Pos (0UL)      /*!< Position of BYPASS field.                                            */
  #define USBHS_DEBOUNCEFILTER_BYPASS_Msk (0x1UL << USBHS_DEBOUNCEFILTER_BYPASS_Pos) /*!< Bit mask of BYPASS field.            */
  #define USBHS_DEBOUNCEFILTER_BYPASS_Min (0x0UL)    /*!< Min enumerator value of BYPASS field.                                */
  #define USBHS_DEBOUNCEFILTER_BYPASS_Max (0x1UL)    /*!< Max enumerator value of BYPASS field.                                */
  #define USBHS_DEBOUNCEFILTER_BYPASS_Disabled (0x0UL) /*!< Bypass disabled.                                                   */
  #define USBHS_DEBOUNCEFILTER_BYPASS_Enabled (0x1UL) /*!< Bypass enabled.                                                     */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         USBHSCORE                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

