adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* =================================================== Struct USBHSCORE_HC =================================================== */
/**
  * @brief HC [USBHSCORE_HC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CHAR;                              /*!< (@ 0x00000000) Host Channel n Characteristics Register               */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  INT;                               /*!< (@ 0x00000008) Host Channel n Interrupt Register                     */
  __IOM uint32_t  INTMSK;                            /*!< (@ 0x0000000C) Host Channel n Interrupt Mask Register                */
  __IOM uint32_t  TSIZ;                              /*!< (@ 0x00000010) Host Channel n Transfer Size Register                 */
  __IOM uint32_t  DMA;                               /*!< (@ 0x00000014) Host Channel n DMA Address Register                   */
  __IM  uint32_t  RESERVED1[2];
} NRF_USBHSCORE_HC_Type;                             /*!< Size = 32 (0x020)                                                    */
  #define USBHSCORE_HC_MaxCount (16UL)               /*!< Max size of HC[16] array.                                            */

/* USBHSCORE_HC_CHAR: Host Channel n Characteristics Register */
  #define USBHSCORE_HC_CHAR_ResetValue (0x00000000UL) /*!< Reset value of CHAR register.                                       */

/* MPS @Bits 0..10 : Maximum Packet Size (MPS) */
  #define USBHSCORE_HC_CHAR_MPS_Pos (0UL)            /*!< Position of MPS field.                                               */
  #define USBHSCORE_HC_CHAR_MPS_Msk (0x7FFUL << USBHSCORE_HC_CHAR_MPS_Pos) /*!< Bit mask of MPS field.                         */

/* EPNUM @Bits 11..14 : Endpoint Number (EPNum) */
  #define USBHSCORE_HC_CHAR_EPNUM_Pos (11UL)         /*!< Position of EPNUM field.                                             */
  #define USBHSCORE_HC_CHAR_EPNUM_Msk (0xFUL << USBHSCORE_HC_CHAR_EPNUM_Pos) /*!< Bit mask of EPNUM field.                     */
  #define USBHSCORE_HC_CHAR_EPNUM_Min (0x0UL)        /*!< Min enumerator value of EPNUM field.                                 */
  #define USBHSCORE_HC_CHAR_EPNUM_Max (0xFUL)        /*!< Max enumerator value of EPNUM field.                                 */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT0 (0x0UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT1 (0x1UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT2 (0x2UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT3 (0x3UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT4 (0x4UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT5 (0x5UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT6 (0x6UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT7 (0x7UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT8 (0x8UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT9 (0x9UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT10 (0xAUL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT11 (0xBUL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT12 (0xCUL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT13 (0xDUL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT14 (0xEUL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT15 (0xFUL)    /*!< (unspecified)                                                        */

/* EPDIR @Bit 15 : Endpoint Direction (EPDir) */
  #define USBHSCORE_HC_CHAR_EPDIR_Pos (15UL)         /*!< Position of EPDIR field.                                             */
  #define USBHSCORE_HC_CHAR_EPDIR_Msk (0x1UL << USBHSCORE_HC_CHAR_EPDIR_Pos) /*!< Bit mask of EPDIR field.                     */
  #define USBHSCORE_HC_CHAR_EPDIR_Min (0x0UL)        /*!< Min enumerator value of EPDIR field.                                 */
  #define USBHSCORE_HC_CHAR_EPDIR_Max (0x1UL)        /*!< Max enumerator value of EPDIR field.                                 */
  #define USBHSCORE_HC_CHAR_EPDIR_OUT (0x0UL)        /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPDIR_IN (0x1UL)         /*!< (unspecified)                                                        */

/* LSPDDEV @Bit 17 : Low-Speed Device (LSpdDev) */
  #define USBHSCORE_HC_CHAR_LSPDDEV_Pos (17UL)       /*!< Position of LSPDDEV field.                                           */
  #define USBHSCORE_HC_CHAR_LSPDDEV_Msk (0x1UL << USBHSCORE_HC_CHAR_LSPDDEV_Pos) /*!< Bit mask of LSPDDEV field.               */
  #define USBHSCORE_HC_CHAR_LSPDDEV_Min (0x0UL)      /*!< Min enumerator value of LSPDDEV field.                               */
  #define USBHSCORE_HC_CHAR_LSPDDEV_Max (0x1UL)      /*!< Max enumerator value of LSPDDEV field.                               */
  #define USBHSCORE_HC_CHAR_LSPDDEV_DISABLED (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_LSPDDEV_ENABLED (0x1UL)  /*!< (unspecified)                                                        */

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_HC_CHAR_EPTYPE_Pos (18UL)        /*!< Position of EPTYPE field.                                            */
  #define USBHSCORE_HC_CHAR_EPTYPE_Msk (0x3UL << USBHSCORE_HC_CHAR_EPTYPE_Pos) /*!< Bit mask of EPTYPE field.                  */
  #define USBHSCORE_HC_CHAR_EPTYPE_Min (0x0UL)       /*!< Min enumerator value of EPTYPE field.                                */
  #define USBHSCORE_HC_CHAR_EPTYPE_Max (0x3UL)       /*!< Max enumerator value of EPTYPE field.                                */
  #define USBHSCORE_HC_CHAR_EPTYPE_CTRL (0x0UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPTYPE_ISOC (0x1UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPTYPE_BULK (0x2UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EPTYPE_INTERR (0x3UL)    /*!< (unspecified)                                                        */

/* EC @Bits 20..21 : Multi Count (MC) / Error Count (EC) */
  #define USBHSCORE_HC_CHAR_EC_Pos (20UL)            /*!< Position of EC field.                                                */
  #define USBHSCORE_HC_CHAR_EC_Msk (0x3UL << USBHSCORE_HC_CHAR_EC_Pos) /*!< Bit mask of EC field.                              */
  #define USBHSCORE_HC_CHAR_EC_Min (0x1UL)           /*!< Min enumerator value of EC field.                                    */
  #define USBHSCORE_HC_CHAR_EC_Max (0x3UL)           /*!< Max enumerator value of EC field.                                    */
  #define USBHSCORE_HC_CHAR_EC_TRANSONE (0x1UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EC_TRANSTWO (0x2UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_EC_TRANSTHREE (0x3UL)    /*!< (unspecified)                                                        */

/* DEVADDR @Bits 22..28 : Device Address (DevAddr) */
  #define USBHSCORE_HC_CHAR_DEVADDR_Pos (22UL)       /*!< Position of DEVADDR field.                                           */
  #define USBHSCORE_HC_CHAR_DEVADDR_Msk (0x7FUL << USBHSCORE_HC_CHAR_DEVADDR_Pos) /*!< Bit mask of DEVADDR field.              */

/* ODDFRM @Bit 29 : Odd Frame (OddFrm) */
  #define USBHSCORE_HC_CHAR_ODDFRM_Pos (29UL)        /*!< Position of ODDFRM field.                                            */
  #define USBHSCORE_HC_CHAR_ODDFRM_Msk (0x1UL << USBHSCORE_HC_CHAR_ODDFRM_Pos) /*!< Bit mask of ODDFRM field.                  */
  #define USBHSCORE_HC_CHAR_ODDFRM_Min (0x0UL)       /*!< Min enumerator value of ODDFRM field.                                */
  #define USBHSCORE_HC_CHAR_ODDFRM_Max (0x1UL)       /*!< Max enumerator value of ODDFRM field.                                */
  #define USBHSCORE_HC_CHAR_ODDFRM_EFRAME (0x0UL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_ODDFRM_OFRAME (0x1UL)    /*!< (unspecified)                                                        */

/* CHDIS @Bit 30 : Channel Disable (ChDis) */
  #define USBHSCORE_HC_CHAR_CHDIS_Pos (30UL)         /*!< Position of CHDIS field.                                             */
  #define USBHSCORE_HC_CHAR_CHDIS_Msk (0x1UL << USBHSCORE_HC_CHAR_CHDIS_Pos) /*!< Bit mask of CHDIS field.                     */
  #define USBHSCORE_HC_CHAR_CHDIS_Min (0x0UL)        /*!< Min enumerator value of CHDIS field.                                 */
  #define USBHSCORE_HC_CHAR_CHDIS_Max (0x1UL)        /*!< Max enumerator value of CHDIS field.                                 */
  #define USBHSCORE_HC_CHAR_CHDIS_INACTIVE (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_CHDIS_ACTIVE (0x1UL)     /*!< (unspecified)                                                        */

/* CHENA @Bit 31 : Channel Enable (ChEna) */
  #define USBHSCORE_HC_CHAR_CHENA_Pos (31UL)         /*!< Position of CHENA field.                                             */
  #define USBHSCORE_HC_CHAR_CHENA_Msk (0x1UL << USBHSCORE_HC_CHAR_CHENA_Pos) /*!< Bit mask of CHENA field.                     */
  #define USBHSCORE_HC_CHAR_CHENA_Min (0x0UL)        /*!< Min enumerator value of CHENA field.                                 */
  #define USBHSCORE_HC_CHAR_CHENA_Max (0x1UL)        /*!< Max enumerator value of CHENA field.                                 */
  #define USBHSCORE_HC_CHAR_CHENA_DISABLED (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_CHAR_CHENA_ENABLED (0x1UL)    /*!< (unspecified)                                                        */


/* USBHSCORE_HC_INT: Host Channel n Interrupt Register */
  #define USBHSCORE_HC_INT_ResetValue (0x00000000UL) /*!< Reset value of INT register.                                         */

/* XFERCOMPL @Bit 0 : Transfer Completed (XferCompl) */
  #define USBHSCORE_HC_INT_XFERCOMPL_Pos (0UL)       /*!< Position of XFERCOMPL field.                                         */
  #define USBHSCORE_HC_INT_XFERCOMPL_Msk (0x1UL << USBHSCORE_HC_INT_XFERCOMPL_Pos) /*!< Bit mask of XFERCOMPL field.           */
  #define USBHSCORE_HC_INT_XFERCOMPL_Min (0x0UL)     /*!< Min enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_HC_INT_XFERCOMPL_Max (0x1UL)     /*!< Max enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_HC_INT_XFERCOMPL_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_HC_INT_XFERCOMPL_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* CHHLTD @Bit 1 : Channel Halted (ChHltd) */
  #define USBHSCORE_HC_INT_CHHLTD_Pos (1UL)          /*!< Position of CHHLTD field.                                            */
  #define USBHSCORE_HC_INT_CHHLTD_Msk (0x1UL << USBHSCORE_HC_INT_CHHLTD_Pos) /*!< Bit mask of CHHLTD field.                    */
  #define USBHSCORE_HC_INT_CHHLTD_Min (0x0UL)        /*!< Min enumerator value of CHHLTD field.                                */
  #define USBHSCORE_HC_INT_CHHLTD_Max (0x1UL)        /*!< Max enumerator value of CHHLTD field.                                */
  #define USBHSCORE_HC_INT_CHHLTD_INACTIVE (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_INT_CHHLTD_ACTIVE (0x1UL)     /*!< (unspecified)                                                        */

/* AHBERR @Bit 2 : AHB Error (AHBErr) */
  #define USBHSCORE_HC_INT_AHBERR_Pos (2UL)          /*!< Position of AHBERR field.                                            */
  #define USBHSCORE_HC_INT_AHBERR_Msk (0x1UL << USBHSCORE_HC_INT_AHBERR_Pos) /*!< Bit mask of AHBERR field.                    */
  #define USBHSCORE_HC_INT_AHBERR_Min (0x0UL)        /*!< Min enumerator value of AHBERR field.                                */
  #define USBHSCORE_HC_INT_AHBERR_Max (0x1UL)        /*!< Max enumerator value of AHBERR field.                                */
  #define USBHSCORE_HC_INT_AHBERR_INACTIVE (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_INT_AHBERR_ACTIVE (0x1UL)     /*!< (unspecified)                                                        */

/* STALL @Bit 3 : STALL Response Received Interrupt (STALL) */
  #define USBHSCORE_HC_INT_STALL_Pos (3UL)           /*!< Position of STALL field.                                             */
  #define USBHSCORE_HC_INT_STALL_Msk (0x1UL << USBHSCORE_HC_INT_STALL_Pos) /*!< Bit mask of STALL field.                       */
  #define USBHSCORE_HC_INT_STALL_Min (0x0UL)         /*!< Min enumerator value of STALL field.                                 */
  #define USBHSCORE_HC_INT_STALL_Max (0x1UL)         /*!< Max enumerator value of STALL field.                                 */
  #define USBHSCORE_HC_INT_STALL_INACTIVE (0x0UL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_INT_STALL_ACTIVE (0x1UL)      /*!< (unspecified)                                                        */

