adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DMAEN @Bit 5 : Mode: Host and device. DMA Enable (DMAEn) */
  #define USBHSCORE_GAHBCFG_DMAEN_Pos (5UL)          /*!< Position of DMAEN field.                                             */
  #define USBHSCORE_GAHBCFG_DMAEN_Msk (0x1UL << USBHSCORE_GAHBCFG_DMAEN_Pos) /*!< Bit mask of DMAEN field.                     */
  #define USBHSCORE_GAHBCFG_DMAEN_Min (0x0UL)        /*!< Min enumerator value of DMAEN field.                                 */
  #define USBHSCORE_GAHBCFG_DMAEN_Max (0x1UL)        /*!< Max enumerator value of DMAEN field.                                 */
  #define USBHSCORE_GAHBCFG_DMAEN_SLAVEMODE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_GAHBCFG_DMAEN_DMAMODE (0x1UL)    /*!< (unspecified)                                                        */

/* NPTXFEMPLVL @Bit 7 : Mode: Host and device. Non-Periodic TxFIFO Empty Level (NPTxFEmpLvl) */
  #define USBHSCORE_GAHBCFG_NPTXFEMPLVL_Pos (7UL)    /*!< Position of NPTXFEMPLVL field.                                       */
  #define USBHSCORE_GAHBCFG_NPTXFEMPLVL_Msk (0x1UL << USBHSCORE_GAHBCFG_NPTXFEMPLVL_Pos) /*!< Bit mask of NPTXFEMPLVL field.   */
  #define USBHSCORE_GAHBCFG_NPTXFEMPLVL_Min (0x0UL)  /*!< Min enumerator value of NPTXFEMPLVL field.                           */
  #define USBHSCORE_GAHBCFG_NPTXFEMPLVL_Max (0x1UL)  /*!< Max enumerator value of NPTXFEMPLVL field.                           */
  #define USBHSCORE_GAHBCFG_NPTXFEMPLVL_HALFEMPTY (0x0UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_GAHBCFG_NPTXFEMPLVL_EMPTY (0x1UL) /*!< (unspecified)                                                       */

/* REMMEMSUPP @Bit 21 : Mode: Host and Device. Remote Memory Support (RemMemSupp) */
  #define USBHSCORE_GAHBCFG_REMMEMSUPP_Pos (21UL)    /*!< Position of REMMEMSUPP field.                                        */
  #define USBHSCORE_GAHBCFG_REMMEMSUPP_Msk (0x1UL << USBHSCORE_GAHBCFG_REMMEMSUPP_Pos) /*!< Bit mask of REMMEMSUPP field.      */
  #define USBHSCORE_GAHBCFG_REMMEMSUPP_Min (0x0UL)   /*!< Min enumerator value of REMMEMSUPP field.                            */
  #define USBHSCORE_GAHBCFG_REMMEMSUPP_Max (0x1UL)   /*!< Max enumerator value of REMMEMSUPP field.                            */
  #define USBHSCORE_GAHBCFG_REMMEMSUPP_DISABLED (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_GAHBCFG_REMMEMSUPP_ENABLED (0x1UL) /*!< (unspecified)                                                      */

/* NOTIALLDMAWRIT @Bit 22 : Mode: Host and Device. Notify All DMA Write Transactions (NotiAllDmaWrit) */
  #define USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_Pos (22UL) /*!< Position of NOTIALLDMAWRIT field.                                   */
  #define USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_Msk (0x1UL << USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_Pos) /*!< Bit mask of NOTIALLDMAWRIT
                                                                            field.*/                                              
  #define USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_Min (0x0UL) /*!< Min enumerator value of NOTIALLDMAWRIT field.                      */
  #define USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_Max (0x1UL) /*!< Max enumerator value of NOTIALLDMAWRIT field.                      */
  #define USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_LASTTRANS (0x0UL) /*!< (unspecified)                                                */
  #define USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_ALLTRANS (0x1UL) /*!< (unspecified)                                                 */

/* AHBSINGLE @Bit 23 : Mode: Host and Device. AHB Single Support (AHBSingle) */
  #define USBHSCORE_GAHBCFG_AHBSINGLE_Pos (23UL)     /*!< Position of AHBSINGLE field.                                         */
  #define USBHSCORE_GAHBCFG_AHBSINGLE_Msk (0x1UL << USBHSCORE_GAHBCFG_AHBSINGLE_Pos) /*!< Bit mask of AHBSINGLE field.         */
  #define USBHSCORE_GAHBCFG_AHBSINGLE_Min (0x0UL)    /*!< Min enumerator value of AHBSINGLE field.                             */
  #define USBHSCORE_GAHBCFG_AHBSINGLE_Max (0x1UL)    /*!< Max enumerator value of AHBSINGLE field.                             */
  #define USBHSCORE_GAHBCFG_AHBSINGLE_INCRBURST (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_GAHBCFG_AHBSINGLE_SINGLEBURST (0x1UL) /*!< (unspecified)                                                   */


/* USBHSCORE_GUSBCFG: USB Configuration Register */
  #define USBHSCORE_GUSBCFG_ResetValue (0x00001400UL) /*!< Reset value of GUSBCFG register.                                    */

/* TOUTCAL @Bits 0..2 : Mode: Host and Device. HS/FS Timeout Calibration (TOutCal) */
  #define USBHSCORE_GUSBCFG_TOUTCAL_Pos (0UL)        /*!< Position of TOUTCAL field.                                           */
  #define USBHSCORE_GUSBCFG_TOUTCAL_Msk (0x7UL << USBHSCORE_GUSBCFG_TOUTCAL_Pos) /*!< Bit mask of TOUTCAL field.               */

/* PHYIF @Bit 3 : Mode: Host and Device. PHY Interface (PHYIf) */
  #define USBHSCORE_GUSBCFG_PHYIF_Pos (3UL)          /*!< Position of PHYIF field.                                             */
  #define USBHSCORE_GUSBCFG_PHYIF_Msk (0x1UL << USBHSCORE_GUSBCFG_PHYIF_Pos) /*!< Bit mask of PHYIF field.                     */
  #define USBHSCORE_GUSBCFG_PHYIF_Min (0x0UL)        /*!< Min enumerator value of PHYIF field.                                 */
  #define USBHSCORE_GUSBCFG_PHYIF_Max (0x1UL)        /*!< Max enumerator value of PHYIF field.                                 */
  #define USBHSCORE_GUSBCFG_PHYIF_BITS8 (0x0UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GUSBCFG_PHYIF_BITS16 (0x1UL)     /*!< (unspecified)                                                        */

/* ULPIUTMISEL @Bit 4 : Mode: Host and Device. ULPI or UTMI+ Select (ULPI_UTMI_Sel) */
  #define USBHSCORE_GUSBCFG_ULPIUTMISEL_Pos (4UL)    /*!< Position of ULPIUTMISEL field.                                       */
  #define USBHSCORE_GUSBCFG_ULPIUTMISEL_Msk (0x1UL << USBHSCORE_GUSBCFG_ULPIUTMISEL_Pos) /*!< Bit mask of ULPIUTMISEL field.   */
  #define USBHSCORE_GUSBCFG_ULPIUTMISEL_Min (0x0UL)  /*!< Min enumerator value of ULPIUTMISEL field.                           */
  #define USBHSCORE_GUSBCFG_ULPIUTMISEL_Max (0x1UL)  /*!< Max enumerator value of ULPIUTMISEL field.                           */
  #define USBHSCORE_GUSBCFG_ULPIUTMISEL_UTMI (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GUSBCFG_ULPIUTMISEL_ULPI (0x1UL) /*!< (unspecified)                                                        */

