adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CSFTRST @Bit 0 : Mode: Host and Device. Core Soft Reset (CSftRst) */
  #define USBHSCORE_GRSTCTL_CSFTRST_Pos (0UL)        /*!< Position of CSFTRST field.                                           */
  #define USBHSCORE_GRSTCTL_CSFTRST_Msk (0x1UL << USBHSCORE_GRSTCTL_CSFTRST_Pos) /*!< Bit mask of CSFTRST field.               */
  #define USBHSCORE_GRSTCTL_CSFTRST_Min (0x0UL)      /*!< Min enumerator value of CSFTRST field.                               */
  #define USBHSCORE_GRSTCTL_CSFTRST_Max (0x1UL)      /*!< Max enumerator value of CSFTRST field.                               */
  #define USBHSCORE_GRSTCTL_CSFTRST_NOTACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_GRSTCTL_CSFTRST_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* PIUFSSFTRST @Bit 1 : Mode: Host and Device. PIU FS Dedicated Controller Soft Reset (PIUFSSftRst) */
  #define USBHSCORE_GRSTCTL_PIUFSSFTRST_Pos (1UL)    /*!< Position of PIUFSSFTRST field.                                       */
  #define USBHSCORE_GRSTCTL_PIUFSSFTRST_Msk (0x1UL << USBHSCORE_GRSTCTL_PIUFSSFTRST_Pos) /*!< Bit mask of PIUFSSFTRST field.   */
  #define USBHSCORE_GRSTCTL_PIUFSSFTRST_Min (0x0UL)  /*!< Min enumerator value of PIUFSSFTRST field.                           */
  #define USBHSCORE_GRSTCTL_PIUFSSFTRST_Max (0x1UL)  /*!< Max enumerator value of PIUFSSFTRST field.                           */
  #define USBHSCORE_GRSTCTL_PIUFSSFTRST_RESET_INACTIVE (0x0UL) /*!< (unspecified)                                              */
  #define USBHSCORE_GRSTCTL_PIUFSSFTRST_RESET_ACTIVE (0x1UL) /*!< (unspecified)                                                */

/* FRMCNTRRST @Bit 2 : Mode: Host only. Host Frame Counter Reset (FrmCntrRst) */
  #define USBHSCORE_GRSTCTL_FRMCNTRRST_Pos (2UL)     /*!< Position of FRMCNTRRST field.                                        */
  #define USBHSCORE_GRSTCTL_FRMCNTRRST_Msk (0x1UL << USBHSCORE_GRSTCTL_FRMCNTRRST_Pos) /*!< Bit mask of FRMCNTRRST field.      */
  #define USBHSCORE_GRSTCTL_FRMCNTRRST_Min (0x0UL)   /*!< Min enumerator value of FRMCNTRRST field.                            */
  #define USBHSCORE_GRSTCTL_FRMCNTRRST_Max (0x1UL)   /*!< Max enumerator value of FRMCNTRRST field.                            */
  #define USBHSCORE_GRSTCTL_FRMCNTRRST_NOTACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_GRSTCTL_FRMCNTRRST_ACTIVE (0x1UL) /*!< (unspecified)                                                       */

/* RXFFLSH @Bit 4 : Mode: Host and Device. RxFIFO Flush (RxFFlsh) */
  #define USBHSCORE_GRSTCTL_RXFFLSH_Pos (4UL)        /*!< Position of RXFFLSH field.                                           */
  #define USBHSCORE_GRSTCTL_RXFFLSH_Msk (0x1UL << USBHSCORE_GRSTCTL_RXFFLSH_Pos) /*!< Bit mask of RXFFLSH field.               */
  #define USBHSCORE_GRSTCTL_RXFFLSH_Min (0x0UL)      /*!< Min enumerator value of RXFFLSH field.                               */
  #define USBHSCORE_GRSTCTL_RXFFLSH_Max (0x1UL)      /*!< Max enumerator value of RXFFLSH field.                               */
  #define USBHSCORE_GRSTCTL_RXFFLSH_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_RXFFLSH_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* TXFFLSH @Bit 5 : Mode: Host and Device. TxFIFO Flush (TxFFlsh) */
  #define USBHSCORE_GRSTCTL_TXFFLSH_Pos (5UL)        /*!< Position of TXFFLSH field.                                           */
  #define USBHSCORE_GRSTCTL_TXFFLSH_Msk (0x1UL << USBHSCORE_GRSTCTL_TXFFLSH_Pos) /*!< Bit mask of TXFFLSH field.               */
  #define USBHSCORE_GRSTCTL_TXFFLSH_Min (0x0UL)      /*!< Min enumerator value of TXFFLSH field.                               */
  #define USBHSCORE_GRSTCTL_TXFFLSH_Max (0x1UL)      /*!< Max enumerator value of TXFFLSH field.                               */
  #define USBHSCORE_GRSTCTL_TXFFLSH_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_TXFFLSH_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* TXFNUM @Bits 6..10 : Mode: Host and Device. TxFIFO Number (TxFNum) */
  #define USBHSCORE_GRSTCTL_TXFNUM_Pos (6UL)         /*!< Position of TXFNUM field.                                            */
  #define USBHSCORE_GRSTCTL_TXFNUM_Msk (0x1FUL << USBHSCORE_GRSTCTL_TXFNUM_Pos) /*!< Bit mask of TXFNUM field.                 */
  #define USBHSCORE_GRSTCTL_TXFNUM_Min (0x0UL)       /*!< Min enumerator value of TXFNUM field.                                */
  #define USBHSCORE_GRSTCTL_TXFNUM_Max (0x10UL)      /*!< Max enumerator value of TXFNUM field.                                */
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF0 (0x00UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF1 (0x01UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF2 (0x02UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF3 (0x03UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF4 (0x04UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF5 (0x05UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF6 (0x06UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF7 (0x07UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF8 (0x08UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF9 (0x09UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF10 (0x0AUL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF11 (0x0BUL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF12 (0x0CUL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF13 (0x0DUL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF14 (0x0EUL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF15 (0x0FUL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF16 (0x10UL)    /*!< (unspecified)                                                        */

