adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* CSFTRSTDONE @Bit 29 : Mode: Host and Device */
  #define USBHSCORE_GRSTCTL_CSFTRSTDONE_Pos (29UL)   /*!< Position of CSFTRSTDONE field.                                       */
  #define USBHSCORE_GRSTCTL_CSFTRSTDONE_Msk (0x1UL << USBHSCORE_GRSTCTL_CSFTRSTDONE_Pos) /*!< Bit mask of CSFTRSTDONE field.   */
  #define USBHSCORE_GRSTCTL_CSFTRSTDONE_Min (0x0UL)  /*!< Min enumerator value of CSFTRSTDONE field.                           */
  #define USBHSCORE_GRSTCTL_CSFTRSTDONE_Max (0x1UL)  /*!< Max enumerator value of CSFTRSTDONE field.                           */
  #define USBHSCORE_GRSTCTL_CSFTRSTDONE_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_GRSTCTL_CSFTRSTDONE_ACTIVE (0x1UL) /*!< (unspecified)                                                      */

/* DMAREQ @Bit 30 : Mode: Host and Device. DMA Request Signal (DMAReq) */
  #define USBHSCORE_GRSTCTL_DMAREQ_Pos (30UL)        /*!< Position of DMAREQ field.                                            */
  #define USBHSCORE_GRSTCTL_DMAREQ_Msk (0x1UL << USBHSCORE_GRSTCTL_DMAREQ_Pos) /*!< Bit mask of DMAREQ field.                  */
  #define USBHSCORE_GRSTCTL_DMAREQ_Min (0x0UL)       /*!< Min enumerator value of DMAREQ field.                                */
  #define USBHSCORE_GRSTCTL_DMAREQ_Max (0x1UL)       /*!< Max enumerator value of DMAREQ field.                                */
  #define USBHSCORE_GRSTCTL_DMAREQ_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_DMAREQ_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* AHBIDLE @Bit 31 : Mode: Host and Device. AHB Master Idle (AHBIdle) */
  #define USBHSCORE_GRSTCTL_AHBIDLE_Pos (31UL)       /*!< Position of AHBIDLE field.                                           */
  #define USBHSCORE_GRSTCTL_AHBIDLE_Msk (0x1UL << USBHSCORE_GRSTCTL_AHBIDLE_Pos) /*!< Bit mask of AHBIDLE field.               */
  #define USBHSCORE_GRSTCTL_AHBIDLE_Min (0x0UL)      /*!< Min enumerator value of AHBIDLE field.                               */
  #define USBHSCORE_GRSTCTL_AHBIDLE_Max (0x1UL)      /*!< Max enumerator value of AHBIDLE field.                               */
  #define USBHSCORE_GRSTCTL_AHBIDLE_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GRSTCTL_AHBIDLE_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */


/* USBHSCORE_GINTSTS: Interrupt Register */
  #define USBHSCORE_GINTSTS_ResetValue (0x00000020UL) /*!< Reset value of GINTSTS register.                                    */

/* CURMOD @Bit 0 : Mode: Host and Device. Current Mode of Operation (CurMod) */
  #define USBHSCORE_GINTSTS_CURMOD_Pos (0UL)         /*!< Position of CURMOD field.                                            */
  #define USBHSCORE_GINTSTS_CURMOD_Msk (0x1UL << USBHSCORE_GINTSTS_CURMOD_Pos) /*!< Bit mask of CURMOD field.                  */
  #define USBHSCORE_GINTSTS_CURMOD_Min (0x0UL)       /*!< Min enumerator value of CURMOD field.                                */
  #define USBHSCORE_GINTSTS_CURMOD_Max (0x1UL)       /*!< Max enumerator value of CURMOD field.                                */
  #define USBHSCORE_GINTSTS_CURMOD_DEVICE (0x0UL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTSTS_CURMOD_HOST (0x1UL)      /*!< (unspecified)                                                        */

/* MODEMIS @Bit 1 : Mode: Host and Device. Mode Mismatch Interrupt (ModeMis) */
  #define USBHSCORE_GINTSTS_MODEMIS_Pos (1UL)        /*!< Position of MODEMIS field.                                           */
  #define USBHSCORE_GINTSTS_MODEMIS_Msk (0x1UL << USBHSCORE_GINTSTS_MODEMIS_Pos) /*!< Bit mask of MODEMIS field.               */
  #define USBHSCORE_GINTSTS_MODEMIS_Min (0x0UL)      /*!< Min enumerator value of MODEMIS field.                               */
  #define USBHSCORE_GINTSTS_MODEMIS_Max (0x1UL)      /*!< Max enumerator value of MODEMIS field.                               */
  #define USBHSCORE_GINTSTS_MODEMIS_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTSTS_MODEMIS_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* OTGINT @Bit 2 : Mode: Host and Device. OTG Interrupt (OTGInt) */
  #define USBHSCORE_GINTSTS_OTGINT_Pos (2UL)         /*!< Position of OTGINT field.                                            */
  #define USBHSCORE_GINTSTS_OTGINT_Msk (0x1UL << USBHSCORE_GINTSTS_OTGINT_Pos) /*!< Bit mask of OTGINT field.                  */
  #define USBHSCORE_GINTSTS_OTGINT_Min (0x0UL)       /*!< Min enumerator value of OTGINT field.                                */
  #define USBHSCORE_GINTSTS_OTGINT_Max (0x1UL)       /*!< Max enumerator value of OTGINT field.                                */
  #define USBHSCORE_GINTSTS_OTGINT_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTSTS_OTGINT_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* SOF @Bit 3 : Mode: Host and Device. Start of (micro)Frame (Sof) */
  #define USBHSCORE_GINTSTS_SOF_Pos (3UL)            /*!< Position of SOF field.                                               */
  #define USBHSCORE_GINTSTS_SOF_Msk (0x1UL << USBHSCORE_GINTSTS_SOF_Pos) /*!< Bit mask of SOF field.                           */
  #define USBHSCORE_GINTSTS_SOF_Min (0x0UL)          /*!< Min enumerator value of SOF field.                                   */
  #define USBHSCORE_GINTSTS_SOF_Max (0x1UL)          /*!< Max enumerator value of SOF field.                                   */
  #define USBHSCORE_GINTSTS_SOF_INTACTIVE (0x0UL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTSTS_SOF_ACTIVE (0x1UL)       /*!< (unspecified)                                                        */

/* RXFLVL @Bit 4 : Mode: Host and Device. RxFIFO Non-Empty (RxFLvl) */
  #define USBHSCORE_GINTSTS_RXFLVL_Pos (4UL)         /*!< Position of RXFLVL field.                                            */
  #define USBHSCORE_GINTSTS_RXFLVL_Msk (0x1UL << USBHSCORE_GINTSTS_RXFLVL_Pos) /*!< Bit mask of RXFLVL field.                  */
  #define USBHSCORE_GINTSTS_RXFLVL_Min (0x0UL)       /*!< Min enumerator value of RXFLVL field.                                */
  #define USBHSCORE_GINTSTS_RXFLVL_Max (0x1UL)       /*!< Max enumerator value of RXFLVL field.                                */
  #define USBHSCORE_GINTSTS_RXFLVL_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTSTS_RXFLVL_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

