adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PRTINT @Bit 24 : Mode: Host only. Host Port Interrupt (PrtInt) */
  #define USBHSCORE_GINTSTS_PRTINT_Pos (24UL)        /*!< Position of PRTINT field.                                            */
  #define USBHSCORE_GINTSTS_PRTINT_Msk (0x1UL << USBHSCORE_GINTSTS_PRTINT_Pos) /*!< Bit mask of PRTINT field.                  */
  #define USBHSCORE_GINTSTS_PRTINT_Min (0x0UL)       /*!< Min enumerator value of PRTINT field.                                */
  #define USBHSCORE_GINTSTS_PRTINT_Max (0x1UL)       /*!< Max enumerator value of PRTINT field.                                */
  #define USBHSCORE_GINTSTS_PRTINT_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTSTS_PRTINT_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* HCHINT @Bit 25 : Mode: Host only. Host Channels Interrupt (HChInt) */
  #define USBHSCORE_GINTSTS_HCHINT_Pos (25UL)        /*!< Position of HCHINT field.                                            */
  #define USBHSCORE_GINTSTS_HCHINT_Msk (0x1UL << USBHSCORE_GINTSTS_HCHINT_Pos) /*!< Bit mask of HCHINT field.                  */
  #define USBHSCORE_GINTSTS_HCHINT_Min (0x0UL)       /*!< Min enumerator value of HCHINT field.                                */
  #define USBHSCORE_GINTSTS_HCHINT_Max (0x1UL)       /*!< Max enumerator value of HCHINT field.                                */
  #define USBHSCORE_GINTSTS_HCHINT_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTSTS_HCHINT_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* LPMINT @Bit 27 : Mode: Host and Device */
  #define USBHSCORE_GINTSTS_LPMINT_Pos (27UL)        /*!< Position of LPMINT field.                                            */
  #define USBHSCORE_GINTSTS_LPMINT_Msk (0x1UL << USBHSCORE_GINTSTS_LPMINT_Pos) /*!< Bit mask of LPMINT field.                  */
  #define USBHSCORE_GINTSTS_LPMINT_Min (0x0UL)       /*!< Min enumerator value of LPMINT field.                                */
  #define USBHSCORE_GINTSTS_LPMINT_Max (0x1UL)       /*!< Max enumerator value of LPMINT field.                                */
  #define USBHSCORE_GINTSTS_LPMINT_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTSTS_LPMINT_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* CONIDSTSCHNG @Bit 28 : Mode: Host and Device. Connector ID Status Change (ConIDStsChng) */
  #define USBHSCORE_GINTSTS_CONIDSTSCHNG_Pos (28UL)  /*!< Position of CONIDSTSCHNG field.                                      */
  #define USBHSCORE_GINTSTS_CONIDSTSCHNG_Msk (0x1UL << USBHSCORE_GINTSTS_CONIDSTSCHNG_Pos) /*!< Bit mask of CONIDSTSCHNG field.*/
  #define USBHSCORE_GINTSTS_CONIDSTSCHNG_Min (0x0UL) /*!< Min enumerator value of CONIDSTSCHNG field.                          */
  #define USBHSCORE_GINTSTS_CONIDSTSCHNG_Max (0x1UL) /*!< Max enumerator value of CONIDSTSCHNG field.                          */
  #define USBHSCORE_GINTSTS_CONIDSTSCHNG_INACTIVE (0x0UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_GINTSTS_CONIDSTSCHNG_ACTIVE (0x1UL) /*!< (unspecified)                                                     */

/* DISCONNINT @Bit 29 : Mode: Host only. Disconnect Detected Interrupt (DisconnInt) */
  #define USBHSCORE_GINTSTS_DISCONNINT_Pos (29UL)    /*!< Position of DISCONNINT field.                                        */
  #define USBHSCORE_GINTSTS_DISCONNINT_Msk (0x1UL << USBHSCORE_GINTSTS_DISCONNINT_Pos) /*!< Bit mask of DISCONNINT field.      */
  #define USBHSCORE_GINTSTS_DISCONNINT_Min (0x0UL)   /*!< Min enumerator value of DISCONNINT field.                            */
  #define USBHSCORE_GINTSTS_DISCONNINT_Max (0x1UL)   /*!< Max enumerator value of DISCONNINT field.                            */
  #define USBHSCORE_GINTSTS_DISCONNINT_INACTIVE (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_GINTSTS_DISCONNINT_ACTIVE (0x1UL) /*!< (unspecified)                                                       */

/* SESSREQINT @Bit 30 : Mode: Host and Device. Session Request/New Session Detected Interrupt (SessReqInt) */
  #define USBHSCORE_GINTSTS_SESSREQINT_Pos (30UL)    /*!< Position of SESSREQINT field.                                        */
  #define USBHSCORE_GINTSTS_SESSREQINT_Msk (0x1UL << USBHSCORE_GINTSTS_SESSREQINT_Pos) /*!< Bit mask of SESSREQINT field.      */
  #define USBHSCORE_GINTSTS_SESSREQINT_Min (0x0UL)   /*!< Min enumerator value of SESSREQINT field.                            */
  #define USBHSCORE_GINTSTS_SESSREQINT_Max (0x1UL)   /*!< Max enumerator value of SESSREQINT field.                            */
  #define USBHSCORE_GINTSTS_SESSREQINT_INACTIVE (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_GINTSTS_SESSREQINT_ACTIVE (0x1UL) /*!< (unspecified)                                                       */

/* WKUPINT @Bit 31 : Mode: Host and Device. Resume/Remote Wakeup Detected Interrupt (WkUpInt) */
  #define USBHSCORE_GINTSTS_WKUPINT_Pos (31UL)       /*!< Position of WKUPINT field.                                           */
  #define USBHSCORE_GINTSTS_WKUPINT_Msk (0x1UL << USBHSCORE_GINTSTS_WKUPINT_Pos) /*!< Bit mask of WKUPINT field.               */
  #define USBHSCORE_GINTSTS_WKUPINT_Min (0x0UL)      /*!< Min enumerator value of WKUPINT field.                               */
  #define USBHSCORE_GINTSTS_WKUPINT_Max (0x1UL)      /*!< Max enumerator value of WKUPINT field.                               */
  #define USBHSCORE_GINTSTS_WKUPINT_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTSTS_WKUPINT_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */


/* USBHSCORE_GINTMSK: Interrupt Mask Register */
  #define USBHSCORE_GINTMSK_ResetValue (0x00000000UL) /*!< Reset value of GINTMSK register.                                    */

/* MODEMISMSK @Bit 1 : Mode: Host and Device */
  #define USBHSCORE_GINTMSK_MODEMISMSK_Pos (1UL)     /*!< Position of MODEMISMSK field.                                        */
  #define USBHSCORE_GINTMSK_MODEMISMSK_Msk (0x1UL << USBHSCORE_GINTMSK_MODEMISMSK_Pos) /*!< Bit mask of MODEMISMSK field.      */
  #define USBHSCORE_GINTMSK_MODEMISMSK_Min (0x0UL)   /*!< Min enumerator value of MODEMISMSK field.                            */
  #define USBHSCORE_GINTMSK_MODEMISMSK_Max (0x1UL)   /*!< Max enumerator value of MODEMISMSK field.                            */
  #define USBHSCORE_GINTMSK_MODEMISMSK_MASK (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTMSK_MODEMISMSK_NOMASK (0x1UL) /*!< (unspecified)                                                       */

