adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* HCHINTMSK @Bit 25 : Mode: Host only. Host Channels Interrupt Mask (HChIntMsk) */
  #define USBHSCORE_GINTMSK_HCHINTMSK_Pos (25UL)     /*!< Position of HCHINTMSK field.                                         */
  #define USBHSCORE_GINTMSK_HCHINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_HCHINTMSK_Pos) /*!< Bit mask of HCHINTMSK field.         */
  #define USBHSCORE_GINTMSK_HCHINTMSK_Min (0x0UL)    /*!< Min enumerator value of HCHINTMSK field.                             */
  #define USBHSCORE_GINTMSK_HCHINTMSK_Max (0x1UL)    /*!< Max enumerator value of HCHINTMSK field.                             */
  #define USBHSCORE_GINTMSK_HCHINTMSK_MASK (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTMSK_HCHINTMSK_NOMASK (0x1UL) /*!< (unspecified)                                                        */

/* LPMINTMSK @Bit 27 : Mode: Host and Device. LPM Transaction Received Interrupt (LPM_Int) */
  #define USBHSCORE_GINTMSK_LPMINTMSK_Pos (27UL)     /*!< Position of LPMINTMSK field.                                         */
  #define USBHSCORE_GINTMSK_LPMINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_LPMINTMSK_Pos) /*!< Bit mask of LPMINTMSK field.         */
  #define USBHSCORE_GINTMSK_LPMINTMSK_Min (0x0UL)    /*!< Min enumerator value of LPMINTMSK field.                             */
  #define USBHSCORE_GINTMSK_LPMINTMSK_Max (0x1UL)    /*!< Max enumerator value of LPMINTMSK field.                             */
  #define USBHSCORE_GINTMSK_LPMINTMSK_MASK (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTMSK_LPMINTMSK_NOMASK (0x1UL) /*!< (unspecified)                                                        */

/* CONIDSTSCHNGMSK @Bit 28 : Mode: Host and Device */
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Pos (28UL) /*!< Position of CONIDSTSCHNGMSK field.                                 */
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Msk (0x1UL << USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Pos) /*!< Bit mask of
                                                                            CONIDSTSCHNGMSK field.*/                              
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Min (0x0UL) /*!< Min enumerator value of CONIDSTSCHNGMSK field.                    */
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Max (0x1UL) /*!< Max enumerator value of CONIDSTSCHNGMSK field.                    */
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_MASK (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_NOMASK (0x1UL) /*!< (unspecified)                                                  */

/* DISCONNINTMSK @Bit 29 : Mode: Host and Device */
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_Pos (29UL) /*!< Position of DISCONNINTMSK field.                                     */
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_DISCONNINTMSK_Pos) /*!< Bit mask of DISCONNINTMSK
                                                                            field.*/                                              
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_Min (0x0UL) /*!< Min enumerator value of DISCONNINTMSK field.                        */
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_Max (0x1UL) /*!< Max enumerator value of DISCONNINTMSK field.                        */
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_MASK (0x0UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_NOMASK (0x1UL) /*!< (unspecified)                                                    */

/* SESSREQINTMSK @Bit 30 : Mode: Host and Device */
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_Pos (30UL) /*!< Position of SESSREQINTMSK field.                                     */
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_SESSREQINTMSK_Pos) /*!< Bit mask of SESSREQINTMSK
                                                                            field.*/                                              
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_Min (0x0UL) /*!< Min enumerator value of SESSREQINTMSK field.                        */
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_Max (0x1UL) /*!< Max enumerator value of SESSREQINTMSK field.                        */
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_MASK (0x0UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_NOMASK (0x1UL) /*!< (unspecified)                                                    */

/* WKUPINTMSK @Bit 31 : Mode: Host and Device. Resume/Remote Wakeup Detected Interrupt Mask (WkUpIntMsk) */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_Pos (31UL)    /*!< Position of WKUPINTMSK field.                                        */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_WKUPINTMSK_Pos) /*!< Bit mask of WKUPINTMSK field.      */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_Min (0x0UL)   /*!< Min enumerator value of WKUPINTMSK field.                            */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_Max (0x1UL)   /*!< Max enumerator value of WKUPINTMSK field.                            */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_MASK (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_NOMASK (0x1UL) /*!< (unspecified)                                                       */


/* USBHSCORE_GRXSTSR: Receive Status Debug Read Register */
  #define USBHSCORE_GRXSTSR_ResetValue (0x00000000UL) /*!< Reset value of GRXSTSR register.                                    */

/* CHNUM @Bits 0..3 : Channel Number (ChNum) */
  #define USBHSCORE_GRXSTSR_CHNUM_Pos (0UL)          /*!< Position of CHNUM field.                                             */
  #define USBHSCORE_GRXSTSR_CHNUM_Msk (0xFUL << USBHSCORE_GRXSTSR_CHNUM_Pos) /*!< Bit mask of CHNUM field.                     */
  #define USBHSCORE_GRXSTSR_CHNUM_Min (0x0UL)        /*!< Min enumerator value of CHNUM field.                                 */
  #define USBHSCORE_GRXSTSR_CHNUM_Max (0xFUL)        /*!< Max enumerator value of CHNUM field.                                 */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP0 (0x0UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP1 (0x1UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP2 (0x2UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP3 (0x3UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP4 (0x4UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP5 (0x5UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP6 (0x6UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP7 (0x7UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP8 (0x8UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP9 (0x9UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP10 (0xAUL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP11 (0xBUL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP12 (0xCUL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP13 (0xDUL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP14 (0xEUL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP15 (0xFUL)     /*!< (unspecified)                                                        */

/* BCNT @Bits 4..14 : Byte Count (BCnt) */
  #define USBHSCORE_GRXSTSR_BCNT_Pos (4UL)           /*!< Position of BCNT field.                                              */
  #define USBHSCORE_GRXSTSR_BCNT_Msk (0x7FFUL << USBHSCORE_GRXSTSR_BCNT_Pos) /*!< Bit mask of BCNT field.                      */

/* DPID @Bits 15..16 : Data PID (DPID) */
  #define USBHSCORE_GRXSTSR_DPID_Pos (15UL)          /*!< Position of DPID field.                                              */
  #define USBHSCORE_GRXSTSR_DPID_Msk (0x3UL << USBHSCORE_GRXSTSR_DPID_Pos) /*!< Bit mask of DPID field.                        */
  #define USBHSCORE_GRXSTSR_DPID_Min (0x0UL)         /*!< Min enumerator value of DPID field.                                  */
  #define USBHSCORE_GRXSTSR_DPID_Max (0x3UL)         /*!< Max enumerator value of DPID field.                                  */
  #define USBHSCORE_GRXSTSR_DPID_DATA0 (0x0UL)       /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_DPID_DATA2 (0x1UL)       /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_DPID_DATA1 (0x2UL)       /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_DPID_MDATA (0x3UL)       /*!< (unspecified)                                                        */

