adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* GPI @Bits 0..15 : General Purpose Input (GPI) */
  #define USBHSCORE_GGPIO_GPI_Pos (0UL)              /*!< Position of GPI field.                                               */
  #define USBHSCORE_GGPIO_GPI_Msk (0xFFFFUL << USBHSCORE_GGPIO_GPI_Pos) /*!< Bit mask of GPI field.                            */

/* GPO @Bits 16..31 : General Purpose Output (GPO) */
  #define USBHSCORE_GGPIO_GPO_Pos (16UL)             /*!< Position of GPO field.                                               */
  #define USBHSCORE_GGPIO_GPO_Msk (0xFFFFUL << USBHSCORE_GGPIO_GPO_Pos) /*!< Bit mask of GPO field.                            */


/* USBHSCORE_GUID: User ID Register */
  #define USBHSCORE_GUID_ResetValue (0x12345678UL)   /*!< Reset value of GUID register.                                        */

/* GUID @Bits 0..31 : User ID (UserID) */
  #define USBHSCORE_GUID_GUID_Pos (0UL)              /*!< Position of GUID field.                                              */
  #define USBHSCORE_GUID_GUID_Msk (0xFFFFFFFFUL << USBHSCORE_GUID_GUID_Pos) /*!< Bit mask of GUID field.                       */


/* USBHSCORE_GSNPSID: Synopsys ID Register */
  #define USBHSCORE_GSNPSID_ResetValue (0x4F54400AUL) /*!< Reset value of GSNPSID register.                                    */

/* SYNOPSYSID @Bits 0..31 : Release number of the controller being used currently. */
  #define USBHSCORE_GSNPSID_SYNOPSYSID_Pos (0UL)     /*!< Position of SYNOPSYSID field.                                        */
  #define USBHSCORE_GSNPSID_SYNOPSYSID_Msk (0xFFFFFFFFUL << USBHSCORE_GSNPSID_SYNOPSYSID_Pos) /*!< Bit mask of SYNOPSYSID
                                                                            field.*/                                              


/* USBHSCORE_GHWCFG1: User Hardware Configuration 1 Register */
  #define USBHSCORE_GHWCFG1_ResetValue (0xAA555000UL) /*!< Reset value of GHWCFG1 register.                                    */

/* EPDIR @Bits 0..31 : This 32-bit field uses two bits per */
  #define USBHSCORE_GHWCFG1_EPDIR_Pos (0UL)          /*!< Position of EPDIR field.                                             */
  #define USBHSCORE_GHWCFG1_EPDIR_Msk (0xFFFFFFFFUL << USBHSCORE_GHWCFG1_EPDIR_Pos) /*!< Bit mask of EPDIR field.              */


/* USBHSCORE_GHWCFG2: User Hardware Configuration 2 Register */
  #define USBHSCORE_GHWCFG2_ResetValue (0x228BFC72UL) /*!< Reset value of GHWCFG2 register.                                    */

/* OTGMODE @Bits 0..2 : Mode of Operation (OtgMode). - 3b000: */
  #define USBHSCORE_GHWCFG2_OTGMODE_Pos (0UL)        /*!< Position of OTGMODE field.                                           */
  #define USBHSCORE_GHWCFG2_OTGMODE_Msk (0x7UL << USBHSCORE_GHWCFG2_OTGMODE_Pos) /*!< Bit mask of OTGMODE field.               */
  #define USBHSCORE_GHWCFG2_OTGMODE_Min (0x0UL)      /*!< Min enumerator value of OTGMODE field.                               */
  #define USBHSCORE_GHWCFG2_OTGMODE_Max (0x6UL)      /*!< Max enumerator value of OTGMODE field.                               */
  #define USBHSCORE_GHWCFG2_OTGMODE_HNPSRP (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_OTGMODE_SRPOTG (0x1UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_OTGMODE_NHNPNSRP (0x2UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_OTGMODE_SRPCAPD (0x3UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_OTGMODE_NONOTGD (0x4UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_OTGMODE_SRPCAPH (0x5UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_OTGMODE_NONOTGH (0x6UL)  /*!< (unspecified)                                                        */

/* OTGARCH @Bits 3..4 : Architecture (OtgArch) */
  #define USBHSCORE_GHWCFG2_OTGARCH_Pos (3UL)        /*!< Position of OTGARCH field.                                           */
  #define USBHSCORE_GHWCFG2_OTGARCH_Msk (0x3UL << USBHSCORE_GHWCFG2_OTGARCH_Pos) /*!< Bit mask of OTGARCH field.               */
  #define USBHSCORE_GHWCFG2_OTGARCH_Min (0x0UL)      /*!< Min enumerator value of OTGARCH field.                               */
  #define USBHSCORE_GHWCFG2_OTGARCH_Max (0x2UL)      /*!< Max enumerator value of OTGARCH field.                               */
  #define USBHSCORE_GHWCFG2_OTGARCH_SLAVEMODE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_GHWCFG2_OTGARCH_EXTERNALDMA (0x1UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_GHWCFG2_OTGARCH_INTERNALDMA (0x2UL) /*!< (unspecified)                                                     */

/* SINGPNT @Bit 5 : Point-to-Point (SingPnt) */
  #define USBHSCORE_GHWCFG2_SINGPNT_Pos (5UL)        /*!< Position of SINGPNT field.                                           */
  #define USBHSCORE_GHWCFG2_SINGPNT_Msk (0x1UL << USBHSCORE_GHWCFG2_SINGPNT_Pos) /*!< Bit mask of SINGPNT field.               */
  #define USBHSCORE_GHWCFG2_SINGPNT_Min (0x0UL)      /*!< Min enumerator value of SINGPNT field.                               */
  #define USBHSCORE_GHWCFG2_SINGPNT_Max (0x1UL)      /*!< Max enumerator value of SINGPNT field.                               */
  #define USBHSCORE_GHWCFG2_SINGPNT_MULTIPOINT (0x0UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GHWCFG2_SINGPNT_SINGLEPOINT (0x1UL) /*!< (unspecified)                                                     */

/* HSPHYTYPE @Bits 6..7 : High-Speed PHY Interface Type (HSPhyType) */
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_Pos (6UL)      /*!< Position of HSPHYTYPE field.                                         */
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_Msk (0x3UL << USBHSCORE_GHWCFG2_HSPHYTYPE_Pos) /*!< Bit mask of HSPHYTYPE field.         */
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_Min (0x0UL)    /*!< Min enumerator value of HSPHYTYPE field.                             */
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_Max (0x3UL)    /*!< Max enumerator value of HSPHYTYPE field.                             */
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_NOHS (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_UTMIPLUS (0x1UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_ULPI (0x2UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_UTMIPUSULPI (0x3UL) /*!< (unspecified)                                                   */

/* FSPHYTYPE @Bits 8..9 : Full-Speed PHY Interface Type (FSPhyType) */
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_Pos (8UL)      /*!< Position of FSPHYTYPE field.                                         */
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_Msk (0x3UL << USBHSCORE_GHWCFG2_FSPHYTYPE_Pos) /*!< Bit mask of FSPHYTYPE field.         */
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_Min (0x0UL)    /*!< Min enumerator value of FSPHYTYPE field.                             */
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_Max (0x3UL)    /*!< Max enumerator value of FSPHYTYPE field.                             */
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_NO_FS (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_FS (0x1UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_FSPLUSUTMI (0x2UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_FSPLUSULPI (0x3UL) /*!< (unspecified)                                                    */

/* NUMDEVEPS @Bits 10..13 : Number of Device Endpoints (NumDevEps) */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_Pos (10UL)     /*!< Position of NUMDEVEPS field.                                         */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_Msk (0xFUL << USBHSCORE_GHWCFG2_NUMDEVEPS_Pos) /*!< Bit mask of NUMDEVEPS field.         */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_Min (0x0UL)    /*!< Min enumerator value of NUMDEVEPS field.                             */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_Max (0xFUL)    /*!< Max enumerator value of NUMDEVEPS field.                             */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT0 (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT1 (0x1UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT2 (0x2UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT3 (0x3UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT4 (0x4UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT5 (0x5UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT6 (0x6UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT7 (0x7UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT8 (0x8UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT9 (0x9UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT10 (0xAUL) /*!< (unspecified)                                                       */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT11 (0xBUL) /*!< (unspecified)                                                       */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT12 (0xCUL) /*!< (unspecified)                                                       */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT13 (0xDUL) /*!< (unspecified)                                                       */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT14 (0xEUL) /*!< (unspecified)                                                       */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT15 (0xFUL) /*!< (unspecified)                                                       */

/* NUMHSTCHNL @Bits 14..17 : Number of Host Channels (NumHstChnl) */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_Pos (14UL)    /*!< Position of NUMHSTCHNL field.                                        */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_Msk (0xFUL << USBHSCORE_GHWCFG2_NUMHSTCHNL_Pos) /*!< Bit mask of NUMHSTCHNL field.      */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_Min (0x0UL)   /*!< Min enumerator value of NUMHSTCHNL field.                            */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_Max (0xFUL)   /*!< Max enumerator value of NUMHSTCHNL field.                            */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH0 (0x0UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH1 (0x1UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH2 (0x2UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH3 (0x3UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH4 (0x4UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH5 (0x5UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH6 (0x6UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH7 (0x7UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH8 (0x8UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH9 (0x9UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH10 (0xAUL) /*!< (unspecified)                                                     */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH11 (0xBUL) /*!< (unspecified)                                                     */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH12 (0xCUL) /*!< (unspecified)                                                     */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH13 (0xDUL) /*!< (unspecified)                                                     */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH14 (0xEUL) /*!< (unspecified)                                                     */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH15 (0xFUL) /*!< (unspecified)                                                     */

/* PERIOSUPPORT @Bit 18 : Periodic OUT Channels Supported in Host Mode (PerioSupport) */
  #define USBHSCORE_GHWCFG2_PERIOSUPPORT_Pos (18UL)  /*!< Position of PERIOSUPPORT field.                                      */
  #define USBHSCORE_GHWCFG2_PERIOSUPPORT_Msk (0x1UL << USBHSCORE_GHWCFG2_PERIOSUPPORT_Pos) /*!< Bit mask of PERIOSUPPORT field.*/
  #define USBHSCORE_GHWCFG2_PERIOSUPPORT_Min (0x0UL) /*!< Min enumerator value of PERIOSUPPORT field.                          */
  #define USBHSCORE_GHWCFG2_PERIOSUPPORT_Max (0x1UL) /*!< Max enumerator value of PERIOSUPPORT field.                          */
  #define USBHSCORE_GHWCFG2_PERIOSUPPORT_DISABLED (0x0UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_GHWCFG2_PERIOSUPPORT_ENABLED (0x1UL) /*!< (unspecified)                                                    */

/* DYNFIFOSIZING @Bit 19 : Dynamic FIFO Sizing Enabled (DynFifoSizing) */
  #define USBHSCORE_GHWCFG2_DYNFIFOSIZING_Pos (19UL) /*!< Position of DYNFIFOSIZING field.                                     */
  #define USBHSCORE_GHWCFG2_DYNFIFOSIZING_Msk (0x1UL << USBHSCORE_GHWCFG2_DYNFIFOSIZING_Pos) /*!< Bit mask of DYNFIFOSIZING
                                                                            field.*/                                              
  #define USBHSCORE_GHWCFG2_DYNFIFOSIZING_Min (0x0UL) /*!< Min enumerator value of DYNFIFOSIZING field.                        */
  #define USBHSCORE_GHWCFG2_DYNFIFOSIZING_Max (0x1UL) /*!< Max enumerator value of DYNFIFOSIZING field.                        */
  #define USBHSCORE_GHWCFG2_DYNFIFOSIZING_DISABLED (0x0UL) /*!< (unspecified)                                                  */
  #define USBHSCORE_GHWCFG2_DYNFIFOSIZING_ENABLED (0x1UL) /*!< (unspecified)                                                   */

