adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* MULTIPROCINTRPT @Bit 20 : Multi Processor Interrupt Enabled (MultiProcIntrpt) */
  #define USBHSCORE_GHWCFG2_MULTIPROCINTRPT_Pos (20UL) /*!< Position of MULTIPROCINTRPT field.                                 */
  #define USBHSCORE_GHWCFG2_MULTIPROCINTRPT_Msk (0x1UL << USBHSCORE_GHWCFG2_MULTIPROCINTRPT_Pos) /*!< Bit mask of
                                                                            MULTIPROCINTRPT field.*/                              
  #define USBHSCORE_GHWCFG2_MULTIPROCINTRPT_Min (0x0UL) /*!< Min enumerator value of MULTIPROCINTRPT field.                    */
  #define USBHSCORE_GHWCFG2_MULTIPROCINTRPT_Max (0x1UL) /*!< Max enumerator value of MULTIPROCINTRPT field.                    */
  #define USBHSCORE_GHWCFG2_MULTIPROCINTRPT_DISABLED (0x0UL) /*!< (unspecified)                                                */
  #define USBHSCORE_GHWCFG2_MULTIPROCINTRPT_ENABLED (0x1UL) /*!< (unspecified)                                                 */

/* NPTXQDEPTH @Bits 22..23 : Non-periodic Request Queue Depth (NPTxQDepth) */
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_Pos (22UL)    /*!< Position of NPTXQDEPTH field.                                        */
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_Msk (0x3UL << USBHSCORE_GHWCFG2_NPTXQDEPTH_Pos) /*!< Bit mask of NPTXQDEPTH field.      */
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_Min (0x0UL)   /*!< Min enumerator value of NPTXQDEPTH field.                            */
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_Max (0x2UL)   /*!< Max enumerator value of NPTXQDEPTH field.                            */
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_TWO (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_FOUR (0x1UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_EIGHT (0x2UL) /*!< (unspecified)                                                        */

/* PTXQDEPTH @Bits 24..25 : Host Mode Periodic Request Queue Depth (PTxQDepth) */
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_Pos (24UL)     /*!< Position of PTXQDEPTH field.                                         */
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_Msk (0x3UL << USBHSCORE_GHWCFG2_PTXQDEPTH_Pos) /*!< Bit mask of PTXQDEPTH field.         */
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_Min (0x0UL)    /*!< Min enumerator value of PTXQDEPTH field.                             */
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_Max (0x3UL)    /*!< Max enumerator value of PTXQDEPTH field.                             */
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_QUE2 (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_QUE4 (0x1UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_QUE8 (0x2UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_QUE16 (0x3UL)  /*!< (unspecified)                                                        */

/* TKNQDEPTH @Bits 26..30 : Device Mode IN Token Sequence Learning Queue Depth (TknQDepth) */
  #define USBHSCORE_GHWCFG2_TKNQDEPTH_Pos (26UL)     /*!< Position of TKNQDEPTH field.                                         */
  #define USBHSCORE_GHWCFG2_TKNQDEPTH_Msk (0x1FUL << USBHSCORE_GHWCFG2_TKNQDEPTH_Pos) /*!< Bit mask of TKNQDEPTH field.        */


/* USBHSCORE_GHWCFG3: User Hardware Configuration 3 Register */
  #define USBHSCORE_GHWCFG3_ResetValue (0x0BEAC0E8UL) /*!< Reset value of GHWCFG3 register.                                    */

/* XFERSIZEWIDTH @Bits 0..3 : Width of Transfer Size Counters (XferSizeWidth) */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_Pos (0UL)  /*!< Position of XFERSIZEWIDTH field.                                     */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_Msk (0xFUL << USBHSCORE_GHWCFG3_XFERSIZEWIDTH_Pos) /*!< Bit mask of XFERSIZEWIDTH
                                                                            field.*/                                              
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_Min (0x0UL) /*!< Min enumerator value of XFERSIZEWIDTH field.                        */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_Max (0x8UL) /*!< Max enumerator value of XFERSIZEWIDTH field.                        */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH11 (0x0UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH12 (0x1UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH13 (0x2UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH14 (0x3UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH15 (0x4UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH16 (0x5UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH17 (0x6UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH18 (0x7UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH19 (0x8UL) /*!< (unspecified)                                                   */

/* PKTSIZEWIDTH @Bits 4..6 : Width of Packet Size Counters (PktSizeWidth) */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_Pos (4UL)   /*!< Position of PKTSIZEWIDTH field.                                      */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_Msk (0x7UL << USBHSCORE_GHWCFG3_PKTSIZEWIDTH_Pos) /*!< Bit mask of PKTSIZEWIDTH field.*/
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_Min (0x0UL) /*!< Min enumerator value of PKTSIZEWIDTH field.                          */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_Max (0x6UL) /*!< Max enumerator value of PKTSIZEWIDTH field.                          */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS4 (0x0UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS5 (0x1UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS6 (0x2UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS7 (0x3UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS8 (0x4UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS9 (0x5UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS10 (0x6UL) /*!< (unspecified)                                                     */

/* OTGEN @Bit 7 : OTG Function Enabled (OtgEn) */
  #define USBHSCORE_GHWCFG3_OTGEN_Pos (7UL)          /*!< Position of OTGEN field.                                             */
  #define USBHSCORE_GHWCFG3_OTGEN_Msk (0x1UL << USBHSCORE_GHWCFG3_OTGEN_Pos) /*!< Bit mask of OTGEN field.                     */
  #define USBHSCORE_GHWCFG3_OTGEN_Min (0x0UL)        /*!< Min enumerator value of OTGEN field.                                 */
  #define USBHSCORE_GHWCFG3_OTGEN_Max (0x1UL)        /*!< Max enumerator value of OTGEN field.                                 */
  #define USBHSCORE_GHWCFG3_OTGEN_DISABLED (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG3_OTGEN_ENABLED (0x1UL)    /*!< (unspecified)                                                        */

