adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* BSESSVLD @Bit 22 : B Session Valid (BSessVld) */
  #define USBHSCORE_GPWRDN_BSESSVLD_Pos (22UL)       /*!< Position of BSESSVLD field.                                          */
  #define USBHSCORE_GPWRDN_BSESSVLD_Msk (0x1UL << USBHSCORE_GPWRDN_BSESSVLD_Pos) /*!< Bit mask of BSESSVLD field.              */
  #define USBHSCORE_GPWRDN_BSESSVLD_Min (0x0UL)      /*!< Min enumerator value of BSESSVLD field.                              */
  #define USBHSCORE_GPWRDN_BSESSVLD_Max (0x1UL)      /*!< Max enumerator value of BSESSVLD field.                              */
  #define USBHSCORE_GPWRDN_BSESSVLD_NOTVALID (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GPWRDN_BSESSVLD_VALID (0x1UL)    /*!< (unspecified)                                                        */

/* MULTVALIDBC @Bits 24..28 : MultValIdBC */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_Pos (24UL)    /*!< Position of MULTVALIDBC field.                                       */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_Msk (0x1FUL << USBHSCORE_GPWRDN_MULTVALIDBC_Pos) /*!< Bit mask of MULTVALIDBC field.    */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_Min (0x0UL)   /*!< Min enumerator value of MULTVALIDBC field.                           */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_Max (0x1FUL)  /*!< Max enumerator value of MULTVALIDBC field.                           */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_0 (0x00UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_C (0x01UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_B (0x02UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_A (0x04UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_GND (0x08UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_A_RID_GND (0x0CUL) /*!< (unspecified)                                               */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_FLOAT (0x10UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_C_RID_FLOAT (0x11UL) /*!< (unspecified)                                             */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_B_RID_FLOAT (0x12UL) /*!< (unspecified)                                             */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_1 (0x1FUL) /*!< (unspecified)                                                       */


/* USBHSCORE_GDFIFOCFG: Global DFIFO Configuration Register */
  #define USBHSCORE_GDFIFOCFG_ResetValue (0x0BEA0C00UL) /*!< Reset value of GDFIFOCFG register.                                */

/* GDFIFOCFG @Bits 0..15 : GDFIFOCfg */
  #define USBHSCORE_GDFIFOCFG_GDFIFOCFG_Pos (0UL)    /*!< Position of GDFIFOCFG field.                                         */
  #define USBHSCORE_GDFIFOCFG_GDFIFOCFG_Msk (0xFFFFUL << USBHSCORE_GDFIFOCFG_GDFIFOCFG_Pos) /*!< Bit mask of GDFIFOCFG field.  */

/* EPINFOBASEADDR @Bits 16..31 : EPInfoBaseAddr */
  #define USBHSCORE_GDFIFOCFG_EPINFOBASEADDR_Pos (16UL) /*!< Position of EPINFOBASEADDR field.                                 */
  #define USBHSCORE_GDFIFOCFG_EPINFOBASEADDR_Msk (0xFFFFUL << USBHSCORE_GDFIFOCFG_EPINFOBASEADDR_Pos) /*!< Bit mask of
                                                                            EPINFOBASEADDR field.*/                               


/* USBHSCORE_GINTMSK2: Interrupt Mask Register 2 */
  #define USBHSCORE_GINTMSK2_ResetValue (0x00000000UL) /*!< Reset value of GINTMSK2 register.                                  */

/* GINTMSK2 @Bits 0..31 : (unspecified) */
  #define USBHSCORE_GINTMSK2_GINTMSK2_Pos (0UL)      /*!< Position of GINTMSK2 field.                                          */
  #define USBHSCORE_GINTMSK2_GINTMSK2_Msk (0xFFFFFFFFUL << USBHSCORE_GINTMSK2_GINTMSK2_Pos) /*!< Bit mask of GINTMSK2 field.   */


/* USBHSCORE_GINTSTS2: Interrupt Register 2 */
  #define USBHSCORE_GINTSTS2_ResetValue (0x00000000UL) /*!< Reset value of GINTSTS2 register.                                  */

/* GINTSTS2 @Bits 0..31 : (unspecified) */
  #define USBHSCORE_GINTSTS2_GINTSTS2_Pos (0UL)      /*!< Position of GINTSTS2 field.                                          */
  #define USBHSCORE_GINTSTS2_GINTSTS2_Msk (0xFFFFFFFFUL << USBHSCORE_GINTSTS2_GINTSTS2_Pos) /*!< Bit mask of GINTSTS2 field.   */


/* USBHSCORE_HPTXFSIZ: Host Periodic Transmit FIFO Size Register */
  #define USBHSCORE_HPTXFSIZ_ResetValue (0x04000424UL) /*!< Reset value of HPTXFSIZ register.                                  */

/* PTXFSTADDR @Bits 0..10 : Host Periodic TxFIFO Start Address (PTxFStAddr) */
  #define USBHSCORE_HPTXFSIZ_PTXFSTADDR_Pos (0UL)    /*!< Position of PTXFSTADDR field.                                        */
  #define USBHSCORE_HPTXFSIZ_PTXFSTADDR_Msk (0x7FFUL << USBHSCORE_HPTXFSIZ_PTXFSTADDR_Pos) /*!< Bit mask of PTXFSTADDR field.  */

/* PTXFSIZE @Bits 16..26 : Host Periodic TxFIFO Depth (PTxFSize) */
  #define USBHSCORE_HPTXFSIZ_PTXFSIZE_Pos (16UL)     /*!< Position of PTXFSIZE field.                                          */
  #define USBHSCORE_HPTXFSIZ_PTXFSIZE_Msk (0x7FFUL << USBHSCORE_HPTXFSIZ_PTXFSIZE_Pos) /*!< Bit mask of PTXFSIZE field.        */


/* USBHSCORE_DIEPTXF1: Device IN Endpoint Transmit FIFO Size Register 1 */
  #define USBHSCORE_DIEPTXF1_ResetValue (0x02000424UL) /*!< Reset value of DIEPTXF1 register.                                  */

/* INEPNTXFSTADDR @Bits 0..10 : IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr) */
  #define USBHSCORE_DIEPTXF1_INEPNTXFSTADDR_Pos (0UL) /*!< Position of INEPNTXFSTADDR field.                                   */
  #define USBHSCORE_DIEPTXF1_INEPNTXFSTADDR_Msk (0x7FFUL << USBHSCORE_DIEPTXF1_INEPNTXFSTADDR_Pos) /*!< Bit mask of
                                                                            INEPNTXFSTADDR field.*/                               

