adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* INEPNTXFDEP @Bits 16..25 : IN Endpoint TxFIFO Depth (INEPnTxFDep) */
  #define USBHSCORE_DIEPTXF1_INEPNTXFDEP_Pos (16UL)  /*!< Position of INEPNTXFDEP field.                                       */
  #define USBHSCORE_DIEPTXF1_INEPNTXFDEP_Msk (0x3FFUL << USBHSCORE_DIEPTXF1_INEPNTXFDEP_Pos) /*!< Bit mask of INEPNTXFDEP
                                                                            field.*/                                              


/* USBHSCORE_DIEPTXF2: Device IN Endpoint Transmit FIFO Size Register 2 */
  #define USBHSCORE_DIEPTXF2_ResetValue (0x02000624UL) /*!< Reset value of DIEPTXF2 register.                                  */

/* INEPNTXFSTADDR @Bits 0..10 : IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr) */
  #define USBHSCORE_DIEPTXF2_INEPNTXFSTADDR_Pos (0UL) /*!< Position of INEPNTXFSTADDR field.                                   */
  #define USBHSCORE_DIEPTXF2_INEPNTXFSTADDR_Msk (0x7FFUL << USBHSCORE_DIEPTXF2_INEPNTXFSTADDR_Pos) /*!< Bit mask of
                                                                            INEPNTXFSTADDR field.*/                               

/* INEPNTXFDEP @Bits 16..25 : IN Endpoint TxFIFO Depth (INEPnTxFDep) */
  #define USBHSCORE_DIEPTXF2_INEPNTXFDEP_Pos (16UL)  /*!< Position of INEPNTXFDEP field.                                       */
  #define USBHSCORE_DIEPTXF2_INEPNTXFDEP_Msk (0x3FFUL << USBHSCORE_DIEPTXF2_INEPNTXFDEP_Pos) /*!< Bit mask of INEPNTXFDEP
                                                                            field.*/                                              


/* USBHSCORE_DIEPTXF3: Device IN Endpoint Transmit FIFO Size Register 3 */
  #define USBHSCORE_DIEPTXF3_ResetValue (0x02000824UL) /*!< Reset value of DIEPTXF3 register.                                  */

/* INEPNTXFSTADDR @Bits 0..11 : IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr) */
  #define USBHSCORE_DIEPTXF3_INEPNTXFSTADDR_Pos (0UL) /*!< Position of INEPNTXFSTADDR field.                                   */
  #define USBHSCORE_DIEPTXF3_INEPNTXFSTADDR_Msk (0xFFFUL << USBHSCORE_DIEPTXF3_INEPNTXFSTADDR_Pos) /*!< Bit mask of
                                                                            INEPNTXFSTADDR field.*/                               

/* INEPNTXFDEP @Bits 16..25 : IN Endpoint TxFIFO Depth (INEPnTxFDep) */
  #define USBHSCORE_DIEPTXF3_INEPNTXFDEP_Pos (16UL)  /*!< Position of INEPNTXFDEP field.                                       */
  #define USBHSCORE_DIEPTXF3_INEPNTXFDEP_Msk (0x3FFUL << USBHSCORE_DIEPTXF3_INEPNTXFDEP_Pos) /*!< Bit mask of INEPNTXFDEP
                                                                            field.*/                                              


/* USBHSCORE_DIEPTXF4: Device IN Endpoint Transmit FIFO Size Register 4 */
  #define USBHSCORE_DIEPTXF4_ResetValue (0x02000A24UL) /*!< Reset value of DIEPTXF4 register.                                  */

/* INEPNTXFSTADDR @Bits 0..11 : IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr) */
  #define USBHSCORE_DIEPTXF4_INEPNTXFSTADDR_Pos (0UL) /*!< Position of INEPNTXFSTADDR field.                                   */
  #define USBHSCORE_DIEPTXF4_INEPNTXFSTADDR_Msk (0xFFFUL << USBHSCORE_DIEPTXF4_INEPNTXFSTADDR_Pos) /*!< Bit mask of
                                                                            INEPNTXFSTADDR field.*/                               

/* INEPNTXFDEP @Bits 16..25 : IN Endpoint TxFIFO Depth (INEPnTxFDep) */
  #define USBHSCORE_DIEPTXF4_INEPNTXFDEP_Pos (16UL)  /*!< Position of INEPNTXFDEP field.                                       */
  #define USBHSCORE_DIEPTXF4_INEPNTXFDEP_Msk (0x3FFUL << USBHSCORE_DIEPTXF4_INEPNTXFDEP_Pos) /*!< Bit mask of INEPNTXFDEP
                                                                            field.*/                                              


/* USBHSCORE_DIEPTXF5: Device IN Endpoint Transmit FIFO Size Register 5 */
  #define USBHSCORE_DIEPTXF5_ResetValue (0x02000C24UL) /*!< Reset value of DIEPTXF5 register.                                  */

/* INEPNTXFSTADDR @Bits 0..11 : IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr) */
  #define USBHSCORE_DIEPTXF5_INEPNTXFSTADDR_Pos (0UL) /*!< Position of INEPNTXFSTADDR field.                                   */
  #define USBHSCORE_DIEPTXF5_INEPNTXFSTADDR_Msk (0xFFFUL << USBHSCORE_DIEPTXF5_INEPNTXFSTADDR_Pos) /*!< Bit mask of
                                                                            INEPNTXFSTADDR field.*/                               

/* INEPNTXFDEP @Bits 16..25 : IN Endpoint TxFIFO Depth (INEPnTxFDep) */
  #define USBHSCORE_DIEPTXF5_INEPNTXFDEP_Pos (16UL)  /*!< Position of INEPNTXFDEP field.                                       */
  #define USBHSCORE_DIEPTXF5_INEPNTXFDEP_Msk (0x3FFUL << USBHSCORE_DIEPTXF5_INEPNTXFDEP_Pos) /*!< Bit mask of INEPNTXFDEP
                                                                            field.*/                                              


/* USBHSCORE_DIEPTXF6: Device IN Endpoint Transmit FIFO Size Register 6 */
  #define USBHSCORE_DIEPTXF6_ResetValue (0x02000E24UL) /*!< Reset value of DIEPTXF6 register.                                  */

/* INEPNTXFSTADDR @Bits 0..11 : IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr) */
  #define USBHSCORE_DIEPTXF6_INEPNTXFSTADDR_Pos (0UL) /*!< Position of INEPNTXFSTADDR field.                                   */
  #define USBHSCORE_DIEPTXF6_INEPNTXFSTADDR_Msk (0xFFFUL << USBHSCORE_DIEPTXF6_INEPNTXFSTADDR_Pos) /*!< Bit mask of
                                                                            INEPNTXFSTADDR field.*/                               

/* INEPNTXFDEP @Bits 16..25 : IN Endpoint TxFIFO Depth (INEPnTxFDep) */
  #define USBHSCORE_DIEPTXF6_INEPNTXFDEP_Pos (16UL)  /*!< Position of INEPNTXFDEP field.                                       */
  #define USBHSCORE_DIEPTXF6_INEPNTXFDEP_Msk (0x3FFUL << USBHSCORE_DIEPTXF6_INEPNTXFDEP_Pos) /*!< Bit mask of INEPNTXFDEP
                                                                            field.*/                                              


/* USBHSCORE_DIEPTXF7: Device IN Endpoint Transmit FIFO Size Register 7 */
  #define USBHSCORE_DIEPTXF7_ResetValue (0x02001024UL) /*!< Reset value of DIEPTXF7 register.                                  */

/* INEPNTXFSTADDR @Bits 0..12 : IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr) */
  #define USBHSCORE_DIEPTXF7_INEPNTXFSTADDR_Pos (0UL) /*!< Position of INEPNTXFSTADDR field.                                   */
  #define USBHSCORE_DIEPTXF7_INEPNTXFSTADDR_Msk (0x1FFFUL << USBHSCORE_DIEPTXF7_INEPNTXFSTADDR_Pos) /*!< Bit mask of
                                                                            INEPNTXFSTADDR field.*/                               

