adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PRTRES @Bit 6 : Port Resume (PrtRes) */
  #define USBHSCORE_HPRT_PRTRES_Pos (6UL)            /*!< Position of PRTRES field.                                            */
  #define USBHSCORE_HPRT_PRTRES_Msk (0x1UL << USBHSCORE_HPRT_PRTRES_Pos) /*!< Bit mask of PRTRES field.                        */
  #define USBHSCORE_HPRT_PRTRES_Min (0x0UL)          /*!< Min enumerator value of PRTRES field.                                */
  #define USBHSCORE_HPRT_PRTRES_Max (0x1UL)          /*!< Max enumerator value of PRTRES field.                                */
  #define USBHSCORE_HPRT_PRTRES_NORESUME (0x0UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTRES_RESUME (0x1UL)       /*!< (unspecified)                                                        */

/* PRTSUSP @Bit 7 : Port Suspend (PrtSusp) */
  #define USBHSCORE_HPRT_PRTSUSP_Pos (7UL)           /*!< Position of PRTSUSP field.                                           */
  #define USBHSCORE_HPRT_PRTSUSP_Msk (0x1UL << USBHSCORE_HPRT_PRTSUSP_Pos) /*!< Bit mask of PRTSUSP field.                     */
  #define USBHSCORE_HPRT_PRTSUSP_Min (0x0UL)         /*!< Min enumerator value of PRTSUSP field.                               */
  #define USBHSCORE_HPRT_PRTSUSP_Max (0x1UL)         /*!< Max enumerator value of PRTSUSP field.                               */
  #define USBHSCORE_HPRT_PRTSUSP_INACTIVE (0x0UL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTSUSP_ACTIVE (0x1UL)      /*!< (unspecified)                                                        */

/* PRTRST @Bit 8 : Port Reset (PrtRst) */
  #define USBHSCORE_HPRT_PRTRST_Pos (8UL)            /*!< Position of PRTRST field.                                            */
  #define USBHSCORE_HPRT_PRTRST_Msk (0x1UL << USBHSCORE_HPRT_PRTRST_Pos) /*!< Bit mask of PRTRST field.                        */
  #define USBHSCORE_HPRT_PRTRST_Min (0x0UL)          /*!< Min enumerator value of PRTRST field.                                */
  #define USBHSCORE_HPRT_PRTRST_Max (0x1UL)          /*!< Max enumerator value of PRTRST field.                                */
  #define USBHSCORE_HPRT_PRTRST_DISABLED (0x0UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTRST_ENABLED (0x1UL)      /*!< (unspecified)                                                        */

/* PRTLNSTS @Bits 10..11 : Port Line Status (PrtLnSts) */
  #define USBHSCORE_HPRT_PRTLNSTS_Pos (10UL)         /*!< Position of PRTLNSTS field.                                          */
  #define USBHSCORE_HPRT_PRTLNSTS_Msk (0x3UL << USBHSCORE_HPRT_PRTLNSTS_Pos) /*!< Bit mask of PRTLNSTS field.                  */
  #define USBHSCORE_HPRT_PRTLNSTS_Min (0x1UL)        /*!< Min enumerator value of PRTLNSTS field.                              */
  #define USBHSCORE_HPRT_PRTLNSTS_Max (0x2UL)        /*!< Max enumerator value of PRTLNSTS field.                              */
  #define USBHSCORE_HPRT_PRTLNSTS_PLUSD (0x1UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTLNSTS_MINUSD (0x2UL)     /*!< (unspecified)                                                        */

/* PRTPWR @Bit 12 : Port Power (PrtPwr) */
  #define USBHSCORE_HPRT_PRTPWR_Pos (12UL)           /*!< Position of PRTPWR field.                                            */
  #define USBHSCORE_HPRT_PRTPWR_Msk (0x1UL << USBHSCORE_HPRT_PRTPWR_Pos) /*!< Bit mask of PRTPWR field.                        */
  #define USBHSCORE_HPRT_PRTPWR_Min (0x0UL)          /*!< Min enumerator value of PRTPWR field.                                */
  #define USBHSCORE_HPRT_PRTPWR_Max (0x1UL)          /*!< Max enumerator value of PRTPWR field.                                */
  #define USBHSCORE_HPRT_PRTPWR_OFF (0x0UL)          /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTPWR_ON (0x1UL)           /*!< (unspecified)                                                        */

/* PRTTSTCTL @Bits 13..16 : Port Test Control (PrtTstCtl) */
  #define USBHSCORE_HPRT_PRTTSTCTL_Pos (13UL)        /*!< Position of PRTTSTCTL field.                                         */
  #define USBHSCORE_HPRT_PRTTSTCTL_Msk (0xFUL << USBHSCORE_HPRT_PRTTSTCTL_Pos) /*!< Bit mask of PRTTSTCTL field.               */
  #define USBHSCORE_HPRT_PRTTSTCTL_Min (0x0UL)       /*!< Min enumerator value of PRTTSTCTL field.                             */
  #define USBHSCORE_HPRT_PRTTSTCTL_Max (0x5UL)       /*!< Max enumerator value of PRTTSTCTL field.                             */
  #define USBHSCORE_HPRT_PRTTSTCTL_DISABLED (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTTSTCTL_TESTJ (0x1UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTTSTCTL_TESTK (0x2UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTTSTCTL_TESTSN (0x3UL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTTSTCTL_TESTPM (0x4UL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTTSTCTL_TESTFENB (0x5UL)  /*!< (unspecified)                                                        */

/* PRTSPD @Bits 17..18 : Port Speed (PrtSpd) */
  #define USBHSCORE_HPRT_PRTSPD_Pos (17UL)           /*!< Position of PRTSPD field.                                            */
  #define USBHSCORE_HPRT_PRTSPD_Msk (0x3UL << USBHSCORE_HPRT_PRTSPD_Pos) /*!< Bit mask of PRTSPD field.                        */
  #define USBHSCORE_HPRT_PRTSPD_Min (0x0UL)          /*!< Min enumerator value of PRTSPD field.                                */
  #define USBHSCORE_HPRT_PRTSPD_Max (0x2UL)          /*!< Max enumerator value of PRTSPD field.                                */
  #define USBHSCORE_HPRT_PRTSPD_HIGHSPD (0x0UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTSPD_FULLSPD (0x1UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTSPD_LOWSPD (0x2UL)       /*!< (unspecified)                                                        */


/* USBHSCORE_DCFG: Device Configuration Register */
  #define USBHSCORE_DCFG_ResetValue (0x08020000UL)   /*!< Reset value of DCFG register.                                        */

/* DEVSPD @Bits 0..1 : Device Speed (DevSpd) */
  #define USBHSCORE_DCFG_DEVSPD_Pos (0UL)            /*!< Position of DEVSPD field.                                            */
  #define USBHSCORE_DCFG_DEVSPD_Msk (0x3UL << USBHSCORE_DCFG_DEVSPD_Pos) /*!< Bit mask of DEVSPD field.                        */
  #define USBHSCORE_DCFG_DEVSPD_Min (0x0UL)          /*!< Min enumerator value of DEVSPD field.                                */
  #define USBHSCORE_DCFG_DEVSPD_Max (0x3UL)          /*!< Max enumerator value of DEVSPD field.                                */
  #define USBHSCORE_DCFG_DEVSPD_USBHS20 (0x0UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_DCFG_DEVSPD_USBFS20 (0x1UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_DCFG_DEVSPD_USBLS116 (0x2UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_DCFG_DEVSPD_USBFS1148 (0x3UL)    /*!< (unspecified)                                                        */

/* NZSTSOUTHSHK @Bit 2 : Non-Zero-Length Status OUT Handshake (NZStsOUTHShk) */
  #define USBHSCORE_DCFG_NZSTSOUTHSHK_Pos (2UL)      /*!< Position of NZSTSOUTHSHK field.                                      */
  #define USBHSCORE_DCFG_NZSTSOUTHSHK_Msk (0x1UL << USBHSCORE_DCFG_NZSTSOUTHSHK_Pos) /*!< Bit mask of NZSTSOUTHSHK field.      */
  #define USBHSCORE_DCFG_NZSTSOUTHSHK_Min (0x0UL)    /*!< Min enumerator value of NZSTSOUTHSHK field.                          */
  #define USBHSCORE_DCFG_NZSTSOUTHSHK_Max (0x1UL)    /*!< Max enumerator value of NZSTSOUTHSHK field.                          */
  #define USBHSCORE_DCFG_NZSTSOUTHSHK_SENDOUT (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DCFG_NZSTSOUTHSHK_SENDSTALL (0x1UL) /*!< (unspecified)                                                     */

