adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* OUTEPINT2 @Bit 18 : OUT Endpoint 2 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT2_Pos (18UL)       /*!< Position of OUTEPINT2 field.                                         */
  #define USBHSCORE_DAINT_OUTEPINT2_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT2_Pos) /*!< Bit mask of OUTEPINT2 field.             */
  #define USBHSCORE_DAINT_OUTEPINT2_Min (0x0UL)      /*!< Min enumerator value of OUTEPINT2 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT2_Max (0x1UL)      /*!< Max enumerator value of OUTEPINT2 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT2_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINT_OUTEPINT2_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* OUTEPINT3 @Bit 19 : OUT Endpoint 3 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT3_Pos (19UL)       /*!< Position of OUTEPINT3 field.                                         */
  #define USBHSCORE_DAINT_OUTEPINT3_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT3_Pos) /*!< Bit mask of OUTEPINT3 field.             */
  #define USBHSCORE_DAINT_OUTEPINT3_Min (0x0UL)      /*!< Min enumerator value of OUTEPINT3 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT3_Max (0x1UL)      /*!< Max enumerator value of OUTEPINT3 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT3_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINT_OUTEPINT3_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* OUTEPINT4 @Bit 20 : OUT Endpoint 4 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT4_Pos (20UL)       /*!< Position of OUTEPINT4 field.                                         */
  #define USBHSCORE_DAINT_OUTEPINT4_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT4_Pos) /*!< Bit mask of OUTEPINT4 field.             */
  #define USBHSCORE_DAINT_OUTEPINT4_Min (0x0UL)      /*!< Min enumerator value of OUTEPINT4 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT4_Max (0x1UL)      /*!< Max enumerator value of OUTEPINT4 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT4_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINT_OUTEPINT4_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* OUTEPINT5 @Bit 21 : OUT Endpoint 5 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT5_Pos (21UL)       /*!< Position of OUTEPINT5 field.                                         */
  #define USBHSCORE_DAINT_OUTEPINT5_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT5_Pos) /*!< Bit mask of OUTEPINT5 field.             */
  #define USBHSCORE_DAINT_OUTEPINT5_Min (0x0UL)      /*!< Min enumerator value of OUTEPINT5 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT5_Max (0x1UL)      /*!< Max enumerator value of OUTEPINT5 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT5_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINT_OUTEPINT5_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* OUTEPINT12 @Bit 28 : OUT Endpoint 12 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT12_Pos (28UL)      /*!< Position of OUTEPINT12 field.                                        */
  #define USBHSCORE_DAINT_OUTEPINT12_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT12_Pos) /*!< Bit mask of OUTEPINT12 field.          */
  #define USBHSCORE_DAINT_OUTEPINT12_Min (0x0UL)     /*!< Min enumerator value of OUTEPINT12 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT12_Max (0x1UL)     /*!< Max enumerator value of OUTEPINT12 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT12_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DAINT_OUTEPINT12_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* OUTEPINT13 @Bit 29 : OUT Endpoint 13 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT13_Pos (29UL)      /*!< Position of OUTEPINT13 field.                                        */
  #define USBHSCORE_DAINT_OUTEPINT13_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT13_Pos) /*!< Bit mask of OUTEPINT13 field.          */
  #define USBHSCORE_DAINT_OUTEPINT13_Min (0x0UL)     /*!< Min enumerator value of OUTEPINT13 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT13_Max (0x1UL)     /*!< Max enumerator value of OUTEPINT13 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT13_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DAINT_OUTEPINT13_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* OUTEPINT14 @Bit 30 : OUT Endpoint 14 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT14_Pos (30UL)      /*!< Position of OUTEPINT14 field.                                        */
  #define USBHSCORE_DAINT_OUTEPINT14_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT14_Pos) /*!< Bit mask of OUTEPINT14 field.          */
  #define USBHSCORE_DAINT_OUTEPINT14_Min (0x0UL)     /*!< Min enumerator value of OUTEPINT14 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT14_Max (0x1UL)     /*!< Max enumerator value of OUTEPINT14 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT14_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DAINT_OUTEPINT14_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* OUTEPINT15 @Bit 31 : OUT Endpoint 15 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT15_Pos (31UL)      /*!< Position of OUTEPINT15 field.                                        */
  #define USBHSCORE_DAINT_OUTEPINT15_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT15_Pos) /*!< Bit mask of OUTEPINT15 field.          */
  #define USBHSCORE_DAINT_OUTEPINT15_Min (0x0UL)     /*!< Min enumerator value of OUTEPINT15 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT15_Max (0x1UL)     /*!< Max enumerator value of OUTEPINT15 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT15_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DAINT_OUTEPINT15_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */


