adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* INEPNAKEFF @Bit 6 : IN Endpoint NAK Effective (INEPNakEff) */
  #define USBHSCORE_DIEPINT4_INEPNAKEFF_Pos (6UL)    /*!< Position of INEPNAKEFF field.                                        */
  #define USBHSCORE_DIEPINT4_INEPNAKEFF_Msk (0x1UL << USBHSCORE_DIEPINT4_INEPNAKEFF_Pos) /*!< Bit mask of INEPNAKEFF field.    */
  #define USBHSCORE_DIEPINT4_INEPNAKEFF_Min (0x0UL)  /*!< Min enumerator value of INEPNAKEFF field.                            */
  #define USBHSCORE_DIEPINT4_INEPNAKEFF_Max (0x1UL)  /*!< Max enumerator value of INEPNAKEFF field.                            */
  #define USBHSCORE_DIEPINT4_INEPNAKEFF_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_DIEPINT4_INEPNAKEFF_ACTIVE (0x1UL) /*!< (unspecified)                                                      */

/* TXFEMP @Bit 7 : Transmit FIFO Empty (TxFEmp) */
  #define USBHSCORE_DIEPINT4_TXFEMP_Pos (7UL)        /*!< Position of TXFEMP field.                                            */
  #define USBHSCORE_DIEPINT4_TXFEMP_Msk (0x1UL << USBHSCORE_DIEPINT4_TXFEMP_Pos) /*!< Bit mask of TXFEMP field.                */
  #define USBHSCORE_DIEPINT4_TXFEMP_Min (0x0UL)      /*!< Min enumerator value of TXFEMP field.                                */
  #define USBHSCORE_DIEPINT4_TXFEMP_Max (0x1UL)      /*!< Max enumerator value of TXFEMP field.                                */
  #define USBHSCORE_DIEPINT4_TXFEMP_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPINT4_TXFEMP_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* TXFIFOUNDRN @Bit 8 : Fifo Underrun (TxfifoUndrn) */
  #define USBHSCORE_DIEPINT4_TXFIFOUNDRN_Pos (8UL)   /*!< Position of TXFIFOUNDRN field.                                       */
  #define USBHSCORE_DIEPINT4_TXFIFOUNDRN_Msk (0x1UL << USBHSCORE_DIEPINT4_TXFIFOUNDRN_Pos) /*!< Bit mask of TXFIFOUNDRN field. */
  #define USBHSCORE_DIEPINT4_TXFIFOUNDRN_Min (0x0UL) /*!< Min enumerator value of TXFIFOUNDRN field.                           */
  #define USBHSCORE_DIEPINT4_TXFIFOUNDRN_Max (0x1UL) /*!< Max enumerator value of TXFIFOUNDRN field.                           */
  #define USBHSCORE_DIEPINT4_TXFIFOUNDRN_INACTIVE (0x0UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_DIEPINT4_TXFIFOUNDRN_ACTIVE (0x1UL) /*!< (unspecified)                                                     */

/* BNAINTR @Bit 9 : BNA (Buffer Not Available) Interrupt (BNAIntr) */
  #define USBHSCORE_DIEPINT4_BNAINTR_Pos (9UL)       /*!< Position of BNAINTR field.                                           */
  #define USBHSCORE_DIEPINT4_BNAINTR_Msk (0x1UL << USBHSCORE_DIEPINT4_BNAINTR_Pos) /*!< Bit mask of BNAINTR field.             */
  #define USBHSCORE_DIEPINT4_BNAINTR_Min (0x0UL)     /*!< Min enumerator value of BNAINTR field.                               */
  #define USBHSCORE_DIEPINT4_BNAINTR_Max (0x1UL)     /*!< Max enumerator value of BNAINTR field.                               */
  #define USBHSCORE_DIEPINT4_BNAINTR_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DIEPINT4_BNAINTR_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* PKTDRPSTS @Bit 11 : Packet Drop Status (PktDrpSts) */
  #define USBHSCORE_DIEPINT4_PKTDRPSTS_Pos (11UL)    /*!< Position of PKTDRPSTS field.                                         */
  #define USBHSCORE_DIEPINT4_PKTDRPSTS_Msk (0x1UL << USBHSCORE_DIEPINT4_PKTDRPSTS_Pos) /*!< Bit mask of PKTDRPSTS field.       */
  #define USBHSCORE_DIEPINT4_PKTDRPSTS_Min (0x0UL)   /*!< Min enumerator value of PKTDRPSTS field.                             */
  #define USBHSCORE_DIEPINT4_PKTDRPSTS_Max (0x1UL)   /*!< Max enumerator value of PKTDRPSTS field.                             */
  #define USBHSCORE_DIEPINT4_PKTDRPSTS_INACTIVE (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DIEPINT4_PKTDRPSTS_ACTIVE (0x1UL) /*!< (unspecified)                                                       */

/* BBLEERR @Bit 12 : NAK Interrupt (BbleErr) */
  #define USBHSCORE_DIEPINT4_BBLEERR_Pos (12UL)      /*!< Position of BBLEERR field.                                           */
  #define USBHSCORE_DIEPINT4_BBLEERR_Msk (0x1UL << USBHSCORE_DIEPINT4_BBLEERR_Pos) /*!< Bit mask of BBLEERR field.             */
  #define USBHSCORE_DIEPINT4_BBLEERR_Min (0x0UL)     /*!< Min enumerator value of BBLEERR field.                               */
  #define USBHSCORE_DIEPINT4_BBLEERR_Max (0x1UL)     /*!< Max enumerator value of BBLEERR field.                               */
  #define USBHSCORE_DIEPINT4_BBLEERR_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DIEPINT4_BBLEERR_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* NAKINTRPT @Bit 13 : NAK Interrupt (NAKInterrupt) */
  #define USBHSCORE_DIEPINT4_NAKINTRPT_Pos (13UL)    /*!< Position of NAKINTRPT field.                                         */
  #define USBHSCORE_DIEPINT4_NAKINTRPT_Msk (0x1UL << USBHSCORE_DIEPINT4_NAKINTRPT_Pos) /*!< Bit mask of NAKINTRPT field.       */
  #define USBHSCORE_DIEPINT4_NAKINTRPT_Min (0x0UL)   /*!< Min enumerator value of NAKINTRPT field.                             */
  #define USBHSCORE_DIEPINT4_NAKINTRPT_Max (0x1UL)   /*!< Max enumerator value of NAKINTRPT field.                             */
  #define USBHSCORE_DIEPINT4_NAKINTRPT_INACTIVE (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DIEPINT4_NAKINTRPT_ACTIVE (0x1UL) /*!< (unspecified)                                                       */

/* NYETINTRPT @Bit 14 : NYET Interrupt (NYETIntrpt) */
  #define USBHSCORE_DIEPINT4_NYETINTRPT_Pos (14UL)   /*!< Position of NYETINTRPT field.                                        */
  #define USBHSCORE_DIEPINT4_NYETINTRPT_Msk (0x1UL << USBHSCORE_DIEPINT4_NYETINTRPT_Pos) /*!< Bit mask of NYETINTRPT field.    */
  #define USBHSCORE_DIEPINT4_NYETINTRPT_Min (0x0UL)  /*!< Min enumerator value of NYETINTRPT field.                            */
  #define USBHSCORE_DIEPINT4_NYETINTRPT_Max (0x1UL)  /*!< Max enumerator value of NYETINTRPT field.                            */
  #define USBHSCORE_DIEPINT4_NYETINTRPT_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_DIEPINT4_NYETINTRPT_ACTIVE (0x1UL) /*!< (unspecified)                                                      */


/* USBHSCORE_DIEPTSIZ4: Device IN Endpoint 4 Transfer Size Register */
  #define USBHSCORE_DIEPTSIZ4_ResetValue (0x00000000UL) /*!< Reset value of DIEPTSIZ4 register.                                */

/* XFERSIZE @Bits 0..18 : Transfer Size (XferSize) */
  #define USBHSCORE_DIEPTSIZ4_XFERSIZE_Pos (0UL)     /*!< Position of XFERSIZE field.                                          */
  #define USBHSCORE_DIEPTSIZ4_XFERSIZE_Msk (0x7FFFFUL << USBHSCORE_DIEPTSIZ4_XFERSIZE_Pos) /*!< Bit mask of XFERSIZE field.    */

/* PKTCNT @Bits 19..28 : Packet Count (PktCnt) */
  #define USBHSCORE_DIEPTSIZ4_PKTCNT_Pos (19UL)      /*!< Position of PKTCNT field.                                            */
  #define USBHSCORE_DIEPTSIZ4_PKTCNT_Msk (0x3FFUL << USBHSCORE_DIEPTSIZ4_PKTCNT_Pos) /*!< Bit mask of PKTCNT field.            */

/* MC @Bits 29..30 : MC */
  #define USBHSCORE_DIEPTSIZ4_MC_Pos (29UL)          /*!< Position of MC field.                                                */
  #define USBHSCORE_DIEPTSIZ4_MC_Msk (0x3UL << USBHSCORE_DIEPTSIZ4_MC_Pos) /*!< Bit mask of MC field.                          */
  #define USBHSCORE_DIEPTSIZ4_MC_Min (0x1UL)         /*!< Min enumerator value of MC field.                                    */
  #define USBHSCORE_DIEPTSIZ4_MC_Max (0x3UL)         /*!< Max enumerator value of MC field.                                    */
  #define USBHSCORE_DIEPTSIZ4_MC_PACKETONE (0x1UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPTSIZ4_MC_PACKETTWO (0x2UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPTSIZ4_MC_PACKETTHREE (0x3UL) /*!< (unspecified)                                                        */


/* USBHSCORE_DIEPDMA4: Device IN Endpoint 4 DMA Address Register */
  #define USBHSCORE_DIEPDMA4_ResetValue (0x00000000UL) /*!< Reset value of DIEPDMA4 register.                                  */

/* DMAADDR @Bits 0..31 : Holds the start address of the external memory for storing or fetching endpoint */
  #define USBHSCORE_DIEPDMA4_DMAADDR_Pos (0UL)       /*!< Position of DMAADDR field.                                           */
  #define USBHSCORE_DIEPDMA4_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DIEPDMA4_DMAADDR_Pos) /*!< Bit mask of DMAADDR field.      */


