adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* STALL @Bit 21 : STALL Handshake (Stall) */
  #define USBHSCORE_DIEPCTL11_STALL_Pos (21UL)       /*!< Position of STALL field.                                             */
  #define USBHSCORE_DIEPCTL11_STALL_Msk (0x1UL << USBHSCORE_DIEPCTL11_STALL_Pos) /*!< Bit mask of STALL field.                 */
  #define USBHSCORE_DIEPCTL11_STALL_Min (0x0UL)      /*!< Min enumerator value of STALL field.                                 */
  #define USBHSCORE_DIEPCTL11_STALL_Max (0x1UL)      /*!< Max enumerator value of STALL field.                                 */
  #define USBHSCORE_DIEPCTL11_STALL_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL11_STALL_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* TXFNUM @Bits 22..25 : TxFIFO Number (TxFNum) */
  #define USBHSCORE_DIEPCTL11_TXFNUM_Pos (22UL)      /*!< Position of TXFNUM field.                                            */
  #define USBHSCORE_DIEPCTL11_TXFNUM_Msk (0xFUL << USBHSCORE_DIEPCTL11_TXFNUM_Pos) /*!< Bit mask of TXFNUM field.              */
  #define USBHSCORE_DIEPCTL11_TXFNUM_Min (0x0UL)     /*!< Min enumerator value of TXFNUM field.                                */
  #define USBHSCORE_DIEPCTL11_TXFNUM_Max (0xFUL)     /*!< Max enumerator value of TXFNUM field.                                */
  #define USBHSCORE_DIEPCTL11_TXFNUM_TXFIFO0 (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL11_TXFNUM_TXFIFO1 (0x1UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL11_TXFNUM_TXFIFO2 (0x2UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL11_TXFNUM_TXFIFO3 (0x3UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL11_TXFNUM_TXFIFO4 (0x4UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL11_TXFNUM_TXFIFO5 (0x5UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL11_TXFNUM_TXFIFO6 (0x6UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL11_TXFNUM_TXFIFO7 (0x7UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL11_TXFNUM_TXFIFO8 (0x8UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL11_TXFNUM_TXFIFO9 (0x9UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL11_TXFNUM_TXFIFO10 (0xAUL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DIEPCTL11_TXFNUM_TXFIFO11 (0xBUL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DIEPCTL11_TXFNUM_TXFIFO12 (0xCUL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DIEPCTL11_TXFNUM_TXFIFO13 (0xDUL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DIEPCTL11_TXFNUM_TXFIFO14 (0xEUL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DIEPCTL11_TXFNUM_TXFIFO15 (0xFUL) /*!< (unspecified)                                                       */

/* CNAK @Bit 26 : Clear NAK (CNAK) */
  #define USBHSCORE_DIEPCTL11_CNAK_Pos (26UL)        /*!< Position of CNAK field.                                              */
  #define USBHSCORE_DIEPCTL11_CNAK_Msk (0x1UL << USBHSCORE_DIEPCTL11_CNAK_Pos) /*!< Bit mask of CNAK field.                    */
  #define USBHSCORE_DIEPCTL11_CNAK_Min (0x0UL)       /*!< Min enumerator value of CNAK field.                                  */
  #define USBHSCORE_DIEPCTL11_CNAK_Max (0x1UL)       /*!< Max enumerator value of CNAK field.                                  */
  #define USBHSCORE_DIEPCTL11_CNAK_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL11_CNAK_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* SNAK @Bit 27 : Set NAK (SNAK) */
  #define USBHSCORE_DIEPCTL11_SNAK_Pos (27UL)        /*!< Position of SNAK field.                                              */
  #define USBHSCORE_DIEPCTL11_SNAK_Msk (0x1UL << USBHSCORE_DIEPCTL11_SNAK_Pos) /*!< Bit mask of SNAK field.                    */
  #define USBHSCORE_DIEPCTL11_SNAK_Min (0x0UL)       /*!< Min enumerator value of SNAK field.                                  */
  #define USBHSCORE_DIEPCTL11_SNAK_Max (0x1UL)       /*!< Max enumerator value of SNAK field.                                  */
  #define USBHSCORE_DIEPCTL11_SNAK_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL11_SNAK_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* SETD0PID @Bit 28 : SetD0PID */
  #define USBHSCORE_DIEPCTL11_SETD0PID_Pos (28UL)    /*!< Position of SETD0PID field.                                          */
  #define USBHSCORE_DIEPCTL11_SETD0PID_Msk (0x1UL << USBHSCORE_DIEPCTL11_SETD0PID_Pos) /*!< Bit mask of SETD0PID field.        */
  #define USBHSCORE_DIEPCTL11_SETD0PID_Min (0x0UL)   /*!< Min enumerator value of SETD0PID field.                              */
  #define USBHSCORE_DIEPCTL11_SETD0PID_Max (0x1UL)   /*!< Max enumerator value of SETD0PID field.                              */
  #define USBHSCORE_DIEPCTL11_SETD0PID_DISABLED (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DIEPCTL11_SETD0PID_ENABLED (0x1UL) /*!< (unspecified)                                                      */

/* SETD1PID @Bit 29 : SetD1PID */
  #define USBHSCORE_DIEPCTL11_SETD1PID_Pos (29UL)    /*!< Position of SETD1PID field.                                          */
  #define USBHSCORE_DIEPCTL11_SETD1PID_Msk (0x1UL << USBHSCORE_DIEPCTL11_SETD1PID_Pos) /*!< Bit mask of SETD1PID field.        */
  #define USBHSCORE_DIEPCTL11_SETD1PID_Min (0x0UL)   /*!< Min enumerator value of SETD1PID field.                              */
  #define USBHSCORE_DIEPCTL11_SETD1PID_Max (0x1UL)   /*!< Max enumerator value of SETD1PID field.                              */
  #define USBHSCORE_DIEPCTL11_SETD1PID_DISABLED (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DIEPCTL11_SETD1PID_ENABLED (0x1UL) /*!< (unspecified)                                                      */

/* EPDIS @Bit 30 : Endpoint Disable (EPDis) */
  #define USBHSCORE_DIEPCTL11_EPDIS_Pos (30UL)       /*!< Position of EPDIS field.                                             */
  #define USBHSCORE_DIEPCTL11_EPDIS_Msk (0x1UL << USBHSCORE_DIEPCTL11_EPDIS_Pos) /*!< Bit mask of EPDIS field.                 */
  #define USBHSCORE_DIEPCTL11_EPDIS_Min (0x0UL)      /*!< Min enumerator value of EPDIS field.                                 */
  #define USBHSCORE_DIEPCTL11_EPDIS_Max (0x1UL)      /*!< Max enumerator value of EPDIS field.                                 */
  #define USBHSCORE_DIEPCTL11_EPDIS_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL11_EPDIS_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* EPENA @Bit 31 : Endpoint Enable (EPEna) */
  #define USBHSCORE_DIEPCTL11_EPENA_Pos (31UL)       /*!< Position of EPENA field.                                             */
  #define USBHSCORE_DIEPCTL11_EPENA_Msk (0x1UL << USBHSCORE_DIEPCTL11_EPENA_Pos) /*!< Bit mask of EPENA field.                 */
  #define USBHSCORE_DIEPCTL11_EPENA_Min (0x0UL)      /*!< Min enumerator value of EPENA field.                                 */
  #define USBHSCORE_DIEPCTL11_EPENA_Max (0x1UL)      /*!< Max enumerator value of EPENA field.                                 */
  #define USBHSCORE_DIEPCTL11_EPENA_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL11_EPENA_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */


