adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* MPS @Bits 0..1 : Maximum Packet Size (MPS) */
  #define USBHSCORE_DOEPCTL0_MPS_Pos (0UL)           /*!< Position of MPS field.                                               */
  #define USBHSCORE_DOEPCTL0_MPS_Msk (0x3UL << USBHSCORE_DOEPCTL0_MPS_Pos) /*!< Bit mask of MPS field.                         */
  #define USBHSCORE_DOEPCTL0_MPS_Min (0x0UL)         /*!< Min enumerator value of MPS field.                                   */
  #define USBHSCORE_DOEPCTL0_MPS_Max (0x3UL)         /*!< Max enumerator value of MPS field.                                   */
  #define USBHSCORE_DOEPCTL0_MPS_BYTE64 (0x0UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL0_MPS_BYTE32 (0x1UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL0_MPS_BYTE16 (0x2UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL0_MPS_BYTE8 (0x3UL)       /*!< (unspecified)                                                        */

/* USBACTEP @Bit 15 : USB Active Endpoint (USBActEP) */
  #define USBHSCORE_DOEPCTL0_USBACTEP_Pos (15UL)     /*!< Position of USBACTEP field.                                          */
  #define USBHSCORE_DOEPCTL0_USBACTEP_Msk (0x1UL << USBHSCORE_DOEPCTL0_USBACTEP_Pos) /*!< Bit mask of USBACTEP field.          */
  #define USBHSCORE_DOEPCTL0_USBACTEP_Min (0x1UL)    /*!< Min enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DOEPCTL0_USBACTEP_Max (0x1UL)    /*!< Max enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DOEPCTL0_USBACTEP_ACTIVE (0x1UL) /*!< (unspecified)                                                        */

/* NAKSTS @Bit 17 : NAK Status (NAKSts) */
  #define USBHSCORE_DOEPCTL0_NAKSTS_Pos (17UL)       /*!< Position of NAKSTS field.                                            */
  #define USBHSCORE_DOEPCTL0_NAKSTS_Msk (0x1UL << USBHSCORE_DOEPCTL0_NAKSTS_Pos) /*!< Bit mask of NAKSTS field.                */
  #define USBHSCORE_DOEPCTL0_NAKSTS_Min (0x0UL)      /*!< Min enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DOEPCTL0_NAKSTS_Max (0x1UL)      /*!< Max enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DOEPCTL0_NAKSTS_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL0_NAKSTS_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_DOEPCTL0_EPTYPE_Pos (18UL)       /*!< Position of EPTYPE field.                                            */
  #define USBHSCORE_DOEPCTL0_EPTYPE_Msk (0x3UL << USBHSCORE_DOEPCTL0_EPTYPE_Pos) /*!< Bit mask of EPTYPE field.                */
  #define USBHSCORE_DOEPCTL0_EPTYPE_Min (0x0UL)      /*!< Min enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DOEPCTL0_EPTYPE_Max (0x0UL)      /*!< Max enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DOEPCTL0_EPTYPE_ACTIVE (0x0UL)   /*!< (unspecified)                                                        */

/* STALL @Bit 21 : STALL Handshake (Stall) */
  #define USBHSCORE_DOEPCTL0_STALL_Pos (21UL)        /*!< Position of STALL field.                                             */
  #define USBHSCORE_DOEPCTL0_STALL_Msk (0x1UL << USBHSCORE_DOEPCTL0_STALL_Pos) /*!< Bit mask of STALL field.                   */
  #define USBHSCORE_DOEPCTL0_STALL_Min (0x0UL)       /*!< Min enumerator value of STALL field.                                 */
  #define USBHSCORE_DOEPCTL0_STALL_Max (0x1UL)       /*!< Max enumerator value of STALL field.                                 */
  #define USBHSCORE_DOEPCTL0_STALL_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL0_STALL_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* CNAK @Bit 26 : Clear NAK (CNAK) */
  #define USBHSCORE_DOEPCTL0_CNAK_Pos (26UL)         /*!< Position of CNAK field.                                              */
  #define USBHSCORE_DOEPCTL0_CNAK_Msk (0x1UL << USBHSCORE_DOEPCTL0_CNAK_Pos) /*!< Bit mask of CNAK field.                      */
  #define USBHSCORE_DOEPCTL0_CNAK_Min (0x0UL)        /*!< Min enumerator value of CNAK field.                                  */
  #define USBHSCORE_DOEPCTL0_CNAK_Max (0x1UL)        /*!< Max enumerator value of CNAK field.                                  */
  #define USBHSCORE_DOEPCTL0_CNAK_NOCLEAR (0x0UL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL0_CNAK_CLEAR (0x1UL)      /*!< (unspecified)                                                        */

/* SNAK @Bit 27 : Set NAK (SNAK) */
  #define USBHSCORE_DOEPCTL0_SNAK_Pos (27UL)         /*!< Position of SNAK field.                                              */
  #define USBHSCORE_DOEPCTL0_SNAK_Msk (0x1UL << USBHSCORE_DOEPCTL0_SNAK_Pos) /*!< Bit mask of SNAK field.                      */
  #define USBHSCORE_DOEPCTL0_SNAK_Min (0x0UL)        /*!< Min enumerator value of SNAK field.                                  */
  #define USBHSCORE_DOEPCTL0_SNAK_Max (0x1UL)        /*!< Max enumerator value of SNAK field.                                  */
  #define USBHSCORE_DOEPCTL0_SNAK_NOSET (0x0UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL0_SNAK_SET (0x1UL)        /*!< (unspecified)                                                        */

/* EPDIS @Bit 30 : Endpoint Disable (EPDis) */
  #define USBHSCORE_DOEPCTL0_EPDIS_Pos (30UL)        /*!< Position of EPDIS field.                                             */
  #define USBHSCORE_DOEPCTL0_EPDIS_Msk (0x1UL << USBHSCORE_DOEPCTL0_EPDIS_Pos) /*!< Bit mask of EPDIS field.                   */
  #define USBHSCORE_DOEPCTL0_EPDIS_Min (0x0UL)       /*!< Min enumerator value of EPDIS field.                                 */
  #define USBHSCORE_DOEPCTL0_EPDIS_Max (0x0UL)       /*!< Max enumerator value of EPDIS field.                                 */
  #define USBHSCORE_DOEPCTL0_EPDIS_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */

/* EPENA @Bit 31 : Endpoint Enable (EPEna) */
  #define USBHSCORE_DOEPCTL0_EPENA_Pos (31UL)        /*!< Position of EPENA field.                                             */
  #define USBHSCORE_DOEPCTL0_EPENA_Msk (0x1UL << USBHSCORE_DOEPCTL0_EPENA_Pos) /*!< Bit mask of EPENA field.                   */
  #define USBHSCORE_DOEPCTL0_EPENA_Min (0x0UL)       /*!< Min enumerator value of EPENA field.                                 */
  #define USBHSCORE_DOEPCTL0_EPENA_Max (0x1UL)       /*!< Max enumerator value of EPENA field.                                 */
  #define USBHSCORE_DOEPCTL0_EPENA_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL0_EPENA_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */


/* USBHSCORE_DOEPINT0: Device OUT Endpoint 0 Interrupt Register */
  #define USBHSCORE_DOEPINT0_ResetValue (0x00000000UL) /*!< Reset value of DOEPINT0 register.                                  */

/* XFERCOMPL @Bit 0 : Transfer Completed Interrupt (XferCompl) */
  #define USBHSCORE_DOEPINT0_XFERCOMPL_Pos (0UL)     /*!< Position of XFERCOMPL field.                                         */
  #define USBHSCORE_DOEPINT0_XFERCOMPL_Msk (0x1UL << USBHSCORE_DOEPINT0_XFERCOMPL_Pos) /*!< Bit mask of XFERCOMPL field.       */
  #define USBHSCORE_DOEPINT0_XFERCOMPL_Min (0x0UL)   /*!< Min enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_DOEPINT0_XFERCOMPL_Max (0x1UL)   /*!< Max enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_DOEPINT0_XFERCOMPL_INACTIVE (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DOEPINT0_XFERCOMPL_ACTIVE (0x1UL) /*!< (unspecified)                                                       */

/* EPDISBLD @Bit 1 : Endpoint Disabled Interrupt (EPDisbld) */
  #define USBHSCORE_DOEPINT0_EPDISBLD_Pos (1UL)      /*!< Position of EPDISBLD field.                                          */
  #define USBHSCORE_DOEPINT0_EPDISBLD_Msk (0x1UL << USBHSCORE_DOEPINT0_EPDISBLD_Pos) /*!< Bit mask of EPDISBLD field.          */
  #define USBHSCORE_DOEPINT0_EPDISBLD_Min (0x0UL)    /*!< Min enumerator value of EPDISBLD field.                              */
  #define USBHSCORE_DOEPINT0_EPDISBLD_Max (0x1UL)    /*!< Max enumerator value of EPDISBLD field.                              */
  #define USBHSCORE_DOEPINT0_EPDISBLD_INACTIVE (0x0UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_DOEPINT0_EPDISBLD_ACTIVE (0x1UL) /*!< (unspecified)                                                        */

/* AHBERR @Bit 2 : AHB Error (AHBErr) */
  #define USBHSCORE_DOEPINT0_AHBERR_Pos (2UL)        /*!< Position of AHBERR field.                                            */
  #define USBHSCORE_DOEPINT0_AHBERR_Msk (0x1UL << USBHSCORE_DOEPINT0_AHBERR_Pos) /*!< Bit mask of AHBERR field.                */
  #define USBHSCORE_DOEPINT0_AHBERR_Min (0x0UL)      /*!< Min enumerator value of AHBERR field.                                */
  #define USBHSCORE_DOEPINT0_AHBERR_Max (0x1UL)      /*!< Max enumerator value of AHBERR field.                                */
  #define USBHSCORE_DOEPINT0_AHBERR_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPINT0_AHBERR_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* SETUP @Bit 3 : SETUP Phase Done (SetUp) */
  #define USBHSCORE_DOEPINT0_SETUP_Pos (3UL)         /*!< Position of SETUP field.                                             */
  #define USBHSCORE_DOEPINT0_SETUP_Msk (0x1UL << USBHSCORE_DOEPINT0_SETUP_Pos) /*!< Bit mask of SETUP field.                   */
  #define USBHSCORE_DOEPINT0_SETUP_Min (0x0UL)       /*!< Min enumerator value of SETUP field.                                 */
  #define USBHSCORE_DOEPINT0_SETUP_Max (0x1UL)       /*!< Max enumerator value of SETUP field.                                 */
  #define USBHSCORE_DOEPINT0_SETUP_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPINT0_SETUP_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* OUTTKNEPDIS @Bit 4 : OUT Token Received When Endpoint Disabled (OUTTknEPdis) */
  #define USBHSCORE_DOEPINT0_OUTTKNEPDIS_Pos (4UL)   /*!< Position of OUTTKNEPDIS field.                                       */
  #define USBHSCORE_DOEPINT0_OUTTKNEPDIS_Msk (0x1UL << USBHSCORE_DOEPINT0_OUTTKNEPDIS_Pos) /*!< Bit mask of OUTTKNEPDIS field. */
  #define USBHSCORE_DOEPINT0_OUTTKNEPDIS_Min (0x0UL) /*!< Min enumerator value of OUTTKNEPDIS field.                           */
  #define USBHSCORE_DOEPINT0_OUTTKNEPDIS_Max (0x1UL) /*!< Max enumerator value of OUTTKNEPDIS field.                           */
  #define USBHSCORE_DOEPINT0_OUTTKNEPDIS_INACTIVE (0x0UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_DOEPINT0_OUTTKNEPDIS_ACTIVE (0x1UL) /*!< (unspecified)                                                     */

/* STSPHSERCVD @Bit 5 : Status Phase Received for Control Write (StsPhseRcvd) */
  #define USBHSCORE_DOEPINT0_STSPHSERCVD_Pos (5UL)   /*!< Position of STSPHSERCVD field.                                       */
  #define USBHSCORE_DOEPINT0_STSPHSERCVD_Msk (0x1UL << USBHSCORE_DOEPINT0_STSPHSERCVD_Pos) /*!< Bit mask of STSPHSERCVD field. */
  #define USBHSCORE_DOEPINT0_STSPHSERCVD_Min (0x0UL) /*!< Min enumerator value of STSPHSERCVD field.                           */
  #define USBHSCORE_DOEPINT0_STSPHSERCVD_Max (0x1UL) /*!< Max enumerator value of STSPHSERCVD field.                           */
  #define USBHSCORE_DOEPINT0_STSPHSERCVD_INACTIVE (0x0UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_DOEPINT0_STSPHSERCVD_ACTIVE (0x1UL) /*!< (unspecified)                                                     */

/* BACK2BACKSETUP @Bit 6 : Back-to-Back SETUP Packets Received (Back2BackSETup) */
  #define USBHSCORE_DOEPINT0_BACK2BACKSETUP_Pos (6UL) /*!< Position of BACK2BACKSETUP field.                                   */
  #define USBHSCORE_DOEPINT0_BACK2BACKSETUP_Msk (0x1UL << USBHSCORE_DOEPINT0_BACK2BACKSETUP_Pos) /*!< Bit mask of BACK2BACKSETUP
                                                                            field.*/                                              
  #define USBHSCORE_DOEPINT0_BACK2BACKSETUP_Min (0x0UL) /*!< Min enumerator value of BACK2BACKSETUP field.                     */
  #define USBHSCORE_DOEPINT0_BACK2BACKSETUP_Max (0x1UL) /*!< Max enumerator value of BACK2BACKSETUP field.                     */
  #define USBHSCORE_DOEPINT0_BACK2BACKSETUP_INACTIVE (0x0UL) /*!< (unspecified)                                                */
  #define USBHSCORE_DOEPINT0_BACK2BACKSETUP_ACTIVE (0x1UL) /*!< (unspecified)                                                  */

/* OUTPKTERR @Bit 8 : OUT Packet Error (OutPktErr) */
  #define USBHSCORE_DOEPINT0_OUTPKTERR_Pos (8UL)     /*!< Position of OUTPKTERR field.                                         */
  #define USBHSCORE_DOEPINT0_OUTPKTERR_Msk (0x1UL << USBHSCORE_DOEPINT0_OUTPKTERR_Pos) /*!< Bit mask of OUTPKTERR field.       */
  #define USBHSCORE_DOEPINT0_OUTPKTERR_Min (0x0UL)   /*!< Min enumerator value of OUTPKTERR field.                             */
  #define USBHSCORE_DOEPINT0_OUTPKTERR_Max (0x1UL)   /*!< Max enumerator value of OUTPKTERR field.                             */
  #define USBHSCORE_DOEPINT0_OUTPKTERR_INACTIVE (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DOEPINT0_OUTPKTERR_ACTIVE (0x1UL) /*!< (unspecified)                                                       */

