adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* BNAINTR @Bit 9 : BNA (Buffer Not Available) Interrupt (BNAIntr) */
  #define USBHSCORE_DOEPINT2_BNAINTR_Pos (9UL)       /*!< Position of BNAINTR field.                                           */
  #define USBHSCORE_DOEPINT2_BNAINTR_Msk (0x1UL << USBHSCORE_DOEPINT2_BNAINTR_Pos) /*!< Bit mask of BNAINTR field.             */
  #define USBHSCORE_DOEPINT2_BNAINTR_Min (0x0UL)     /*!< Min enumerator value of BNAINTR field.                               */
  #define USBHSCORE_DOEPINT2_BNAINTR_Max (0x1UL)     /*!< Max enumerator value of BNAINTR field.                               */
  #define USBHSCORE_DOEPINT2_BNAINTR_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DOEPINT2_BNAINTR_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* PKTDRPSTS @Bit 11 : Packet Drop Status (PktDrpSts) */
  #define USBHSCORE_DOEPINT2_PKTDRPSTS_Pos (11UL)    /*!< Position of PKTDRPSTS field.                                         */
  #define USBHSCORE_DOEPINT2_PKTDRPSTS_Msk (0x1UL << USBHSCORE_DOEPINT2_PKTDRPSTS_Pos) /*!< Bit mask of PKTDRPSTS field.       */
  #define USBHSCORE_DOEPINT2_PKTDRPSTS_Min (0x0UL)   /*!< Min enumerator value of PKTDRPSTS field.                             */
  #define USBHSCORE_DOEPINT2_PKTDRPSTS_Max (0x1UL)   /*!< Max enumerator value of PKTDRPSTS field.                             */
  #define USBHSCORE_DOEPINT2_PKTDRPSTS_INACTIVE (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DOEPINT2_PKTDRPSTS_ACTIVE (0x1UL) /*!< (unspecified)                                                       */

/* BBLEERR @Bit 12 : NAK Interrupt (BbleErr) */
  #define USBHSCORE_DOEPINT2_BBLEERR_Pos (12UL)      /*!< Position of BBLEERR field.                                           */
  #define USBHSCORE_DOEPINT2_BBLEERR_Msk (0x1UL << USBHSCORE_DOEPINT2_BBLEERR_Pos) /*!< Bit mask of BBLEERR field.             */
  #define USBHSCORE_DOEPINT2_BBLEERR_Min (0x0UL)     /*!< Min enumerator value of BBLEERR field.                               */
  #define USBHSCORE_DOEPINT2_BBLEERR_Max (0x1UL)     /*!< Max enumerator value of BBLEERR field.                               */
  #define USBHSCORE_DOEPINT2_BBLEERR_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DOEPINT2_BBLEERR_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* NAKINTRPT @Bit 13 : NAK Interrupt (NAKInterrupt) */
  #define USBHSCORE_DOEPINT2_NAKINTRPT_Pos (13UL)    /*!< Position of NAKINTRPT field.                                         */
  #define USBHSCORE_DOEPINT2_NAKINTRPT_Msk (0x1UL << USBHSCORE_DOEPINT2_NAKINTRPT_Pos) /*!< Bit mask of NAKINTRPT field.       */
  #define USBHSCORE_DOEPINT2_NAKINTRPT_Min (0x0UL)   /*!< Min enumerator value of NAKINTRPT field.                             */
  #define USBHSCORE_DOEPINT2_NAKINTRPT_Max (0x1UL)   /*!< Max enumerator value of NAKINTRPT field.                             */
  #define USBHSCORE_DOEPINT2_NAKINTRPT_INACTIVE (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DOEPINT2_NAKINTRPT_ACTIVE (0x1UL) /*!< (unspecified)                                                       */

/* NYETINTRPT @Bit 14 : NYET Interrupt (NYETIntrpt) */
  #define USBHSCORE_DOEPINT2_NYETINTRPT_Pos (14UL)   /*!< Position of NYETINTRPT field.                                        */
  #define USBHSCORE_DOEPINT2_NYETINTRPT_Msk (0x1UL << USBHSCORE_DOEPINT2_NYETINTRPT_Pos) /*!< Bit mask of NYETINTRPT field.    */
  #define USBHSCORE_DOEPINT2_NYETINTRPT_Min (0x0UL)  /*!< Min enumerator value of NYETINTRPT field.                            */
  #define USBHSCORE_DOEPINT2_NYETINTRPT_Max (0x1UL)  /*!< Max enumerator value of NYETINTRPT field.                            */
  #define USBHSCORE_DOEPINT2_NYETINTRPT_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_DOEPINT2_NYETINTRPT_ACTIVE (0x1UL) /*!< (unspecified)                                                      */

/* STUPPKTRCVD @Bit 15 : Setup Packet Received */
  #define USBHSCORE_DOEPINT2_STUPPKTRCVD_Pos (15UL)  /*!< Position of STUPPKTRCVD field.                                       */
  #define USBHSCORE_DOEPINT2_STUPPKTRCVD_Msk (0x1UL << USBHSCORE_DOEPINT2_STUPPKTRCVD_Pos) /*!< Bit mask of STUPPKTRCVD field. */
  #define USBHSCORE_DOEPINT2_STUPPKTRCVD_Min (0x0UL) /*!< Min enumerator value of STUPPKTRCVD field.                           */
  #define USBHSCORE_DOEPINT2_STUPPKTRCVD_Max (0x1UL) /*!< Max enumerator value of STUPPKTRCVD field.                           */
  #define USBHSCORE_DOEPINT2_STUPPKTRCVD_NOT_RCVD (0x0UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_DOEPINT2_STUPPKTRCVD_RCVD (0x1UL) /*!< (unspecified)                                                       */


/* USBHSCORE_DOEPTSIZ2: Device OUT Endpoint 2 Transfer Size Register */
  #define USBHSCORE_DOEPTSIZ2_ResetValue (0x00000000UL) /*!< Reset value of DOEPTSIZ2 register.                                */

/* XFERSIZE @Bits 0..18 : Transfer Size (XferSize) */
  #define USBHSCORE_DOEPTSIZ2_XFERSIZE_Pos (0UL)     /*!< Position of XFERSIZE field.                                          */
  #define USBHSCORE_DOEPTSIZ2_XFERSIZE_Msk (0x7FFFFUL << USBHSCORE_DOEPTSIZ2_XFERSIZE_Pos) /*!< Bit mask of XFERSIZE field.    */

/* PKTCNT @Bits 19..28 : Packet Count (PktCnt) */
  #define USBHSCORE_DOEPTSIZ2_PKTCNT_Pos (19UL)      /*!< Position of PKTCNT field.                                            */
  #define USBHSCORE_DOEPTSIZ2_PKTCNT_Msk (0x3FFUL << USBHSCORE_DOEPTSIZ2_PKTCNT_Pos) /*!< Bit mask of PKTCNT field.            */

/* RXDPID @Bits 29..30 : RxDPID */
  #define USBHSCORE_DOEPTSIZ2_RXDPID_Pos (29UL)      /*!< Position of RXDPID field.                                            */
  #define USBHSCORE_DOEPTSIZ2_RXDPID_Msk (0x3UL << USBHSCORE_DOEPTSIZ2_RXDPID_Pos) /*!< Bit mask of RXDPID field.              */
  #define USBHSCORE_DOEPTSIZ2_RXDPID_Min (0x0UL)     /*!< Min enumerator value of RXDPID field.                                */
  #define USBHSCORE_DOEPTSIZ2_RXDPID_Max (0x3UL)     /*!< Max enumerator value of RXDPID field.                                */
  #define USBHSCORE_DOEPTSIZ2_RXDPID_DATA0 (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPTSIZ2_RXDPID_DATA2PACKET1 (0x1UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_DOEPTSIZ2_RXDPID_DATA1PACKET2 (0x2UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_DOEPTSIZ2_RXDPID_MDATAPACKET3 (0x3UL) /*!< (unspecified)                                                   */


/* USBHSCORE_DOEPDMA2: Device OUT Endpoint 2 DMA Address Register */
  #define USBHSCORE_DOEPDMA2_ResetValue (0x00000000UL) /*!< Reset value of DOEPDMA2 register.                                  */

/* DMAADDR @Bits 0..31 : Holds the start address of the external memory for storing or fetching endpoint */
  #define USBHSCORE_DOEPDMA2_DMAADDR_Pos (0UL)       /*!< Position of DMAADDR field.                                           */
  #define USBHSCORE_DOEPDMA2_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DOEPDMA2_DMAADDR_Pos) /*!< Bit mask of DMAADDR field.      */


/* USBHSCORE_DOEPCTL3: Device Control OUT Endpoint 3 Control Register */
  #define USBHSCORE_DOEPCTL3_ResetValue (0x00000000UL) /*!< Reset value of DOEPCTL3 register.                                  */

