adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* USBHSCORE_DOEPDMA14: Device OUT Endpoint 14 DMA Address Register */
  #define USBHSCORE_DOEPDMA14_ResetValue (0x00000000UL) /*!< Reset value of DOEPDMA14 register.                                */

/* DMAADDR @Bits 0..31 : Holds the start address of the external memory for storing or fetching endpoint */
  #define USBHSCORE_DOEPDMA14_DMAADDR_Pos (0UL)      /*!< Position of DMAADDR field.                                           */
  #define USBHSCORE_DOEPDMA14_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DOEPDMA14_DMAADDR_Pos) /*!< Bit mask of DMAADDR field.    */


/* USBHSCORE_DOEPCTL15: Device Control OUT Endpoint 15 Control Register */
  #define USBHSCORE_DOEPCTL15_ResetValue (0x00000000UL) /*!< Reset value of DOEPCTL15 register.                                */

/* MPS @Bits 0..10 : Maximum Packet Size (MPS) */
  #define USBHSCORE_DOEPCTL15_MPS_Pos (0UL)          /*!< Position of MPS field.                                               */
  #define USBHSCORE_DOEPCTL15_MPS_Msk (0x7FFUL << USBHSCORE_DOEPCTL15_MPS_Pos) /*!< Bit mask of MPS field.                     */

/* USBACTEP @Bit 15 : USB Active Endpoint (USBActEP) */
  #define USBHSCORE_DOEPCTL15_USBACTEP_Pos (15UL)    /*!< Position of USBACTEP field.                                          */
  #define USBHSCORE_DOEPCTL15_USBACTEP_Msk (0x1UL << USBHSCORE_DOEPCTL15_USBACTEP_Pos) /*!< Bit mask of USBACTEP field.        */
  #define USBHSCORE_DOEPCTL15_USBACTEP_Min (0x0UL)   /*!< Min enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DOEPCTL15_USBACTEP_Max (0x1UL)   /*!< Max enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DOEPCTL15_USBACTEP_DISABLED (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DOEPCTL15_USBACTEP_ENABLED (0x1UL) /*!< (unspecified)                                                      */

/* DPID @Bit 16 : Endpoint Data PID (DPID) */
  #define USBHSCORE_DOEPCTL15_DPID_Pos (16UL)        /*!< Position of DPID field.                                              */
  #define USBHSCORE_DOEPCTL15_DPID_Msk (0x1UL << USBHSCORE_DOEPCTL15_DPID_Pos) /*!< Bit mask of DPID field.                    */
  #define USBHSCORE_DOEPCTL15_DPID_Min (0x0UL)       /*!< Min enumerator value of DPID field.                                  */
  #define USBHSCORE_DOEPCTL15_DPID_Max (0x1UL)       /*!< Max enumerator value of DPID field.                                  */
  #define USBHSCORE_DOEPCTL15_DPID_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL15_DPID_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* NAKSTS @Bit 17 : NAK Status (NAKSts) */
  #define USBHSCORE_DOEPCTL15_NAKSTS_Pos (17UL)      /*!< Position of NAKSTS field.                                            */
  #define USBHSCORE_DOEPCTL15_NAKSTS_Msk (0x1UL << USBHSCORE_DOEPCTL15_NAKSTS_Pos) /*!< Bit mask of NAKSTS field.              */
  #define USBHSCORE_DOEPCTL15_NAKSTS_Min (0x0UL)     /*!< Min enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DOEPCTL15_NAKSTS_Max (0x1UL)     /*!< Max enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DOEPCTL15_NAKSTS_NONNAK (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL15_NAKSTS_NAK (0x1UL)     /*!< (unspecified)                                                        */

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_DOEPCTL15_EPTYPE_Pos (18UL)      /*!< Position of EPTYPE field.                                            */
  #define USBHSCORE_DOEPCTL15_EPTYPE_Msk (0x3UL << USBHSCORE_DOEPCTL15_EPTYPE_Pos) /*!< Bit mask of EPTYPE field.              */
  #define USBHSCORE_DOEPCTL15_EPTYPE_Min (0x0UL)     /*!< Min enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DOEPCTL15_EPTYPE_Max (0x3UL)     /*!< Max enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DOEPCTL15_EPTYPE_CONTROL (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL15_EPTYPE_ISOCHRONOUS (0x1UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_DOEPCTL15_EPTYPE_BULK (0x2UL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL15_EPTYPE_INTERRUPT (0x3UL) /*!< (unspecified)                                                      */

/* STALL @Bit 21 : STALL Handshake (Stall) */
  #define USBHSCORE_DOEPCTL15_STALL_Pos (21UL)       /*!< Position of STALL field.                                             */
  #define USBHSCORE_DOEPCTL15_STALL_Msk (0x1UL << USBHSCORE_DOEPCTL15_STALL_Pos) /*!< Bit mask of STALL field.                 */
  #define USBHSCORE_DOEPCTL15_STALL_Min (0x0UL)      /*!< Min enumerator value of STALL field.                                 */
  #define USBHSCORE_DOEPCTL15_STALL_Max (0x1UL)      /*!< Max enumerator value of STALL field.                                 */
  #define USBHSCORE_DOEPCTL15_STALL_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL15_STALL_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* CNAK @Bit 26 : Clear NAK (CNAK) */
  #define USBHSCORE_DOEPCTL15_CNAK_Pos (26UL)        /*!< Position of CNAK field.                                              */
  #define USBHSCORE_DOEPCTL15_CNAK_Msk (0x1UL << USBHSCORE_DOEPCTL15_CNAK_Pos) /*!< Bit mask of CNAK field.                    */
  #define USBHSCORE_DOEPCTL15_CNAK_Min (0x0UL)       /*!< Min enumerator value of CNAK field.                                  */
  #define USBHSCORE_DOEPCTL15_CNAK_Max (0x1UL)       /*!< Max enumerator value of CNAK field.                                  */
  #define USBHSCORE_DOEPCTL15_CNAK_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL15_CNAK_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* SNAK @Bit 27 : Set NAK (SNAK) */
  #define USBHSCORE_DOEPCTL15_SNAK_Pos (27UL)        /*!< Position of SNAK field.                                              */
  #define USBHSCORE_DOEPCTL15_SNAK_Msk (0x1UL << USBHSCORE_DOEPCTL15_SNAK_Pos) /*!< Bit mask of SNAK field.                    */
  #define USBHSCORE_DOEPCTL15_SNAK_Min (0x0UL)       /*!< Min enumerator value of SNAK field.                                  */
  #define USBHSCORE_DOEPCTL15_SNAK_Max (0x1UL)       /*!< Max enumerator value of SNAK field.                                  */
  #define USBHSCORE_DOEPCTL15_SNAK_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL15_SNAK_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

