adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SETD0PID @Bit 28 : Set DATA0 PID (SetD0PID) */
  #define USBHSCORE_DOEPCTL15_SETD0PID_Pos (28UL)    /*!< Position of SETD0PID field.                                          */
  #define USBHSCORE_DOEPCTL15_SETD0PID_Msk (0x1UL << USBHSCORE_DOEPCTL15_SETD0PID_Pos) /*!< Bit mask of SETD0PID field.        */
  #define USBHSCORE_DOEPCTL15_SETD0PID_Min (0x0UL)   /*!< Min enumerator value of SETD0PID field.                              */
  #define USBHSCORE_DOEPCTL15_SETD0PID_Max (0x1UL)   /*!< Max enumerator value of SETD0PID field.                              */
  #define USBHSCORE_DOEPCTL15_SETD0PID_DISABLED (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DOEPCTL15_SETD0PID_ENABLED (0x1UL) /*!< (unspecified)                                                      */

/* SETD1PID @Bit 29 : Set DATA1 PID (SetD1PID) */
  #define USBHSCORE_DOEPCTL15_SETD1PID_Pos (29UL)    /*!< Position of SETD1PID field.                                          */
  #define USBHSCORE_DOEPCTL15_SETD1PID_Msk (0x1UL << USBHSCORE_DOEPCTL15_SETD1PID_Pos) /*!< Bit mask of SETD1PID field.        */
  #define USBHSCORE_DOEPCTL15_SETD1PID_Min (0x0UL)   /*!< Min enumerator value of SETD1PID field.                              */
  #define USBHSCORE_DOEPCTL15_SETD1PID_Max (0x1UL)   /*!< Max enumerator value of SETD1PID field.                              */
  #define USBHSCORE_DOEPCTL15_SETD1PID_DISABLED (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DOEPCTL15_SETD1PID_ENABLED (0x1UL) /*!< (unspecified)                                                      */

/* EPDIS @Bit 30 : Endpoint Disable (EPDis) */
  #define USBHSCORE_DOEPCTL15_EPDIS_Pos (30UL)       /*!< Position of EPDIS field.                                             */
  #define USBHSCORE_DOEPCTL15_EPDIS_Msk (0x1UL << USBHSCORE_DOEPCTL15_EPDIS_Pos) /*!< Bit mask of EPDIS field.                 */
  #define USBHSCORE_DOEPCTL15_EPDIS_Min (0x0UL)      /*!< Min enumerator value of EPDIS field.                                 */
  #define USBHSCORE_DOEPCTL15_EPDIS_Max (0x1UL)      /*!< Max enumerator value of EPDIS field.                                 */
  #define USBHSCORE_DOEPCTL15_EPDIS_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL15_EPDIS_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* EPENA @Bit 31 : Endpoint Enable (EPEna) */
  #define USBHSCORE_DOEPCTL15_EPENA_Pos (31UL)       /*!< Position of EPENA field.                                             */
  #define USBHSCORE_DOEPCTL15_EPENA_Msk (0x1UL << USBHSCORE_DOEPCTL15_EPENA_Pos) /*!< Bit mask of EPENA field.                 */
  #define USBHSCORE_DOEPCTL15_EPENA_Min (0x0UL)      /*!< Min enumerator value of EPENA field.                                 */
  #define USBHSCORE_DOEPCTL15_EPENA_Max (0x1UL)      /*!< Max enumerator value of EPENA field.                                 */
  #define USBHSCORE_DOEPCTL15_EPENA_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL15_EPENA_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */


/* USBHSCORE_DOEPINT15: Device OUT Endpoint 15 Interrupt Register */
  #define USBHSCORE_DOEPINT15_ResetValue (0x00000000UL) /*!< Reset value of DOEPINT15 register.                                */

/* XFERCOMPL @Bit 0 : Transfer Completed Interrupt (XferCompl) */
  #define USBHSCORE_DOEPINT15_XFERCOMPL_Pos (0UL)    /*!< Position of XFERCOMPL field.                                         */
  #define USBHSCORE_DOEPINT15_XFERCOMPL_Msk (0x1UL << USBHSCORE_DOEPINT15_XFERCOMPL_Pos) /*!< Bit mask of XFERCOMPL field.     */
  #define USBHSCORE_DOEPINT15_XFERCOMPL_Min (0x0UL)  /*!< Min enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_DOEPINT15_XFERCOMPL_Max (0x1UL)  /*!< Max enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_DOEPINT15_XFERCOMPL_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_DOEPINT15_XFERCOMPL_ACTIVE (0x1UL) /*!< (unspecified)                                                      */

/* EPDISBLD @Bit 1 : Endpoint Disabled Interrupt (EPDisbld) */
  #define USBHSCORE_DOEPINT15_EPDISBLD_Pos (1UL)     /*!< Position of EPDISBLD field.                                          */
  #define USBHSCORE_DOEPINT15_EPDISBLD_Msk (0x1UL << USBHSCORE_DOEPINT15_EPDISBLD_Pos) /*!< Bit mask of EPDISBLD field.        */
  #define USBHSCORE_DOEPINT15_EPDISBLD_Min (0x0UL)   /*!< Min enumerator value of EPDISBLD field.                              */
  #define USBHSCORE_DOEPINT15_EPDISBLD_Max (0x1UL)   /*!< Max enumerator value of EPDISBLD field.                              */
  #define USBHSCORE_DOEPINT15_EPDISBLD_INACTIVE (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DOEPINT15_EPDISBLD_ACTIVE (0x1UL) /*!< (unspecified)                                                       */

/* AHBERR @Bit 2 : AHB Error (AHBErr) */
  #define USBHSCORE_DOEPINT15_AHBERR_Pos (2UL)       /*!< Position of AHBERR field.                                            */
  #define USBHSCORE_DOEPINT15_AHBERR_Msk (0x1UL << USBHSCORE_DOEPINT15_AHBERR_Pos) /*!< Bit mask of AHBERR field.              */
  #define USBHSCORE_DOEPINT15_AHBERR_Min (0x0UL)     /*!< Min enumerator value of AHBERR field.                                */
  #define USBHSCORE_DOEPINT15_AHBERR_Max (0x1UL)     /*!< Max enumerator value of AHBERR field.                                */
  #define USBHSCORE_DOEPINT15_AHBERR_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DOEPINT15_AHBERR_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* SETUP @Bit 3 : SETUP Phase Done (SetUp) */
  #define USBHSCORE_DOEPINT15_SETUP_Pos (3UL)        /*!< Position of SETUP field.                                             */
  #define USBHSCORE_DOEPINT15_SETUP_Msk (0x1UL << USBHSCORE_DOEPINT15_SETUP_Pos) /*!< Bit mask of SETUP field.                 */
  #define USBHSCORE_DOEPINT15_SETUP_Min (0x0UL)      /*!< Min enumerator value of SETUP field.                                 */
  #define USBHSCORE_DOEPINT15_SETUP_Max (0x1UL)      /*!< Max enumerator value of SETUP field.                                 */
  #define USBHSCORE_DOEPINT15_SETUP_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPINT15_SETUP_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* OUTTKNEPDIS @Bit 4 : OUT Token Received When Endpoint Disabled (OUTTknEPdis) */
  #define USBHSCORE_DOEPINT15_OUTTKNEPDIS_Pos (4UL)  /*!< Position of OUTTKNEPDIS field.                                       */
  #define USBHSCORE_DOEPINT15_OUTTKNEPDIS_Msk (0x1UL << USBHSCORE_DOEPINT15_OUTTKNEPDIS_Pos) /*!< Bit mask of OUTTKNEPDIS
                                                                            field.*/                                              
  #define USBHSCORE_DOEPINT15_OUTTKNEPDIS_Min (0x0UL) /*!< Min enumerator value of OUTTKNEPDIS field.                          */
  #define USBHSCORE_DOEPINT15_OUTTKNEPDIS_Max (0x1UL) /*!< Max enumerator value of OUTTKNEPDIS field.                          */
  #define USBHSCORE_DOEPINT15_OUTTKNEPDIS_INACTIVE (0x0UL) /*!< (unspecified)                                                  */
  #define USBHSCORE_DOEPINT15_OUTTKNEPDIS_ACTIVE (0x1UL) /*!< (unspecified)                                                    */

/* STSPHSERCVD @Bit 5 : Status Phase Received for Control Write (StsPhseRcvd) */
  #define USBHSCORE_DOEPINT15_STSPHSERCVD_Pos (5UL)  /*!< Position of STSPHSERCVD field.                                       */
  #define USBHSCORE_DOEPINT15_STSPHSERCVD_Msk (0x1UL << USBHSCORE_DOEPINT15_STSPHSERCVD_Pos) /*!< Bit mask of STSPHSERCVD
                                                                            field.*/                                              
  #define USBHSCORE_DOEPINT15_STSPHSERCVD_Min (0x0UL) /*!< Min enumerator value of STSPHSERCVD field.                          */
  #define USBHSCORE_DOEPINT15_STSPHSERCVD_Max (0x1UL) /*!< Max enumerator value of STSPHSERCVD field.                          */
  #define USBHSCORE_DOEPINT15_STSPHSERCVD_INACTIVE (0x0UL) /*!< (unspecified)                                                  */
  #define USBHSCORE_DOEPINT15_STSPHSERCVD_ACTIVE (0x1UL) /*!< (unspecified)                                                    */

/* BACK2BACKSETUP @Bit 6 : Back-to-Back SETUP Packets Received (Back2BackSETup) */
  #define USBHSCORE_DOEPINT15_BACK2BACKSETUP_Pos (6UL) /*!< Position of BACK2BACKSETUP field.                                  */
  #define USBHSCORE_DOEPINT15_BACK2BACKSETUP_Msk (0x1UL << USBHSCORE_DOEPINT15_BACK2BACKSETUP_Pos) /*!< Bit mask of
                                                                            BACK2BACKSETUP field.*/                               
  #define USBHSCORE_DOEPINT15_BACK2BACKSETUP_Min (0x0UL) /*!< Min enumerator value of BACK2BACKSETUP field.                    */
  #define USBHSCORE_DOEPINT15_BACK2BACKSETUP_Max (0x1UL) /*!< Max enumerator value of BACK2BACKSETUP field.                    */
  #define USBHSCORE_DOEPINT15_BACK2BACKSETUP_INACTIVE (0x0UL) /*!< (unspecified)                                               */
  #define USBHSCORE_DOEPINT15_BACK2BACKSETUP_ACTIVE (0x1UL) /*!< (unspecified)                                                 */

/* OUTPKTERR @Bit 8 : OUT Packet Error (OutPktErr) */
  #define USBHSCORE_DOEPINT15_OUTPKTERR_Pos (8UL)    /*!< Position of OUTPKTERR field.                                         */
  #define USBHSCORE_DOEPINT15_OUTPKTERR_Msk (0x1UL << USBHSCORE_DOEPINT15_OUTPKTERR_Pos) /*!< Bit mask of OUTPKTERR field.     */
  #define USBHSCORE_DOEPINT15_OUTPKTERR_Min (0x0UL)  /*!< Min enumerator value of OUTPKTERR field.                             */
  #define USBHSCORE_DOEPINT15_OUTPKTERR_Max (0x1UL)  /*!< Max enumerator value of OUTPKTERR field.                             */
  #define USBHSCORE_DOEPINT15_OUTPKTERR_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_DOEPINT15_OUTPKTERR_ACTIVE (0x1UL) /*!< (unspecified)                                                      */

