adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* BNAINTR @Bit 9 : BNA (Buffer Not Available) Interrupt (BNAIntr) */
  #define USBHSCORE_DOEPINT15_BNAINTR_Pos (9UL)      /*!< Position of BNAINTR field.                                           */
  #define USBHSCORE_DOEPINT15_BNAINTR_Msk (0x1UL << USBHSCORE_DOEPINT15_BNAINTR_Pos) /*!< Bit mask of BNAINTR field.           */
  #define USBHSCORE_DOEPINT15_BNAINTR_Min (0x0UL)    /*!< Min enumerator value of BNAINTR field.                               */
  #define USBHSCORE_DOEPINT15_BNAINTR_Max (0x1UL)    /*!< Max enumerator value of BNAINTR field.                               */
  #define USBHSCORE_DOEPINT15_BNAINTR_INACTIVE (0x0UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_DOEPINT15_BNAINTR_ACTIVE (0x1UL) /*!< (unspecified)                                                        */

/* PKTDRPSTS @Bit 11 : Packet Drop Status (PktDrpSts) */
  #define USBHSCORE_DOEPINT15_PKTDRPSTS_Pos (11UL)   /*!< Position of PKTDRPSTS field.                                         */
  #define USBHSCORE_DOEPINT15_PKTDRPSTS_Msk (0x1UL << USBHSCORE_DOEPINT15_PKTDRPSTS_Pos) /*!< Bit mask of PKTDRPSTS field.     */
  #define USBHSCORE_DOEPINT15_PKTDRPSTS_Min (0x0UL)  /*!< Min enumerator value of PKTDRPSTS field.                             */
  #define USBHSCORE_DOEPINT15_PKTDRPSTS_Max (0x1UL)  /*!< Max enumerator value of PKTDRPSTS field.                             */
  #define USBHSCORE_DOEPINT15_PKTDRPSTS_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_DOEPINT15_PKTDRPSTS_ACTIVE (0x1UL) /*!< (unspecified)                                                      */

/* BBLEERR @Bit 12 : NAK Interrupt (BbleErr) */
  #define USBHSCORE_DOEPINT15_BBLEERR_Pos (12UL)     /*!< Position of BBLEERR field.                                           */
  #define USBHSCORE_DOEPINT15_BBLEERR_Msk (0x1UL << USBHSCORE_DOEPINT15_BBLEERR_Pos) /*!< Bit mask of BBLEERR field.           */
  #define USBHSCORE_DOEPINT15_BBLEERR_Min (0x0UL)    /*!< Min enumerator value of BBLEERR field.                               */
  #define USBHSCORE_DOEPINT15_BBLEERR_Max (0x1UL)    /*!< Max enumerator value of BBLEERR field.                               */
  #define USBHSCORE_DOEPINT15_BBLEERR_INACTIVE (0x0UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_DOEPINT15_BBLEERR_ACTIVE (0x1UL) /*!< (unspecified)                                                        */

/* NAKINTRPT @Bit 13 : NAK Interrupt (NAKInterrupt) */
  #define USBHSCORE_DOEPINT15_NAKINTRPT_Pos (13UL)   /*!< Position of NAKINTRPT field.                                         */
  #define USBHSCORE_DOEPINT15_NAKINTRPT_Msk (0x1UL << USBHSCORE_DOEPINT15_NAKINTRPT_Pos) /*!< Bit mask of NAKINTRPT field.     */
  #define USBHSCORE_DOEPINT15_NAKINTRPT_Min (0x0UL)  /*!< Min enumerator value of NAKINTRPT field.                             */
  #define USBHSCORE_DOEPINT15_NAKINTRPT_Max (0x1UL)  /*!< Max enumerator value of NAKINTRPT field.                             */
  #define USBHSCORE_DOEPINT15_NAKINTRPT_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_DOEPINT15_NAKINTRPT_ACTIVE (0x1UL) /*!< (unspecified)                                                      */

/* NYETINTRPT @Bit 14 : NYET Interrupt (NYETIntrpt) */
  #define USBHSCORE_DOEPINT15_NYETINTRPT_Pos (14UL)  /*!< Position of NYETINTRPT field.                                        */
  #define USBHSCORE_DOEPINT15_NYETINTRPT_Msk (0x1UL << USBHSCORE_DOEPINT15_NYETINTRPT_Pos) /*!< Bit mask of NYETINTRPT field.  */
  #define USBHSCORE_DOEPINT15_NYETINTRPT_Min (0x0UL) /*!< Min enumerator value of NYETINTRPT field.                            */
  #define USBHSCORE_DOEPINT15_NYETINTRPT_Max (0x1UL) /*!< Max enumerator value of NYETINTRPT field.                            */
  #define USBHSCORE_DOEPINT15_NYETINTRPT_INACTIVE (0x0UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_DOEPINT15_NYETINTRPT_ACTIVE (0x1UL) /*!< (unspecified)                                                     */

/* STUPPKTRCVD @Bit 15 : Setup Packet Received */
  #define USBHSCORE_DOEPINT15_STUPPKTRCVD_Pos (15UL) /*!< Position of STUPPKTRCVD field.                                       */
  #define USBHSCORE_DOEPINT15_STUPPKTRCVD_Msk (0x1UL << USBHSCORE_DOEPINT15_STUPPKTRCVD_Pos) /*!< Bit mask of STUPPKTRCVD
                                                                            field.*/                                              
  #define USBHSCORE_DOEPINT15_STUPPKTRCVD_Min (0x0UL) /*!< Min enumerator value of STUPPKTRCVD field.                          */
  #define USBHSCORE_DOEPINT15_STUPPKTRCVD_Max (0x1UL) /*!< Max enumerator value of STUPPKTRCVD field.                          */
  #define USBHSCORE_DOEPINT15_STUPPKTRCVD_NOT_RCVD (0x0UL) /*!< (unspecified)                                                  */
  #define USBHSCORE_DOEPINT15_STUPPKTRCVD_RCVD (0x1UL) /*!< (unspecified)                                                      */


/* USBHSCORE_DOEPTSIZ15: Device OUT Endpoint 15 Transfer Size Register */
  #define USBHSCORE_DOEPTSIZ15_ResetValue (0x00000000UL) /*!< Reset value of DOEPTSIZ15 register.                              */

/* XFERSIZE @Bits 0..18 : Transfer Size (XferSize) */
  #define USBHSCORE_DOEPTSIZ15_XFERSIZE_Pos (0UL)    /*!< Position of XFERSIZE field.                                          */
  #define USBHSCORE_DOEPTSIZ15_XFERSIZE_Msk (0x7FFFFUL << USBHSCORE_DOEPTSIZ15_XFERSIZE_Pos) /*!< Bit mask of XFERSIZE field.  */

/* PKTCNT @Bits 19..28 : Packet Count (PktCnt) */
  #define USBHSCORE_DOEPTSIZ15_PKTCNT_Pos (19UL)     /*!< Position of PKTCNT field.                                            */
  #define USBHSCORE_DOEPTSIZ15_PKTCNT_Msk (0x3FFUL << USBHSCORE_DOEPTSIZ15_PKTCNT_Pos) /*!< Bit mask of PKTCNT field.          */

/* RXDPID @Bits 29..30 : RxDPID */
  #define USBHSCORE_DOEPTSIZ15_RXDPID_Pos (29UL)     /*!< Position of RXDPID field.                                            */
  #define USBHSCORE_DOEPTSIZ15_RXDPID_Msk (0x3UL << USBHSCORE_DOEPTSIZ15_RXDPID_Pos) /*!< Bit mask of RXDPID field.            */
  #define USBHSCORE_DOEPTSIZ15_RXDPID_Min (0x0UL)    /*!< Min enumerator value of RXDPID field.                                */
  #define USBHSCORE_DOEPTSIZ15_RXDPID_Max (0x3UL)    /*!< Max enumerator value of RXDPID field.                                */
  #define USBHSCORE_DOEPTSIZ15_RXDPID_DATA0 (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPTSIZ15_RXDPID_DATA2PACKET1 (0x1UL) /*!< (unspecified)                                                  */
  #define USBHSCORE_DOEPTSIZ15_RXDPID_DATA1PACKET2 (0x2UL) /*!< (unspecified)                                                  */
  #define USBHSCORE_DOEPTSIZ15_RXDPID_MDATAPACKET3 (0x3UL) /*!< (unspecified)                                                  */


/* USBHSCORE_DOEPDMA15: Device OUT Endpoint 15 DMA Address Register */
  #define USBHSCORE_DOEPDMA15_ResetValue (0x00000000UL) /*!< Reset value of DOEPDMA15 register.                                */

/* DMAADDR @Bits 0..31 : Holds the start address of the external memory for storing or fetching endpoint */
  #define USBHSCORE_DOEPDMA15_DMAADDR_Pos (0UL)      /*!< Position of DMAADDR field.                                           */
  #define USBHSCORE_DOEPDMA15_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DOEPDMA15_DMAADDR_Pos) /*!< Bit mask of DMAADDR field.    */


/* USBHSCORE_PCGCCTL: Power and Clock Gating Control Register */
  #define USBHSCORE_PCGCCTL_ResetValue (0x880A0000UL) /*!< Reset value of PCGCCTL register.                                    */

/* STOPPCLK @Bit 0 : Stop Pclk (StopPclk) */
  #define USBHSCORE_PCGCCTL_STOPPCLK_Pos (0UL)       /*!< Position of STOPPCLK field.                                          */
  #define USBHSCORE_PCGCCTL_STOPPCLK_Msk (0x1UL << USBHSCORE_PCGCCTL_STOPPCLK_Pos) /*!< Bit mask of STOPPCLK field.            */
  #define USBHSCORE_PCGCCTL_STOPPCLK_Min (0x0UL)     /*!< Min enumerator value of STOPPCLK field.                              */
  #define USBHSCORE_PCGCCTL_STOPPCLK_Max (0x1UL)     /*!< Max enumerator value of STOPPCLK field.                              */
  #define USBHSCORE_PCGCCTL_STOPPCLK_DISABLED (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_PCGCCTL_STOPPCLK_ENABLED (0x1UL) /*!< (unspecified)                                                        */

/* RSTPDWNMODULE @Bit 3 : Reset Power-Down Modules (RstPdwnModule) */
  #define USBHSCORE_PCGCCTL_RSTPDWNMODULE_Pos (3UL)  /*!< Position of RSTPDWNMODULE field.                                     */
  #define USBHSCORE_PCGCCTL_RSTPDWNMODULE_Msk (0x1UL << USBHSCORE_PCGCCTL_RSTPDWNMODULE_Pos) /*!< Bit mask of RSTPDWNMODULE
                                                                            field.*/                                              
  #define USBHSCORE_PCGCCTL_RSTPDWNMODULE_Min (0x0UL) /*!< Min enumerator value of RSTPDWNMODULE field.                        */
  #define USBHSCORE_PCGCCTL_RSTPDWNMODULE_Max (0x1UL) /*!< Max enumerator value of RSTPDWNMODULE field.                        */
  #define USBHSCORE_PCGCCTL_RSTPDWNMODULE_ON (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_PCGCCTL_RSTPDWNMODULE_OFF (0x1UL) /*!< (unspecified)                                                       */

/* ENBLL1GATING @Bit 5 : Enable Sleep Clock Gating */
  #define USBHSCORE_PCGCCTL_ENBLL1GATING_Pos (5UL)   /*!< Position of ENBLL1GATING field.                                      */
  #define USBHSCORE_PCGCCTL_ENBLL1GATING_Msk (0x1UL << USBHSCORE_PCGCCTL_ENBLL1GATING_Pos) /*!< Bit mask of ENBLL1GATING field.*/
  #define USBHSCORE_PCGCCTL_ENBLL1GATING_Min (0x0UL) /*!< Min enumerator value of ENBLL1GATING field.                          */
  #define USBHSCORE_PCGCCTL_ENBLL1GATING_Max (0x1UL) /*!< Max enumerator value of ENBLL1GATING field.                          */
  #define USBHSCORE_PCGCCTL_ENBLL1GATING_DISABLED (0x0UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_PCGCCTL_ENBLL1GATING_ENABLED (0x1UL) /*!< (unspecified)                                                    */

