adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PHYSLEEP @Bit 6 : PHY In Sleep */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_Pos (6UL)       /*!< Position of PHYSLEEP field.                                          */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_Msk (0x1UL << USBHSCORE_PCGCCTL_PHYSLEEP_Pos) /*!< Bit mask of PHYSLEEP field.            */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_Min (0x0UL)     /*!< Min enumerator value of PHYSLEEP field.                              */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_Max (0x1UL)     /*!< Max enumerator value of PHYSLEEP field.                              */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* L1SUSPENDED @Bit 7 : L1 Deep Sleep */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_Pos (7UL)    /*!< Position of L1SUSPENDED field.                                       */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_Msk (0x1UL << USBHSCORE_PCGCCTL_L1SUSPENDED_Pos) /*!< Bit mask of L1SUSPENDED field.   */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_Min (0x0UL)  /*!< Min enumerator value of L1SUSPENDED field.                           */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_Max (0x1UL)  /*!< Max enumerator value of L1SUSPENDED field.                           */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_ACTIVE (0x1UL) /*!< (unspecified)                                                      */

/* RESTOREMODE @Bit 9 : Restore Mode (RestoreMode) */
  #define USBHSCORE_PCGCCTL_RESTOREMODE_Pos (9UL)    /*!< Position of RESTOREMODE field.                                       */
  #define USBHSCORE_PCGCCTL_RESTOREMODE_Msk (0x1UL << USBHSCORE_PCGCCTL_RESTOREMODE_Pos) /*!< Bit mask of RESTOREMODE field.   */
  #define USBHSCORE_PCGCCTL_RESTOREMODE_Min (0x0UL)  /*!< Min enumerator value of RESTOREMODE field.                           */
  #define USBHSCORE_PCGCCTL_RESTOREMODE_Max (0x1UL)  /*!< Max enumerator value of RESTOREMODE field.                           */
  #define USBHSCORE_PCGCCTL_RESTOREMODE_DISABLED (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_PCGCCTL_RESTOREMODE_ENABLED (0x1UL) /*!< (unspecified)                                                     */

/* ESSREGRESTORED @Bit 13 : Essential Register Values Restored (EssRegRestored) */
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_Pos (13UL) /*!< Position of ESSREGRESTORED field.                                   */
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_Msk (0x1UL << USBHSCORE_PCGCCTL_ESSREGRESTORED_Pos) /*!< Bit mask of ESSREGRESTORED
                                                                            field.*/                                              
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_Min (0x0UL) /*!< Min enumerator value of ESSREGRESTORED field.                      */
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_Max (0x1UL) /*!< Max enumerator value of ESSREGRESTORED field.                      */
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_NOT_RESTORED (0x0UL) /*!< (unspecified)                                             */
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_RESTORED (0x1UL) /*!< (unspecified)                                                 */

/* RESTOREVALUE @Bits 14..31 : Restore Value (RestoreValue) */
  #define USBHSCORE_PCGCCTL_RESTOREVALUE_Pos (14UL)  /*!< Position of RESTOREVALUE field.                                      */
  #define USBHSCORE_PCGCCTL_RESTOREVALUE_Msk (0x3FFFFUL << USBHSCORE_PCGCCTL_RESTOREVALUE_Pos) /*!< Bit mask of RESTOREVALUE
                                                                            field.*/                                              


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          VDET1V0                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct VDET1V0_CONFIG ================================================== */
/**
  * @brief CONFIG [VDET1V0_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000000) Voltage detector configuration                        */
  __IOM uint32_t  PWRGOODLVL;                        /*!< (@ 0x00000004) Power good detector threshold voltage level           */
} NRF_VDET1V0_CONFIG_Type;                           /*!< Size = 8 (0x008)                                                     */

/* VDET1V0_CONFIG_CFG: Voltage detector configuration */
  #define VDET1V0_CONFIG_CFG_ResetValue (0x00000000UL) /*!< Reset value of CFG register.                                       */

/* PWRGOODHYST @Bit 0 : Power good detector hysteresis setting */
  #define VDET1V0_CONFIG_CFG_PWRGOODHYST_Pos (0UL)   /*!< Position of PWRGOODHYST field.                                       */
  #define VDET1V0_CONFIG_CFG_PWRGOODHYST_Msk (0x1UL << VDET1V0_CONFIG_CFG_PWRGOODHYST_Pos) /*!< Bit mask of PWRGOODHYST field. */
  #define VDET1V0_CONFIG_CFG_PWRGOODHYST_Min (0x0UL) /*!< Min enumerator value of PWRGOODHYST field.                           */
  #define VDET1V0_CONFIG_CFG_PWRGOODHYST_Max (0x1UL) /*!< Max enumerator value of PWRGOODHYST field.                           */
  #define VDET1V0_CONFIG_CFG_PWRGOODHYST_HystLow (0x0UL) /*!< Hysteresis is 1.16 percent of the configured PGD level           */
  #define VDET1V0_CONFIG_CFG_PWRGOODHYST_HystHigh (0x1UL) /*!< Hysteresis is 2.33 percent of the configured PGD level          */


/* VDET1V0_CONFIG_PWRGOODLVL: Power good detector threshold voltage level */
  #define VDET1V0_CONFIG_PWRGOODLVL_ResetValue (0x00000011UL) /*!< Reset value of PWRGOODLVL register.                         */

/* VAL @Bits 0..5 : Threshold voltage value */
  #define VDET1V0_CONFIG_PWRGOODLVL_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VDET1V0_CONFIG_PWRGOODLVL_VAL_Msk (0x3FUL << VDET1V0_CONFIG_PWRGOODLVL_VAL_Pos) /*!< Bit mask of VAL field.          */
  #define VDET1V0_CONFIG_PWRGOODLVL_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                        */
  #define VDET1V0_CONFIG_PWRGOODLVL_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                         */



/* =================================================== Struct VDET1V0_TRIM =================================================== */
/**
  * @brief TRIM [VDET1V0_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRGOOD;                           /*!< (@ 0x00000000) Power good detector trimming                          */
} NRF_VDET1V0_TRIM_Type;                             /*!< Size = 4 (0x004)                                                     */

/* VDET1V0_TRIM_PWRGOOD: Power good detector trimming */
  #define VDET1V0_TRIM_PWRGOOD_ResetValue (0x00000000UL) /*!< Reset value of PWRGOOD register.                                 */

