adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VAL @Bits 0..3 : Threshold voltage trimming value. */
  #define VDET1V0_TRIM_PWRGOOD_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define VDET1V0_TRIM_PWRGOOD_VAL_Msk (0xFUL << VDET1V0_TRIM_PWRGOOD_VAL_Pos) /*!< Bit mask of VAL field.                     */
  #define VDET1V0_TRIM_PWRGOOD_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                             */
  #define VDET1V0_TRIM_PWRGOOD_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                              */



/* ================================================= Struct VDET1V0_OVERRIDE ================================================= */
/**
  * @brief OVERRIDE [VDET1V0_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000008) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x0000000C) Override the SETTLED signal from the analog module    */
  __IOM uint32_t  PGD;                               /*!< (@ 0x00000010) Override the PGD signal from the analog module        */
} NRF_VDET1V0_OVERRIDE_Type;                         /*!< Size = 20 (0x014)                                                    */

/* VDET1V0_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define VDET1V0_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                 */

/* VAL @Bit 0 : Override value for the signal */
  #define VDET1V0_OVERRIDE_PWRUP_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define VDET1V0_OVERRIDE_PWRUP_VAL_Msk (0x1UL << VDET1V0_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define VDET1V0_OVERRIDE_PWRUP_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VDET1V0_OVERRIDE_PWRUP_EN_Msk (0x1UL << VDET1V0_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VDET1V0_OVERRIDE_PWRUP_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VDET1V0_OVERRIDE_PWRUP_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VDET1V0_OVERRIDE_PWRUP_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define VDET1V0_OVERRIDE_PWRUP_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */


/* VDET1V0_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define VDET1V0_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                               */

/* VAL @Bit 0 : Override value for the signal */
  #define VDET1V0_OVERRIDE_RETAIN_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VDET1V0_OVERRIDE_RETAIN_VAL_Msk (0x1UL << VDET1V0_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.               */

/* EN @Bit 31 : Enable the override */
  #define VDET1V0_OVERRIDE_RETAIN_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VDET1V0_OVERRIDE_RETAIN_EN_Msk (0x1UL << VDET1V0_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VDET1V0_OVERRIDE_RETAIN_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VDET1V0_OVERRIDE_RETAIN_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VDET1V0_OVERRIDE_RETAIN_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define VDET1V0_OVERRIDE_RETAIN_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */


/* VDET1V0_OVERRIDE_READY: Override the READY signal from the analog module */
  #define VDET1V0_OVERRIDE_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                                 */

/* VAL @Bit 0 : Current value of the signal */
  #define VDET1V0_OVERRIDE_READY_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define VDET1V0_OVERRIDE_READY_VAL_Msk (0x1UL << VDET1V0_OVERRIDE_READY_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define VDET1V0_OVERRIDE_READY_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VDET1V0_OVERRIDE_READY_EN_Msk (0x1UL << VDET1V0_OVERRIDE_READY_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VDET1V0_OVERRIDE_READY_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VDET1V0_OVERRIDE_READY_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VDET1V0_OVERRIDE_READY_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define VDET1V0_OVERRIDE_READY_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */


/* VDET1V0_OVERRIDE_SETTLED: Override the SETTLED signal from the analog module */
  #define VDET1V0_OVERRIDE_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of SETTLED register.                             */

/* VAL @Bit 0 : Current value of the signal */
  #define VDET1V0_OVERRIDE_SETTLED_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VDET1V0_OVERRIDE_SETTLED_VAL_Msk (0x1UL << VDET1V0_OVERRIDE_SETTLED_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VDET1V0_OVERRIDE_SETTLED_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDET1V0_OVERRIDE_SETTLED_EN_Msk (0x1UL << VDET1V0_OVERRIDE_SETTLED_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDET1V0_OVERRIDE_SETTLED_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDET1V0_OVERRIDE_SETTLED_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDET1V0_OVERRIDE_SETTLED_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VDET1V0_OVERRIDE_SETTLED_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


