adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VDET1V0_OVERRIDE_PGD: Override the PGD signal from the analog module */
  #define VDET1V0_OVERRIDE_PGD_ResetValue (0x00000000UL) /*!< Reset value of PGD register.                                     */

/* VAL @Bit 0 : Current value of the signal */
  #define VDET1V0_OVERRIDE_PGD_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define VDET1V0_OVERRIDE_PGD_VAL_Msk (0x1UL << VDET1V0_OVERRIDE_PGD_VAL_Pos) /*!< Bit mask of VAL field.                     */

/* EN @Bit 31 : Enable the override */
  #define VDET1V0_OVERRIDE_PGD_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define VDET1V0_OVERRIDE_PGD_EN_Msk (0x1UL << VDET1V0_OVERRIDE_PGD_EN_Pos) /*!< Bit mask of EN field.                        */
  #define VDET1V0_OVERRIDE_PGD_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define VDET1V0_OVERRIDE_PGD_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define VDET1V0_OVERRIDE_PGD_EN_Disabled (0x0UL)   /*!< Override is disabled                                                 */
  #define VDET1V0_OVERRIDE_PGD_EN_Enabled (0x1UL)    /*!< Override is enabled                                                  */



/* =================================================== Struct VDET1V0_DFT ==================================================== */
/**
  * @brief DFT [VDET1V0_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  DTB3CONFIG;                        /*!< (@ 0x0000001C) Digital Test Bus 3 (DTB3) configuration               */
  __IM  uint32_t  RESERVED2[4];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
} NRF_VDET1V0_DFT_Type;                              /*!< Size = 52 (0x034)                                                    */

/* VDET1V0_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define VDET1V0_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                            */

/* SELMUX @Bit 0 : Select multiplexer for ATB0 */
  #define VDET1V0_DFT_ATB0CONFIG_SELMUX_Pos (0UL)    /*!< Position of SELMUX field.                                            */
  #define VDET1V0_DFT_ATB0CONFIG_SELMUX_Msk (0x1UL << VDET1V0_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.        */
  #define VDET1V0_DFT_ATB0CONFIG_SELMUX_Min (0x0UL)  /*!< Min enumerator value of SELMUX field.                                */
  #define VDET1V0_DFT_ATB0CONFIG_SELMUX_Max (0x1UL)  /*!< Max enumerator value of SELMUX field.                                */
  #define VDET1V0_DFT_ATB0CONFIG_SELMUX_ConnectVSS (0x0UL) /*!< Connect VSS to ATB0                                            */
  #define VDET1V0_DFT_ATB0CONFIG_SELMUX_ConnectSenseVoltage (0x1UL) /*!< Use ATB0 as sense voltage instead of VDD_SENSE_1V0    */

/* EN @Bit 31 : Enable the analog test bus */
  #define VDET1V0_DFT_ATB0CONFIG_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VDET1V0_DFT_ATB0CONFIG_EN_Msk (0x1UL << VDET1V0_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VDET1V0_DFT_ATB0CONFIG_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VDET1V0_DFT_ATB0CONFIG_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VDET1V0_DFT_ATB0CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                          */
  #define VDET1V0_DFT_ATB0CONFIG_EN_Enabled (0x1UL)  /*!< Analog test bus is enabled                                           */


/* VDET1V0_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define VDET1V0_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                            */

/* EN @Bit 31 : Connect VREF_PGD to the analog test bus */
  #define VDET1V0_DFT_ATB1CONFIG_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VDET1V0_DFT_ATB1CONFIG_EN_Msk (0x1UL << VDET1V0_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VDET1V0_DFT_ATB1CONFIG_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VDET1V0_DFT_ATB1CONFIG_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VDET1V0_DFT_ATB1CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                          */
  #define VDET1V0_DFT_ATB1CONFIG_EN_Enabled (0x1UL)  /*!< Analog test bus is enabled                                           */


/* VDET1V0_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define VDET1V0_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                            */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB0 */
  #define VDET1V0_DFT_DTB0CONFIG_SELMUX_Pos (0UL)    /*!< Position of SELMUX field.                                            */
  #define VDET1V0_DFT_DTB0CONFIG_SELMUX_Msk (0x3UL << VDET1V0_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.        */
  #define VDET1V0_DFT_DTB0CONFIG_SELMUX_Min (0x0UL)  /*!< Min enumerator value of SELMUX field.                                */
  #define VDET1V0_DFT_DTB0CONFIG_SELMUX_Max (0x3UL)  /*!< Max enumerator value of SELMUX field.                                */
  #define VDET1V0_DFT_DTB0CONFIG_SELMUX_ReadyPgdSw (0x0UL) /*!< READY_PGD_SW_0V8                                               */
  #define VDET1V0_DFT_DTB0CONFIG_SELMUX_Settled (0x1UL) /*!< SETTLED_VDET1V0_AO_0V8                                            */
  #define VDET1V0_DFT_DTB0CONFIG_SELMUX_PgdCmp (0x2UL) /*!< PGD comparator output                                              */
  #define VDET1V0_DFT_DTB0CONFIG_SELMUX_PgdUnbuf (0x3UL) /*!< Unbuffered PGD, after deglitch filter                            */

