adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EVENTS_SETTLED @Bit 0 : Settled flag for MODE handshake */
  #define VDET1V0_EVENTS_SETTLED_EVENTS_SETTLED_Pos (0UL) /*!< Position of EVENTS_SETTLED field.                               */
  #define VDET1V0_EVENTS_SETTLED_EVENTS_SETTLED_Msk (0x1UL << VDET1V0_EVENTS_SETTLED_EVENTS_SETTLED_Pos) /*!< Bit mask of
                                                                            EVENTS_SETTLED field.*/                               
  #define VDET1V0_EVENTS_SETTLED_EVENTS_SETTLED_Min (0x0UL) /*!< Min enumerator value of EVENTS_SETTLED field.                 */
  #define VDET1V0_EVENTS_SETTLED_EVENTS_SETTLED_Max (0x1UL) /*!< Max enumerator value of EVENTS_SETTLED field.                 */
  #define VDET1V0_EVENTS_SETTLED_EVENTS_SETTLED_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define VDET1V0_EVENTS_SETTLED_EVENTS_SETTLED_Generated (0x1UL) /*!< Event generated                                         */


/* VDET1V0_EVENTS_PWRGOOD: Power good detector detected voltage above threshold level */
  #define VDET1V0_EVENTS_PWRGOOD_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PWRGOOD register.                        */

/* EVENTS_PWRGOOD @Bit 0 : Power good detector detected voltage above threshold level */
  #define VDET1V0_EVENTS_PWRGOOD_EVENTS_PWRGOOD_Pos (0UL) /*!< Position of EVENTS_PWRGOOD field.                               */
  #define VDET1V0_EVENTS_PWRGOOD_EVENTS_PWRGOOD_Msk (0x1UL << VDET1V0_EVENTS_PWRGOOD_EVENTS_PWRGOOD_Pos) /*!< Bit mask of
                                                                            EVENTS_PWRGOOD field.*/                               
  #define VDET1V0_EVENTS_PWRGOOD_EVENTS_PWRGOOD_Min (0x0UL) /*!< Min enumerator value of EVENTS_PWRGOOD field.                 */
  #define VDET1V0_EVENTS_PWRGOOD_EVENTS_PWRGOOD_Max (0x1UL) /*!< Max enumerator value of EVENTS_PWRGOOD field.                 */
  #define VDET1V0_EVENTS_PWRGOOD_EVENTS_PWRGOOD_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define VDET1V0_EVENTS_PWRGOOD_EVENTS_PWRGOOD_Generated (0x1UL) /*!< Event generated                                         */


/* VDET1V0_EVENTS_PWRNOTGOOD: Power good detector detected voltage below threshold level */
  #define VDET1V0_EVENTS_PWRNOTGOOD_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PWRNOTGOOD register.                  */

/* EVENTS_PWRNOTGOOD @Bit 0 : Power good detector detected voltage below threshold level */
  #define VDET1V0_EVENTS_PWRNOTGOOD_EVENTS_PWRNOTGOOD_Pos (0UL) /*!< Position of EVENTS_PWRNOTGOOD field.                      */
  #define VDET1V0_EVENTS_PWRNOTGOOD_EVENTS_PWRNOTGOOD_Msk (0x1UL << VDET1V0_EVENTS_PWRNOTGOOD_EVENTS_PWRNOTGOOD_Pos) /*!< Bit
                                                                            mask of EVENTS_PWRNOTGOOD field.*/                    
  #define VDET1V0_EVENTS_PWRNOTGOOD_EVENTS_PWRNOTGOOD_Min (0x0UL) /*!< Min enumerator value of EVENTS_PWRNOTGOOD field.        */
  #define VDET1V0_EVENTS_PWRNOTGOOD_EVENTS_PWRNOTGOOD_Max (0x1UL) /*!< Max enumerator value of EVENTS_PWRNOTGOOD field.        */
  #define VDET1V0_EVENTS_PWRNOTGOOD_EVENTS_PWRNOTGOOD_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define VDET1V0_EVENTS_PWRNOTGOOD_EVENTS_PWRNOTGOOD_Generated (0x1UL) /*!< Event generated                                   */


/* VDET1V0_INTEN: Enable or disable interrupt */
  #define VDET1V0_INTEN_ResetValue (0x00000000UL)    /*!< Reset value of INTEN register.                                       */

/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define VDET1V0_INTEN_READY_Pos (0UL)              /*!< Position of READY field.                                             */
  #define VDET1V0_INTEN_READY_Msk (0x1UL << VDET1V0_INTEN_READY_Pos) /*!< Bit mask of READY field.                             */
  #define VDET1V0_INTEN_READY_Min (0x0UL)            /*!< Min enumerator value of READY field.                                 */
  #define VDET1V0_INTEN_READY_Max (0x1UL)            /*!< Max enumerator value of READY field.                                 */
  #define VDET1V0_INTEN_READY_Disabled (0x0UL)       /*!< Disable                                                              */
  #define VDET1V0_INTEN_READY_Enabled (0x1UL)        /*!< Enable                                                               */

/* SETTLED @Bit 1 : Enable or disable interrupt for event SETTLED */
  #define VDET1V0_INTEN_SETTLED_Pos (1UL)            /*!< Position of SETTLED field.                                           */
  #define VDET1V0_INTEN_SETTLED_Msk (0x1UL << VDET1V0_INTEN_SETTLED_Pos) /*!< Bit mask of SETTLED field.                       */
  #define VDET1V0_INTEN_SETTLED_Min (0x0UL)          /*!< Min enumerator value of SETTLED field.                               */
  #define VDET1V0_INTEN_SETTLED_Max (0x1UL)          /*!< Max enumerator value of SETTLED field.                               */
  #define VDET1V0_INTEN_SETTLED_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VDET1V0_INTEN_SETTLED_Enabled (0x1UL)      /*!< Enable                                                               */

/* PWRGOOD @Bit 2 : Enable or disable interrupt for event PWRGOOD */
  #define VDET1V0_INTEN_PWRGOOD_Pos (2UL)            /*!< Position of PWRGOOD field.                                           */
  #define VDET1V0_INTEN_PWRGOOD_Msk (0x1UL << VDET1V0_INTEN_PWRGOOD_Pos) /*!< Bit mask of PWRGOOD field.                       */
  #define VDET1V0_INTEN_PWRGOOD_Min (0x0UL)          /*!< Min enumerator value of PWRGOOD field.                               */
  #define VDET1V0_INTEN_PWRGOOD_Max (0x1UL)          /*!< Max enumerator value of PWRGOOD field.                               */
  #define VDET1V0_INTEN_PWRGOOD_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VDET1V0_INTEN_PWRGOOD_Enabled (0x1UL)      /*!< Enable                                                               */

/* PWRNOTGOOD @Bit 3 : Enable or disable interrupt for event PWRNOTGOOD */
  #define VDET1V0_INTEN_PWRNOTGOOD_Pos (3UL)         /*!< Position of PWRNOTGOOD field.                                        */
  #define VDET1V0_INTEN_PWRNOTGOOD_Msk (0x1UL << VDET1V0_INTEN_PWRNOTGOOD_Pos) /*!< Bit mask of PWRNOTGOOD field.              */
  #define VDET1V0_INTEN_PWRNOTGOOD_Min (0x0UL)       /*!< Min enumerator value of PWRNOTGOOD field.                            */
  #define VDET1V0_INTEN_PWRNOTGOOD_Max (0x1UL)       /*!< Max enumerator value of PWRNOTGOOD field.                            */
  #define VDET1V0_INTEN_PWRNOTGOOD_Disabled (0x0UL)  /*!< Disable                                                              */
  #define VDET1V0_INTEN_PWRNOTGOOD_Enabled (0x1UL)   /*!< Enable                                                               */


/* VDET1V0_INTENSET: Enable interrupt */
  #define VDET1V0_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                    */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define VDET1V0_INTENSET_READY_Pos (0UL)           /*!< Position of READY field.                                             */
  #define VDET1V0_INTENSET_READY_Msk (0x1UL << VDET1V0_INTENSET_READY_Pos) /*!< Bit mask of READY field.                       */
  #define VDET1V0_INTENSET_READY_Min (0x0UL)         /*!< Min enumerator value of READY field.                                 */
  #define VDET1V0_INTENSET_READY_Max (0x1UL)         /*!< Max enumerator value of READY field.                                 */
  #define VDET1V0_INTENSET_READY_Set (0x1UL)         /*!< Enable                                                               */
  #define VDET1V0_INTENSET_READY_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define VDET1V0_INTENSET_READY_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

