adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PWRGOOD @Bit 2 : Read pending status of interrupt for event PWRGOOD */
  #define VDET1V0_INTPEND_PWRGOOD_Pos (2UL)          /*!< Position of PWRGOOD field.                                           */
  #define VDET1V0_INTPEND_PWRGOOD_Msk (0x1UL << VDET1V0_INTPEND_PWRGOOD_Pos) /*!< Bit mask of PWRGOOD field.                   */
  #define VDET1V0_INTPEND_PWRGOOD_Min (0x0UL)        /*!< Min enumerator value of PWRGOOD field.                               */
  #define VDET1V0_INTPEND_PWRGOOD_Max (0x1UL)        /*!< Max enumerator value of PWRGOOD field.                               */
  #define VDET1V0_INTPEND_PWRGOOD_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VDET1V0_INTPEND_PWRGOOD_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* PWRNOTGOOD @Bit 3 : Read pending status of interrupt for event PWRNOTGOOD */
  #define VDET1V0_INTPEND_PWRNOTGOOD_Pos (3UL)       /*!< Position of PWRNOTGOOD field.                                        */
  #define VDET1V0_INTPEND_PWRNOTGOOD_Msk (0x1UL << VDET1V0_INTPEND_PWRNOTGOOD_Pos) /*!< Bit mask of PWRNOTGOOD field.          */
  #define VDET1V0_INTPEND_PWRNOTGOOD_Min (0x0UL)     /*!< Min enumerator value of PWRNOTGOOD field.                            */
  #define VDET1V0_INTPEND_PWRNOTGOOD_Max (0x1UL)     /*!< Max enumerator value of PWRNOTGOOD field.                            */
  #define VDET1V0_INTPEND_PWRNOTGOOD_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define VDET1V0_INTPEND_PWRNOTGOOD_Pending (0x1UL) /*!< Read: Pending                                                        */


/* VDET1V0_STATUSANA: Status of analog module output signals */
  #define VDET1V0_STATUSANA_ResetValue (0x00000000UL) /*!< Reset value of STATUSANA register.                                  */

/* READY @Bit 0 : Current value of the READY signal from the analog module */
  #define VDET1V0_STATUSANA_READY_Pos (0UL)          /*!< Position of READY field.                                             */
  #define VDET1V0_STATUSANA_READY_Msk (0x1UL << VDET1V0_STATUSANA_READY_Pos) /*!< Bit mask of READY field.                     */

/* SETTLED @Bit 1 : Current value of the SETTLED signal from the analog module */
  #define VDET1V0_STATUSANA_SETTLED_Pos (1UL)        /*!< Position of SETTLED field.                                           */
  #define VDET1V0_STATUSANA_SETTLED_Msk (0x1UL << VDET1V0_STATUSANA_SETTLED_Pos) /*!< Bit mask of SETTLED field.               */

/* PGD @Bit 2 : Current value of the PGD signal from the analog module */
  #define VDET1V0_STATUSANA_PGD_Pos (2UL)            /*!< Position of PGD field.                                               */
  #define VDET1V0_STATUSANA_PGD_Msk (0x1UL << VDET1V0_STATUSANA_PGD_Pos) /*!< Bit mask of PGD field.                           */


/* VDET1V0_MIRROR: Enable LOCK for mirrored registers */
  #define VDET1V0_MIRROR_ResetValue (0x00000001UL)   /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define VDET1V0_MIRROR_LOCK_Pos (0UL)              /*!< Position of LOCK field.                                              */
  #define VDET1V0_MIRROR_LOCK_Msk (0x1UL << VDET1V0_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                              */
  #define VDET1V0_MIRROR_LOCK_Min (0x0UL)            /*!< Min enumerator value of LOCK field.                                  */
  #define VDET1V0_MIRROR_LOCK_Max (0x1UL)            /*!< Max enumerator value of LOCK field.                                  */
  #define VDET1V0_MIRROR_LOCK_Disabled (0x0UL)       /*!< Lock disabled                                                        */
  #define VDET1V0_MIRROR_LOCK_Enabled (0x1UL)        /*!< Lock enabled                                                         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         VDETAO0V8                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct VDETAO0V8_CONFIG ================================================= */
/**
  * @brief CONFIG [VDETAO0V8_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000000) Voltage detector configuration                        */
  __IOM uint32_t  PWRGOODLVL;                        /*!< (@ 0x00000004) Power good detector threshold voltage level           */
  __IOM uint32_t  BROWNOUTHP;                        /*!< (@ 0x00000008) Brown out detector threshold voltage level, HP
                                                                         regulated rail*/                                         
  __IOM uint32_t  BROWNOUTLP;                        /*!< (@ 0x0000000C) Brown out detector threshold voltage level, LP
                                                                         regulated rail*/                                         
  __IOM uint32_t  BROWNOUTULV;                       /*!< (@ 0x00000010) Brown out detector threshold voltage level, ULV
                                                                         regulated rail*/                                         
} NRF_VDETAO0V8_CONFIG_Type;                         /*!< Size = 20 (0x014)                                                    */

/* VDETAO0V8_CONFIG_CFG: Voltage detector configuration */
  #define VDETAO0V8_CONFIG_CFG_ResetValue (0x00000000UL) /*!< Reset value of CFG register.                                     */

/* BROWNOUTHYST @Bits 0..1 : Brown out detector hysteresis voltage value */
  #define VDETAO0V8_CONFIG_CFG_BROWNOUTHYST_Pos (0UL) /*!< Position of BROWNOUTHYST field.                                     */
  #define VDETAO0V8_CONFIG_CFG_BROWNOUTHYST_Msk (0x3UL << VDETAO0V8_CONFIG_CFG_BROWNOUTHYST_Pos) /*!< Bit mask of BROWNOUTHYST
                                                                            field.*/                                              
  #define VDETAO0V8_CONFIG_CFG_BROWNOUTHYST_Min (0x0UL) /*!< Min enumerator value of BROWNOUTHYST field.                       */
  #define VDETAO0V8_CONFIG_CFG_BROWNOUTHYST_Max (0x3UL) /*!< Max enumerator value of BROWNOUTHYST field.                       */
  #define VDETAO0V8_CONFIG_CFG_BROWNOUTHYST_Val0V0250 (0x0UL) /*!< Hysteresis voltage is 25mV                                  */
  #define VDETAO0V8_CONFIG_CFG_BROWNOUTHYST_Val0V0500 (0x1UL) /*!< Hysteresis voltage is 50mV                                  */
  #define VDETAO0V8_CONFIG_CFG_BROWNOUTHYST_Val0V0125 (0x2UL) /*!< Hysteresis voltage is 12.5mV                                */
  #define VDETAO0V8_CONFIG_CFG_BROWNOUTHYST_Val0V0167 (0x3UL) /*!< Hysteresis voltage is 16.7mV                                */


/* VDETAO0V8_CONFIG_PWRGOODLVL: Power good detector threshold voltage level */
  #define VDETAO0V8_CONFIG_PWRGOODLVL_ResetValue (0x00000035UL) /*!< Reset value of PWRGOODLVL register.                       */

/* VAL @Bits 0..5 : Threshold voltage value. */
  #define VDETAO0V8_CONFIG_PWRGOODLVL_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define VDETAO0V8_CONFIG_PWRGOODLVL_VAL_Msk (0x3FUL << VDETAO0V8_CONFIG_PWRGOODLVL_VAL_Pos) /*!< Bit mask of VAL field.      */
  #define VDETAO0V8_CONFIG_PWRGOODLVL_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                      */
  #define VDETAO0V8_CONFIG_PWRGOODLVL_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                       */


/* VDETAO0V8_CONFIG_BROWNOUTHP: Brown out detector threshold voltage level, HP regulated rail */
  #define VDETAO0V8_CONFIG_BROWNOUTHP_ResetValue (0x0000002DUL) /*!< Reset value of BROWNOUTHP register.                       */

/* VAL @Bits 0..5 : Threshold voltage value. */
  #define VDETAO0V8_CONFIG_BROWNOUTHP_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define VDETAO0V8_CONFIG_BROWNOUTHP_VAL_Msk (0x3FUL << VDETAO0V8_CONFIG_BROWNOUTHP_VAL_Pos) /*!< Bit mask of VAL field.      */
  #define VDETAO0V8_CONFIG_BROWNOUTHP_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                      */
  #define VDETAO0V8_CONFIG_BROWNOUTHP_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                       */


/* VDETAO0V8_CONFIG_BROWNOUTLP: Brown out detector threshold voltage level, LP regulated rail */
  #define VDETAO0V8_CONFIG_BROWNOUTLP_ResetValue (0x00000032UL) /*!< Reset value of BROWNOUTLP register.                       */

/* VAL @Bits 0..5 : Threshold voltage value. */
  #define VDETAO0V8_CONFIG_BROWNOUTLP_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define VDETAO0V8_CONFIG_BROWNOUTLP_VAL_Msk (0x3FUL << VDETAO0V8_CONFIG_BROWNOUTLP_VAL_Pos) /*!< Bit mask of VAL field.      */
  #define VDETAO0V8_CONFIG_BROWNOUTLP_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                      */
  #define VDETAO0V8_CONFIG_BROWNOUTLP_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                       */


/* VDETAO0V8_CONFIG_BROWNOUTULV: Brown out detector threshold voltage level, ULV regulated rail */
  #define VDETAO0V8_CONFIG_BROWNOUTULV_ResetValue (0x00000023UL) /*!< Reset value of BROWNOUTULV register.                     */

/* VAL @Bits 0..5 : Threshold voltage value. */
  #define VDETAO0V8_CONFIG_BROWNOUTULV_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define VDETAO0V8_CONFIG_BROWNOUTULV_VAL_Msk (0x3FUL << VDETAO0V8_CONFIG_BROWNOUTULV_VAL_Pos) /*!< Bit mask of VAL field.    */
  #define VDETAO0V8_CONFIG_BROWNOUTULV_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                     */
  #define VDETAO0V8_CONFIG_BROWNOUTULV_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                      */



/* ================================================== Struct VDETAO0V8_TRIM ================================================== */
/**
  * @brief TRIM [VDETAO0V8_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  BROWNOUT;                          /*!< (@ 0x00000000) Brown out detector trimming                           */
  __IOM uint32_t  PWRGOOD;                           /*!< (@ 0x00000004) Power good detector trimming                          */
} NRF_VDETAO0V8_TRIM_Type;                           /*!< Size = 8 (0x008)                                                     */

