adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VDETAO0V8_TRIM_BROWNOUT: Brown out detector trimming */
  #define VDETAO0V8_TRIM_BROWNOUT_ResetValue (0x00000000UL) /*!< Reset value of BROWNOUT register.                             */

/* VAL @Bits 0..3 : Threshold voltage deviation value. */
  #define VDETAO0V8_TRIM_BROWNOUT_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VDETAO0V8_TRIM_BROWNOUT_VAL_Msk (0xFUL << VDETAO0V8_TRIM_BROWNOUT_VAL_Pos) /*!< Bit mask of VAL field.               */
  #define VDETAO0V8_TRIM_BROWNOUT_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                          */
  #define VDETAO0V8_TRIM_BROWNOUT_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                           */


/* VDETAO0V8_TRIM_PWRGOOD: Power good detector trimming */
  #define VDETAO0V8_TRIM_PWRGOOD_ResetValue (0x00000000UL) /*!< Reset value of PWRGOOD register.                               */

/* VAL @Bits 0..3 : Threshold voltage trimming deviation value. */
  #define VDETAO0V8_TRIM_PWRGOOD_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define VDETAO0V8_TRIM_PWRGOOD_VAL_Msk (0xFUL << VDETAO0V8_TRIM_PWRGOOD_VAL_Pos) /*!< Bit mask of VAL field.                 */
  #define VDETAO0V8_TRIM_PWRGOOD_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                           */
  #define VDETAO0V8_TRIM_PWRGOOD_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                            */



/* ================================================ Struct VDETAO0V8_OVERRIDE ================================================ */
/**
  * @brief OVERRIDE [VDETAO0V8_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  MODEULPR;                          /*!< (@ 0x00000008) Override the MODE_ULPR signal to the analog module    */
  __IOM uint32_t  MODELP;                            /*!< (@ 0x0000000C) Override the MODE_LP signal to the analog module      */
  __IOM uint32_t  PGDREQUEST;                        /*!< (@ 0x00000010) Override the PGD_REQUEST signal to the analog module  */
  __IOM uint32_t  PGDCANCEL;                         /*!< (@ 0x00000014) Override the PGD_CANCEL signal to the analog module   */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000018) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x0000001C) Override the SETTLED signal from the analog module    */
  __IOM uint32_t  BOD;                               /*!< (@ 0x00000020) Override the BOD signal from the analog module        */
  __IOM uint32_t  PGD;                               /*!< (@ 0x00000024) Override the PGD signal from the analog module        */
  __IOM uint32_t  BODVOLTSEL;                        /*!< (@ 0x00000028) Override the BOD_VOLT_SEL signal to the analog module */
  __IOM uint32_t  MUXEDBOD;                          /*!< (@ 0x0000002C) Override the muxselect to BOD HP/LP level multiplexer */
} NRF_VDETAO0V8_OVERRIDE_Type;                       /*!< Size = 48 (0x030)                                                    */

/* VDETAO0V8_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define VDETAO0V8_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                               */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETAO0V8_OVERRIDE_PWRUP_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VDETAO0V8_OVERRIDE_PWRUP_VAL_Msk (0x1UL << VDETAO0V8_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VDETAO0V8_OVERRIDE_PWRUP_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETAO0V8_OVERRIDE_PWRUP_EN_Msk (0x1UL << VDETAO0V8_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETAO0V8_OVERRIDE_PWRUP_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETAO0V8_OVERRIDE_PWRUP_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETAO0V8_OVERRIDE_PWRUP_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VDETAO0V8_OVERRIDE_PWRUP_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* VDETAO0V8_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define VDETAO0V8_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                             */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETAO0V8_OVERRIDE_RETAIN_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VDETAO0V8_OVERRIDE_RETAIN_VAL_Msk (0x1UL << VDETAO0V8_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VDETAO0V8_OVERRIDE_RETAIN_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VDETAO0V8_OVERRIDE_RETAIN_EN_Msk (0x1UL << VDETAO0V8_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.              */
  #define VDETAO0V8_OVERRIDE_RETAIN_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VDETAO0V8_OVERRIDE_RETAIN_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VDETAO0V8_OVERRIDE_RETAIN_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VDETAO0V8_OVERRIDE_RETAIN_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* VDETAO0V8_OVERRIDE_MODEULPR: Override the MODE_ULPR signal to the analog module */
  #define VDETAO0V8_OVERRIDE_MODEULPR_ResetValue (0x00000000UL) /*!< Reset value of MODEULPR register.                         */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETAO0V8_OVERRIDE_MODEULPR_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define VDETAO0V8_OVERRIDE_MODEULPR_VAL_Msk (0x1UL << VDETAO0V8_OVERRIDE_MODEULPR_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : Enable the override */
  #define VDETAO0V8_OVERRIDE_MODEULPR_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define VDETAO0V8_OVERRIDE_MODEULPR_EN_Msk (0x1UL << VDETAO0V8_OVERRIDE_MODEULPR_EN_Pos) /*!< Bit mask of EN field.          */
  #define VDETAO0V8_OVERRIDE_MODEULPR_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define VDETAO0V8_OVERRIDE_MODEULPR_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define VDETAO0V8_OVERRIDE_MODEULPR_EN_Disabled (0x0UL) /*!< Override is disabled                                            */
  #define VDETAO0V8_OVERRIDE_MODEULPR_EN_Enabled (0x1UL) /*!< Override is enabled                                              */


/* VDETAO0V8_OVERRIDE_MODELP: Override the MODE_LP signal to the analog module */
  #define VDETAO0V8_OVERRIDE_MODELP_ResetValue (0x00000000UL) /*!< Reset value of MODELP register.                             */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETAO0V8_OVERRIDE_MODELP_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VDETAO0V8_OVERRIDE_MODELP_VAL_Msk (0x1UL << VDETAO0V8_OVERRIDE_MODELP_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VDETAO0V8_OVERRIDE_MODELP_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VDETAO0V8_OVERRIDE_MODELP_EN_Msk (0x1UL << VDETAO0V8_OVERRIDE_MODELP_EN_Pos) /*!< Bit mask of EN field.              */
  #define VDETAO0V8_OVERRIDE_MODELP_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VDETAO0V8_OVERRIDE_MODELP_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VDETAO0V8_OVERRIDE_MODELP_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VDETAO0V8_OVERRIDE_MODELP_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* VDETAO0V8_OVERRIDE_PGDREQUEST: Override the PGD_REQUEST signal to the analog module */
  #define VDETAO0V8_OVERRIDE_PGDREQUEST_ResetValue (0x00000000UL) /*!< Reset value of PGDREQUEST register.                     */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETAO0V8_OVERRIDE_PGDREQUEST_VAL_Pos (0UL) /*!< Position of VAL field.                                              */
  #define VDETAO0V8_OVERRIDE_PGDREQUEST_VAL_Msk (0x1UL << VDETAO0V8_OVERRIDE_PGDREQUEST_VAL_Pos) /*!< Bit mask of VAL field.   */

/* EN @Bit 31 : Enable the override */
  #define VDETAO0V8_OVERRIDE_PGDREQUEST_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define VDETAO0V8_OVERRIDE_PGDREQUEST_EN_Msk (0x1UL << VDETAO0V8_OVERRIDE_PGDREQUEST_EN_Pos) /*!< Bit mask of EN field.      */
  #define VDETAO0V8_OVERRIDE_PGDREQUEST_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define VDETAO0V8_OVERRIDE_PGDREQUEST_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define VDETAO0V8_OVERRIDE_PGDREQUEST_EN_Disabled (0x0UL) /*!< Override is disabled                                          */
  #define VDETAO0V8_OVERRIDE_PGDREQUEST_EN_Enabled (0x1UL) /*!< Override is enabled                                            */


