adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* FORCEBODTO0 @Bit 6 : Force BOD outputs to 0 */
  #define VDETAO1V8_DFT_TCFG_FORCEBODTO0_Pos (6UL)   /*!< Position of FORCEBODTO0 field.                                       */
  #define VDETAO1V8_DFT_TCFG_FORCEBODTO0_Msk (0x1UL << VDETAO1V8_DFT_TCFG_FORCEBODTO0_Pos) /*!< Bit mask of FORCEBODTO0 field. */
  #define VDETAO1V8_DFT_TCFG_FORCEBODTO0_Min (0x0UL) /*!< Min enumerator value of FORCEBODTO0 field.                           */
  #define VDETAO1V8_DFT_TCFG_FORCEBODTO0_Max (0x1UL) /*!< Max enumerator value of FORCEBODTO0 field.                           */
  #define VDETAO1V8_DFT_TCFG_FORCEBODTO0_Disabled (0x0UL) /*!< Force disabled                                                  */
  #define VDETAO1V8_DFT_TCFG_FORCEBODTO0_Enabled (0x1UL) /*!< Force enabled                                                    */


/* ==================================================== Struct VDETAO1V8 ===================================================== */
/**
  * @brief VDETAO1V8 peripheral
  */
  typedef struct {                                   /*!< VDETAO1V8 Structure                                                  */
    __OM uint32_t TASKS_PWRUP;                       /*!< (@ 0x00000000) Power up voltage detector                             */
    __OM uint32_t TASKS_PWRDOWN;                     /*!< (@ 0x00000004) Power down voltage detector                           */
    __IM uint32_t RESERVED[62];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) Power up done                                         */
    __IOM uint32_t EVENTS_SETTLED;                   /*!< (@ 0x00000104) Settled flag for MODE handshake                       */
    __IOM uint32_t EVENTS_BROWNOUTHIGH;              /*!< (@ 0x00000108) Brownout detector high level detected voltage below
                                                                         high threshold*/                                         
    __IM uint32_t RESERVED1[125];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) Voltage detector status                               */
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000404) Status of analog module output signals                */
    __IM uint32_t RESERVED3[2];
    __IOM NRF_VDETAO1V8_CONFIG_Type CONFIG;          /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[10];
    __IOM NRF_VDETAO1V8_TRIM_Type TRIM;              /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED5[14];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000484) Voltage detector mode                                 */
    __IM uint32_t RESERVED6[30];
    __IOM NRF_VDETAO1V8_OVERRIDE_Type OVERRIDE;      /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED7[56];
    __IOM NRF_VDETAO1V8_DFT_Type DFT;                /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_VDETAO1V8_Type;                              /*!< Size = 1588 (0x634)                                                  */

/* VDETAO1V8_TASKS_PWRUP: Power up voltage detector */
  #define VDETAO1V8_TASKS_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWRUP register.                            */

/* TASKS_PWRUP @Bit 0 : Power up voltage detector */
  #define VDETAO1V8_TASKS_PWRUP_TASKS_PWRUP_Pos (0UL) /*!< Position of TASKS_PWRUP field.                                      */
  #define VDETAO1V8_TASKS_PWRUP_TASKS_PWRUP_Msk (0x1UL << VDETAO1V8_TASKS_PWRUP_TASKS_PWRUP_Pos) /*!< Bit mask of TASKS_PWRUP
                                                                            field.*/                                              
  #define VDETAO1V8_TASKS_PWRUP_TASKS_PWRUP_Min (0x1UL) /*!< Min enumerator value of TASKS_PWRUP field.                        */
  #define VDETAO1V8_TASKS_PWRUP_TASKS_PWRUP_Max (0x1UL) /*!< Max enumerator value of TASKS_PWRUP field.                        */
  #define VDETAO1V8_TASKS_PWRUP_TASKS_PWRUP_Trigger (0x1UL) /*!< Trigger task                                                  */


/* VDETAO1V8_TASKS_PWRDOWN: Power down voltage detector */
  #define VDETAO1V8_TASKS_PWRDOWN_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWRDOWN register.                        */

/* TASKS_PWRDOWN @Bit 0 : Power down voltage detector */
  #define VDETAO1V8_TASKS_PWRDOWN_TASKS_PWRDOWN_Pos (0UL) /*!< Position of TASKS_PWRDOWN field.                                */
  #define VDETAO1V8_TASKS_PWRDOWN_TASKS_PWRDOWN_Msk (0x1UL << VDETAO1V8_TASKS_PWRDOWN_TASKS_PWRDOWN_Pos) /*!< Bit mask of
                                                                            TASKS_PWRDOWN field.*/                                
  #define VDETAO1V8_TASKS_PWRDOWN_TASKS_PWRDOWN_Min (0x1UL) /*!< Min enumerator value of TASKS_PWRDOWN field.                  */
  #define VDETAO1V8_TASKS_PWRDOWN_TASKS_PWRDOWN_Max (0x1UL) /*!< Max enumerator value of TASKS_PWRDOWN field.                  */
  #define VDETAO1V8_TASKS_PWRDOWN_TASKS_PWRDOWN_Trigger (0x1UL) /*!< Trigger task                                              */


/* VDETAO1V8_EVENTS_READY: Power up done */
  #define VDETAO1V8_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                          */

/* EVENTS_READY @Bit 0 : Power up done */
  #define VDETAO1V8_EVENTS_READY_EVENTS_READY_Pos (0UL) /*!< Position of EVENTS_READY field.                                   */
  #define VDETAO1V8_EVENTS_READY_EVENTS_READY_Msk (0x1UL << VDETAO1V8_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of
                                                                            EVENTS_READY field.*/                                 
  #define VDETAO1V8_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                     */
  #define VDETAO1V8_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                     */
  #define VDETAO1V8_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define VDETAO1V8_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                           */


/* VDETAO1V8_EVENTS_SETTLED: Settled flag for MODE handshake */
  #define VDETAO1V8_EVENTS_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SETTLED register.                      */

