adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EVENTS_SETTLED @Bit 0 : Settled flag for MODE handshake */
  #define VDETAO1V8_EVENTS_SETTLED_EVENTS_SETTLED_Pos (0UL) /*!< Position of EVENTS_SETTLED field.                             */
  #define VDETAO1V8_EVENTS_SETTLED_EVENTS_SETTLED_Msk (0x1UL << VDETAO1V8_EVENTS_SETTLED_EVENTS_SETTLED_Pos) /*!< Bit mask of
                                                                            EVENTS_SETTLED field.*/                               
  #define VDETAO1V8_EVENTS_SETTLED_EVENTS_SETTLED_Min (0x0UL) /*!< Min enumerator value of EVENTS_SETTLED field.               */
  #define VDETAO1V8_EVENTS_SETTLED_EVENTS_SETTLED_Max (0x1UL) /*!< Max enumerator value of EVENTS_SETTLED field.               */
  #define VDETAO1V8_EVENTS_SETTLED_EVENTS_SETTLED_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define VDETAO1V8_EVENTS_SETTLED_EVENTS_SETTLED_Generated (0x1UL) /*!< Event generated                                       */


/* VDETAO1V8_EVENTS_BROWNOUTHIGH: Brownout detector high level detected voltage below high threshold */
  #define VDETAO1V8_EVENTS_BROWNOUTHIGH_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_BROWNOUTHIGH register.            */

/* EVENTS_BROWNOUTHIGH @Bit 0 : Brownout detector high level detected voltage below high threshold */
  #define VDETAO1V8_EVENTS_BROWNOUTHIGH_EVENTS_BROWNOUTHIGH_Pos (0UL) /*!< Position of EVENTS_BROWNOUTHIGH field.              */
  #define VDETAO1V8_EVENTS_BROWNOUTHIGH_EVENTS_BROWNOUTHIGH_Msk (0x1UL << VDETAO1V8_EVENTS_BROWNOUTHIGH_EVENTS_BROWNOUTHIGH_Pos)
                                                                            /*!< Bit mask of EVENTS_BROWNOUTHIGH field.*/         
  #define VDETAO1V8_EVENTS_BROWNOUTHIGH_EVENTS_BROWNOUTHIGH_Min (0x0UL) /*!< Min enumerator value of EVENTS_BROWNOUTHIGH field.*/
  #define VDETAO1V8_EVENTS_BROWNOUTHIGH_EVENTS_BROWNOUTHIGH_Max (0x1UL) /*!< Max enumerator value of EVENTS_BROWNOUTHIGH field.*/
  #define VDETAO1V8_EVENTS_BROWNOUTHIGH_EVENTS_BROWNOUTHIGH_NotGenerated (0x0UL) /*!< Event not generated                      */
  #define VDETAO1V8_EVENTS_BROWNOUTHIGH_EVENTS_BROWNOUTHIGH_Generated (0x1UL) /*!< Event generated                             */


/* VDETAO1V8_INTEN: Enable or disable interrupt */
  #define VDETAO1V8_INTEN_ResetValue (0x00000000UL)  /*!< Reset value of INTEN register.                                       */

/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define VDETAO1V8_INTEN_READY_Pos (0UL)            /*!< Position of READY field.                                             */
  #define VDETAO1V8_INTEN_READY_Msk (0x1UL << VDETAO1V8_INTEN_READY_Pos) /*!< Bit mask of READY field.                         */
  #define VDETAO1V8_INTEN_READY_Min (0x0UL)          /*!< Min enumerator value of READY field.                                 */
  #define VDETAO1V8_INTEN_READY_Max (0x1UL)          /*!< Max enumerator value of READY field.                                 */
  #define VDETAO1V8_INTEN_READY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VDETAO1V8_INTEN_READY_Enabled (0x1UL)      /*!< Enable                                                               */

/* SETTLED @Bit 1 : Enable or disable interrupt for event SETTLED */
  #define VDETAO1V8_INTEN_SETTLED_Pos (1UL)          /*!< Position of SETTLED field.                                           */
  #define VDETAO1V8_INTEN_SETTLED_Msk (0x1UL << VDETAO1V8_INTEN_SETTLED_Pos) /*!< Bit mask of SETTLED field.                   */
  #define VDETAO1V8_INTEN_SETTLED_Min (0x0UL)        /*!< Min enumerator value of SETTLED field.                               */
  #define VDETAO1V8_INTEN_SETTLED_Max (0x1UL)        /*!< Max enumerator value of SETTLED field.                               */
  #define VDETAO1V8_INTEN_SETTLED_Disabled (0x0UL)   /*!< Disable                                                              */
  #define VDETAO1V8_INTEN_SETTLED_Enabled (0x1UL)    /*!< Enable                                                               */

/* BROWNOUTHIGH @Bit 2 : Enable or disable interrupt for event BROWNOUTHIGH */
  #define VDETAO1V8_INTEN_BROWNOUTHIGH_Pos (2UL)     /*!< Position of BROWNOUTHIGH field.                                      */
  #define VDETAO1V8_INTEN_BROWNOUTHIGH_Msk (0x1UL << VDETAO1V8_INTEN_BROWNOUTHIGH_Pos) /*!< Bit mask of BROWNOUTHIGH field.    */
  #define VDETAO1V8_INTEN_BROWNOUTHIGH_Min (0x0UL)   /*!< Min enumerator value of BROWNOUTHIGH field.                          */
  #define VDETAO1V8_INTEN_BROWNOUTHIGH_Max (0x1UL)   /*!< Max enumerator value of BROWNOUTHIGH field.                          */
  #define VDETAO1V8_INTEN_BROWNOUTHIGH_Disabled (0x0UL) /*!< Disable                                                           */
  #define VDETAO1V8_INTEN_BROWNOUTHIGH_Enabled (0x1UL) /*!< Enable                                                             */


/* VDETAO1V8_INTENSET: Enable interrupt */
  #define VDETAO1V8_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                  */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define VDETAO1V8_INTENSET_READY_Pos (0UL)         /*!< Position of READY field.                                             */
  #define VDETAO1V8_INTENSET_READY_Msk (0x1UL << VDETAO1V8_INTENSET_READY_Pos) /*!< Bit mask of READY field.                   */
  #define VDETAO1V8_INTENSET_READY_Min (0x0UL)       /*!< Min enumerator value of READY field.                                 */
  #define VDETAO1V8_INTENSET_READY_Max (0x1UL)       /*!< Max enumerator value of READY field.                                 */
  #define VDETAO1V8_INTENSET_READY_Set (0x1UL)       /*!< Enable                                                               */
  #define VDETAO1V8_INTENSET_READY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VDETAO1V8_INTENSET_READY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

