adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SETTLED @Bit 1 : Write '1' to enable interrupt for event SETTLED */
  #define VDETAO1V8_INTENSET_SETTLED_Pos (1UL)       /*!< Position of SETTLED field.                                           */
  #define VDETAO1V8_INTENSET_SETTLED_Msk (0x1UL << VDETAO1V8_INTENSET_SETTLED_Pos) /*!< Bit mask of SETTLED field.             */
  #define VDETAO1V8_INTENSET_SETTLED_Min (0x0UL)     /*!< Min enumerator value of SETTLED field.                               */
  #define VDETAO1V8_INTENSET_SETTLED_Max (0x1UL)     /*!< Max enumerator value of SETTLED field.                               */
  #define VDETAO1V8_INTENSET_SETTLED_Set (0x1UL)     /*!< Enable                                                               */
  #define VDETAO1V8_INTENSET_SETTLED_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define VDETAO1V8_INTENSET_SETTLED_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* BROWNOUTHIGH @Bit 2 : Write '1' to enable interrupt for event BROWNOUTHIGH */
  #define VDETAO1V8_INTENSET_BROWNOUTHIGH_Pos (2UL)  /*!< Position of BROWNOUTHIGH field.                                      */
  #define VDETAO1V8_INTENSET_BROWNOUTHIGH_Msk (0x1UL << VDETAO1V8_INTENSET_BROWNOUTHIGH_Pos) /*!< Bit mask of BROWNOUTHIGH
                                                                            field.*/                                              
  #define VDETAO1V8_INTENSET_BROWNOUTHIGH_Min (0x0UL) /*!< Min enumerator value of BROWNOUTHIGH field.                         */
  #define VDETAO1V8_INTENSET_BROWNOUTHIGH_Max (0x1UL) /*!< Max enumerator value of BROWNOUTHIGH field.                         */
  #define VDETAO1V8_INTENSET_BROWNOUTHIGH_Set (0x1UL) /*!< Enable                                                              */
  #define VDETAO1V8_INTENSET_BROWNOUTHIGH_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define VDETAO1V8_INTENSET_BROWNOUTHIGH_Enabled (0x1UL) /*!< Read: Enabled                                                   */


/* VDETAO1V8_INTENCLR: Disable interrupt */
  #define VDETAO1V8_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                  */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define VDETAO1V8_INTENCLR_READY_Pos (0UL)         /*!< Position of READY field.                                             */
  #define VDETAO1V8_INTENCLR_READY_Msk (0x1UL << VDETAO1V8_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                   */
  #define VDETAO1V8_INTENCLR_READY_Min (0x0UL)       /*!< Min enumerator value of READY field.                                 */
  #define VDETAO1V8_INTENCLR_READY_Max (0x1UL)       /*!< Max enumerator value of READY field.                                 */
  #define VDETAO1V8_INTENCLR_READY_Clear (0x1UL)     /*!< Disable                                                              */
  #define VDETAO1V8_INTENCLR_READY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VDETAO1V8_INTENCLR_READY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* SETTLED @Bit 1 : Write '1' to disable interrupt for event SETTLED */
  #define VDETAO1V8_INTENCLR_SETTLED_Pos (1UL)       /*!< Position of SETTLED field.                                           */
  #define VDETAO1V8_INTENCLR_SETTLED_Msk (0x1UL << VDETAO1V8_INTENCLR_SETTLED_Pos) /*!< Bit mask of SETTLED field.             */
  #define VDETAO1V8_INTENCLR_SETTLED_Min (0x0UL)     /*!< Min enumerator value of SETTLED field.                               */
  #define VDETAO1V8_INTENCLR_SETTLED_Max (0x1UL)     /*!< Max enumerator value of SETTLED field.                               */
  #define VDETAO1V8_INTENCLR_SETTLED_Clear (0x1UL)   /*!< Disable                                                              */
  #define VDETAO1V8_INTENCLR_SETTLED_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define VDETAO1V8_INTENCLR_SETTLED_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* BROWNOUTHIGH @Bit 2 : Write '1' to disable interrupt for event BROWNOUTHIGH */
  #define VDETAO1V8_INTENCLR_BROWNOUTHIGH_Pos (2UL)  /*!< Position of BROWNOUTHIGH field.                                      */
  #define VDETAO1V8_INTENCLR_BROWNOUTHIGH_Msk (0x1UL << VDETAO1V8_INTENCLR_BROWNOUTHIGH_Pos) /*!< Bit mask of BROWNOUTHIGH
                                                                            field.*/                                              
  #define VDETAO1V8_INTENCLR_BROWNOUTHIGH_Min (0x0UL) /*!< Min enumerator value of BROWNOUTHIGH field.                         */
  #define VDETAO1V8_INTENCLR_BROWNOUTHIGH_Max (0x1UL) /*!< Max enumerator value of BROWNOUTHIGH field.                         */
  #define VDETAO1V8_INTENCLR_BROWNOUTHIGH_Clear (0x1UL) /*!< Disable                                                           */
  #define VDETAO1V8_INTENCLR_BROWNOUTHIGH_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define VDETAO1V8_INTENCLR_BROWNOUTHIGH_Enabled (0x1UL) /*!< Read: Enabled                                                   */


/* VDETAO1V8_INTPEND: Pending interrupts */
  #define VDETAO1V8_INTPEND_ResetValue (0x00000000UL) /*!< Reset value of INTPEND register.                                    */

/* READY @Bit 0 : Read pending status of interrupt for event READY */
  #define VDETAO1V8_INTPEND_READY_Pos (0UL)          /*!< Position of READY field.                                             */
  #define VDETAO1V8_INTPEND_READY_Msk (0x1UL << VDETAO1V8_INTPEND_READY_Pos) /*!< Bit mask of READY field.                     */
  #define VDETAO1V8_INTPEND_READY_Min (0x0UL)        /*!< Min enumerator value of READY field.                                 */
  #define VDETAO1V8_INTPEND_READY_Max (0x1UL)        /*!< Max enumerator value of READY field.                                 */
  #define VDETAO1V8_INTPEND_READY_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VDETAO1V8_INTPEND_READY_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* SETTLED @Bit 1 : Read pending status of interrupt for event SETTLED */
  #define VDETAO1V8_INTPEND_SETTLED_Pos (1UL)        /*!< Position of SETTLED field.                                           */
  #define VDETAO1V8_INTPEND_SETTLED_Msk (0x1UL << VDETAO1V8_INTPEND_SETTLED_Pos) /*!< Bit mask of SETTLED field.               */
  #define VDETAO1V8_INTPEND_SETTLED_Min (0x0UL)      /*!< Min enumerator value of SETTLED field.                               */
  #define VDETAO1V8_INTPEND_SETTLED_Max (0x1UL)      /*!< Max enumerator value of SETTLED field.                               */
  #define VDETAO1V8_INTPEND_SETTLED_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define VDETAO1V8_INTPEND_SETTLED_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* BROWNOUTHIGH @Bit 2 : Read pending status of interrupt for event BROWNOUTHIGH */
  #define VDETAO1V8_INTPEND_BROWNOUTHIGH_Pos (2UL)   /*!< Position of BROWNOUTHIGH field.                                      */
  #define VDETAO1V8_INTPEND_BROWNOUTHIGH_Msk (0x1UL << VDETAO1V8_INTPEND_BROWNOUTHIGH_Pos) /*!< Bit mask of BROWNOUTHIGH field.*/
  #define VDETAO1V8_INTPEND_BROWNOUTHIGH_Min (0x0UL) /*!< Min enumerator value of BROWNOUTHIGH field.                          */
  #define VDETAO1V8_INTPEND_BROWNOUTHIGH_Max (0x1UL) /*!< Max enumerator value of BROWNOUTHIGH field.                          */
  #define VDETAO1V8_INTPEND_BROWNOUTHIGH_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define VDETAO1V8_INTPEND_BROWNOUTHIGH_Pending (0x1UL) /*!< Read: Pending                                                    */


/* VDETAO1V8_STATUS: Voltage detector status */
  #define VDETAO1V8_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                                      */

