adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* MODE @Bits 0..1 : Current voltage detector mode */
  #define VDETAO1V8_STATUS_MODE_Pos (0UL)            /*!< Position of MODE field.                                              */
  #define VDETAO1V8_STATUS_MODE_Msk (0x3UL << VDETAO1V8_STATUS_MODE_Pos) /*!< Bit mask of MODE field.                          */
  #define VDETAO1V8_STATUS_MODE_Min (0x0UL)          /*!< Min enumerator value of MODE field.                                  */
  #define VDETAO1V8_STATUS_MODE_Max (0x2UL)          /*!< Max enumerator value of MODE field.                                  */
  #define VDETAO1V8_STATUS_MODE_HighPower (0x0UL)    /*!< High power mode                                                      */
  #define VDETAO1V8_STATUS_MODE_LowPower (0x1UL)     /*!< Low power mode                                                       */
  #define VDETAO1V8_STATUS_MODE_UltraLowPowerRefresh (0x2UL) /*!< Ultra-low power refresh mode                                 */


/* VDETAO1V8_STATUSANA: Status of analog module output signals */
  #define VDETAO1V8_STATUSANA_ResetValue (0x00000000UL) /*!< Reset value of STATUSANA register.                                */

/* READY @Bit 0 : Current value of the READY signal from the analog module */
  #define VDETAO1V8_STATUSANA_READY_Pos (0UL)        /*!< Position of READY field.                                             */
  #define VDETAO1V8_STATUSANA_READY_Msk (0x1UL << VDETAO1V8_STATUSANA_READY_Pos) /*!< Bit mask of READY field.                 */

/* SETTLED @Bit 1 : Current value of the SETTLED signal from the analog module */
  #define VDETAO1V8_STATUSANA_SETTLED_Pos (1UL)      /*!< Position of SETTLED field.                                           */
  #define VDETAO1V8_STATUSANA_SETTLED_Msk (0x1UL << VDETAO1V8_STATUSANA_SETTLED_Pos) /*!< Bit mask of SETTLED field.           */

/* BODH @Bit 2 : Current value of the BODH signal from the analog module */
  #define VDETAO1V8_STATUSANA_BODH_Pos (2UL)         /*!< Position of BODH field.                                              */
  #define VDETAO1V8_STATUSANA_BODH_Msk (0x1UL << VDETAO1V8_STATUSANA_BODH_Pos) /*!< Bit mask of BODH field.                    */


/* VDETAO1V8_MIRROR: Enable LOCK for mirrored registers */
  #define VDETAO1V8_MIRROR_ResetValue (0x00000001UL) /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define VDETAO1V8_MIRROR_LOCK_Pos (0UL)            /*!< Position of LOCK field.                                              */
  #define VDETAO1V8_MIRROR_LOCK_Msk (0x1UL << VDETAO1V8_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                          */
  #define VDETAO1V8_MIRROR_LOCK_Min (0x0UL)          /*!< Min enumerator value of LOCK field.                                  */
  #define VDETAO1V8_MIRROR_LOCK_Max (0x1UL)          /*!< Max enumerator value of LOCK field.                                  */
  #define VDETAO1V8_MIRROR_LOCK_Disabled (0x0UL)     /*!< Lock disabled                                                        */
  #define VDETAO1V8_MIRROR_LOCK_Enabled (0x1UL)      /*!< Lock enabled                                                         */


/* VDETAO1V8_MODE: Voltage detector mode */
  #define VDETAO1V8_MODE_ResetValue (0x00000000UL)   /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..2 : Mode */
  #define VDETAO1V8_MODE_MODE_Pos (0UL)              /*!< Position of MODE field.                                              */
  #define VDETAO1V8_MODE_MODE_Msk (0x7UL << VDETAO1V8_MODE_MODE_Pos) /*!< Bit mask of MODE field.                              */
  #define VDETAO1V8_MODE_MODE_Min (0x0UL)            /*!< Min enumerator value of MODE field.                                  */
  #define VDETAO1V8_MODE_MODE_Max (0x3UL)            /*!< Max enumerator value of MODE field.                                  */
  #define VDETAO1V8_MODE_MODE_Auto (0x0UL)           /*!< Automatically handled by the peripheral                              */
  #define VDETAO1V8_MODE_MODE_HighPower (0x1UL)      /*!< High power mode                                                      */
  #define VDETAO1V8_MODE_MODE_LowPower (0x2UL)       /*!< Low power mode                                                       */
  #define VDETAO1V8_MODE_MODE_UltraLowPowerRefresh (0x3UL) /*!< Ultra-low power refresh mode                                   */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         VDETAO5V0                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct VDETAO5V0_CONFIG ================================================= */
/**
  * @brief CONFIG [VDETAO5V0_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000000) Voltage detector configuration                        */
  __IOM uint32_t  PWRGOODLVL;                        /*!< (@ 0x00000004) Power good detector threshold voltage level           */
} NRF_VDETAO5V0_CONFIG_Type;                         /*!< Size = 8 (0x008)                                                     */

/* VDETAO5V0_CONFIG_CFG: Voltage detector configuration */
  #define VDETAO5V0_CONFIG_CFG_ResetValue (0x00000000UL) /*!< Reset value of CFG register.                                     */

/* PWRGOODHYST @Bits 0..1 : Power good detector hysteresis voltage value */
  #define VDETAO5V0_CONFIG_CFG_PWRGOODHYST_Pos (0UL) /*!< Position of PWRGOODHYST field.                                       */
  #define VDETAO5V0_CONFIG_CFG_PWRGOODHYST_Msk (0x3UL << VDETAO5V0_CONFIG_CFG_PWRGOODHYST_Pos) /*!< Bit mask of PWRGOODHYST
                                                                            field.*/                                              
  #define VDETAO5V0_CONFIG_CFG_PWRGOODHYST_Min (0x0UL) /*!< Min enumerator value of PWRGOODHYST field.                         */
  #define VDETAO5V0_CONFIG_CFG_PWRGOODHYST_Max (0x3UL) /*!< Max enumerator value of PWRGOODHYST field.                         */
  #define VDETAO5V0_CONFIG_CFG_PWRGOODHYST_Val0V050 (0x0UL) /*!< Hysteresis voltage is 50mV                                    */
  #define VDETAO5V0_CONFIG_CFG_PWRGOODHYST_Val0V025 (0x1UL) /*!< Hysteresis voltage is 25mV                                    */
  #define VDETAO5V0_CONFIG_CFG_PWRGOODHYST_Val0V150 (0x2UL) /*!< Hysteresis voltage is 150mV                                   */
  #define VDETAO5V0_CONFIG_CFG_PWRGOODHYST_Val0V100 (0x3UL) /*!< Hysteresis voltage is 100mV                                   */

/* SAMPLETIMEEXT @Bit 2 : Extend VDD sense sample time */
  #define VDETAO5V0_CONFIG_CFG_SAMPLETIMEEXT_Pos (2UL) /*!< Position of SAMPLETIMEEXT field.                                   */
  #define VDETAO5V0_CONFIG_CFG_SAMPLETIMEEXT_Msk (0x1UL << VDETAO5V0_CONFIG_CFG_SAMPLETIMEEXT_Pos) /*!< Bit mask of
                                                                            SAMPLETIMEEXT field.*/                                
  #define VDETAO5V0_CONFIG_CFG_SAMPLETIMEEXT_Min (0x0UL) /*!< Min enumerator value of SAMPLETIMEEXT field.                     */
  #define VDETAO5V0_CONFIG_CFG_SAMPLETIMEEXT_Max (0x1UL) /*!< Max enumerator value of SAMPLETIMEEXT field.                     */
  #define VDETAO5V0_CONFIG_CFG_SAMPLETIMEEXT_Disabled (0x0UL) /*!< Sample time extention disabled                              */
  #define VDETAO5V0_CONFIG_CFG_SAMPLETIMEEXT_Enabled (0x1UL) /*!< Sample time 200ns extention enabled                          */


/* VDETAO5V0_CONFIG_PWRGOODLVL: Power good detector threshold voltage level */
  #define VDETAO5V0_CONFIG_PWRGOODLVL_ResetValue (0x00000006UL) /*!< Reset value of PWRGOODLVL register.                       */

/* VAL @Bits 0..2 : Threshold voltage value. */
  #define VDETAO5V0_CONFIG_PWRGOODLVL_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define VDETAO5V0_CONFIG_PWRGOODLVL_VAL_Msk (0x7UL << VDETAO5V0_CONFIG_PWRGOODLVL_VAL_Pos) /*!< Bit mask of VAL field.       */
  #define VDETAO5V0_CONFIG_PWRGOODLVL_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                      */
  #define VDETAO5V0_CONFIG_PWRGOODLVL_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                       */



/* ================================================== Struct VDETAO5V0_TRIM ================================================== */
/**
  * @brief TRIM [VDETAO5V0_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRGOOD;                           /*!< (@ 0x00000000) Power good detector trimming                          */
} NRF_VDETAO5V0_TRIM_Type;                           /*!< Size = 4 (0x004)                                                     */

