adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EN @Bit 31 : Enable the analog test bus */
  #define VDETAO5V0_DFT_ATB1CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETAO5V0_DFT_ATB1CONFIG_EN_Msk (0x1UL << VDETAO5V0_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETAO5V0_DFT_ATB1CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETAO5V0_DFT_ATB1CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETAO5V0_DFT_ATB1CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                        */
  #define VDETAO5V0_DFT_ATB1CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                          */


/* VDETAO5V0_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define VDETAO5V0_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                          */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB0 */
  #define VDETAO5V0_DFT_DTB0CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VDETAO5V0_DFT_DTB0CONFIG_SELMUX_Msk (0x3UL << VDETAO5V0_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VDETAO5V0_DFT_DTB0CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VDETAO5V0_DFT_DTB0CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VDETAO5V0_DFT_DTB0CONFIG_SELMUX_PgdCompReady (0x0UL) /*!< VDETAO5V0_PGD_COMP_READY                                   */
  #define VDETAO5V0_DFT_DTB0CONFIG_SELMUX_PgdUnlatched (0x1UL) /*!< Unlatched PGD signal                                       */
  #define VDETAO5V0_DFT_DTB0CONFIG_SELMUX_ModeLP (0x2UL) /*!< MODE_LP_PGD                                                      */
  #define VDETAO5V0_DFT_DTB0CONFIG_SELMUX_ModeULPR (0x3UL) /*!< MODE_ULPR_PGD                                                  */

/* EN @Bit 31 : Enable the digital test bus */
  #define VDETAO5V0_DFT_DTB0CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETAO5V0_DFT_DTB0CONFIG_EN_Msk (0x1UL << VDETAO5V0_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETAO5V0_DFT_DTB0CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETAO5V0_DFT_DTB0CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETAO5V0_DFT_DTB0CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                       */
  #define VDETAO5V0_DFT_DTB0CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                         */


/* VDETAO5V0_DFT_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define VDETAO5V0_DFT_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                          */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB1 */
  #define VDETAO5V0_DFT_DTB1CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VDETAO5V0_DFT_DTB1CONFIG_SELMUX_Msk (0x3UL << VDETAO5V0_DFT_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VDETAO5V0_DFT_DTB1CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VDETAO5V0_DFT_DTB1CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VDETAO5V0_DFT_DTB1CONFIG_SELMUX_Pgd (0x0UL) /*!< VDETAO5V0_PGD                                                       */
  #define VDETAO5V0_DFT_DTB1CONFIG_SELMUX_Pwrup (0x1UL) /*!< PWRUP_PGD                                                         */
  #define VDETAO5V0_DFT_DTB1CONFIG_SELMUX_Settled (0x2UL) /*!< SETTLED_VDETAO5V0                                               */
  #define VDETAO5V0_DFT_DTB1CONFIG_SELMUX_Ready (0x3UL) /*!< READY_VDETAO5V0                                                   */

/* EN @Bit 31 : Enable the digital test bus */
  #define VDETAO5V0_DFT_DTB1CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETAO5V0_DFT_DTB1CONFIG_EN_Msk (0x1UL << VDETAO5V0_DFT_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETAO5V0_DFT_DTB1CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETAO5V0_DFT_DTB1CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETAO5V0_DFT_DTB1CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                       */
  #define VDETAO5V0_DFT_DTB1CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                         */


/* VDETAO5V0_DFT_DTB3CONFIG: Digital Test Bus 3 (DTB3) configuration */
  #define VDETAO5V0_DFT_DTB3CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB3CONFIG register.                          */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define VDETAO5V0_DFT_DTB3CONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                */
  #define VDETAO5V0_DFT_DTB3CONFIG_PWRUPDELTEST_Msk (0x1UL << VDETAO5V0_DFT_DTB3CONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of
                                                                            PWRUPDELTEST field.*/                                 
  #define VDETAO5V0_DFT_DTB3CONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                   */
  #define VDETAO5V0_DFT_DTB3CONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                   */
  #define VDETAO5V0_DFT_DTB3CONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                     */
  #define VDETAO5V0_DFT_DTB3CONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                       */


