adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VDETAO5V0_DFT_TCFG: Test mode configuration */
  #define VDETAO5V0_DFT_TCFG_ResetValue (0x00000000UL) /*!< Reset value of TCFG register.                                      */

/* FORCEPGDHIGH @Bit 0 : Force VDETAO5V0_PGD_AO_0V8 high */
  #define VDETAO5V0_DFT_TCFG_FORCEPGDHIGH_Pos (0UL)  /*!< Position of FORCEPGDHIGH field.                                      */
  #define VDETAO5V0_DFT_TCFG_FORCEPGDHIGH_Msk (0x1UL << VDETAO5V0_DFT_TCFG_FORCEPGDHIGH_Pos) /*!< Bit mask of FORCEPGDHIGH
                                                                            field.*/                                              
  #define VDETAO5V0_DFT_TCFG_FORCEPGDHIGH_Min (0x0UL) /*!< Min enumerator value of FORCEPGDHIGH field.                         */
  #define VDETAO5V0_DFT_TCFG_FORCEPGDHIGH_Max (0x1UL) /*!< Max enumerator value of FORCEPGDHIGH field.                         */
  #define VDETAO5V0_DFT_TCFG_FORCEPGDHIGH_Disabled (0x0UL) /*!< Normal operation                                               */
  #define VDETAO5V0_DFT_TCFG_FORCEPGDHIGH_Enabled (0x1UL) /*!< Force enabled                                                   */

/* COMPPWR @Bit 1 : Control PGD comparator ON/OFF */
  #define VDETAO5V0_DFT_TCFG_COMPPWR_Pos (1UL)       /*!< Position of COMPPWR field.                                           */
  #define VDETAO5V0_DFT_TCFG_COMPPWR_Msk (0x1UL << VDETAO5V0_DFT_TCFG_COMPPWR_Pos) /*!< Bit mask of COMPPWR field.             */
  #define VDETAO5V0_DFT_TCFG_COMPPWR_Min (0x0UL)     /*!< Min enumerator value of COMPPWR field.                               */
  #define VDETAO5V0_DFT_TCFG_COMPPWR_Max (0x1UL)     /*!< Max enumerator value of COMPPWR field.                               */
  #define VDETAO5V0_DFT_TCFG_COMPPWR_Off (0x0UL)     /*!< Comparator forced off                                                */
  #define VDETAO5V0_DFT_TCFG_COMPPWR_On (0x1UL)      /*!< Comparator forced on                                                 */

/* COMPBIAS @Bit 2 : Control PGD comparator 1uA bias ON/OFF */
  #define VDETAO5V0_DFT_TCFG_COMPBIAS_Pos (2UL)      /*!< Position of COMPBIAS field.                                          */
  #define VDETAO5V0_DFT_TCFG_COMPBIAS_Msk (0x1UL << VDETAO5V0_DFT_TCFG_COMPBIAS_Pos) /*!< Bit mask of COMPBIAS field.          */
  #define VDETAO5V0_DFT_TCFG_COMPBIAS_Min (0x0UL)    /*!< Min enumerator value of COMPBIAS field.                              */
  #define VDETAO5V0_DFT_TCFG_COMPBIAS_Max (0x1UL)    /*!< Max enumerator value of COMPBIAS field.                              */
  #define VDETAO5V0_DFT_TCFG_COMPBIAS_Off (0x0UL)    /*!< Comparator bias forced off                                           */
  #define VDETAO5V0_DFT_TCFG_COMPBIAS_On (0x1UL)     /*!< Comparator bias forced on                                            */

/* DEGLITCHLOCK @Bit 3 : Control lock of PGD deglitch logic */
  #define VDETAO5V0_DFT_TCFG_DEGLITCHLOCK_Pos (3UL)  /*!< Position of DEGLITCHLOCK field.                                      */
  #define VDETAO5V0_DFT_TCFG_DEGLITCHLOCK_Msk (0x1UL << VDETAO5V0_DFT_TCFG_DEGLITCHLOCK_Pos) /*!< Bit mask of DEGLITCHLOCK
                                                                            field.*/                                              
  #define VDETAO5V0_DFT_TCFG_DEGLITCHLOCK_Min (0x0UL) /*!< Min enumerator value of DEGLITCHLOCK field.                         */
  #define VDETAO5V0_DFT_TCFG_DEGLITCHLOCK_Max (0x1UL) /*!< Max enumerator value of DEGLITCHLOCK field.                         */
  #define VDETAO5V0_DFT_TCFG_DEGLITCHLOCK_Unlocked (0x0UL) /*!< Deglitch logic unlocked                                        */
  #define VDETAO5V0_DFT_TCFG_DEGLITCHLOCK_Locked (0x1UL) /*!< Deglitch logic locked                                            */

/* FORCEPGDHYSTOFF @Bit 4 : Force PGD hysteresis off */
  #define VDETAO5V0_DFT_TCFG_FORCEPGDHYSTOFF_Pos (4UL) /*!< Position of FORCEPGDHYSTOFF field.                                 */
  #define VDETAO5V0_DFT_TCFG_FORCEPGDHYSTOFF_Msk (0x1UL << VDETAO5V0_DFT_TCFG_FORCEPGDHYSTOFF_Pos) /*!< Bit mask of
                                                                            FORCEPGDHYSTOFF field.*/                              
  #define VDETAO5V0_DFT_TCFG_FORCEPGDHYSTOFF_Min (0x0UL) /*!< Min enumerator value of FORCEPGDHYSTOFF field.                   */
  #define VDETAO5V0_DFT_TCFG_FORCEPGDHYSTOFF_Max (0x1UL) /*!< Max enumerator value of FORCEPGDHYSTOFF field.                   */
  #define VDETAO5V0_DFT_TCFG_FORCEPGDHYSTOFF_Disabled (0x0UL) /*!< Normal operation                                            */
  #define VDETAO5V0_DFT_TCFG_FORCEPGDHYSTOFF_Enabled (0x1UL) /*!< Force enabled                                                */

/* FORCEFBANDSAMPSWON @Bit 5 : Force fb div on and sampling switch on */
  #define VDETAO5V0_DFT_TCFG_FORCEFBANDSAMPSWON_Pos (5UL) /*!< Position of FORCEFBANDSAMPSWON field.                           */
  #define VDETAO5V0_DFT_TCFG_FORCEFBANDSAMPSWON_Msk (0x1UL << VDETAO5V0_DFT_TCFG_FORCEFBANDSAMPSWON_Pos) /*!< Bit mask of
                                                                            FORCEFBANDSAMPSWON field.*/                           
  #define VDETAO5V0_DFT_TCFG_FORCEFBANDSAMPSWON_Min (0x0UL) /*!< Min enumerator value of FORCEFBANDSAMPSWON field.             */
  #define VDETAO5V0_DFT_TCFG_FORCEFBANDSAMPSWON_Max (0x1UL) /*!< Max enumerator value of FORCEFBANDSAMPSWON field.             */
  #define VDETAO5V0_DFT_TCFG_FORCEFBANDSAMPSWON_Disabled (0x0UL) /*!< Normal operation                                         */
  #define VDETAO5V0_DFT_TCFG_FORCEFBANDSAMPSWON_Enabled (0x1UL) /*!< Force enabled                                             */

/* FORCEFBDIVSWOFF @Bit 6 : Force fb div sample switch off for voltage force */
  #define VDETAO5V0_DFT_TCFG_FORCEFBDIVSWOFF_Pos (6UL) /*!< Position of FORCEFBDIVSWOFF field.                                 */
  #define VDETAO5V0_DFT_TCFG_FORCEFBDIVSWOFF_Msk (0x1UL << VDETAO5V0_DFT_TCFG_FORCEFBDIVSWOFF_Pos) /*!< Bit mask of
                                                                            FORCEFBDIVSWOFF field.*/                              
  #define VDETAO5V0_DFT_TCFG_FORCEFBDIVSWOFF_Min (0x0UL) /*!< Min enumerator value of FORCEFBDIVSWOFF field.                   */
  #define VDETAO5V0_DFT_TCFG_FORCEFBDIVSWOFF_Max (0x1UL) /*!< Max enumerator value of FORCEFBDIVSWOFF field.                   */
  #define VDETAO5V0_DFT_TCFG_FORCEFBDIVSWOFF_Disabled (0x0UL) /*!< Normal operation                                            */
  #define VDETAO5V0_DFT_TCFG_FORCEFBDIVSWOFF_Enabled (0x1UL) /*!< Force enabled                                                */

/* FORCEVREFSWOFF @Bit 7 : Force vref sample switch off for voltage force */
  #define VDETAO5V0_DFT_TCFG_FORCEVREFSWOFF_Pos (7UL) /*!< Position of FORCEVREFSWOFF field.                                   */
  #define VDETAO5V0_DFT_TCFG_FORCEVREFSWOFF_Msk (0x1UL << VDETAO5V0_DFT_TCFG_FORCEVREFSWOFF_Pos) /*!< Bit mask of FORCEVREFSWOFF
                                                                            field.*/                                              
  #define VDETAO5V0_DFT_TCFG_FORCEVREFSWOFF_Min (0x0UL) /*!< Min enumerator value of FORCEVREFSWOFF field.                     */
  #define VDETAO5V0_DFT_TCFG_FORCEVREFSWOFF_Max (0x1UL) /*!< Max enumerator value of FORCEVREFSWOFF field.                     */
  #define VDETAO5V0_DFT_TCFG_FORCEVREFSWOFF_Disabled (0x0UL) /*!< Normal operation                                             */
  #define VDETAO5V0_DFT_TCFG_FORCEVREFSWOFF_Enabled (0x1UL) /*!< Force enabled                                                 */


/* ==================================================== Struct VDETAO5V0 ===================================================== */
/**
  * @brief VDETAO5V0 peripheral
  */
  typedef struct {                                   /*!< VDETAO5V0 Structure                                                  */
    __OM uint32_t TASKS_PWRUP;                       /*!< (@ 0x00000000) Power up voltage detector                             */
    __OM uint32_t TASKS_PWRDOWN;                     /*!< (@ 0x00000004) Power down voltage detector                           */
    __IM uint32_t RESERVED[62];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) Power up done                                         */
    __IOM uint32_t EVENTS_SETTLED;                   /*!< (@ 0x00000104) Settled flag for MODE handshake                       */
    __IM uint32_t RESERVED1[126];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) Voltage detector status                               */
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000404) Status of analog module output signals                */
    __IM uint32_t RESERVED3[2];
    __IOM NRF_VDETAO5V0_CONFIG_Type CONFIG;          /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[10];
    __IOM NRF_VDETAO5V0_TRIM_Type TRIM;              /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED5[15];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000484) Voltage detector mode                                 */
    __IM uint32_t RESERVED6[30];
    __IOM NRF_VDETAO5V0_OVERRIDE_Type OVERRIDE;      /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED7[57];
    __IOM NRF_VDETAO5V0_DFT_Type DFT;                /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_VDETAO5V0_Type;                              /*!< Size = 1588 (0x634)                                                  */

/* VDETAO5V0_TASKS_PWRUP: Power up voltage detector */
  #define VDETAO5V0_TASKS_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWRUP register.                            */

