adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TASKS_PWRUP @Bit 0 : Power up voltage detector */
  #define VDETAO5V0_TASKS_PWRUP_TASKS_PWRUP_Pos (0UL) /*!< Position of TASKS_PWRUP field.                                      */
  #define VDETAO5V0_TASKS_PWRUP_TASKS_PWRUP_Msk (0x1UL << VDETAO5V0_TASKS_PWRUP_TASKS_PWRUP_Pos) /*!< Bit mask of TASKS_PWRUP
                                                                            field.*/                                              
  #define VDETAO5V0_TASKS_PWRUP_TASKS_PWRUP_Min (0x1UL) /*!< Min enumerator value of TASKS_PWRUP field.                        */
  #define VDETAO5V0_TASKS_PWRUP_TASKS_PWRUP_Max (0x1UL) /*!< Max enumerator value of TASKS_PWRUP field.                        */
  #define VDETAO5V0_TASKS_PWRUP_TASKS_PWRUP_Trigger (0x1UL) /*!< Trigger task                                                  */


/* VDETAO5V0_TASKS_PWRDOWN: Power down voltage detector */
  #define VDETAO5V0_TASKS_PWRDOWN_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWRDOWN register.                        */

/* TASKS_PWRDOWN @Bit 0 : Power down voltage detector */
  #define VDETAO5V0_TASKS_PWRDOWN_TASKS_PWRDOWN_Pos (0UL) /*!< Position of TASKS_PWRDOWN field.                                */
  #define VDETAO5V0_TASKS_PWRDOWN_TASKS_PWRDOWN_Msk (0x1UL << VDETAO5V0_TASKS_PWRDOWN_TASKS_PWRDOWN_Pos) /*!< Bit mask of
                                                                            TASKS_PWRDOWN field.*/                                
  #define VDETAO5V0_TASKS_PWRDOWN_TASKS_PWRDOWN_Min (0x1UL) /*!< Min enumerator value of TASKS_PWRDOWN field.                  */
  #define VDETAO5V0_TASKS_PWRDOWN_TASKS_PWRDOWN_Max (0x1UL) /*!< Max enumerator value of TASKS_PWRDOWN field.                  */
  #define VDETAO5V0_TASKS_PWRDOWN_TASKS_PWRDOWN_Trigger (0x1UL) /*!< Trigger task                                              */


/* VDETAO5V0_EVENTS_READY: Power up done */
  #define VDETAO5V0_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                          */

/* EVENTS_READY @Bit 0 : Power up done */
  #define VDETAO5V0_EVENTS_READY_EVENTS_READY_Pos (0UL) /*!< Position of EVENTS_READY field.                                   */
  #define VDETAO5V0_EVENTS_READY_EVENTS_READY_Msk (0x1UL << VDETAO5V0_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of
                                                                            EVENTS_READY field.*/                                 
  #define VDETAO5V0_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                     */
  #define VDETAO5V0_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                     */
  #define VDETAO5V0_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define VDETAO5V0_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                           */


/* VDETAO5V0_EVENTS_SETTLED: Settled flag for MODE handshake */
  #define VDETAO5V0_EVENTS_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SETTLED register.                      */

/* EVENTS_SETTLED @Bit 0 : Settled flag for MODE handshake */
  #define VDETAO5V0_EVENTS_SETTLED_EVENTS_SETTLED_Pos (0UL) /*!< Position of EVENTS_SETTLED field.                             */
  #define VDETAO5V0_EVENTS_SETTLED_EVENTS_SETTLED_Msk (0x1UL << VDETAO5V0_EVENTS_SETTLED_EVENTS_SETTLED_Pos) /*!< Bit mask of
                                                                            EVENTS_SETTLED field.*/                               
  #define VDETAO5V0_EVENTS_SETTLED_EVENTS_SETTLED_Min (0x0UL) /*!< Min enumerator value of EVENTS_SETTLED field.               */
  #define VDETAO5V0_EVENTS_SETTLED_EVENTS_SETTLED_Max (0x1UL) /*!< Max enumerator value of EVENTS_SETTLED field.               */
  #define VDETAO5V0_EVENTS_SETTLED_EVENTS_SETTLED_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define VDETAO5V0_EVENTS_SETTLED_EVENTS_SETTLED_Generated (0x1UL) /*!< Event generated                                       */


/* VDETAO5V0_INTEN: Enable or disable interrupt */
  #define VDETAO5V0_INTEN_ResetValue (0x00000000UL)  /*!< Reset value of INTEN register.                                       */

/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define VDETAO5V0_INTEN_READY_Pos (0UL)            /*!< Position of READY field.                                             */
  #define VDETAO5V0_INTEN_READY_Msk (0x1UL << VDETAO5V0_INTEN_READY_Pos) /*!< Bit mask of READY field.                         */
  #define VDETAO5V0_INTEN_READY_Min (0x0UL)          /*!< Min enumerator value of READY field.                                 */
  #define VDETAO5V0_INTEN_READY_Max (0x1UL)          /*!< Max enumerator value of READY field.                                 */
  #define VDETAO5V0_INTEN_READY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VDETAO5V0_INTEN_READY_Enabled (0x1UL)      /*!< Enable                                                               */

/* SETTLED @Bit 1 : Enable or disable interrupt for event SETTLED */
  #define VDETAO5V0_INTEN_SETTLED_Pos (1UL)          /*!< Position of SETTLED field.                                           */
  #define VDETAO5V0_INTEN_SETTLED_Msk (0x1UL << VDETAO5V0_INTEN_SETTLED_Pos) /*!< Bit mask of SETTLED field.                   */
  #define VDETAO5V0_INTEN_SETTLED_Min (0x0UL)        /*!< Min enumerator value of SETTLED field.                               */
  #define VDETAO5V0_INTEN_SETTLED_Max (0x1UL)        /*!< Max enumerator value of SETTLED field.                               */
  #define VDETAO5V0_INTEN_SETTLED_Disabled (0x0UL)   /*!< Disable                                                              */
  #define VDETAO5V0_INTEN_SETTLED_Enabled (0x1UL)    /*!< Enable                                                               */


/* VDETAO5V0_INTENSET: Enable interrupt */
  #define VDETAO5V0_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                  */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define VDETAO5V0_INTENSET_READY_Pos (0UL)         /*!< Position of READY field.                                             */
  #define VDETAO5V0_INTENSET_READY_Msk (0x1UL << VDETAO5V0_INTENSET_READY_Pos) /*!< Bit mask of READY field.                   */
  #define VDETAO5V0_INTENSET_READY_Min (0x0UL)       /*!< Min enumerator value of READY field.                                 */
  #define VDETAO5V0_INTENSET_READY_Max (0x1UL)       /*!< Max enumerator value of READY field.                                 */
  #define VDETAO5V0_INTENSET_READY_Set (0x1UL)       /*!< Enable                                                               */
  #define VDETAO5V0_INTENSET_READY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VDETAO5V0_INTENSET_READY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

