adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EN4 @Bit 4 : Enable the power good detector for port [4] */
  #define VDETIO_CONFIG_PWRGOOD_EN4_Pos (4UL)        /*!< Position of EN4 field.                                               */
  #define VDETIO_CONFIG_PWRGOOD_EN4_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN4_Pos) /*!< Bit mask of EN4 field.                   */
  #define VDETIO_CONFIG_PWRGOOD_EN4_Min (0x0UL)      /*!< Min enumerator value of EN4 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN4_Max (0x1UL)      /*!< Max enumerator value of EN4 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN4_Disabled (0x0UL) /*!< IO voltage detector is disabled                                      */
  #define VDETIO_CONFIG_PWRGOOD_EN4_Enabled (0x1UL)  /*!< IO voltage detector is enabled                                       */

/* EN5 @Bit 5 : Enable the power good detector for port [5] */
  #define VDETIO_CONFIG_PWRGOOD_EN5_Pos (5UL)        /*!< Position of EN5 field.                                               */
  #define VDETIO_CONFIG_PWRGOOD_EN5_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN5_Pos) /*!< Bit mask of EN5 field.                   */
  #define VDETIO_CONFIG_PWRGOOD_EN5_Min (0x0UL)      /*!< Min enumerator value of EN5 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN5_Max (0x1UL)      /*!< Max enumerator value of EN5 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN5_Disabled (0x0UL) /*!< IO voltage detector is disabled                                      */
  #define VDETIO_CONFIG_PWRGOOD_EN5_Enabled (0x1UL)  /*!< IO voltage detector is enabled                                       */

/* EN6 @Bit 6 : Enable the power good detector for port [6] */
  #define VDETIO_CONFIG_PWRGOOD_EN6_Pos (6UL)        /*!< Position of EN6 field.                                               */
  #define VDETIO_CONFIG_PWRGOOD_EN6_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN6_Pos) /*!< Bit mask of EN6 field.                   */
  #define VDETIO_CONFIG_PWRGOOD_EN6_Min (0x0UL)      /*!< Min enumerator value of EN6 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN6_Max (0x1UL)      /*!< Max enumerator value of EN6 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN6_Disabled (0x0UL) /*!< IO voltage detector is disabled                                      */
  #define VDETIO_CONFIG_PWRGOOD_EN6_Enabled (0x1UL)  /*!< IO voltage detector is enabled                                       */

/* EN7 @Bit 7 : Enable the power good detector for port [7] */
  #define VDETIO_CONFIG_PWRGOOD_EN7_Pos (7UL)        /*!< Position of EN7 field.                                               */
  #define VDETIO_CONFIG_PWRGOOD_EN7_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN7_Pos) /*!< Bit mask of EN7 field.                   */
  #define VDETIO_CONFIG_PWRGOOD_EN7_Min (0x0UL)      /*!< Min enumerator value of EN7 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN7_Max (0x1UL)      /*!< Max enumerator value of EN7 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN7_Disabled (0x0UL) /*!< IO voltage detector is disabled                                      */
  #define VDETIO_CONFIG_PWRGOOD_EN7_Enabled (0x1UL)  /*!< IO voltage detector is enabled                                       */

/* EN8 @Bit 8 : Enable the power good detector for port [8] */
  #define VDETIO_CONFIG_PWRGOOD_EN8_Pos (8UL)        /*!< Position of EN8 field.                                               */
  #define VDETIO_CONFIG_PWRGOOD_EN8_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN8_Pos) /*!< Bit mask of EN8 field.                   */
  #define VDETIO_CONFIG_PWRGOOD_EN8_Min (0x0UL)      /*!< Min enumerator value of EN8 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN8_Max (0x1UL)      /*!< Max enumerator value of EN8 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN8_Disabled (0x0UL) /*!< IO voltage detector is disabled                                      */
  #define VDETIO_CONFIG_PWRGOOD_EN8_Enabled (0x1UL)  /*!< IO voltage detector is enabled                                       */

/* EN9 @Bit 9 : Enable the power good detector for port [9] */
  #define VDETIO_CONFIG_PWRGOOD_EN9_Pos (9UL)        /*!< Position of EN9 field.                                               */
  #define VDETIO_CONFIG_PWRGOOD_EN9_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN9_Pos) /*!< Bit mask of EN9 field.                   */
  #define VDETIO_CONFIG_PWRGOOD_EN9_Min (0x0UL)      /*!< Min enumerator value of EN9 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN9_Max (0x1UL)      /*!< Max enumerator value of EN9 field.                                   */
  #define VDETIO_CONFIG_PWRGOOD_EN9_Disabled (0x0UL) /*!< IO voltage detector is disabled                                      */
  #define VDETIO_CONFIG_PWRGOOD_EN9_Enabled (0x1UL)  /*!< IO voltage detector is enabled                                       */

/* EN10 @Bit 10 : Enable the power good detector for port [10] */
  #define VDETIO_CONFIG_PWRGOOD_EN10_Pos (10UL)      /*!< Position of EN10 field.                                              */
  #define VDETIO_CONFIG_PWRGOOD_EN10_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN10_Pos) /*!< Bit mask of EN10 field.                */
  #define VDETIO_CONFIG_PWRGOOD_EN10_Min (0x0UL)     /*!< Min enumerator value of EN10 field.                                  */
  #define VDETIO_CONFIG_PWRGOOD_EN10_Max (0x1UL)     /*!< Max enumerator value of EN10 field.                                  */
  #define VDETIO_CONFIG_PWRGOOD_EN10_Disabled (0x0UL) /*!< IO voltage detector is disabled                                     */
  #define VDETIO_CONFIG_PWRGOOD_EN10_Enabled (0x1UL) /*!< IO voltage detector is enabled                                       */

/* EN11 @Bit 11 : Enable the power good detector for port [11] */
  #define VDETIO_CONFIG_PWRGOOD_EN11_Pos (11UL)      /*!< Position of EN11 field.                                              */
  #define VDETIO_CONFIG_PWRGOOD_EN11_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN11_Pos) /*!< Bit mask of EN11 field.                */
  #define VDETIO_CONFIG_PWRGOOD_EN11_Min (0x0UL)     /*!< Min enumerator value of EN11 field.                                  */
  #define VDETIO_CONFIG_PWRGOOD_EN11_Max (0x1UL)     /*!< Max enumerator value of EN11 field.                                  */
  #define VDETIO_CONFIG_PWRGOOD_EN11_Disabled (0x0UL) /*!< IO voltage detector is disabled                                     */
  #define VDETIO_CONFIG_PWRGOOD_EN11_Enabled (0x1UL) /*!< IO voltage detector is enabled                                       */

/* EN12 @Bit 12 : Enable the power good detector for port [12] */
  #define VDETIO_CONFIG_PWRGOOD_EN12_Pos (12UL)      /*!< Position of EN12 field.                                              */
  #define VDETIO_CONFIG_PWRGOOD_EN12_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN12_Pos) /*!< Bit mask of EN12 field.                */
  #define VDETIO_CONFIG_PWRGOOD_EN12_Min (0x0UL)     /*!< Min enumerator value of EN12 field.                                  */
  #define VDETIO_CONFIG_PWRGOOD_EN12_Max (0x1UL)     /*!< Max enumerator value of EN12 field.                                  */
  #define VDETIO_CONFIG_PWRGOOD_EN12_Disabled (0x0UL) /*!< IO voltage detector is disabled                                     */
  #define VDETIO_CONFIG_PWRGOOD_EN12_Enabled (0x1UL) /*!< IO voltage detector is enabled                                       */

/* EN13 @Bit 13 : Enable the power good detector for port [13] */
  #define VDETIO_CONFIG_PWRGOOD_EN13_Pos (13UL)      /*!< Position of EN13 field.                                              */
  #define VDETIO_CONFIG_PWRGOOD_EN13_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN13_Pos) /*!< Bit mask of EN13 field.                */
  #define VDETIO_CONFIG_PWRGOOD_EN13_Min (0x0UL)     /*!< Min enumerator value of EN13 field.                                  */
  #define VDETIO_CONFIG_PWRGOOD_EN13_Max (0x1UL)     /*!< Max enumerator value of EN13 field.                                  */
  #define VDETIO_CONFIG_PWRGOOD_EN13_Disabled (0x0UL) /*!< IO voltage detector is disabled                                     */
  #define VDETIO_CONFIG_PWRGOOD_EN13_Enabled (0x1UL) /*!< IO voltage detector is enabled                                       */

/* EN14 @Bit 14 : Enable the power good detector for port [14] */
  #define VDETIO_CONFIG_PWRGOOD_EN14_Pos (14UL)      /*!< Position of EN14 field.                                              */
  #define VDETIO_CONFIG_PWRGOOD_EN14_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN14_Pos) /*!< Bit mask of EN14 field.                */
  #define VDETIO_CONFIG_PWRGOOD_EN14_Min (0x0UL)     /*!< Min enumerator value of EN14 field.                                  */
  #define VDETIO_CONFIG_PWRGOOD_EN14_Max (0x1UL)     /*!< Max enumerator value of EN14 field.                                  */
  #define VDETIO_CONFIG_PWRGOOD_EN14_Disabled (0x0UL) /*!< IO voltage detector is disabled                                     */
  #define VDETIO_CONFIG_PWRGOOD_EN14_Enabled (0x1UL) /*!< IO voltage detector is enabled                                       */

/* EN15 @Bit 15 : Enable the power good detector for port [15] */
  #define VDETIO_CONFIG_PWRGOOD_EN15_Pos (15UL)      /*!< Position of EN15 field.                                              */
  #define VDETIO_CONFIG_PWRGOOD_EN15_Msk (0x1UL << VDETIO_CONFIG_PWRGOOD_EN15_Pos) /*!< Bit mask of EN15 field.                */
  #define VDETIO_CONFIG_PWRGOOD_EN15_Min (0x0UL)     /*!< Min enumerator value of EN15 field.                                  */
  #define VDETIO_CONFIG_PWRGOOD_EN15_Max (0x1UL)     /*!< Max enumerator value of EN15 field.                                  */
  #define VDETIO_CONFIG_PWRGOOD_EN15_Disabled (0x0UL) /*!< IO voltage detector is disabled                                     */
  #define VDETIO_CONFIG_PWRGOOD_EN15_Enabled (0x1UL) /*!< IO voltage detector is enabled                                       */


