adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ====================================================== Struct VDETIO ====================================================== */
/**
  * @brief VDETIO peripheral
  */
  typedef struct {                                   /*!< VDETIO Structure                                                     */
    __IM uint32_t RESERVED[256];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) Voltage detector status                               */
    __IM uint32_t RESERVED1[3];
    __IOM NRF_VDETIO_CONFIG_Type CONFIG;             /*!< (@ 0x00000410) (unspecified)                                         */
  } NRF_VDETIO_Type;                                 /*!< Size = 1044 (0x414)                                                  */

/* VDETIO_STATUS: Voltage detector status */
  #define VDETIO_STATUS_ResetValue (0x00000000UL)    /*!< Reset value of STATUS register.                                      */

/* PWRGOOD0 @Bit 0 : Power good detector status for port [0] */
  #define VDETIO_STATUS_PWRGOOD0_Pos (0UL)           /*!< Position of PWRGOOD0 field.                                          */
  #define VDETIO_STATUS_PWRGOOD0_Msk (0x1UL << VDETIO_STATUS_PWRGOOD0_Pos) /*!< Bit mask of PWRGOOD0 field.                    */
  #define VDETIO_STATUS_PWRGOOD0_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD0 field.                              */
  #define VDETIO_STATUS_PWRGOOD0_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD0 field.                              */
  #define VDETIO_STATUS_PWRGOOD0_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD0_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD1 @Bit 1 : Power good detector status for port [1] */
  #define VDETIO_STATUS_PWRGOOD1_Pos (1UL)           /*!< Position of PWRGOOD1 field.                                          */
  #define VDETIO_STATUS_PWRGOOD1_Msk (0x1UL << VDETIO_STATUS_PWRGOOD1_Pos) /*!< Bit mask of PWRGOOD1 field.                    */
  #define VDETIO_STATUS_PWRGOOD1_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD1 field.                              */
  #define VDETIO_STATUS_PWRGOOD1_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD1 field.                              */
  #define VDETIO_STATUS_PWRGOOD1_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD1_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD2 @Bit 2 : Power good detector status for port [2] */
  #define VDETIO_STATUS_PWRGOOD2_Pos (2UL)           /*!< Position of PWRGOOD2 field.                                          */
  #define VDETIO_STATUS_PWRGOOD2_Msk (0x1UL << VDETIO_STATUS_PWRGOOD2_Pos) /*!< Bit mask of PWRGOOD2 field.                    */
  #define VDETIO_STATUS_PWRGOOD2_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD2 field.                              */
  #define VDETIO_STATUS_PWRGOOD2_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD2 field.                              */
  #define VDETIO_STATUS_PWRGOOD2_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD2_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD3 @Bit 3 : Power good detector status for port [3] */
  #define VDETIO_STATUS_PWRGOOD3_Pos (3UL)           /*!< Position of PWRGOOD3 field.                                          */
  #define VDETIO_STATUS_PWRGOOD3_Msk (0x1UL << VDETIO_STATUS_PWRGOOD3_Pos) /*!< Bit mask of PWRGOOD3 field.                    */
  #define VDETIO_STATUS_PWRGOOD3_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD3 field.                              */
  #define VDETIO_STATUS_PWRGOOD3_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD3 field.                              */
  #define VDETIO_STATUS_PWRGOOD3_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD3_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD4 @Bit 4 : Power good detector status for port [4] */
  #define VDETIO_STATUS_PWRGOOD4_Pos (4UL)           /*!< Position of PWRGOOD4 field.                                          */
  #define VDETIO_STATUS_PWRGOOD4_Msk (0x1UL << VDETIO_STATUS_PWRGOOD4_Pos) /*!< Bit mask of PWRGOOD4 field.                    */
  #define VDETIO_STATUS_PWRGOOD4_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD4 field.                              */
  #define VDETIO_STATUS_PWRGOOD4_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD4 field.                              */
  #define VDETIO_STATUS_PWRGOOD4_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD4_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD5 @Bit 5 : Power good detector status for port [5] */
  #define VDETIO_STATUS_PWRGOOD5_Pos (5UL)           /*!< Position of PWRGOOD5 field.                                          */
  #define VDETIO_STATUS_PWRGOOD5_Msk (0x1UL << VDETIO_STATUS_PWRGOOD5_Pos) /*!< Bit mask of PWRGOOD5 field.                    */
  #define VDETIO_STATUS_PWRGOOD5_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD5 field.                              */
  #define VDETIO_STATUS_PWRGOOD5_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD5 field.                              */
  #define VDETIO_STATUS_PWRGOOD5_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD5_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD6 @Bit 6 : Power good detector status for port [6] */
  #define VDETIO_STATUS_PWRGOOD6_Pos (6UL)           /*!< Position of PWRGOOD6 field.                                          */
  #define VDETIO_STATUS_PWRGOOD6_Msk (0x1UL << VDETIO_STATUS_PWRGOOD6_Pos) /*!< Bit mask of PWRGOOD6 field.                    */
  #define VDETIO_STATUS_PWRGOOD6_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD6 field.                              */
  #define VDETIO_STATUS_PWRGOOD6_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD6 field.                              */
  #define VDETIO_STATUS_PWRGOOD6_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD6_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD7 @Bit 7 : Power good detector status for port [7] */
  #define VDETIO_STATUS_PWRGOOD7_Pos (7UL)           /*!< Position of PWRGOOD7 field.                                          */
  #define VDETIO_STATUS_PWRGOOD7_Msk (0x1UL << VDETIO_STATUS_PWRGOOD7_Pos) /*!< Bit mask of PWRGOOD7 field.                    */
  #define VDETIO_STATUS_PWRGOOD7_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD7 field.                              */
  #define VDETIO_STATUS_PWRGOOD7_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD7 field.                              */
  #define VDETIO_STATUS_PWRGOOD7_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD7_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD8 @Bit 8 : Power good detector status for port [8] */
  #define VDETIO_STATUS_PWRGOOD8_Pos (8UL)           /*!< Position of PWRGOOD8 field.                                          */
  #define VDETIO_STATUS_PWRGOOD8_Msk (0x1UL << VDETIO_STATUS_PWRGOOD8_Pos) /*!< Bit mask of PWRGOOD8 field.                    */
  #define VDETIO_STATUS_PWRGOOD8_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD8 field.                              */
  #define VDETIO_STATUS_PWRGOOD8_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD8 field.                              */
  #define VDETIO_STATUS_PWRGOOD8_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD8_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

