adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PWRGOOD9 @Bit 9 : Power good detector status for port [9] */
  #define VDETIO_STATUS_PWRGOOD9_Pos (9UL)           /*!< Position of PWRGOOD9 field.                                          */
  #define VDETIO_STATUS_PWRGOOD9_Msk (0x1UL << VDETIO_STATUS_PWRGOOD9_Pos) /*!< Bit mask of PWRGOOD9 field.                    */
  #define VDETIO_STATUS_PWRGOOD9_Min (0x0UL)         /*!< Min enumerator value of PWRGOOD9 field.                              */
  #define VDETIO_STATUS_PWRGOOD9_Max (0x1UL)         /*!< Max enumerator value of PWRGOOD9 field.                              */
  #define VDETIO_STATUS_PWRGOOD9_AboveThr (0x0UL)    /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD9_BelowThr (0x1UL)    /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD10 @Bit 10 : Power good detector status for port [10] */
  #define VDETIO_STATUS_PWRGOOD10_Pos (10UL)         /*!< Position of PWRGOOD10 field.                                         */
  #define VDETIO_STATUS_PWRGOOD10_Msk (0x1UL << VDETIO_STATUS_PWRGOOD10_Pos) /*!< Bit mask of PWRGOOD10 field.                 */
  #define VDETIO_STATUS_PWRGOOD10_Min (0x0UL)        /*!< Min enumerator value of PWRGOOD10 field.                             */
  #define VDETIO_STATUS_PWRGOOD10_Max (0x1UL)        /*!< Max enumerator value of PWRGOOD10 field.                             */
  #define VDETIO_STATUS_PWRGOOD10_AboveThr (0x0UL)   /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD10_BelowThr (0x1UL)   /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD11 @Bit 11 : Power good detector status for port [11] */
  #define VDETIO_STATUS_PWRGOOD11_Pos (11UL)         /*!< Position of PWRGOOD11 field.                                         */
  #define VDETIO_STATUS_PWRGOOD11_Msk (0x1UL << VDETIO_STATUS_PWRGOOD11_Pos) /*!< Bit mask of PWRGOOD11 field.                 */
  #define VDETIO_STATUS_PWRGOOD11_Min (0x0UL)        /*!< Min enumerator value of PWRGOOD11 field.                             */
  #define VDETIO_STATUS_PWRGOOD11_Max (0x1UL)        /*!< Max enumerator value of PWRGOOD11 field.                             */
  #define VDETIO_STATUS_PWRGOOD11_AboveThr (0x0UL)   /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD11_BelowThr (0x1UL)   /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD12 @Bit 12 : Power good detector status for port [12] */
  #define VDETIO_STATUS_PWRGOOD12_Pos (12UL)         /*!< Position of PWRGOOD12 field.                                         */
  #define VDETIO_STATUS_PWRGOOD12_Msk (0x1UL << VDETIO_STATUS_PWRGOOD12_Pos) /*!< Bit mask of PWRGOOD12 field.                 */
  #define VDETIO_STATUS_PWRGOOD12_Min (0x0UL)        /*!< Min enumerator value of PWRGOOD12 field.                             */
  #define VDETIO_STATUS_PWRGOOD12_Max (0x1UL)        /*!< Max enumerator value of PWRGOOD12 field.                             */
  #define VDETIO_STATUS_PWRGOOD12_AboveThr (0x0UL)   /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD12_BelowThr (0x1UL)   /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD13 @Bit 13 : Power good detector status for port [13] */
  #define VDETIO_STATUS_PWRGOOD13_Pos (13UL)         /*!< Position of PWRGOOD13 field.                                         */
  #define VDETIO_STATUS_PWRGOOD13_Msk (0x1UL << VDETIO_STATUS_PWRGOOD13_Pos) /*!< Bit mask of PWRGOOD13 field.                 */
  #define VDETIO_STATUS_PWRGOOD13_Min (0x0UL)        /*!< Min enumerator value of PWRGOOD13 field.                             */
  #define VDETIO_STATUS_PWRGOOD13_Max (0x1UL)        /*!< Max enumerator value of PWRGOOD13 field.                             */
  #define VDETIO_STATUS_PWRGOOD13_AboveThr (0x0UL)   /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD13_BelowThr (0x1UL)   /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD14 @Bit 14 : Power good detector status for port [14] */
  #define VDETIO_STATUS_PWRGOOD14_Pos (14UL)         /*!< Position of PWRGOOD14 field.                                         */
  #define VDETIO_STATUS_PWRGOOD14_Msk (0x1UL << VDETIO_STATUS_PWRGOOD14_Pos) /*!< Bit mask of PWRGOOD14 field.                 */
  #define VDETIO_STATUS_PWRGOOD14_Min (0x0UL)        /*!< Min enumerator value of PWRGOOD14 field.                             */
  #define VDETIO_STATUS_PWRGOOD14_Max (0x1UL)        /*!< Max enumerator value of PWRGOOD14 field.                             */
  #define VDETIO_STATUS_PWRGOOD14_AboveThr (0x0UL)   /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD14_BelowThr (0x1UL)   /*!< Power good detector detected voltage below threshold level           */

/* PWRGOOD15 @Bit 15 : Power good detector status for port [15] */
  #define VDETIO_STATUS_PWRGOOD15_Pos (15UL)         /*!< Position of PWRGOOD15 field.                                         */
  #define VDETIO_STATUS_PWRGOOD15_Msk (0x1UL << VDETIO_STATUS_PWRGOOD15_Pos) /*!< Bit mask of PWRGOOD15 field.                 */
  #define VDETIO_STATUS_PWRGOOD15_Min (0x0UL)        /*!< Min enumerator value of PWRGOOD15 field.                             */
  #define VDETIO_STATUS_PWRGOOD15_Max (0x1UL)        /*!< Max enumerator value of PWRGOOD15 field.                             */
  #define VDETIO_STATUS_PWRGOOD15_AboveThr (0x0UL)   /*!< Power good detector detected voltage above threshold level           */
  #define VDETIO_STATUS_PWRGOOD15_BelowThr (0x1UL)   /*!< Power good detector detected voltage below threshold level           */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        VDETPOF5V0                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

