adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VDETPOF5V0_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define VDETPOF5V0_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                            */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETPOF5V0_OVERRIDE_RETAIN_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define VDETPOF5V0_OVERRIDE_RETAIN_VAL_Msk (0x1UL << VDETPOF5V0_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.         */

/* EN @Bit 31 : Enable the override */
  #define VDETPOF5V0_OVERRIDE_RETAIN_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define VDETPOF5V0_OVERRIDE_RETAIN_EN_Msk (0x1UL << VDETPOF5V0_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.            */
  #define VDETPOF5V0_OVERRIDE_RETAIN_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define VDETPOF5V0_OVERRIDE_RETAIN_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define VDETPOF5V0_OVERRIDE_RETAIN_EN_Disabled (0x0UL) /*!< Override is disabled                                             */
  #define VDETPOF5V0_OVERRIDE_RETAIN_EN_Enabled (0x1UL) /*!< Override is enabled                                               */


/* VDETPOF5V0_OVERRIDE_READY: Override the READY signal from the analog module */
  #define VDETPOF5V0_OVERRIDE_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                              */

/* VAL @Bit 0 : Current value of the signal */
  #define VDETPOF5V0_OVERRIDE_READY_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VDETPOF5V0_OVERRIDE_READY_VAL_Msk (0x1UL << VDETPOF5V0_OVERRIDE_READY_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VDETPOF5V0_OVERRIDE_READY_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VDETPOF5V0_OVERRIDE_READY_EN_Msk (0x1UL << VDETPOF5V0_OVERRIDE_READY_EN_Pos) /*!< Bit mask of EN field.              */
  #define VDETPOF5V0_OVERRIDE_READY_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VDETPOF5V0_OVERRIDE_READY_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VDETPOF5V0_OVERRIDE_READY_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VDETPOF5V0_OVERRIDE_READY_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* VDETPOF5V0_OVERRIDE_SETTLED: Override the SETTLED signal from the analog module */
  #define VDETPOF5V0_OVERRIDE_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of SETTLED register.                          */

/* VAL @Bit 0 : Current value of the signal */
  #define VDETPOF5V0_OVERRIDE_SETTLED_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define VDETPOF5V0_OVERRIDE_SETTLED_VAL_Msk (0x1UL << VDETPOF5V0_OVERRIDE_SETTLED_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : Enable the override */
  #define VDETPOF5V0_OVERRIDE_SETTLED_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define VDETPOF5V0_OVERRIDE_SETTLED_EN_Msk (0x1UL << VDETPOF5V0_OVERRIDE_SETTLED_EN_Pos) /*!< Bit mask of EN field.          */
  #define VDETPOF5V0_OVERRIDE_SETTLED_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define VDETPOF5V0_OVERRIDE_SETTLED_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define VDETPOF5V0_OVERRIDE_SETTLED_EN_Disabled (0x0UL) /*!< Override is disabled                                            */
  #define VDETPOF5V0_OVERRIDE_SETTLED_EN_Enabled (0x1UL) /*!< Override is enabled                                              */


/* VDETPOF5V0_OVERRIDE_POFWARN: Override the POFAO5V0_WARN signal from the analog module */
  #define VDETPOF5V0_OVERRIDE_POFWARN_ResetValue (0x00000000UL) /*!< Reset value of POFWARN register.                          */

/* VAL @Bit 0 : Current value of the signal */
  #define VDETPOF5V0_OVERRIDE_POFWARN_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define VDETPOF5V0_OVERRIDE_POFWARN_VAL_Msk (0x1UL << VDETPOF5V0_OVERRIDE_POFWARN_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : Enable the override */
  #define VDETPOF5V0_OVERRIDE_POFWARN_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define VDETPOF5V0_OVERRIDE_POFWARN_EN_Msk (0x1UL << VDETPOF5V0_OVERRIDE_POFWARN_EN_Pos) /*!< Bit mask of EN field.          */
  #define VDETPOF5V0_OVERRIDE_POFWARN_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define VDETPOF5V0_OVERRIDE_POFWARN_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define VDETPOF5V0_OVERRIDE_POFWARN_EN_Disabled (0x0UL) /*!< Override is disabled                                            */
  #define VDETPOF5V0_OVERRIDE_POFWARN_EN_Enabled (0x1UL) /*!< Override is enabled                                              */



/* ================================================== Struct VDETPOF5V0_DFT ================================================== */
/**
  * @brief DFT [VDETPOF5V0_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  DTB3CONFIG;                        /*!< (@ 0x0000001C) Digital Test Bus 3 (DTB3) configuration               */
} NRF_VDETPOF5V0_DFT_Type;                           /*!< Size = 32 (0x020)                                                    */

/* VDETPOF5V0_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define VDETPOF5V0_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                         */

/* SELMUX @Bit 0 : Select multiplexer for ATB0 */
  #define VDETPOF5V0_DFT_ATB0CONFIG_SELMUX_Pos (0UL) /*!< Position of SELMUX field.                                            */
  #define VDETPOF5V0_DFT_ATB0CONFIG_SELMUX_Msk (0x1UL << VDETPOF5V0_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.  */
  #define VDETPOF5V0_DFT_ATB0CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                              */
  #define VDETPOF5V0_DFT_ATB0CONFIG_SELMUX_Max (0x1UL) /*!< Max enumerator value of SELMUX field.                              */
  #define VDETPOF5V0_DFT_ATB0CONFIG_SELMUX_ATB0sense (0x0UL) /*!< Use ATB0 voltage for sensing instead of VDIV tap voltage     */
  #define VDETPOF5V0_DFT_ATB0CONFIG_SELMUX_ConnectVSS (0x1UL) /*!< Connect VSS to ATB0                                         */

