adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SETTLED @Bit 1 : Enable or disable interrupt for event SETTLED */
  #define VDETPOF5V0_INTEN_SETTLED_Pos (1UL)         /*!< Position of SETTLED field.                                           */
  #define VDETPOF5V0_INTEN_SETTLED_Msk (0x1UL << VDETPOF5V0_INTEN_SETTLED_Pos) /*!< Bit mask of SETTLED field.                 */
  #define VDETPOF5V0_INTEN_SETTLED_Min (0x0UL)       /*!< Min enumerator value of SETTLED field.                               */
  #define VDETPOF5V0_INTEN_SETTLED_Max (0x1UL)       /*!< Max enumerator value of SETTLED field.                               */
  #define VDETPOF5V0_INTEN_SETTLED_Disabled (0x0UL)  /*!< Disable                                                              */
  #define VDETPOF5V0_INTEN_SETTLED_Enabled (0x1UL)   /*!< Enable                                                               */

/* POFWARN @Bit 2 : Enable or disable interrupt for event POFWARN */
  #define VDETPOF5V0_INTEN_POFWARN_Pos (2UL)         /*!< Position of POFWARN field.                                           */
  #define VDETPOF5V0_INTEN_POFWARN_Msk (0x1UL << VDETPOF5V0_INTEN_POFWARN_Pos) /*!< Bit mask of POFWARN field.                 */
  #define VDETPOF5V0_INTEN_POFWARN_Min (0x0UL)       /*!< Min enumerator value of POFWARN field.                               */
  #define VDETPOF5V0_INTEN_POFWARN_Max (0x1UL)       /*!< Max enumerator value of POFWARN field.                               */
  #define VDETPOF5V0_INTEN_POFWARN_Disabled (0x0UL)  /*!< Disable                                                              */
  #define VDETPOF5V0_INTEN_POFWARN_Enabled (0x1UL)   /*!< Enable                                                               */


/* VDETPOF5V0_INTENSET: Enable interrupt */
  #define VDETPOF5V0_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                 */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define VDETPOF5V0_INTENSET_READY_Pos (0UL)        /*!< Position of READY field.                                             */
  #define VDETPOF5V0_INTENSET_READY_Msk (0x1UL << VDETPOF5V0_INTENSET_READY_Pos) /*!< Bit mask of READY field.                 */
  #define VDETPOF5V0_INTENSET_READY_Min (0x0UL)      /*!< Min enumerator value of READY field.                                 */
  #define VDETPOF5V0_INTENSET_READY_Max (0x1UL)      /*!< Max enumerator value of READY field.                                 */
  #define VDETPOF5V0_INTENSET_READY_Set (0x1UL)      /*!< Enable                                                               */
  #define VDETPOF5V0_INTENSET_READY_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define VDETPOF5V0_INTENSET_READY_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* SETTLED @Bit 1 : Write '1' to enable interrupt for event SETTLED */
  #define VDETPOF5V0_INTENSET_SETTLED_Pos (1UL)      /*!< Position of SETTLED field.                                           */
  #define VDETPOF5V0_INTENSET_SETTLED_Msk (0x1UL << VDETPOF5V0_INTENSET_SETTLED_Pos) /*!< Bit mask of SETTLED field.           */
  #define VDETPOF5V0_INTENSET_SETTLED_Min (0x0UL)    /*!< Min enumerator value of SETTLED field.                               */
  #define VDETPOF5V0_INTENSET_SETTLED_Max (0x1UL)    /*!< Max enumerator value of SETTLED field.                               */
  #define VDETPOF5V0_INTENSET_SETTLED_Set (0x1UL)    /*!< Enable                                                               */
  #define VDETPOF5V0_INTENSET_SETTLED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define VDETPOF5V0_INTENSET_SETTLED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* POFWARN @Bit 2 : Write '1' to enable interrupt for event POFWARN */
  #define VDETPOF5V0_INTENSET_POFWARN_Pos (2UL)      /*!< Position of POFWARN field.                                           */
  #define VDETPOF5V0_INTENSET_POFWARN_Msk (0x1UL << VDETPOF5V0_INTENSET_POFWARN_Pos) /*!< Bit mask of POFWARN field.           */
  #define VDETPOF5V0_INTENSET_POFWARN_Min (0x0UL)    /*!< Min enumerator value of POFWARN field.                               */
  #define VDETPOF5V0_INTENSET_POFWARN_Max (0x1UL)    /*!< Max enumerator value of POFWARN field.                               */
  #define VDETPOF5V0_INTENSET_POFWARN_Set (0x1UL)    /*!< Enable                                                               */
  #define VDETPOF5V0_INTENSET_POFWARN_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define VDETPOF5V0_INTENSET_POFWARN_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* VDETPOF5V0_INTENCLR: Disable interrupt */
  #define VDETPOF5V0_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                 */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define VDETPOF5V0_INTENCLR_READY_Pos (0UL)        /*!< Position of READY field.                                             */
  #define VDETPOF5V0_INTENCLR_READY_Msk (0x1UL << VDETPOF5V0_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                 */
  #define VDETPOF5V0_INTENCLR_READY_Min (0x0UL)      /*!< Min enumerator value of READY field.                                 */
  #define VDETPOF5V0_INTENCLR_READY_Max (0x1UL)      /*!< Max enumerator value of READY field.                                 */
  #define VDETPOF5V0_INTENCLR_READY_Clear (0x1UL)    /*!< Disable                                                              */
  #define VDETPOF5V0_INTENCLR_READY_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define VDETPOF5V0_INTENCLR_READY_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* SETTLED @Bit 1 : Write '1' to disable interrupt for event SETTLED */
  #define VDETPOF5V0_INTENCLR_SETTLED_Pos (1UL)      /*!< Position of SETTLED field.                                           */
  #define VDETPOF5V0_INTENCLR_SETTLED_Msk (0x1UL << VDETPOF5V0_INTENCLR_SETTLED_Pos) /*!< Bit mask of SETTLED field.           */
  #define VDETPOF5V0_INTENCLR_SETTLED_Min (0x0UL)    /*!< Min enumerator value of SETTLED field.                               */
  #define VDETPOF5V0_INTENCLR_SETTLED_Max (0x1UL)    /*!< Max enumerator value of SETTLED field.                               */
  #define VDETPOF5V0_INTENCLR_SETTLED_Clear (0x1UL)  /*!< Disable                                                              */
  #define VDETPOF5V0_INTENCLR_SETTLED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define VDETPOF5V0_INTENCLR_SETTLED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

