adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VDETVS0V8_CONFIG_CFG: Voltage detector configuration */
  #define VDETVS0V8_CONFIG_CFG_ResetValue (0x00000000UL) /*!< Reset value of CFG register.                                     */

/* BROWNOUTHYST @Bits 0..1 : Brown out detector hysteresis voltage value */
  #define VDETVS0V8_CONFIG_CFG_BROWNOUTHYST_Pos (0UL) /*!< Position of BROWNOUTHYST field.                                     */
  #define VDETVS0V8_CONFIG_CFG_BROWNOUTHYST_Msk (0x3UL << VDETVS0V8_CONFIG_CFG_BROWNOUTHYST_Pos) /*!< Bit mask of BROWNOUTHYST
                                                                            field.*/                                              
  #define VDETVS0V8_CONFIG_CFG_BROWNOUTHYST_Min (0x0UL) /*!< Min enumerator value of BROWNOUTHYST field.                       */
  #define VDETVS0V8_CONFIG_CFG_BROWNOUTHYST_Max (0x3UL) /*!< Max enumerator value of BROWNOUTHYST field.                       */
  #define VDETVS0V8_CONFIG_CFG_BROWNOUTHYST_Val0V0250 (0x0UL) /*!< Hysteresis voltage is 25mV                                  */
  #define VDETVS0V8_CONFIG_CFG_BROWNOUTHYST_Val0V0500 (0x1UL) /*!< Hysteresis voltage is 50mV                                  */
  #define VDETVS0V8_CONFIG_CFG_BROWNOUTHYST_Val0V0125 (0x2UL) /*!< Hysteresis voltage is 12.5mV                                */
  #define VDETVS0V8_CONFIG_CFG_BROWNOUTHYST_Val0V0167 (0x3UL) /*!< Hysteresis voltage is 16.7mV                                */


/* VDETVS0V8_CONFIG_PWRGOODLVL: Power good detector threshold voltage level */
  #define VDETVS0V8_CONFIG_PWRGOODLVL_ResetValue (0x0000002FUL) /*!< Reset value of PWRGOODLVL register.                       */

/* VAL @Bits 0..5 : Threshold voltage value. */
  #define VDETVS0V8_CONFIG_PWRGOODLVL_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define VDETVS0V8_CONFIG_PWRGOODLVL_VAL_Msk (0x3FUL << VDETVS0V8_CONFIG_PWRGOODLVL_VAL_Pos) /*!< Bit mask of VAL field.      */
  #define VDETVS0V8_CONFIG_PWRGOODLVL_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                      */
  #define VDETVS0V8_CONFIG_PWRGOODLVL_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                       */


/* VDETVS0V8_CONFIG_BROWNOUTLVL: Brown out detector threshold voltage level */
  #define VDETVS0V8_CONFIG_BROWNOUTLVL_ResetValue (0x0000002DUL) /*!< Reset value of BROWNOUTLVL register.                     */

/* VAL @Bits 0..5 : Threshold voltage value. */
  #define VDETVS0V8_CONFIG_BROWNOUTLVL_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define VDETVS0V8_CONFIG_BROWNOUTLVL_VAL_Msk (0x3FUL << VDETVS0V8_CONFIG_BROWNOUTLVL_VAL_Pos) /*!< Bit mask of VAL field.    */
  #define VDETVS0V8_CONFIG_BROWNOUTLVL_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                     */
  #define VDETVS0V8_CONFIG_BROWNOUTLVL_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                      */



/* ================================================== Struct VDETVS0V8_TRIM ================================================== */
/**
  * @brief TRIM [VDETVS0V8_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  BROWNOUT;                          /*!< (@ 0x00000000) Brown out detector trimming                           */
  __IOM uint32_t  PWRGOOD;                           /*!< (@ 0x00000004) Power good detector trimming                          */
} NRF_VDETVS0V8_TRIM_Type;                           /*!< Size = 8 (0x008)                                                     */

/* VDETVS0V8_TRIM_BROWNOUT: Brown out detector trimming */
  #define VDETVS0V8_TRIM_BROWNOUT_ResetValue (0x00000000UL) /*!< Reset value of BROWNOUT register.                             */

/* VAL @Bits 0..3 : Threshold voltage deviation value. */
  #define VDETVS0V8_TRIM_BROWNOUT_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VDETVS0V8_TRIM_BROWNOUT_VAL_Msk (0xFUL << VDETVS0V8_TRIM_BROWNOUT_VAL_Pos) /*!< Bit mask of VAL field.               */
  #define VDETVS0V8_TRIM_BROWNOUT_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                          */
  #define VDETVS0V8_TRIM_BROWNOUT_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                           */


/* VDETVS0V8_TRIM_PWRGOOD: Power good detector trimming */
  #define VDETVS0V8_TRIM_PWRGOOD_ResetValue (0x00000000UL) /*!< Reset value of PWRGOOD register.                               */

/* VAL @Bits 0..3 : Threshold voltage trimming deviation value. */
  #define VDETVS0V8_TRIM_PWRGOOD_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define VDETVS0V8_TRIM_PWRGOOD_VAL_Msk (0xFUL << VDETVS0V8_TRIM_PWRGOOD_VAL_Pos) /*!< Bit mask of VAL field.                 */
  #define VDETVS0V8_TRIM_PWRGOOD_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                           */
  #define VDETVS0V8_TRIM_PWRGOOD_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                            */



/* ================================================ Struct VDETVS0V8_OVERRIDE ================================================ */
/**
  * @brief OVERRIDE [VDETVS0V8_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  MODEULPR;                          /*!< (@ 0x00000008) Override the MODE_ULPR signal to the analog module    */
  __IOM uint32_t  MODELP;                            /*!< (@ 0x0000000C) Override the MODE_LP signal to the analog module      */
  __IOM uint32_t  PGDREQUEST;                        /*!< (@ 0x00000010) Override the PGD_REQUEST signal to the analog module  */
  __IOM uint32_t  PGDCANCEL;                         /*!< (@ 0x00000014) Override the PGD_CANCEL signal to the analog module   */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000018) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x0000001C) Override the SETTLED signal from the analog module    */
  __IOM uint32_t  BOD;                               /*!< (@ 0x00000020) Override the BOD signal from the analog module        */
  __IOM uint32_t  PGD;                               /*!< (@ 0x00000024) Override the PGD signal from the analog module        */
  __IOM uint32_t  BODVOLTSEL;                        /*!< (@ 0x00000028) Override the BOD_VOLT_SEL signal to the analog module */
} NRF_VDETVS0V8_OVERRIDE_Type;                       /*!< Size = 44 (0x02C)                                                    */

/* VDETVS0V8_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define VDETVS0V8_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                               */

/* VAL @Bit 0 : Override value for the signal */
  #define VDETVS0V8_OVERRIDE_PWRUP_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VDETVS0V8_OVERRIDE_PWRUP_VAL_Msk (0x1UL << VDETVS0V8_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VDETVS0V8_OVERRIDE_PWRUP_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETVS0V8_OVERRIDE_PWRUP_EN_Msk (0x1UL << VDETVS0V8_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETVS0V8_OVERRIDE_PWRUP_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETVS0V8_OVERRIDE_PWRUP_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETVS0V8_OVERRIDE_PWRUP_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VDETVS0V8_OVERRIDE_PWRUP_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


