adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VDETVS0V8_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define VDETVS0V8_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                          */

/* SELMUX @Bits 0..1 : Select multiplexer for ATB0 */
  #define VDETVS0V8_DFT_ATB0CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VDETVS0V8_DFT_ATB0CONFIG_SELMUX_Msk (0x3UL << VDETVS0V8_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VDETVS0V8_DFT_ATB0CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VDETVS0V8_DFT_ATB0CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VDETVS0V8_DFT_ATB0CONFIG_SELMUX_None (0x0UL) /*!< None selected                                                      */
  #define VDETVS0V8_DFT_ATB0CONFIG_SELMUX_ConnectIDBG1U (0x1UL) /*!< Connect IDBG_1U to ATB0                                   */
  #define VDETVS0V8_DFT_ATB0CONFIG_SELMUX_ConnectVSS (0x2UL) /*!< Connect VSS to ATB0                                          */
  #define VDETVS0V8_DFT_ATB0CONFIG_SELMUX_ConnectSenseVoltage (0x3UL) /*!< Use ATB0 as sense voltage instead of VDD_SENSE_0V8  */

/* EN @Bit 31 : Enable the analog test bus */
  #define VDETVS0V8_DFT_ATB0CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETVS0V8_DFT_ATB0CONFIG_EN_Msk (0x1UL << VDETVS0V8_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETVS0V8_DFT_ATB0CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETVS0V8_DFT_ATB0CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETVS0V8_DFT_ATB0CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                        */
  #define VDETVS0V8_DFT_ATB0CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                          */


/* VDETVS0V8_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define VDETVS0V8_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                          */

/* SELMUX @Bit 0 : Select multiplexer for ATB1 */
  #define VDETVS0V8_DFT_ATB1CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VDETVS0V8_DFT_ATB1CONFIG_SELMUX_Msk (0x1UL << VDETVS0V8_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VDETVS0V8_DFT_ATB1CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VDETVS0V8_DFT_ATB1CONFIG_SELMUX_Max (0x1UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VDETVS0V8_DFT_ATB1CONFIG_SELMUX_None (0x0UL) /*!< None selected                                                      */
  #define VDETVS0V8_DFT_ATB1CONFIG_SELMUX_ConnectVREFBOD (0x1UL) /*!< Connect VREF_BOD to ATB1                                 */

/* EN @Bit 31 : Enable the analog test bus */
  #define VDETVS0V8_DFT_ATB1CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETVS0V8_DFT_ATB1CONFIG_EN_Msk (0x1UL << VDETVS0V8_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETVS0V8_DFT_ATB1CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETVS0V8_DFT_ATB1CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETVS0V8_DFT_ATB1CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                        */
  #define VDETVS0V8_DFT_ATB1CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                          */


/* VDETVS0V8_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define VDETVS0V8_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                          */

/* SELMUX @Bits 0..2 : Select multiplexer for DTB0 */
  #define VDETVS0V8_DFT_DTB0CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VDETVS0V8_DFT_DTB0CONFIG_SELMUX_Msk (0x7UL << VDETVS0V8_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VDETVS0V8_DFT_DTB0CONFIG_SELMUX_Min (0x1UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VDETVS0V8_DFT_DTB0CONFIG_SELMUX_Max (0x6UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VDETVS0V8_DFT_DTB0CONFIG_SELMUX_SettledVDETAO0V8AO0V8 (0x1UL) /*!< SETTLED_VDETAO0V8_AO_0V8                          */
  #define VDETVS0V8_DFT_DTB0CONFIG_SELMUX_PGDCompOutput (0x2UL) /*!< PGD comparator output                                     */
  #define VDETVS0V8_DFT_DTB0CONFIG_SELMUX_PGDCompOutputPost (0x3UL) /*!< PGD comparator output after the handshake logic.      */
  #define VDETVS0V8_DFT_DTB0CONFIG_SELMUX_PWRUPPGDSW1V8 (0x4UL) /*!< PWRUP_PGD_SW_1V8                                          */
  #define VDETVS0V8_DFT_DTB0CONFIG_SELMUX_BODLockAckSW1V8 (0x6UL) /*!< BOD_LOCK_ACK_SW_1V8                                     */

/* EN @Bit 31 : Enable the digital test bus */
  #define VDETVS0V8_DFT_DTB0CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETVS0V8_DFT_DTB0CONFIG_EN_Msk (0x1UL << VDETVS0V8_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETVS0V8_DFT_DTB0CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETVS0V8_DFT_DTB0CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETVS0V8_DFT_DTB0CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                       */
  #define VDETVS0V8_DFT_DTB0CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                         */


/* VDETVS0V8_DFT_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define VDETVS0V8_DFT_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                          */

