adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SELMUX @Bits 0..2 : Select multiplexer for DTB1 */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_Msk (0x7UL << VDETVS0V8_DFT_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_Min (0x1UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_Max (0x7UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_ReadyVDETAO0V8AO0V8 (0x1UL) /*!< READY_VDETAO0V8_AO_0V8                              */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_BODCompOutput (0x2UL) /*!< BOD comparator output                                     */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_BODCompOutputPost (0x3UL) /*!< BOD comparator output after the deglitch logic.       */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_PWRUPBODSW1V8 (0x4UL) /*!< PWRUP_BOD_SW_1V8                                          */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_PWRUPBODBIASSW1V8 (0x5UL) /*!< PWRUP_BOD_BIAS_SW_1V8                                 */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_BODLockReqSW1V8 (0x6UL) /*!< BOD_LOCK_REQ_SW_1V8                                     */
  #define VDETVS0V8_DFT_DTB1CONFIG_SELMUX_ReadyBODSW1V8 (0x7UL) /*!< READY_BOD_SW_1V8                                          */

/* EN @Bit 31 : Enable the digital test bus */
  #define VDETVS0V8_DFT_DTB1CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VDETVS0V8_DFT_DTB1CONFIG_EN_Msk (0x1UL << VDETVS0V8_DFT_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VDETVS0V8_DFT_DTB1CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VDETVS0V8_DFT_DTB1CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VDETVS0V8_DFT_DTB1CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                       */
  #define VDETVS0V8_DFT_DTB1CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                         */


/* VDETVS0V8_DFT_DTB3CONFIG: Digital Test Bus 3 (DTB3) configuration */
  #define VDETVS0V8_DFT_DTB3CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB3CONFIG register.                          */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define VDETVS0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                */
  #define VDETVS0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Msk (0x1UL << VDETVS0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of
                                                                            PWRUPDELTEST field.*/                                 
  #define VDETVS0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                   */
  #define VDETVS0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                   */
  #define VDETVS0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                     */
  #define VDETVS0V8_DFT_DTB3CONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                       */


/* VDETVS0V8_DFT_TCFG: Test mode configuration */
  #define VDETVS0V8_DFT_TCFG_ResetValue (0x00000000UL) /*!< Reset value of TCFG register.                                      */

/* VDETAO0V8PGDAO0V8 @Bit 0 : Override VDETAO0V8_PGD_AO_0V8 to 0 */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8PGDAO0V8_Pos (0UL) /*!< Position of VDETAO0V8PGDAO0V8 field.                             */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8PGDAO0V8_Msk (0x1UL << VDETVS0V8_DFT_TCFG_VDETAO0V8PGDAO0V8_Pos) /*!< Bit mask of
                                                                            VDETAO0V8PGDAO0V8 field.*/                            
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8PGDAO0V8_Min (0x0UL) /*!< Min enumerator value of VDETAO0V8PGDAO0V8 field.               */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8PGDAO0V8_Max (0x1UL) /*!< Max enumerator value of VDETAO0V8PGDAO0V8 field.               */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8PGDAO0V8_Disabled (0x0UL) /*!< Override disabled                                         */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8PGDAO0V8_Enabled (0x1UL) /*!< Override enabled                                           */

/* VDETAO0V8BODAO0V81V8 @Bit 1 : Override VDETAO0V8_BOD_AO_0V8 and VDETAO0V8_BOD_AO_1V8 to 0 */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8BODAO0V81V8_Pos (1UL) /*!< Position of VDETAO0V8BODAO0V81V8 field.                       */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8BODAO0V81V8_Msk (0x1UL << VDETVS0V8_DFT_TCFG_VDETAO0V8BODAO0V81V8_Pos) /*!< Bit mask of
                                                                            VDETAO0V8BODAO0V81V8 field.*/                         
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8BODAO0V81V8_Min (0x0UL) /*!< Min enumerator value of VDETAO0V8BODAO0V81V8 field.         */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8BODAO0V81V8_Max (0x1UL) /*!< Max enumerator value of VDETAO0V8BODAO0V81V8 field.         */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8BODAO0V81V8_Disabled (0x0UL) /*!< Override disabled                                      */
  #define VDETVS0V8_DFT_TCFG_VDETAO0V8BODAO0V81V8_Enabled (0x1UL) /*!< Override enabled                                        */

/* PGDCOMPARATOR @Bit 2 : If bit TCFG.OVERRIDEN is one, this bit will directly control the internal power-up or power-down the
                          PGD comparator. */                                                                                      
                                                                                                                                  
