adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* TASKS_PWRUP @Bit 0 : Power up voltage detector */
  #define VDETVS0V8_TASKS_PWRUP_TASKS_PWRUP_Pos (0UL) /*!< Position of TASKS_PWRUP field.                                      */
  #define VDETVS0V8_TASKS_PWRUP_TASKS_PWRUP_Msk (0x1UL << VDETVS0V8_TASKS_PWRUP_TASKS_PWRUP_Pos) /*!< Bit mask of TASKS_PWRUP
                                                                            field.*/                                              
  #define VDETVS0V8_TASKS_PWRUP_TASKS_PWRUP_Min (0x1UL) /*!< Min enumerator value of TASKS_PWRUP field.                        */
  #define VDETVS0V8_TASKS_PWRUP_TASKS_PWRUP_Max (0x1UL) /*!< Max enumerator value of TASKS_PWRUP field.                        */
  #define VDETVS0V8_TASKS_PWRUP_TASKS_PWRUP_Trigger (0x1UL) /*!< Trigger task                                                  */


/* VDETVS0V8_TASKS_PWRDOWN: Power down voltage detector */
  #define VDETVS0V8_TASKS_PWRDOWN_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWRDOWN register.                        */

/* TASKS_PWRDOWN @Bit 0 : Power down voltage detector */
  #define VDETVS0V8_TASKS_PWRDOWN_TASKS_PWRDOWN_Pos (0UL) /*!< Position of TASKS_PWRDOWN field.                                */
  #define VDETVS0V8_TASKS_PWRDOWN_TASKS_PWRDOWN_Msk (0x1UL << VDETVS0V8_TASKS_PWRDOWN_TASKS_PWRDOWN_Pos) /*!< Bit mask of
                                                                            TASKS_PWRDOWN field.*/                                
  #define VDETVS0V8_TASKS_PWRDOWN_TASKS_PWRDOWN_Min (0x1UL) /*!< Min enumerator value of TASKS_PWRDOWN field.                  */
  #define VDETVS0V8_TASKS_PWRDOWN_TASKS_PWRDOWN_Max (0x1UL) /*!< Max enumerator value of TASKS_PWRDOWN field.                  */
  #define VDETVS0V8_TASKS_PWRDOWN_TASKS_PWRDOWN_Trigger (0x1UL) /*!< Trigger task                                              */


/* VDETVS0V8_TASKS_STARTPWRGOOD: Start power good detection */
  #define VDETVS0V8_TASKS_STARTPWRGOOD_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STARTPWRGOOD register.              */

/* TASKS_STARTPWRGOOD @Bit 0 : Start power good detection */
  #define VDETVS0V8_TASKS_STARTPWRGOOD_TASKS_STARTPWRGOOD_Pos (0UL) /*!< Position of TASKS_STARTPWRGOOD field.                 */
  #define VDETVS0V8_TASKS_STARTPWRGOOD_TASKS_STARTPWRGOOD_Msk (0x1UL << VDETVS0V8_TASKS_STARTPWRGOOD_TASKS_STARTPWRGOOD_Pos)
                                                                            /*!< Bit mask of TASKS_STARTPWRGOOD field.*/          
  #define VDETVS0V8_TASKS_STARTPWRGOOD_TASKS_STARTPWRGOOD_Min (0x1UL) /*!< Min enumerator value of TASKS_STARTPWRGOOD field.   */
  #define VDETVS0V8_TASKS_STARTPWRGOOD_TASKS_STARTPWRGOOD_Max (0x1UL) /*!< Max enumerator value of TASKS_STARTPWRGOOD field.   */
  #define VDETVS0V8_TASKS_STARTPWRGOOD_TASKS_STARTPWRGOOD_Trigger (0x1UL) /*!< Trigger task                                    */


/* VDETVS0V8_TASKS_CANCELPWRGOOD: Cancel power good detection */
  #define VDETVS0V8_TASKS_CANCELPWRGOOD_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CANCELPWRGOOD register.            */

/* TASKS_CANCELPWRGOOD @Bit 0 : Cancel power good detection */
  #define VDETVS0V8_TASKS_CANCELPWRGOOD_TASKS_CANCELPWRGOOD_Pos (0UL) /*!< Position of TASKS_CANCELPWRGOOD field.              */
  #define VDETVS0V8_TASKS_CANCELPWRGOOD_TASKS_CANCELPWRGOOD_Msk (0x1UL << VDETVS0V8_TASKS_CANCELPWRGOOD_TASKS_CANCELPWRGOOD_Pos)
                                                                            /*!< Bit mask of TASKS_CANCELPWRGOOD field.*/         
  #define VDETVS0V8_TASKS_CANCELPWRGOOD_TASKS_CANCELPWRGOOD_Min (0x1UL) /*!< Min enumerator value of TASKS_CANCELPWRGOOD field.*/
  #define VDETVS0V8_TASKS_CANCELPWRGOOD_TASKS_CANCELPWRGOOD_Max (0x1UL) /*!< Max enumerator value of TASKS_CANCELPWRGOOD field.*/
  #define VDETVS0V8_TASKS_CANCELPWRGOOD_TASKS_CANCELPWRGOOD_Trigger (0x1UL) /*!< Trigger task                                  */


/* VDETVS0V8_TASKS_APPLYBROWNOUT: Apply value in BROWNOUTLVL to analog module */
  #define VDETVS0V8_TASKS_APPLYBROWNOUT_ResetValue (0x00000000UL) /*!< Reset value of TASKS_APPLYBROWNOUT register.            */

/* TASKS_APPLYBROWNOUT @Bit 0 : Apply value in BROWNOUTLVL to analog module */
  #define VDETVS0V8_TASKS_APPLYBROWNOUT_TASKS_APPLYBROWNOUT_Pos (0UL) /*!< Position of TASKS_APPLYBROWNOUT field.              */
  #define VDETVS0V8_TASKS_APPLYBROWNOUT_TASKS_APPLYBROWNOUT_Msk (0x1UL << VDETVS0V8_TASKS_APPLYBROWNOUT_TASKS_APPLYBROWNOUT_Pos)
                                                                            /*!< Bit mask of TASKS_APPLYBROWNOUT field.*/         
  #define VDETVS0V8_TASKS_APPLYBROWNOUT_TASKS_APPLYBROWNOUT_Min (0x1UL) /*!< Min enumerator value of TASKS_APPLYBROWNOUT field.*/
  #define VDETVS0V8_TASKS_APPLYBROWNOUT_TASKS_APPLYBROWNOUT_Max (0x1UL) /*!< Max enumerator value of TASKS_APPLYBROWNOUT field.*/
  #define VDETVS0V8_TASKS_APPLYBROWNOUT_TASKS_APPLYBROWNOUT_Trigger (0x1UL) /*!< Trigger task                                  */


/* VDETVS0V8_EVENTS_READY: Power up done */
  #define VDETVS0V8_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                          */

/* EVENTS_READY @Bit 0 : Power up done */
  #define VDETVS0V8_EVENTS_READY_EVENTS_READY_Pos (0UL) /*!< Position of EVENTS_READY field.                                   */
  #define VDETVS0V8_EVENTS_READY_EVENTS_READY_Msk (0x1UL << VDETVS0V8_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of
                                                                            EVENTS_READY field.*/                                 
  #define VDETVS0V8_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                     */
  #define VDETVS0V8_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                     */
  #define VDETVS0V8_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define VDETVS0V8_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                           */


/* VDETVS0V8_EVENTS_SETTLED: Settled flag for MODE handshake */
  #define VDETVS0V8_EVENTS_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SETTLED register.                      */

