adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PWRGOOD @Bit 2 : Read pending status of interrupt for event PWRGOOD */
  #define VDETVS0V8_INTPEND_PWRGOOD_Pos (2UL)        /*!< Position of PWRGOOD field.                                           */
  #define VDETVS0V8_INTPEND_PWRGOOD_Msk (0x1UL << VDETVS0V8_INTPEND_PWRGOOD_Pos) /*!< Bit mask of PWRGOOD field.               */
  #define VDETVS0V8_INTPEND_PWRGOOD_Min (0x0UL)      /*!< Min enumerator value of PWRGOOD field.                               */
  #define VDETVS0V8_INTPEND_PWRGOOD_Max (0x1UL)      /*!< Max enumerator value of PWRGOOD field.                               */
  #define VDETVS0V8_INTPEND_PWRGOOD_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define VDETVS0V8_INTPEND_PWRGOOD_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* BROWNOUT @Bit 3 : Read pending status of interrupt for event BROWNOUT */
  #define VDETVS0V8_INTPEND_BROWNOUT_Pos (3UL)       /*!< Position of BROWNOUT field.                                          */
  #define VDETVS0V8_INTPEND_BROWNOUT_Msk (0x1UL << VDETVS0V8_INTPEND_BROWNOUT_Pos) /*!< Bit mask of BROWNOUT field.            */
  #define VDETVS0V8_INTPEND_BROWNOUT_Min (0x0UL)     /*!< Min enumerator value of BROWNOUT field.                              */
  #define VDETVS0V8_INTPEND_BROWNOUT_Max (0x1UL)     /*!< Max enumerator value of BROWNOUT field.                              */
  #define VDETVS0V8_INTPEND_BROWNOUT_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define VDETVS0V8_INTPEND_BROWNOUT_Pending (0x1UL) /*!< Read: Pending                                                        */


/* VDETVS0V8_STATUS: Voltage detector status */
  #define VDETVS0V8_STATUS_ResetValue (0x000002D0UL) /*!< Reset value of STATUS register.                                      */

/* MODE @Bits 0..1 : Current voltage detector mode */
  #define VDETVS0V8_STATUS_MODE_Pos (0UL)            /*!< Position of MODE field.                                              */
  #define VDETVS0V8_STATUS_MODE_Msk (0x3UL << VDETVS0V8_STATUS_MODE_Pos) /*!< Bit mask of MODE field.                          */
  #define VDETVS0V8_STATUS_MODE_Min (0x0UL)          /*!< Min enumerator value of MODE field.                                  */
  #define VDETVS0V8_STATUS_MODE_Max (0x2UL)          /*!< Max enumerator value of MODE field.                                  */
  #define VDETVS0V8_STATUS_MODE_HighPower (0x0UL)    /*!< High power mode                                                      */
  #define VDETVS0V8_STATUS_MODE_LowPower (0x1UL)     /*!< Low power mode                                                       */
  #define VDETVS0V8_STATUS_MODE_UltraLowPowerRefresh (0x2UL) /*!< Ultra-low power refresh mode                                 */

/* CURRENTBODLEVEL @Bits 4..9 : Brownout level currently applied to the analog module */
  #define VDETVS0V8_STATUS_CURRENTBODLEVEL_Pos (4UL) /*!< Position of CURRENTBODLEVEL field.                                   */
  #define VDETVS0V8_STATUS_CURRENTBODLEVEL_Msk (0x3FUL << VDETVS0V8_STATUS_CURRENTBODLEVEL_Pos) /*!< Bit mask of CURRENTBODLEVEL
                                                                            field.*/                                              


/* VDETVS0V8_STATUSANA: Status of analog module output signals */
  #define VDETVS0V8_STATUSANA_ResetValue (0x00000000UL) /*!< Reset value of STATUSANA register.                                */

/* READY @Bit 0 : Current value of the READY signal from the analog module */
  #define VDETVS0V8_STATUSANA_READY_Pos (0UL)        /*!< Position of READY field.                                             */
  #define VDETVS0V8_STATUSANA_READY_Msk (0x1UL << VDETVS0V8_STATUSANA_READY_Pos) /*!< Bit mask of READY field.                 */

/* SETTLED @Bit 1 : Current value of the SETTLED signal from the analog module */
  #define VDETVS0V8_STATUSANA_SETTLED_Pos (1UL)      /*!< Position of SETTLED field.                                           */
  #define VDETVS0V8_STATUSANA_SETTLED_Msk (0x1UL << VDETVS0V8_STATUSANA_SETTLED_Pos) /*!< Bit mask of SETTLED field.           */

/* BOD @Bit 2 : Current value of the BOD signal from the analog module */
  #define VDETVS0V8_STATUSANA_BOD_Pos (2UL)          /*!< Position of BOD field.                                               */
  #define VDETVS0V8_STATUSANA_BOD_Msk (0x1UL << VDETVS0V8_STATUSANA_BOD_Pos) /*!< Bit mask of BOD field.                       */

/* PGD @Bit 3 : Current value of the PGD signal from the analog module */
  #define VDETVS0V8_STATUSANA_PGD_Pos (3UL)          /*!< Position of PGD field.                                               */
  #define VDETVS0V8_STATUSANA_PGD_Msk (0x1UL << VDETVS0V8_STATUSANA_PGD_Pos) /*!< Bit mask of PGD field.                       */


/* VDETVS0V8_MIRROR: Enable LOCK for mirrored registers */
  #define VDETVS0V8_MIRROR_ResetValue (0x00000001UL) /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define VDETVS0V8_MIRROR_LOCK_Pos (0UL)            /*!< Position of LOCK field.                                              */
  #define VDETVS0V8_MIRROR_LOCK_Msk (0x1UL << VDETVS0V8_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                          */
  #define VDETVS0V8_MIRROR_LOCK_Min (0x0UL)          /*!< Min enumerator value of LOCK field.                                  */
  #define VDETVS0V8_MIRROR_LOCK_Max (0x1UL)          /*!< Max enumerator value of LOCK field.                                  */
  #define VDETVS0V8_MIRROR_LOCK_Disabled (0x0UL)     /*!< Lock disabled                                                        */
  #define VDETVS0V8_MIRROR_LOCK_Enabled (0x1UL)      /*!< Lock enabled                                                         */


/* VDETVS0V8_MODE: Voltage detector mode */
  #define VDETVS0V8_MODE_ResetValue (0x00000000UL)   /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..2 : Mode */
  #define VDETVS0V8_MODE_MODE_Pos (0UL)              /*!< Position of MODE field.                                              */
  #define VDETVS0V8_MODE_MODE_Msk (0x7UL << VDETVS0V8_MODE_MODE_Pos) /*!< Bit mask of MODE field.                              */
  #define VDETVS0V8_MODE_MODE_Min (0x0UL)            /*!< Min enumerator value of MODE field.                                  */
  #define VDETVS0V8_MODE_MODE_Max (0x3UL)            /*!< Max enumerator value of MODE field.                                  */
  #define VDETVS0V8_MODE_MODE_Auto (0x0UL)           /*!< Automatically handled by the peripheral                              */
  #define VDETVS0V8_MODE_MODE_HighPower (0x1UL)      /*!< High power mode                                                      */
  #define VDETVS0V8_MODE_MODE_LowPower (0x2UL)       /*!< Low power mode                                                       */
  #define VDETVS0V8_MODE_MODE_UltraLowPowerRefresh (0x3UL) /*!< Ultra-low power refresh mode                                   */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                      VDMADESCRIPTOR                                      ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ================================================== Struct VDMADESCRIPTOR ================================================== */
/**
  * @brief Job descriptor for vector-based DMA.
  */
  typedef struct {                                   /*!< VDMADESCRIPTOR Structure                                             */
    __IOM uint32_t PTR;                              /*!< (@ 0x00000000) Pointer to data buffer.                               */
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000004) Job configuration. Configuration of attributes and
                                                                         buffer length.*/                                         
  } NRF_VDMADESCRIPTOR_Type;                         /*!< Size = 8 (0x008)                                                     */

/* VDMADESCRIPTOR_PTR: Pointer to data buffer. */
  #define VDMADESCRIPTOR_PTR_ResetValue (0x00000000UL) /*!< Reset value of PTR register.                                       */

/* PTR @Bits 0..31 : Pointer to data buffer. */
  #define VDMADESCRIPTOR_PTR_PTR_Pos (0UL)           /*!< Position of PTR field.                                               */
  #define VDMADESCRIPTOR_PTR_PTR_Msk (0xFFFFFFFFUL << VDMADESCRIPTOR_PTR_PTR_Pos) /*!< Bit mask of PTR field.                  */


/* VDMADESCRIPTOR_CONFIG: Job configuration. Configuration of attributes and buffer length. */
  #define VDMADESCRIPTOR_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                                 */

/* CNT @Bits 0..23 : Maximum number of bytes in data buffer. */
  #define VDMADESCRIPTOR_CONFIG_CNT_Pos (0UL)        /*!< Position of CNT field.                                               */
  #define VDMADESCRIPTOR_CONFIG_CNT_Msk (0xFFFFFFUL << VDMADESCRIPTOR_CONFIG_CNT_Pos) /*!< Bit mask of CNT field.              */

/* ATTRIBUTE @Bits 24..29 : Job attribute. */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Pos (24UL) /*!< Position of ATTRIBUTE field.                                         */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Msk (0x3FUL << VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Pos) /*!< Bit mask of ATTRIBUTE field.*/
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Min (0x0UL) /*!< Min enumerator value of ATTRIBUTE field.                            */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Max (0x6UL) /*!< Max enumerator value of ATTRIBUTE field.                            */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_ByteSwap (0x00UL) /*!< Byte swap attribute.                                          */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_LteCipher (0x00UL) /*!< LTE plain/cipher data.                                       */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_JobList (0x01UL) /*!< Job list attribute.                                            */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_LteKey (0x01UL) /*!< LTE key.                                                        */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_BufferFill (0x02UL) /*!< Buffer fill attribute.                                      */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_LteIV (0x02UL) /*!< LTE IV.                                                          */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_FixedSize (0x03UL) /*!< Fixed size attribute.                                        */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_LteBypass (0x03UL) /*!< LTE bypass.                                                  */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_StaticAddress (0x04UL) /*!< Static address attribute.                                */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_PlainDataBufferWrite (0x05UL) /*!< Plain data buffer write attribute.                */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Crc (0x06UL) /*!< CRC attribute.                                                     */

