adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VAL @Bits 0..31 : Machine Exception Program Counter value */
  #define VPRCSR_MEPC_VAL_Pos (0UL)                  /*!< Position of VAL field.                                               */
  #define VPRCSR_MEPC_VAL_Msk (0xFFFFFFFFUL << VPRCSR_MEPC_VAL_Pos) /*!< Bit mask of VAL field.                                */


/**
  * @brief MCAUSE [VPRCSR_MCAUSE] Machine Cause
  */
  #define VPRCSR_MCAUSE (0x00000342ul)
  #define VPRCSR_MCAUSE_ResetValue (0x30000000UL)    /*!< Reset value of MCAUSE register.                                      */

/* EXECPTIONCODE @Bits 0..11 : Exception code */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_Pos (0UL)      /*!< Position of EXECPTIONCODE field.                                     */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_Msk (0xFFFUL << VPRCSR_MCAUSE_EXECPTIONCODE_Pos) /*!< Bit mask of EXECPTIONCODE field.   */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_Min (0x0UL)    /*!< Min enumerator value of EXECPTIONCODE field.                         */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_Max (0x1FUL)   /*!< Max enumerator value of EXECPTIONCODE field.                         */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_INSTADDRMISALIGN (0x000UL) /*!< Instruction Address Misaligned                           */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_INSTACCESSFAULT (0x001UL) /*!< Instruction Access Fault                                  */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_ILLEGALINST (0x002UL) /*!< Illegal Instruction                                           */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_BKPT (0x003UL) /*!< Breakpoint                                                           */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_LOADADDRMISALIGN (0x004UL) /*!< Load Address Misaligned                                  */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_LOADACCESSFAULT (0x005UL) /*!< Load Access Fault                                         */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_STOREADDRMISALIGN (0x006UL) /*!< Store/AMO Address Misaligned                            */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_STOREACCESSFAULT (0x007UL) /*!< Store/AMO Access Fault                                   */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_ECALLMMODE (0x00BUL) /*!< Environment Call M-Mode                                        */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_MISALIGNSTACKING (0x018UL) /*!< Misaligned Stacking                                      */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_BUSFAULTSTACKING (0x019UL) /*!< Bus Fault on Stacking                                    */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_INTVECTORFAULT (0x01AUL) /*!< Interrupt Vector Fault                                     */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_MISALIGNUNSTACKING (0x01BUL) /*!< Misaligned Unstacking                                  */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_BUSFAULTUNSTACKING (0x01CUL) /*!< Bus Fault on Unstacking                                */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_LOADTIMEOUTFAULT (0x01DUL) /*!< Load Timeout Fault                                       */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_STORETIMEOUTFAULT (0x01EUL) /*!< Store Timeout Fault                                     */
  #define VPRCSR_MCAUSE_EXECPTIONCODE_STACKINGEXCFAULT (0x01FUL) /*!< Fault on Exception Stacking                              */

/* MPIL @Bits 16..23 : Previous interrupt level */
  #define VPRCSR_MCAUSE_MPIL_Pos (16UL)              /*!< Position of MPIL field.                                              */
  #define VPRCSR_MCAUSE_MPIL_Msk (0xFFUL << VPRCSR_MCAUSE_MPIL_Pos) /*!< Bit mask of MPIL field.                               */

/* MPIE @Bit 27 : Previous interrupt enable, same as MSTATUS.MPIE */
  #define VPRCSR_MCAUSE_MPIE_Pos (27UL)              /*!< Position of MPIE field.                                              */
  #define VPRCSR_MCAUSE_MPIE_Msk (0x1UL << VPRCSR_MCAUSE_MPIE_Pos) /*!< Bit mask of MPIE field.                                */

/* MPP @Bits 28..29 : Previous privilege mode, same as MSTATUS.MPP */
  #define VPRCSR_MCAUSE_MPP_Pos (28UL)               /*!< Position of MPP field.                                               */
  #define VPRCSR_MCAUSE_MPP_Msk (0x3UL << VPRCSR_MCAUSE_MPP_Pos) /*!< Bit mask of MPP field.                                   */

/* MINHV @Bit 30 : In hardware vectoring */
  #define VPRCSR_MCAUSE_MINHV_Pos (30UL)             /*!< Position of MINHV field.                                             */
  #define VPRCSR_MCAUSE_MINHV_Msk (0x1UL << VPRCSR_MCAUSE_MINHV_Pos) /*!< Bit mask of MINHV field.                             */

/* INTERRUPT @Bit 31 : Interrupt bit */
  #define VPRCSR_MCAUSE_INTERRUPT_Pos (31UL)         /*!< Position of INTERRUPT field.                                         */
  #define VPRCSR_MCAUSE_INTERRUPT_Msk (0x1UL << VPRCSR_MCAUSE_INTERRUPT_Pos) /*!< Bit mask of INTERRUPT field.                 */
  #define VPRCSR_MCAUSE_INTERRUPT_Min (0x0UL)        /*!< Min enumerator value of INTERRUPT field.                             */
  #define VPRCSR_MCAUSE_INTERRUPT_Max (0x1UL)        /*!< Max enumerator value of INTERRUPT field.                             */
  #define VPRCSR_MCAUSE_INTERRUPT_EXCEPTION (0x0UL)  /*!< (unspecified)                                                        */
  #define VPRCSR_MCAUSE_INTERRUPT_INTERRUPT (0x1UL)  /*!< (unspecified)                                                        */


/**
  * @brief MTVAL [VPRCSR_MTVAL] Machine Trap Value
  */
  #define VPRCSR_MTVAL (0x00000343ul)
  #define VPRCSR_MTVAL_ResetValue (0x00000000UL)     /*!< Reset value of MTVAL register.                                       */

/* VAL @Bits 0..31 : Machine Trap Value */
  #define VPRCSR_MTVAL_VAL_Pos (0UL)                 /*!< Position of VAL field.                                               */
  #define VPRCSR_MTVAL_VAL_Msk (0xFFFFFFFFUL << VPRCSR_MTVAL_VAL_Pos) /*!< Bit mask of VAL field.                              */


/**
  * @brief MINTSTATUS [VPRCSR_MINTSTATUS] M-mode Interrupt Status
  */
  #define VPRCSR_MINTSTATUS (0x00000346ul)
  #define VPRCSR_MINTSTATUS_ResetValue (0x00000000UL) /*!< Reset value of MINTSTATUS register.                                 */

/* MIL @Bits 24..31 : M-Mode interrupt level */
  #define VPRCSR_MINTSTATUS_MIL_Pos (24UL)           /*!< Position of MIL field.                                               */
  #define VPRCSR_MINTSTATUS_MIL_Msk (0xFFUL << VPRCSR_MINTSTATUS_MIL_Pos) /*!< Bit mask of MIL field.                          */


/**
  * @brief MINTTHRESH [VPRCSR_MINTTHRESH] M-mode Interrupt-level Threshold
  */
  #define VPRCSR_MINTTHRESH (0x00000347ul)
  #define VPRCSR_MINTTHRESH_ResetValue (0x00000000UL) /*!< Reset value of MINTTHRESH register.                                 */

/* TH @Bits 24..31 : M-Mode Interrupt-level Threshold */
  #define VPRCSR_MINTTHRESH_TH_Pos (24UL)            /*!< Position of TH field.                                                */
  #define VPRCSR_MINTTHRESH_TH_Msk (0xFFUL << VPRCSR_MINTTHRESH_TH_Pos) /*!< Bit mask of TH field.                             */
  #define VPRCSR_MINTTHRESH_TH_Min (0x0UL)           /*!< Min enumerator value of TH field.                                    */
  #define VPRCSR_MINTTHRESH_TH_Max (0xFFUL)          /*!< Max enumerator value of TH field.                                    */
  #define VPRCSR_MINTTHRESH_TH_DISABLED (0x00UL)     /*!< Threshold disabled                                                   */
  #define VPRCSR_MINTTHRESH_TH_THRESHLEVEL0 (0x3FUL) /*!< Threshold level 0                                                    */
  #define VPRCSR_MINTTHRESH_TH_THRESHLEVEL1 (0x7FUL) /*!< Threshold level 1                                                    */
  #define VPRCSR_MINTTHRESH_TH_THRESHLEVEL2 (0xBFUL) /*!< Threshold level 2                                                    */
  #define VPRCSR_MINTTHRESH_TH_THRESHLEVEL3 (0xFFUL) /*!< Threshold level 3                                                    */


/**
  * @brief MCLICBASE [VPRCSR_MCLICBASE] Machine CLIC Base
  */
  #define VPRCSR_MCLICBASE (0x00000350ul)
  #define VPRCSR_MCLICBASE_ResetValue (0x00001000UL) /*!< Reset value of MCLICBASE register.                                   */

