adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* MULDIV @Bits 0..1 : Indicates the MULDIV parameter option */
  #define VPRCSR_MARCHID_MULDIV_Pos (0UL)            /*!< Position of MULDIV field.                                            */
  #define VPRCSR_MARCHID_MULDIV_Msk (0x3UL << VPRCSR_MARCHID_MULDIV_Pos) /*!< Bit mask of MULDIV field.                        */

/* HIBERNATE @Bit 2 : Indicates the HIBERNATE parameter option */
  #define VPRCSR_MARCHID_HIBERNATE_Pos (2UL)         /*!< Position of HIBERNATE field.                                         */
  #define VPRCSR_MARCHID_HIBERNATE_Msk (0x1UL << VPRCSR_MARCHID_HIBERNATE_Pos) /*!< Bit mask of HIBERNATE field.               */

/* DBG @Bit 3 : Indicates the DBG parameter option */
  #define VPRCSR_MARCHID_DBG_Pos (3UL)               /*!< Position of DBG field.                                               */
  #define VPRCSR_MARCHID_DBG_Msk (0x1UL << VPRCSR_MARCHID_DBG_Pos) /*!< Bit mask of DBG field.                                 */

/* REMAP @Bit 4 : Indicates the REMAP parameter option */
  #define VPRCSR_MARCHID_REMAP_Pos (4UL)             /*!< Position of REMAP field.                                             */
  #define VPRCSR_MARCHID_REMAP_Msk (0x1UL << VPRCSR_MARCHID_REMAP_Pos) /*!< Bit mask of REMAP field.                           */

/* BUSWIDTH @Bit 5 : Indicates the BUS_WIDTH parameter option */
  #define VPRCSR_MARCHID_BUSWIDTH_Pos (5UL)          /*!< Position of BUSWIDTH field.                                          */
  #define VPRCSR_MARCHID_BUSWIDTH_Msk (0x1UL << VPRCSR_MARCHID_BUSWIDTH_Pos) /*!< Bit mask of BUSWIDTH field.                  */

/* BKPT @Bits 6..8 : Indicates the BKPT parameter option */
  #define VPRCSR_MARCHID_BKPT_Pos (6UL)              /*!< Position of BKPT field.                                              */
  #define VPRCSR_MARCHID_BKPT_Msk (0x7UL << VPRCSR_MARCHID_BKPT_Pos) /*!< Bit mask of BKPT field.                              */

/* IMPLEM @Bit 31 : Indicates a non-open implementation */
  #define VPRCSR_MARCHID_IMPLEM_Pos (31UL)           /*!< Position of IMPLEM field.                                            */
  #define VPRCSR_MARCHID_IMPLEM_Msk (0x1UL << VPRCSR_MARCHID_IMPLEM_Pos) /*!< Bit mask of IMPLEM field.                        */


/**
  * @brief MIMPID [VPRCSR_MIMPID] Machine Implementation ID
  */
  #define VPRCSR_MIMPID (0x00000F13ul)
  #define VPRCSR_MIMPID_ResetValue (0x00010001UL)    /*!< Reset value of MIMPID register.                                      */

/* PATCHREV @Bits 0..7 : Indicates the number of the patch revision */
  #define VPRCSR_MIMPID_PATCHREV_Pos (0UL)           /*!< Position of PATCHREV field.                                          */
  #define VPRCSR_MIMPID_PATCHREV_Msk (0xFFUL << VPRCSR_MIMPID_PATCHREV_Pos) /*!< Bit mask of PATCHREV field.                   */

/* MINORREV @Bits 8..15 : Indicates the number of the minor revision */
  #define VPRCSR_MIMPID_MINORREV_Pos (8UL)           /*!< Position of MINORREV field.                                          */
  #define VPRCSR_MIMPID_MINORREV_Msk (0xFFUL << VPRCSR_MIMPID_MINORREV_Pos) /*!< Bit mask of MINORREV field.                   */

/* MAJORREV @Bits 16..23 : Indicates the number of the major revison */
  #define VPRCSR_MIMPID_MAJORREV_Pos (16UL)          /*!< Position of MAJORREV field.                                          */
  #define VPRCSR_MIMPID_MAJORREV_Msk (0xFFUL << VPRCSR_MIMPID_MAJORREV_Pos) /*!< Bit mask of MAJORREV field.                   */


/**
  * @brief MHARTID [VPRCSR_MHARTID] Machine Hart ID
  */
  #define VPRCSR_MHARTID (0x00000F14ul)
  #define VPRCSR_MHARTID_ResetValue (0x00000000UL)   /*!< Reset value of MHARTID register.                                     */

/* HARTNUM @Bits 0..31 : Machine Hart ID value */
  #define VPRCSR_MHARTID_HARTNUM_Pos (0UL)           /*!< Position of HARTNUM field.                                           */
  #define VPRCSR_MHARTID_HARTNUM_Msk (0xFFFFFFFFUL << VPRCSR_MHARTID_HARTNUM_Pos) /*!< Bit mask of HARTNUM field.              */


/**
  * @brief NORDIC [VPRCSR_NORDIC] (unspecified)
  */

/**
  * @brief VPRNORDICCTRL [VPRCSR_NORDIC_VPRNORDICCTRL] Nordic Core Control
  */
  #define VPRCSR_NORDIC_VPRNORDICCTRL (0x000007C0ul)
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ResetValue (0x00000000UL) /*!< Reset value of VPRNORDICCTRL register.                    */

/* ENABLERTPERIPH @Bit 0 : Control bit to enable Real-Time Peripherals */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Pos (0UL) /*!< Position of ENABLERTPERIPH field.                          */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Pos) /*!< Bit mask
                                                                            of ENABLERTPERIPH field.*/                            
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Min (0x0UL) /*!< Min enumerator value of ENABLERTPERIPH field.            */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Max (0x1UL) /*!< Max enumerator value of ENABLERTPERIPH field.            */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Disabled (0x0UL) /*!< (unspecified)                                       */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Enabled (0x1UL) /*!< (unspecified)                                        */

/* RESETUNRECOVERABLE @Bit 1 : Core resets when it runs into an unrecoverable exception */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_RESETUNRECOVERABLE_Pos (1UL) /*!< Position of RESETUNRECOVERABLE field.                  */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_RESETUNRECOVERABLE_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICCTRL_RESETUNRECOVERABLE_Pos) /*!<
                                                                            Bit mask of RESETUNRECOVERABLE field.*/               
  #define VPRCSR_NORDIC_VPRNORDICCTRL_RESETUNRECOVERABLE_Min (0x0UL) /*!< Min enumerator value of RESETUNRECOVERABLE field.    */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_RESETUNRECOVERABLE_Max (0x1UL) /*!< Max enumerator value of RESETUNRECOVERABLE field.    */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_RESETUNRECOVERABLE_Disabled (0x0UL) /*!< (unspecified)                                   */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_RESETUNRECOVERABLE_Enabled (0x1UL) /*!< (unspecified)                                    */

