adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ENABLEREMAP @Bit 3 : Enable remap feature */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLEREMAP_Pos (3UL) /*!< Position of ENABLEREMAP field.                                */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLEREMAP_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICCTRL_ENABLEREMAP_Pos) /*!< Bit mask of
                                                                            ENABLEREMAP field.*/                                  
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLEREMAP_Min (0x0UL) /*!< Min enumerator value of ENABLEREMAP field.                  */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLEREMAP_Max (0x1UL) /*!< Max enumerator value of ENABLEREMAP field.                  */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLEREMAP_Disabled (0x0UL) /*!< (unspecified)                                          */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLEREMAP_Enabled (0x1UL) /*!< (unspecified)                                           */

/* FORCERAMCLK @Bit 4 : Force RAM clock request */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCERAMCLK_Pos (4UL) /*!< Position of FORCERAMCLK field.                                */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCERAMCLK_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICCTRL_FORCERAMCLK_Pos) /*!< Bit mask of
                                                                            FORCERAMCLK field.*/                                  
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCERAMCLK_Min (0x0UL) /*!< Min enumerator value of FORCERAMCLK field.                  */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCERAMCLK_Max (0x1UL) /*!< Max enumerator value of FORCERAMCLK field.                  */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCERAMCLK_Disabled (0x0UL) /*!< (unspecified)                                          */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCERAMCLK_Enabled (0x1UL) /*!< (unspecified)                                           */

/* FORCEEXTCLK @Bit 5 : Force external clock request */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCEEXTCLK_Pos (5UL) /*!< Position of FORCEEXTCLK field.                                */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCEEXTCLK_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICCTRL_FORCEEXTCLK_Pos) /*!< Bit mask of
                                                                            FORCEEXTCLK field.*/                                  
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCEEXTCLK_Min (0x0UL) /*!< Min enumerator value of FORCEEXTCLK field.                  */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCEEXTCLK_Max (0x1UL) /*!< Max enumerator value of FORCEEXTCLK field.                  */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCEEXTCLK_Disabled (0x0UL) /*!< (unspecified)                                          */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_FORCEEXTCLK_Enabled (0x1UL) /*!< (unspecified)                                           */

/* CNTIRQENABLE @Bit 6 : Enables the generation of IRQ at position CNT_IRQ_POSITION */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_CNTIRQENABLE_Pos (6UL) /*!< Position of CNTIRQENABLE field.                              */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_CNTIRQENABLE_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICCTRL_CNTIRQENABLE_Pos) /*!< Bit mask of
                                                                            CNTIRQENABLE field.*/                                 
  #define VPRCSR_NORDIC_VPRNORDICCTRL_CNTIRQENABLE_Min (0x0UL) /*!< Min enumerator value of CNTIRQENABLE field.                */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_CNTIRQENABLE_Max (0x1UL) /*!< Max enumerator value of CNTIRQENABLE field.                */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_CNTIRQENABLE_Disabled (0x0UL) /*!< (unspecified)                                         */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_CNTIRQENABLE_Enabled (0x1UL) /*!< (unspecified)                                          */

/* NORDICKEY @Bits 16..31 : Used in order to protect the write to this register */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Pos (16UL) /*!< Position of NORDICKEY field.                                   */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Msk (0xFFFFUL << VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Pos) /*!< Bit mask of
                                                                            NORDICKEY field.*/                                    
  #define VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Min (0x507DUL) /*!< Min enumerator value of NORDICKEY field.                   */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Max (0x507DUL) /*!< Max enumerator value of NORDICKEY field.                   */
  #define VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Enabled (0x507DUL) /*!< Write enabled                                          */


/**
  * @brief VPRNORDICSLEEPCTRL [VPRCSR_NORDIC_VPRNORDICSLEEPCTRL] Nordic Sleep Control
  */
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL (0x000007C1ul)
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_ResetValue (0x00000002UL) /*!< Reset value of VPRNORDICSLEEPCTRL register.          */

/* SLEEPSTATE @Bits 0..3 : Sleep State */
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_SLEEPSTATE_Pos (0UL) /*!< Position of SLEEPSTATE field.                             */
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_SLEEPSTATE_Msk (0xFUL << VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_SLEEPSTATE_Pos) /*!< Bit
                                                                            mask of SLEEPSTATE field.*/                           
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_SLEEPSTATE_Min (0x0UL) /*!< Min enumerator value of SLEEPSTATE field.               */
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_SLEEPSTATE_Max (0xFUL) /*!< Max enumerator value of SLEEPSTATE field.               */
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_SLEEPSTATE_WAIT (0x0UL) /*!< Sleep is not turning off the clock                     */
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_SLEEPSTATE_RESET (0x2UL) /*!< Sleep state default reset value. Going to sleep with
                                                                         sleep state = RESET has the same effect as going to
                                                                         sleep with sleep state = WAIT*/                          
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_SLEEPSTATE_SLEEP (0x5UL) /*!< Sleep is turning the clock off                        */
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_SLEEPSTATE_DEEPSLEEP (0x7UL) /*!< Sleep is turning the clock off and power is turned
                                                                            off*/                                                 
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_SLEEPSTATE_HIBERNATE (0xFUL) /*!< sleep is turning the clock off and all the
                                                                            registers are saved automatically, restart by a
                                                                            reset*/                                               

/* RETURNTOSLEEP @Bit 16 : Return to Sleep */
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_RETURNTOSLEEP_Pos (16UL) /*!< Position of RETURNTOSLEEP field.                      */
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_RETURNTOSLEEP_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_RETURNTOSLEEP_Pos) /*!<
                                                                            Bit mask of RETURNTOSLEEP field.*/                    
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_RETURNTOSLEEP_Min (0x0UL) /*!< Min enumerator value of RETURNTOSLEEP field.         */
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_RETURNTOSLEEP_Max (0x1UL) /*!< Max enumerator value of RETURNTOSLEEP field.         */
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_RETURNTOSLEEP_Disabled (0x0UL) /*!< (unspecified)                                   */
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_RETURNTOSLEEP_Enabled (0x1UL) /*!< (unspecified)                                    */

/* STACKONSLEEP @Bit 17 : Stack on Sleep */
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_STACKONSLEEP_Pos (17UL) /*!< Position of STACKONSLEEP field.                        */
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_STACKONSLEEP_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_STACKONSLEEP_Pos) /*!<
                                                                            Bit mask of STACKONSLEEP field.*/                     
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_STACKONSLEEP_Min (0x0UL) /*!< Min enumerator value of STACKONSLEEP field.           */
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_STACKONSLEEP_Max (0x1UL) /*!< Max enumerator value of STACKONSLEEP field.           */
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_STACKONSLEEP_Disabled (0x0UL) /*!< (unspecified)                                    */
  #define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_STACKONSLEEP_Enabled (0x1UL) /*!< (unspecified)                                     */


/**
  * @brief VPRNORDICFEATURESDISABLE [VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE] (unspecified)
  */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE (0x000007C2ul)
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_ResetValue (0x00000090UL) /*!< Reset value of VPRNORDICFEATURESDISABLE
                                                                            register.*/                                           

/* DISABLESTOREBUFFER @Bit 0 : Disable Store Buffer */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLESTOREBUFFER_Pos (0UL) /*!< Position of DISABLESTOREBUFFER field.       */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLESTOREBUFFER_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLESTOREBUFFER_Pos)
                                                                            /*!< Bit mask of DISABLESTOREBUFFER field.*/          
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLESTOREBUFFER_Min (0x0UL) /*!< Min enumerator value of DISABLESTOREBUFFER
                                                                            field.*/                                              
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLESTOREBUFFER_Max (0x1UL) /*!< Max enumerator value of DISABLESTOREBUFFER
                                                                            field.*/                                              
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLESTOREBUFFER_Enabled (0x0UL) /*!< (unspecified)                         */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLESTOREBUFFER_Disabled (0x1UL) /*!< (unspecified)                        */

/* DISABLELOADSLOT @Bit 1 : Disable Load Slot */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLELOADSLOT_Pos (1UL) /*!< Position of DISABLELOADSLOT field.             */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLELOADSLOT_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLELOADSLOT_Pos)
                                                                            /*!< Bit mask of DISABLELOADSLOT field.*/             
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLELOADSLOT_Min (0x0UL) /*!< Min enumerator value of DISABLELOADSLOT
                                                                            field.*/                                              
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLELOADSLOT_Max (0x1UL) /*!< Max enumerator value of DISABLELOADSLOT
                                                                            field.*/                                              
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLELOADSLOT_Enabled (0x0UL) /*!< (unspecified)                            */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLELOADSLOT_Disabled (0x1UL) /*!< (unspecified)                           */

/* DISABLECLICROUNDROBIN @Bit 3 : Disable CLIC Round Robin */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLECLICROUNDROBIN_Pos (3UL) /*!< Position of DISABLECLICROUNDROBIN field. */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLECLICROUNDROBIN_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLECLICROUNDROBIN_Pos)
                                                                            /*!< Bit mask of DISABLECLICROUNDROBIN field.*/       
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLECLICROUNDROBIN_Min (0x0UL) /*!< Min enumerator value of
                                                                            DISABLECLICROUNDROBIN field.*/                        
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLECLICROUNDROBIN_Max (0x1UL) /*!< Max enumerator value of
                                                                            DISABLECLICROUNDROBIN field.*/                        
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLECLICROUNDROBIN_Enabled (0x0UL) /*!< (unspecified)                      */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_DISABLECLICROUNDROBIN_Disabled (0x1UL) /*!< (unspecified)                     */

