adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* UNRECOVRETURN @Bit 4 : Unrecoverable Return */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_UNRECOVRETURN_Pos (4UL) /*!< Position of UNRECOVRETURN field.                 */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_UNRECOVRETURN_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_UNRECOVRETURN_Pos)
                                                                            /*!< Bit mask of UNRECOVRETURN field.*/               
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_UNRECOVRETURN_Min (0x0UL) /*!< Min enumerator value of UNRECOVRETURN field.   */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_UNRECOVRETURN_Max (0x1UL) /*!< Max enumerator value of UNRECOVRETURN field.   */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_UNRECOVRETURN_Disabled (0x0UL) /*!< (unspecified)                             */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_UNRECOVRETURN_Enabled (0x1UL) /*!< (unspecified)                              */

/* INTHWSTACKING @Bits 5..6 : Interrupt Request Functionality */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_INTHWSTACKING_Pos (5UL) /*!< Position of INTHWSTACKING field.                 */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_INTHWSTACKING_Msk (0x3UL << VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_INTHWSTACKING_Pos)
                                                                            /*!< Bit mask of INTHWSTACKING field.*/               
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_INTHWSTACKING_Min (0x0UL) /*!< Min enumerator value of INTHWSTACKING field.   */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_INTHWSTACKING_Max (0x3UL) /*!< Max enumerator value of INTHWSTACKING field.   */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_INTHWSTACKING_AUTOSTACK1F0 (0x0UL) /*!< (unspecified)                         */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_INTHWSTACKING_AUTOSTACKNO1F0 (0x1UL) /*!< (unspecified)                       */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_INTHWSTACKING_AUTOSTACK1F0NOFIT (0x2UL) /*!< (unspecified)                    */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_INTHWSTACKING_NOAUTOSTACK (0x3UL) /*!< (unspecified)                          */

/* TIMEOUTCHK @Bit 7 : Disable transaction timeout check. Exception is raised if a transaction takes more than 512 cycles */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_TIMEOUTCHK_Pos (7UL) /*!< Position of TIMEOUTCHK field.                       */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_TIMEOUTCHK_Msk (0x1UL << VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_TIMEOUTCHK_Pos)
                                                                            /*!< Bit mask of TIMEOUTCHK field.*/                  
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_TIMEOUTCHK_Min (0x0UL) /*!< Min enumerator value of TIMEOUTCHK field.         */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_TIMEOUTCHK_Max (0x1UL) /*!< Max enumerator value of TIMEOUTCHK field.         */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_TIMEOUTCHK_Enabled (0x0UL) /*!< (unspecified)                                 */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_TIMEOUTCHK_Disabled (0x1UL) /*!< (unspecified)                                */

/* NORDICKEY @Bits 16..31 : Used in order to protect the write to this register */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_NORDICKEY_Pos (16UL) /*!< Position of NORDICKEY field.                        */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_NORDICKEY_Msk (0xFFFFUL << VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_NORDICKEY_Pos)
                                                                            /*!< Bit mask of NORDICKEY field.*/                   
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_NORDICKEY_Min (0x507DUL) /*!< Min enumerator value of NORDICKEY field.        */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_NORDICKEY_Max (0x507DUL) /*!< Max enumerator value of NORDICKEY field.        */
  #define VPRCSR_NORDIC_VPRNORDICFEATURESDISABLE_NORDICKEY_Enabled (0x507DUL) /*!< Write enabled                               */


/**
  * @brief VIOPINS [VPRCSR_NORDIC_VIOPINS] Reads value of parameter RT_VIO_PINS
  */
  #define VPRCSR_NORDIC_VIOPINS (0x000007C3ul)
  #define VPRCSR_NORDIC_VIOPINS_ResetValue (0x00000000UL) /*!< Reset value of VIOPINS register.                                */

/* VAL @Bits 0..31 : value of RT_VIO_PINS */
  #define VPRCSR_NORDIC_VIOPINS_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define VPRCSR_NORDIC_VIOPINS_VAL_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_VIOPINS_VAL_Pos) /*!< Bit mask of VAL field.            */


/**
  * @brief EXTPARAMS [VPRCSR_NORDIC_EXTPARAMS] Reads values of external configuration parameters
  */
  #define VPRCSR_NORDIC_EXTPARAMS (0x000007C4ul)
  #define VPRCSR_NORDIC_EXTPARAMS_ResetValue (0x00000000UL) /*!< Reset value of EXTPARAMS register.                            */

/* MULDIV @Bits 0..1 : value of MULDIV */
  #define VPRCSR_NORDIC_EXTPARAMS_MULDIV_Pos (0UL)   /*!< Position of MULDIV field.                                            */
  #define VPRCSR_NORDIC_EXTPARAMS_MULDIV_Msk (0x3UL << VPRCSR_NORDIC_EXTPARAMS_MULDIV_Pos) /*!< Bit mask of MULDIV field.      */

/* DBG @Bit 2 : value of DBG */
  #define VPRCSR_NORDIC_EXTPARAMS_DBG_Pos (2UL)      /*!< Position of DBG field.                                               */
  #define VPRCSR_NORDIC_EXTPARAMS_DBG_Msk (0x1UL << VPRCSR_NORDIC_EXTPARAMS_DBG_Pos) /*!< Bit mask of DBG field.               */

/* BKPT @Bits 3..6 : value of BKPT */
  #define VPRCSR_NORDIC_EXTPARAMS_BKPT_Pos (3UL)     /*!< Position of BKPT field.                                              */
  #define VPRCSR_NORDIC_EXTPARAMS_BKPT_Msk (0xFUL << VPRCSR_NORDIC_EXTPARAMS_BKPT_Pos) /*!< Bit mask of BKPT field.            */

/* REMAP @Bit 7 : value of REMAP */
  #define VPRCSR_NORDIC_EXTPARAMS_REMAP_Pos (7UL)    /*!< Position of REMAP field.                                             */
  #define VPRCSR_NORDIC_EXTPARAMS_REMAP_Msk (0x1UL << VPRCSR_NORDIC_EXTPARAMS_REMAP_Pos) /*!< Bit mask of REMAP field.         */

/* RTSPLITSEC @Bit 8 : value of RT_SPLIT_SEC */
  #define VPRCSR_NORDIC_EXTPARAMS_RTSPLITSEC_Pos (8UL) /*!< Position of RTSPLITSEC field.                                      */
  #define VPRCSR_NORDIC_EXTPARAMS_RTSPLITSEC_Msk (0x1UL << VPRCSR_NORDIC_EXTPARAMS_RTSPLITSEC_Pos) /*!< Bit mask of RTSPLITSEC
                                                                            field.*/                                              


/**
  * @brief CACHE [VPRCSR_NORDIC_CACHE] (unspecified)
  */

/**
  * @brief CTRL [VPRCSR_NORDIC_CACHE_CTRL] Cache control
  */
  #define VPRCSR_NORDIC_CACHE_CTRL (0x000007C8ul)
  #define VPRCSR_NORDIC_CACHE_CTRL_ResetValue (0x00000000UL) /*!< Reset value of CTRL register.                                */

/* ENABLE @Bit 0 : Enable cache */
  #define VPRCSR_NORDIC_CACHE_CTRL_ENABLE_Pos (0UL)  /*!< Position of ENABLE field.                                            */
  #define VPRCSR_NORDIC_CACHE_CTRL_ENABLE_Msk (0x1UL << VPRCSR_NORDIC_CACHE_CTRL_ENABLE_Pos) /*!< Bit mask of ENABLE field.    */
  #define VPRCSR_NORDIC_CACHE_CTRL_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                               */
  #define VPRCSR_NORDIC_CACHE_CTRL_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                               */
  #define VPRCSR_NORDIC_CACHE_CTRL_ENABLE_Disabled (0x0UL) /*!< Cache disabled                                                 */
  #define VPRCSR_NORDIC_CACHE_CTRL_ENABLE_Enabled (0x1UL) /*!< Cache enabled                                                   */


/**
  * @brief CFG [VPRCSR_NORDIC_CACHE_CFG] Cache configuration
  */
  #define VPRCSR_NORDIC_CACHE_CFG (0x000007C9ul)
  #define VPRCSR_NORDIC_CACHE_CFG_ResetValue (0x00000000UL) /*!< Reset value of CFG register.                                  */

/* CACHESIZE @Bits 0..4 : Cache size in KB */
  #define VPRCSR_NORDIC_CACHE_CFG_CACHESIZE_Pos (0UL) /*!< Position of CACHESIZE field.                                        */
  #define VPRCSR_NORDIC_CACHE_CFG_CACHESIZE_Msk (0x1FUL << VPRCSR_NORDIC_CACHE_CFG_CACHESIZE_Pos) /*!< Bit mask of CACHESIZE
                                                                            field.*/                                              
  #define VPRCSR_NORDIC_CACHE_CFG_CACHESIZE_Min (0x0UL) /*!< Min value of CACHESIZE field.                                     */
  #define VPRCSR_NORDIC_CACHE_CFG_CACHESIZE_Max (0x1FUL) /*!< Max size of CACHESIZE field.                                     */

/* CACHELINESIZE @Bit 8 : Cache line size */
  #define VPRCSR_NORDIC_CACHE_CFG_CACHELINESIZE_Pos (8UL) /*!< Position of CACHELINESIZE field.                                */
  #define VPRCSR_NORDIC_CACHE_CFG_CACHELINESIZE_Msk (0x1UL << VPRCSR_NORDIC_CACHE_CFG_CACHELINESIZE_Pos) /*!< Bit mask of
                                                                            CACHELINESIZE field.*/                                
  #define VPRCSR_NORDIC_CACHE_CFG_CACHELINESIZE_Min (0x0UL) /*!< Min enumerator value of CACHELINESIZE field.                  */
  #define VPRCSR_NORDIC_CACHE_CFG_CACHELINESIZE_Max (0x1UL) /*!< Max enumerator value of CACHELINESIZE field.                  */
  #define VPRCSR_NORDIC_CACHE_CFG_CACHELINESIZE_CachelineSize32B (0x0UL) /*!< Cache line size is 32 bytes                      */
  #define VPRCSR_NORDIC_CACHE_CFG_CACHELINESIZE_CachelineSize64B (0x1UL) /*!< Cache line size is 64 bytes                      */


/**
  * @brief DATABASEADDR [VPRCSR_NORDIC_CACHE_DATABASEADDR] Cache data base address
  */
  #define VPRCSR_NORDIC_CACHE_DATABASEADDR (0x000007CAul)
  #define VPRCSR_NORDIC_CACHE_DATABASEADDR_ResetValue (0x00000000UL) /*!< Reset value of DATABASEADDR register.                */

