adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* INTEN10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN10_Pos (10UL)     /*!< Position of INTEN10 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN10_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN10_Pos) /*!< Bit mask of INTEN10 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN10_Min (0x0UL)    /*!< Min enumerator value of INTEN10 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN10_Max (0x1UL)    /*!< Max enumerator value of INTEN10 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN10_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[10]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN10_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[10]                                    */

/* INTEN11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN11_Pos (11UL)     /*!< Position of INTEN11 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN11_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN11_Pos) /*!< Bit mask of INTEN11 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN11_Min (0x0UL)    /*!< Min enumerator value of INTEN11 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN11_Max (0x1UL)    /*!< Max enumerator value of INTEN11 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN11_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[11]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN11_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[11]                                    */

/* INTEN12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN12_Pos (12UL)     /*!< Position of INTEN12 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN12_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN12_Pos) /*!< Bit mask of INTEN12 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN12_Min (0x0UL)    /*!< Min enumerator value of INTEN12 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN12_Max (0x1UL)    /*!< Max enumerator value of INTEN12 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN12_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[12]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN12_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[12]                                    */

/* INTEN13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN13_Pos (13UL)     /*!< Position of INTEN13 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN13_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN13_Pos) /*!< Bit mask of INTEN13 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN13_Min (0x0UL)    /*!< Min enumerator value of INTEN13 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN13_Max (0x1UL)    /*!< Max enumerator value of INTEN13 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN13_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[13]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN13_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[13]                                    */

/* INTEN14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN14_Pos (14UL)     /*!< Position of INTEN14 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN14_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN14_Pos) /*!< Bit mask of INTEN14 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN14_Min (0x0UL)    /*!< Min enumerator value of INTEN14 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN14_Max (0x1UL)    /*!< Max enumerator value of INTEN14 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN14_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[14]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN14_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[14]                                    */

/* INTEN15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN15_Pos (15UL)     /*!< Position of INTEN15 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN15_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN15_Pos) /*!< Bit mask of INTEN15 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN15_Min (0x0UL)    /*!< Min enumerator value of INTEN15 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN15_Max (0x1UL)    /*!< Max enumerator value of INTEN15 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN15_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[15]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN15_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[15]                                    */

/* INTEN16 @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN16_Pos (16UL)     /*!< Position of INTEN16 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN16_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN16_Pos) /*!< Bit mask of INTEN16 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN16_Min (0x0UL)    /*!< Min enumerator value of INTEN16 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN16_Max (0x1UL)    /*!< Max enumerator value of INTEN16 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN16_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[16]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN16_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[16]                                    */

/* INTEN17 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN17_Pos (17UL)     /*!< Position of INTEN17 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN17_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN17_Pos) /*!< Bit mask of INTEN17 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN17_Min (0x0UL)    /*!< Min enumerator value of INTEN17 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN17_Max (0x1UL)    /*!< Max enumerator value of INTEN17 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN17_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[17]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN17_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[17]                                    */

/* INTEN18 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN18_Pos (18UL)     /*!< Position of INTEN18 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN18_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN18_Pos) /*!< Bit mask of INTEN18 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN18_Min (0x0UL)    /*!< Min enumerator value of INTEN18 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN18_Max (0x1UL)    /*!< Max enumerator value of INTEN18 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN18_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[18]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN18_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[18]                                    */

/* INTEN19 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN19_Pos (19UL)     /*!< Position of INTEN19 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN19_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN19_Pos) /*!< Bit mask of INTEN19 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN19_Min (0x0UL)    /*!< Min enumerator value of INTEN19 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN19_Max (0x1UL)    /*!< Max enumerator value of INTEN19 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN19_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[19]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN19_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[19]                                    */

/* INTEN20 @Bit 20 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN20_Pos (20UL)     /*!< Position of INTEN20 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN20_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN20_Pos) /*!< Bit mask of INTEN20 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN20_Min (0x0UL)    /*!< Min enumerator value of INTEN20 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN20_Max (0x1UL)    /*!< Max enumerator value of INTEN20 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN20_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[20]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN20_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[20]                                    */

