adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* INTEN21 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN21_Pos (21UL)     /*!< Position of INTEN21 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN21_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN21_Pos) /*!< Bit mask of INTEN21 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN21_Min (0x0UL)    /*!< Min enumerator value of INTEN21 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN21_Max (0x1UL)    /*!< Max enumerator value of INTEN21 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN21_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[21]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN21_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[21]                                    */

/* INTEN22 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN22_Pos (22UL)     /*!< Position of INTEN22 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN22_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN22_Pos) /*!< Bit mask of INTEN22 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN22_Min (0x0UL)    /*!< Min enumerator value of INTEN22 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN22_Max (0x1UL)    /*!< Max enumerator value of INTEN22 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN22_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[22]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN22_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[22]                                    */

/* INTEN23 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN23_Pos (23UL)     /*!< Position of INTEN23 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN23_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN23_Pos) /*!< Bit mask of INTEN23 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN23_Min (0x0UL)    /*!< Min enumerator value of INTEN23 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN23_Max (0x1UL)    /*!< Max enumerator value of INTEN23 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN23_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[23]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN23_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[23]                                    */

/* INTEN24 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN24_Pos (24UL)     /*!< Position of INTEN24 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN24_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN24_Pos) /*!< Bit mask of INTEN24 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN24_Min (0x0UL)    /*!< Min enumerator value of INTEN24 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN24_Max (0x1UL)    /*!< Max enumerator value of INTEN24 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN24_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[24]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN24_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[24]                                    */

/* INTEN25 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN25_Pos (25UL)     /*!< Position of INTEN25 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN25_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN25_Pos) /*!< Bit mask of INTEN25 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN25_Min (0x0UL)    /*!< Min enumerator value of INTEN25 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN25_Max (0x1UL)    /*!< Max enumerator value of INTEN25 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN25_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[25]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN25_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[25]                                    */

/* INTEN26 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN26_Pos (26UL)     /*!< Position of INTEN26 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN26_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN26_Pos) /*!< Bit mask of INTEN26 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN26_Min (0x0UL)    /*!< Min enumerator value of INTEN26 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN26_Max (0x1UL)    /*!< Max enumerator value of INTEN26 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN26_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[26]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN26_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[26]                                    */

/* INTEN27 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN27_Pos (27UL)     /*!< Position of INTEN27 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN27_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN27_Pos) /*!< Bit mask of INTEN27 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN27_Min (0x0UL)    /*!< Min enumerator value of INTEN27 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN27_Max (0x1UL)    /*!< Max enumerator value of INTEN27 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN27_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[27]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN27_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[27]                                    */

/* INTEN28 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN28_Pos (28UL)     /*!< Position of INTEN28 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN28_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN28_Pos) /*!< Bit mask of INTEN28 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN28_Min (0x0UL)    /*!< Min enumerator value of INTEN28 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN28_Max (0x1UL)    /*!< Max enumerator value of INTEN28 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN28_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[28]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN28_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[28]                                    */

/* INTEN29 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN29_Pos (29UL)     /*!< Position of INTEN29 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN29_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN29_Pos) /*!< Bit mask of INTEN29 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN29_Min (0x0UL)    /*!< Min enumerator value of INTEN29 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN29_Max (0x1UL)    /*!< Max enumerator value of INTEN29 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN29_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[29]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN29_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[29]                                    */

/* INTEN30 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN30_Pos (30UL)     /*!< Position of INTEN30 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN30_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN30_Pos) /*!< Bit mask of INTEN30 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN30_Min (0x0UL)    /*!< Min enumerator value of INTEN30 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN30_Max (0x1UL)    /*!< Max enumerator value of INTEN30 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN30_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[30]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN30_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[30]                                    */

/* INTEN31 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN31_Pos (31UL)     /*!< Position of INTEN31 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN31_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN31_Pos) /*!< Bit mask of INTEN31 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN31_Min (0x0UL)    /*!< Min enumerator value of INTEN31 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN31_Max (0x1UL)    /*!< Max enumerator value of INTEN31 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN31_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[31]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN31_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[31]                                    */


/**
  * @brief EVENTSB [VPRCSR_NORDIC_EVENTSB] Buffered DPPI Events
  */
  #define VPRCSR_NORDIC_EVENTSB (0x000007E5ul)
  #define VPRCSR_NORDIC_EVENTSB_ResetValue (0x00000000UL) /*!< Reset value of EVENTSB register.                                */

