adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* PIN8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN8_Pos (8UL)            /*!< Position of PIN8 field.                                              */
  #define VPRCSR_NORDIC_IN_PIN8_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN8_Pos) /*!< Bit mask of PIN8 field.                          */
  #define VPRCSR_NORDIC_IN_PIN8_Min (0x0UL)          /*!< Min enumerator value of PIN8 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN8_Max (0x1UL)          /*!< Max enumerator value of PIN8 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN8_LOW (0x0UL)          /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN8_HIGH (0x1UL)         /*!< Pin is High                                                          */

/* PIN9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN9_Pos (9UL)            /*!< Position of PIN9 field.                                              */
  #define VPRCSR_NORDIC_IN_PIN9_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN9_Pos) /*!< Bit mask of PIN9 field.                          */
  #define VPRCSR_NORDIC_IN_PIN9_Min (0x0UL)          /*!< Min enumerator value of PIN9 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN9_Max (0x1UL)          /*!< Max enumerator value of PIN9 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN9_LOW (0x0UL)          /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN9_HIGH (0x1UL)         /*!< Pin is High                                                          */

/* PIN10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN10_Pos (10UL)          /*!< Position of PIN10 field.                                             */
  #define VPRCSR_NORDIC_IN_PIN10_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN10_Pos) /*!< Bit mask of PIN10 field.                       */
  #define VPRCSR_NORDIC_IN_PIN10_Min (0x0UL)         /*!< Min enumerator value of PIN10 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN10_Max (0x1UL)         /*!< Max enumerator value of PIN10 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN10_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN10_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN11_Pos (11UL)          /*!< Position of PIN11 field.                                             */
  #define VPRCSR_NORDIC_IN_PIN11_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN11_Pos) /*!< Bit mask of PIN11 field.                       */
  #define VPRCSR_NORDIC_IN_PIN11_Min (0x0UL)         /*!< Min enumerator value of PIN11 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN11_Max (0x1UL)         /*!< Max enumerator value of PIN11 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN11_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN11_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN12_Pos (12UL)          /*!< Position of PIN12 field.                                             */
  #define VPRCSR_NORDIC_IN_PIN12_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN12_Pos) /*!< Bit mask of PIN12 field.                       */
  #define VPRCSR_NORDIC_IN_PIN12_Min (0x0UL)         /*!< Min enumerator value of PIN12 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN12_Max (0x1UL)         /*!< Max enumerator value of PIN12 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN12_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN12_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN13_Pos (13UL)          /*!< Position of PIN13 field.                                             */
  #define VPRCSR_NORDIC_IN_PIN13_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN13_Pos) /*!< Bit mask of PIN13 field.                       */
  #define VPRCSR_NORDIC_IN_PIN13_Min (0x0UL)         /*!< Min enumerator value of PIN13 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN13_Max (0x1UL)         /*!< Max enumerator value of PIN13 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN13_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN13_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN14_Pos (14UL)          /*!< Position of PIN14 field.                                             */
  #define VPRCSR_NORDIC_IN_PIN14_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN14_Pos) /*!< Bit mask of PIN14 field.                       */
  #define VPRCSR_NORDIC_IN_PIN14_Min (0x0UL)         /*!< Min enumerator value of PIN14 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN14_Max (0x1UL)         /*!< Max enumerator value of PIN14 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN14_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN14_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN15_Pos (15UL)          /*!< Position of PIN15 field.                                             */
  #define VPRCSR_NORDIC_IN_PIN15_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN15_Pos) /*!< Bit mask of PIN15 field.                       */
  #define VPRCSR_NORDIC_IN_PIN15_Min (0x0UL)         /*!< Min enumerator value of PIN15 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN15_Max (0x1UL)         /*!< Max enumerator value of PIN15 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN15_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN15_HIGH (0x1UL)        /*!< Pin is High                                                          */


/**
  * @brief INMODE [VPRCSR_NORDIC_INMODE] Input Mode
  */
  #define VPRCSR_NORDIC_INMODE (0x00000BC3ul)
  #define VPRCSR_NORDIC_INMODE_ResetValue (0x00000000UL) /*!< Reset value of INMODE register.                                  */

/* MODE0 @Bit 0 : Input Mode */
  #define VPRCSR_NORDIC_INMODE_MODE0_Pos (0UL)       /*!< Position of MODE0 field.                                             */
  #define VPRCSR_NORDIC_INMODE_MODE0_Msk (0x1UL << VPRCSR_NORDIC_INMODE_MODE0_Pos) /*!< Bit mask of MODE0 field.               */
  #define VPRCSR_NORDIC_INMODE_MODE0_Min (0x0UL)     /*!< Min enumerator value of MODE0 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE0_Max (0x1UL)     /*!< Max enumerator value of MODE0 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE0_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)                      */
  #define VPRCSR_NORDIC_INMODE_MODE0_EVENT (0x1UL)   /*!< Sampling on Counter1 event                                           */

/* MODE1 @Bit 1 : Input Mode */
  #define VPRCSR_NORDIC_INMODE_MODE1_Pos (1UL)       /*!< Position of MODE1 field.                                             */
  #define VPRCSR_NORDIC_INMODE_MODE1_Msk (0x1UL << VPRCSR_NORDIC_INMODE_MODE1_Pos) /*!< Bit mask of MODE1 field.               */
  #define VPRCSR_NORDIC_INMODE_MODE1_Min (0x0UL)     /*!< Min enumerator value of MODE1 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE1_Max (0x1UL)     /*!< Max enumerator value of MODE1 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE1_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)                      */
  #define VPRCSR_NORDIC_INMODE_MODE1_EVENT (0x1UL)   /*!< Sampling on Counter1 event                                           */

/* MODE2 @Bit 2 : Input Mode */
  #define VPRCSR_NORDIC_INMODE_MODE2_Pos (2UL)       /*!< Position of MODE2 field.                                             */
  #define VPRCSR_NORDIC_INMODE_MODE2_Msk (0x1UL << VPRCSR_NORDIC_INMODE_MODE2_Pos) /*!< Bit mask of MODE2 field.               */
  #define VPRCSR_NORDIC_INMODE_MODE2_Min (0x0UL)     /*!< Min enumerator value of MODE2 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE2_Max (0x1UL)     /*!< Max enumerator value of MODE2 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE2_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)                      */
  #define VPRCSR_NORDIC_INMODE_MODE2_EVENT (0x1UL)   /*!< Sampling on Counter1 event                                           */

/* MODE3 @Bit 3 : Input Mode */
  #define VPRCSR_NORDIC_INMODE_MODE3_Pos (3UL)       /*!< Position of MODE3 field.                                             */
  #define VPRCSR_NORDIC_INMODE_MODE3_Msk (0x1UL << VPRCSR_NORDIC_INMODE_MODE3_Pos) /*!< Bit mask of MODE3 field.               */
  #define VPRCSR_NORDIC_INMODE_MODE3_Min (0x0UL)     /*!< Min enumerator value of MODE3 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE3_Max (0x1UL)     /*!< Max enumerator value of MODE3 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE3_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)                      */
  #define VPRCSR_NORDIC_INMODE_MODE3_EVENT (0x1UL)   /*!< Sampling on Counter1 event                                           */

/* MODE4 @Bit 4 : Input Mode */
  #define VPRCSR_NORDIC_INMODE_MODE4_Pos (4UL)       /*!< Position of MODE4 field.                                             */
  #define VPRCSR_NORDIC_INMODE_MODE4_Msk (0x1UL << VPRCSR_NORDIC_INMODE_MODE4_Pos) /*!< Bit mask of MODE4 field.               */
  #define VPRCSR_NORDIC_INMODE_MODE4_Min (0x0UL)     /*!< Min enumerator value of MODE4 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE4_Max (0x1UL)     /*!< Max enumerator value of MODE4 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE4_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)                      */
  #define VPRCSR_NORDIC_INMODE_MODE4_EVENT (0x1UL)   /*!< Sampling on Counter1 event                                           */

/* MODE5 @Bit 5 : Input Mode */
  #define VPRCSR_NORDIC_INMODE_MODE5_Pos (5UL)       /*!< Position of MODE5 field.                                             */
  #define VPRCSR_NORDIC_INMODE_MODE5_Msk (0x1UL << VPRCSR_NORDIC_INMODE_MODE5_Pos) /*!< Bit mask of MODE5 field.               */
  #define VPRCSR_NORDIC_INMODE_MODE5_Min (0x0UL)     /*!< Min enumerator value of MODE5 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE5_Max (0x1UL)     /*!< Max enumerator value of MODE5 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE5_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)                      */
  #define VPRCSR_NORDIC_INMODE_MODE5_EVENT (0x1UL)   /*!< Sampling on Counter1 event                                           */

/* MODE6 @Bit 6 : Input Mode */
  #define VPRCSR_NORDIC_INMODE_MODE6_Pos (6UL)       /*!< Position of MODE6 field.                                             */
  #define VPRCSR_NORDIC_INMODE_MODE6_Msk (0x1UL << VPRCSR_NORDIC_INMODE_MODE6_Pos) /*!< Bit mask of MODE6 field.               */
  #define VPRCSR_NORDIC_INMODE_MODE6_Min (0x0UL)     /*!< Min enumerator value of MODE6 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE6_Max (0x1UL)     /*!< Max enumerator value of MODE6 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE6_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)                      */
  #define VPRCSR_NORDIC_INMODE_MODE6_EVENT (0x1UL)   /*!< Sampling on Counter1 event                                           */

/* MODE7 @Bit 7 : Input Mode */
  #define VPRCSR_NORDIC_INMODE_MODE7_Pos (7UL)       /*!< Position of MODE7 field.                                             */
  #define VPRCSR_NORDIC_INMODE_MODE7_Msk (0x1UL << VPRCSR_NORDIC_INMODE_MODE7_Pos) /*!< Bit mask of MODE7 field.               */
  #define VPRCSR_NORDIC_INMODE_MODE7_Min (0x0UL)     /*!< Min enumerator value of MODE7 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE7_Max (0x1UL)     /*!< Max enumerator value of MODE7 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE7_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)                      */
  #define VPRCSR_NORDIC_INMODE_MODE7_EVENT (0x1UL)   /*!< Sampling on Counter1 event                                           */

/* MODE8 @Bit 8 : Input Mode */
  #define VPRCSR_NORDIC_INMODE_MODE8_Pos (8UL)       /*!< Position of MODE8 field.                                             */
  #define VPRCSR_NORDIC_INMODE_MODE8_Msk (0x1UL << VPRCSR_NORDIC_INMODE_MODE8_Pos) /*!< Bit mask of MODE8 field.               */
  #define VPRCSR_NORDIC_INMODE_MODE8_Min (0x0UL)     /*!< Min enumerator value of MODE8 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE8_Max (0x1UL)     /*!< Max enumerator value of MODE8 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE8_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)                      */
  #define VPRCSR_NORDIC_INMODE_MODE8_EVENT (0x1UL)   /*!< Sampling on Counter1 event                                           */

/* MODE9 @Bit 9 : Input Mode */
  #define VPRCSR_NORDIC_INMODE_MODE9_Pos (9UL)       /*!< Position of MODE9 field.                                             */
  #define VPRCSR_NORDIC_INMODE_MODE9_Msk (0x1UL << VPRCSR_NORDIC_INMODE_MODE9_Pos) /*!< Bit mask of MODE9 field.               */
  #define VPRCSR_NORDIC_INMODE_MODE9_Min (0x0UL)     /*!< Min enumerator value of MODE9 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE9_Max (0x1UL)     /*!< Max enumerator value of MODE9 field.                                 */
  #define VPRCSR_NORDIC_INMODE_MODE9_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)                      */
  #define VPRCSR_NORDIC_INMODE_MODE9_EVENT (0x1UL)   /*!< Sampling on Counter1 event                                           */

