adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* OUTB13 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB13_Pos (29UL)   /*!< Position of OUTB13 field.                                            */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB13_Msk (0x1UL << VPRCSR_NORDIC_OUTBDTGL_OUTB13_Pos) /*!< Bit mask of OUTB13 field.        */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB13_Min (0x0UL)  /*!< Min enumerator value of OUTB13 field.                                */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB13_Max (0x1UL)  /*!< Max enumerator value of OUTB13 field.                                */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB13_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                           */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB13_TOGGLE (0x1UL) /*!< Pin is toggled                                                     */

/* OUTB14 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB14_Pos (30UL)   /*!< Position of OUTB14 field.                                            */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB14_Msk (0x1UL << VPRCSR_NORDIC_OUTBDTGL_OUTB14_Pos) /*!< Bit mask of OUTB14 field.        */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB14_Min (0x0UL)  /*!< Min enumerator value of OUTB14 field.                                */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB14_Max (0x1UL)  /*!< Max enumerator value of OUTB14 field.                                */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB14_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                           */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB14_TOGGLE (0x1UL) /*!< Pin is toggled                                                     */

/* OUTB15 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB15_Pos (31UL)   /*!< Position of OUTB15 field.                                            */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB15_Msk (0x1UL << VPRCSR_NORDIC_OUTBDTGL_OUTB15_Pos) /*!< Bit mask of OUTB15 field.        */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB15_Min (0x0UL)  /*!< Min enumerator value of OUTB15 field.                                */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB15_Max (0x1UL)  /*!< Max enumerator value of OUTB15 field.                                */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB15_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                           */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB15_TOGGLE (0x1UL) /*!< Pin is toggled                                                     */


/**
  * @brief OUTBDS [VPRCSR_NORDIC_OUTBDS] OUTBD Dirty Status
  */
  #define VPRCSR_NORDIC_OUTBDS (0x00000BE2ul)
  #define VPRCSR_NORDIC_OUTBDS_ResetValue (0x00000000UL) /*!< Reset value of OUTBDS register.                                  */

/* OUTBD @Bits 0..31 : Write to OUTBD register (if not dirty) */
  #define VPRCSR_NORDIC_OUTBDS_OUTBD_Pos (0UL)       /*!< Position of OUTBD field.                                             */
  #define VPRCSR_NORDIC_OUTBDS_OUTBD_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_OUTBDS_OUTBD_Pos) /*!< Bit mask of OUTBD field.        */

/* DIRTYBIT @Bit 0 : Read OUTB and OUT parallel write Dirty status */
  #define VPRCSR_NORDIC_OUTBDS_DIRTYBIT_Pos (0UL)    /*!< Position of DIRTYBIT field.                                          */
  #define VPRCSR_NORDIC_OUTBDS_DIRTYBIT_Msk (0x1UL << VPRCSR_NORDIC_OUTBDS_DIRTYBIT_Pos) /*!< Bit mask of DIRTYBIT field.      */
  #define VPRCSR_NORDIC_OUTBDS_DIRTYBIT_Min (0x0UL)  /*!< Min enumerator value of DIRTYBIT field.                              */
  #define VPRCSR_NORDIC_OUTBDS_DIRTYBIT_Max (0x1UL)  /*!< Max enumerator value of DIRTYBIT field.                              */
  #define VPRCSR_NORDIC_OUTBDS_DIRTYBIT_CLEAN (0x0UL) /*!< Buffer is clean                                                     */
  #define VPRCSR_NORDIC_OUTBDS_DIRTYBIT_DIRTY (0x1UL) /*!< Buffer is dirty                                                     */


/**
  * @brief OUTMODE [VPRCSR_NORDIC_OUTMODE] Serial output mode
  */
  #define VPRCSR_NORDIC_OUTMODE (0x00000BE3ul)
  #define VPRCSR_NORDIC_OUTMODE_ResetValue (0x00000000UL) /*!< Reset value of OUTMODE register.                                */

/* ENABLE @Bit 0 : Enable serial output mode */
  #define VPRCSR_NORDIC_OUTMODE_ENABLE_Pos (0UL)     /*!< Position of ENABLE field.                                            */
  #define VPRCSR_NORDIC_OUTMODE_ENABLE_Msk (0x1UL << VPRCSR_NORDIC_OUTMODE_ENABLE_Pos) /*!< Bit mask of ENABLE field.          */
  #define VPRCSR_NORDIC_OUTMODE_ENABLE_Min (0x0UL)   /*!< Min enumerator value of ENABLE field.                                */
  #define VPRCSR_NORDIC_OUTMODE_ENABLE_Max (0x1UL)   /*!< Max enumerator value of ENABLE field.                                */
  #define VPRCSR_NORDIC_OUTMODE_ENABLE_Disabled (0x0UL) /*!< Serial output mode disabled                                       */
  #define VPRCSR_NORDIC_OUTMODE_ENABLE_Enabled (0x1UL) /*!< Serial output mode enabled                                         */

/* MODE @Bits 4..5 : Mode */
  #define VPRCSR_NORDIC_OUTMODE_MODE_Pos (4UL)       /*!< Position of MODE field.                                              */
  #define VPRCSR_NORDIC_OUTMODE_MODE_Msk (0x3UL << VPRCSR_NORDIC_OUTMODE_MODE_Pos) /*!< Bit mask of MODE field.                */
  #define VPRCSR_NORDIC_OUTMODE_MODE_Min (0x0UL)     /*!< Min enumerator value of MODE field.                                  */
  #define VPRCSR_NORDIC_OUTMODE_MODE_Max (0x2UL)     /*!< Max enumerator value of MODE field.                                  */
  #define VPRCSR_NORDIC_OUTMODE_MODE_OutBAndOutBuf (0x0UL) /*!< OUTB and OUT msbs used for buffering                           */
  #define VPRCSR_NORDIC_OUTMODE_MODE_OutBBuf (0x1UL) /*!< Only OUTB used for buffering                                         */
  #define VPRCSR_NORDIC_OUTMODE_MODE_OutBBufToggleClk (0x2UL) /*!< Only OUTB used for buffering, auto-toggle clock line        */

/* OUTWIDTH @Bits 8..10 : Output frame is 2^OUTWIDTH bits wide */
  #define VPRCSR_NORDIC_OUTMODE_OUTWIDTH_Pos (8UL)   /*!< Position of OUTWIDTH field.                                          */
  #define VPRCSR_NORDIC_OUTMODE_OUTWIDTH_Msk (0x7UL << VPRCSR_NORDIC_OUTMODE_OUTWIDTH_Pos) /*!< Bit mask of OUTWIDTH field.    */
  #define VPRCSR_NORDIC_OUTMODE_OUTWIDTH_Min (0x0UL) /*!< Min value of OUTWIDTH field.                                         */
  #define VPRCSR_NORDIC_OUTMODE_OUTWIDTH_Max (0x7UL) /*!< Max size of OUTWIDTH field.                                          */




/* =========================================================================================================================== */
/* ================                                          VREG1V0                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

