adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ================================================== Struct VREG1V0_CONFIG ================================================== */
/**
  * @brief CONFIG [VREG1V0_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFGSTATIC;                         /*!< (@ 0x00000000) Voltage regulator static CFG configuration            */
  __IOM uint32_t  CFGDYNAMIC;                        /*!< (@ 0x00000004) Voltage regulator dynamic CFG configuration           */
} NRF_VREG1V0_CONFIG_Type;                           /*!< Size = 8 (0x008)                                                     */

/* VREG1V0_CONFIG_CFGSTATIC: Voltage regulator static CFG configuration */
  #define VREG1V0_CONFIG_CFGSTATIC_ResetValue (0x00000000UL) /*!< Reset value of CFGSTATIC register.                           */

/* ULPRREFRESHCMPDIS @Bit 0 : Disable the ULPR refresh comparator */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Pos (0UL) /*!< Position of ULPRREFRESHCMPDIS field.                       */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Msk (0x1UL << VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Pos) /*!< Bit mask
                                                                            of ULPRREFRESHCMPDIS field.*/                         
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Min (0x0UL) /*!< Min enumerator value of ULPRREFRESHCMPDIS field.         */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Max (0x1UL) /*!< Max enumerator value of ULPRREFRESHCMPDIS field.         */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Disabled (0x0UL) /*!< Configuration disabled                              */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHCMPDIS_Enabled (0x1UL) /*!< Configuration enabled                                */

/* VREFTIMERDIV2 @Bit 1 : Divide the VREF timer by 2 */
  #define VREG1V0_CONFIG_CFGSTATIC_VREFTIMERDIV2_Pos (1UL) /*!< Position of VREFTIMERDIV2 field.                               */
  #define VREG1V0_CONFIG_CFGSTATIC_VREFTIMERDIV2_Msk (0x1UL << VREG1V0_CONFIG_CFGSTATIC_VREFTIMERDIV2_Pos) /*!< Bit mask of
                                                                            VREFTIMERDIV2 field.*/                                
  #define VREG1V0_CONFIG_CFGSTATIC_VREFTIMERDIV2_Min (0x0UL) /*!< Min enumerator value of VREFTIMERDIV2 field.                 */
  #define VREG1V0_CONFIG_CFGSTATIC_VREFTIMERDIV2_Max (0x1UL) /*!< Max enumerator value of VREFTIMERDIV2 field.                 */
  #define VREG1V0_CONFIG_CFGSTATIC_VREFTIMERDIV2_Disabled (0x0UL) /*!< Configuration disabled                                  */
  #define VREG1V0_CONFIG_CFGSTATIC_VREFTIMERDIV2_Enabled (0x1UL) /*!< Configuration enabled                                    */

/* ULPRREFRESHDIV2 @Bit 2 : Divide the ULPR refresh timer by 2 */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Pos (2UL) /*!< Position of ULPRREFRESHDIV2 field.                           */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Msk (0x1UL << VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Pos) /*!< Bit mask of
                                                                            ULPRREFRESHDIV2 field.*/                              
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Min (0x0UL) /*!< Min enumerator value of ULPRREFRESHDIV2 field.             */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Max (0x1UL) /*!< Max enumerator value of ULPRREFRESHDIV2 field.             */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Disabled (0x0UL) /*!< Configuration disabled                                */
  #define VREG1V0_CONFIG_CFGSTATIC_ULPRREFRESHDIV2_Enabled (0x1UL) /*!< Configuration enabled                                  */

/* CURRCMPDIS @Bit 3 : Disable the current comparator */
  #define VREG1V0_CONFIG_CFGSTATIC_CURRCMPDIS_Pos (3UL) /*!< Position of CURRCMPDIS field.                                     */
  #define VREG1V0_CONFIG_CFGSTATIC_CURRCMPDIS_Msk (0x1UL << VREG1V0_CONFIG_CFGSTATIC_CURRCMPDIS_Pos) /*!< Bit mask of CURRCMPDIS
                                                                            field.*/                                              
  #define VREG1V0_CONFIG_CFGSTATIC_CURRCMPDIS_Min (0x0UL) /*!< Min enumerator value of CURRCMPDIS field.                       */
  #define VREG1V0_CONFIG_CFGSTATIC_CURRCMPDIS_Max (0x1UL) /*!< Max enumerator value of CURRCMPDIS field.                       */
  #define VREG1V0_CONFIG_CFGSTATIC_CURRCMPDIS_Disabled (0x0UL) /*!< Configuration disabled                                     */
  #define VREG1V0_CONFIG_CFGSTATIC_CURRCMPDIS_Enabled (0x1UL) /*!< Configuration enabled                                       */

/* LPDOUBLEBIAS @Bit 4 : Double the LP core bias current */
  #define VREG1V0_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Pos (4UL) /*!< Position of LPDOUBLEBIAS field.                                 */
  #define VREG1V0_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Msk (0x1UL << VREG1V0_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Pos) /*!< Bit mask of
                                                                            LPDOUBLEBIAS field.*/                                 
  #define VREG1V0_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Min (0x0UL) /*!< Min enumerator value of LPDOUBLEBIAS field.                   */
  #define VREG1V0_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Max (0x1UL) /*!< Max enumerator value of LPDOUBLEBIAS field.                   */
  #define VREG1V0_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Disabled (0x0UL) /*!< Configuration disabled                                   */
  #define VREG1V0_CONFIG_CFGSTATIC_LPDOUBLEBIAS_Enabled (0x1UL) /*!< Configuration enabled                                     */


/* VREG1V0_CONFIG_CFGDYNAMIC: Voltage regulator dynamic CFG configuration */
  #define VREG1V0_CONFIG_CFGDYNAMIC_ResetValue (0x00000004UL) /*!< Reset value of CFGDYNAMIC register.                         */

/* SOFTSTART @Bits 0..2 : Current limit configuration for the voltage regulator */
  #define VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_Pos (0UL) /*!< Position of SOFTSTART field.                                      */
  #define VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_Msk (0x7UL << VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_Pos) /*!< Bit mask of SOFTSTART
                                                                            field.*/                                              
  #define VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_Min (0x0UL) /*!< Min enumerator value of SOFTSTART field.                        */
  #define VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_Max (0x4UL) /*!< Max enumerator value of SOFTSTART field.                        */
  #define VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_Auto (0x0UL) /*!< Automatically handled by the peripheral                        */
  #define VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_Normal (0x1UL) /*!< Normal operation                                             */
  #define VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_IlimHigh (0x2UL) /*!< Radio soft start                                           */
  #define VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_IlimMid (0x3UL) /*!< WU soft start                                               */
  #define VREG1V0_CONFIG_CFGDYNAMIC_SOFTSTART_IlimLow (0x4UL) /*!< Reset current limit                                         */



