adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* =================================================== Struct VREG1V0_TRIM =================================================== */
/**
  * @brief TRIM [VREG1V0_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  IREF;                              /*!< (@ 0x00000000) Local current reference trimming                      */
  __IOM uint32_t  HIGHPOWER;                         /*!< (@ 0x00000004) High power mode output voltage offset trimming        */
  __IOM uint32_t  LOWPOWER;                          /*!< (@ 0x00000008) Low power mode output voltage offset trimming         */
  __IOM uint32_t  ULPR;                              /*!< (@ 0x0000000C) ULPR mode comparator offset trimming                  */
} NRF_VREG1V0_TRIM_Type;                             /*!< Size = 16 (0x010)                                                    */

/* VREG1V0_TRIM_IREF: Local current reference trimming */
  #define VREG1V0_TRIM_IREF_ResetValue (0x00000008UL) /*!< Reset value of IREF register.                                       */

/* VAL @Bits 0..6 : Current reference trimming value */
  #define VREG1V0_TRIM_IREF_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define VREG1V0_TRIM_IREF_VAL_Msk (0x7FUL << VREG1V0_TRIM_IREF_VAL_Pos) /*!< Bit mask of VAL field.                          */
  #define VREG1V0_TRIM_IREF_VAL_Min (0xFFFFFFFFUL)   /*!< Min value of VAL field.                                              */
  #define VREG1V0_TRIM_IREF_VAL_Max (0xFFFFFFFFUL)   /*!< Max size of VAL field.                                               */


/* VREG1V0_TRIM_HIGHPOWER: High power mode output voltage offset trimming */
  #define VREG1V0_TRIM_HIGHPOWER_ResetValue (0x00000000UL) /*!< Reset value of HIGHPOWER register.                             */

/* VAL @Bits 0..3 : Voltage offset trimming value */
  #define VREG1V0_TRIM_HIGHPOWER_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define VREG1V0_TRIM_HIGHPOWER_VAL_Msk (0xFUL << VREG1V0_TRIM_HIGHPOWER_VAL_Pos) /*!< Bit mask of VAL field.                 */
  #define VREG1V0_TRIM_HIGHPOWER_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                           */
  #define VREG1V0_TRIM_HIGHPOWER_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                            */


/* VREG1V0_TRIM_LOWPOWER: Low power mode output voltage offset trimming */
  #define VREG1V0_TRIM_LOWPOWER_ResetValue (0x00000000UL) /*!< Reset value of LOWPOWER register.                               */

/* VAL @Bits 0..3 : Voltage offset trimming value. */
  #define VREG1V0_TRIM_LOWPOWER_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define VREG1V0_TRIM_LOWPOWER_VAL_Msk (0xFUL << VREG1V0_TRIM_LOWPOWER_VAL_Pos) /*!< Bit mask of VAL field.                   */
  #define VREG1V0_TRIM_LOWPOWER_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                            */
  #define VREG1V0_TRIM_LOWPOWER_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                             */


/* VREG1V0_TRIM_ULPR: ULPR mode comparator offset trimming */
  #define VREG1V0_TRIM_ULPR_ResetValue (0x00000000UL) /*!< Reset value of ULPR register.                                       */

/* VAL @Bits 0..2 : Comparator offset trimming value. */
  #define VREG1V0_TRIM_ULPR_VAL_Pos (0UL)            /*!< Position of VAL field.                                               */
  #define VREG1V0_TRIM_ULPR_VAL_Msk (0x7UL << VREG1V0_TRIM_ULPR_VAL_Pos) /*!< Bit mask of VAL field.                           */
  #define VREG1V0_TRIM_ULPR_VAL_Min (0xFFFFFFFFUL)   /*!< Min value of VAL field.                                              */
  #define VREG1V0_TRIM_ULPR_VAL_Max (0xFFFFFFFFUL)   /*!< Max size of VAL field.                                               */



/* ================================================= Struct VREG1V0_OVERRIDE ================================================= */
/**
  * @brief OVERRIDE [VREG1V0_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  MODELP;                            /*!< (@ 0x00000008) Override the MODE LP signal to the analog module      */
  __IOM uint32_t  MODEULPR;                          /*!< (@ 0x0000000C) Override the MODE ULPR signal to the analog module    */
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000010) Override the dynamic CFG signal to the analog module  */
  __IOM uint32_t  VOLTHP;                            /*!< (@ 0x00000014) Override the VOLT HP signal to the analog module      */
  __IOM uint32_t  VOLTLP;                            /*!< (@ 0x00000018) Override the VOLT LP signal to the analog module      */
  __IOM uint32_t  READY;                             /*!< (@ 0x0000001C) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x00000020) Override the SETTLED signal from the analog module    */
  __IOM uint32_t  IOUTCMP;                           /*!< (@ 0x00000024) Override the IOUTCMP signal from the analog module    */
} NRF_VREG1V0_OVERRIDE_Type;                         /*!< Size = 40 (0x028)                                                    */

/* VREG1V0_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define VREG1V0_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                 */

/* VAL @Bit 0 : Override value for the signal */
  #define VREG1V0_OVERRIDE_PWRUP_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define VREG1V0_OVERRIDE_PWRUP_VAL_Msk (0x1UL << VREG1V0_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define VREG1V0_OVERRIDE_PWRUP_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VREG1V0_OVERRIDE_PWRUP_EN_Msk (0x1UL << VREG1V0_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VREG1V0_OVERRIDE_PWRUP_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_PWRUP_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_PWRUP_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define VREG1V0_OVERRIDE_PWRUP_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */


/* VREG1V0_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define VREG1V0_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                               */

/* VAL @Bit 0 : Override value for the signal */
  #define VREG1V0_OVERRIDE_RETAIN_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREG1V0_OVERRIDE_RETAIN_VAL_Msk (0x1UL << VREG1V0_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.               */

/* EN @Bit 31 : Enable the override */
  #define VREG1V0_OVERRIDE_RETAIN_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREG1V0_OVERRIDE_RETAIN_EN_Msk (0x1UL << VREG1V0_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREG1V0_OVERRIDE_RETAIN_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_RETAIN_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREG1V0_OVERRIDE_RETAIN_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define VREG1V0_OVERRIDE_RETAIN_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */


