adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EVENTS_SETTLED @Bit 0 : Settled flag for MODE handshake */
  #define VREG1V0_EVENTS_SETTLED_EVENTS_SETTLED_Pos (0UL) /*!< Position of EVENTS_SETTLED field.                               */
  #define VREG1V0_EVENTS_SETTLED_EVENTS_SETTLED_Msk (0x1UL << VREG1V0_EVENTS_SETTLED_EVENTS_SETTLED_Pos) /*!< Bit mask of
                                                                            EVENTS_SETTLED field.*/                               
  #define VREG1V0_EVENTS_SETTLED_EVENTS_SETTLED_Min (0x0UL) /*!< Min enumerator value of EVENTS_SETTLED field.                 */
  #define VREG1V0_EVENTS_SETTLED_EVENTS_SETTLED_Max (0x1UL) /*!< Max enumerator value of EVENTS_SETTLED field.                 */
  #define VREG1V0_EVENTS_SETTLED_EVENTS_SETTLED_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define VREG1V0_EVENTS_SETTLED_EVENTS_SETTLED_Generated (0x1UL) /*!< Event generated                                         */


/* VREG1V0_EVENTS_IOUTCMP: Analog current comparator */
  #define VREG1V0_EVENTS_IOUTCMP_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_IOUTCMP register.                        */

/* EVENTS_IOUTCMP @Bit 0 : Analog current comparator */
  #define VREG1V0_EVENTS_IOUTCMP_EVENTS_IOUTCMP_Pos (0UL) /*!< Position of EVENTS_IOUTCMP field.                               */
  #define VREG1V0_EVENTS_IOUTCMP_EVENTS_IOUTCMP_Msk (0x1UL << VREG1V0_EVENTS_IOUTCMP_EVENTS_IOUTCMP_Pos) /*!< Bit mask of
                                                                            EVENTS_IOUTCMP field.*/                               
  #define VREG1V0_EVENTS_IOUTCMP_EVENTS_IOUTCMP_Min (0x0UL) /*!< Min enumerator value of EVENTS_IOUTCMP field.                 */
  #define VREG1V0_EVENTS_IOUTCMP_EVENTS_IOUTCMP_Max (0x1UL) /*!< Max enumerator value of EVENTS_IOUTCMP field.                 */
  #define VREG1V0_EVENTS_IOUTCMP_EVENTS_IOUTCMP_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define VREG1V0_EVENTS_IOUTCMP_EVENTS_IOUTCMP_Generated (0x1UL) /*!< Event generated                                         */


/* VREG1V0_EVENTS_LP2HP: Current consumption above threshold */
  #define VREG1V0_EVENTS_LP2HP_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_LP2HP register.                            */

/* EVENTS_LP2HP @Bit 0 : Current consumption above threshold */
  #define VREG1V0_EVENTS_LP2HP_EVENTS_LP2HP_Pos (0UL) /*!< Position of EVENTS_LP2HP field.                                     */
  #define VREG1V0_EVENTS_LP2HP_EVENTS_LP2HP_Msk (0x1UL << VREG1V0_EVENTS_LP2HP_EVENTS_LP2HP_Pos) /*!< Bit mask of EVENTS_LP2HP
                                                                            field.*/                                              
  #define VREG1V0_EVENTS_LP2HP_EVENTS_LP2HP_Min (0x0UL) /*!< Min enumerator value of EVENTS_LP2HP field.                       */
  #define VREG1V0_EVENTS_LP2HP_EVENTS_LP2HP_Max (0x1UL) /*!< Max enumerator value of EVENTS_LP2HP field.                       */
  #define VREG1V0_EVENTS_LP2HP_EVENTS_LP2HP_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define VREG1V0_EVENTS_LP2HP_EVENTS_LP2HP_Generated (0x1UL) /*!< Event generated                                             */


/* VREG1V0_EVENTS_HP2LP: Current consumption below threshold */
  #define VREG1V0_EVENTS_HP2LP_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_HP2LP register.                            */

/* EVENTS_HP2LP @Bit 0 : Current consumption below threshold */
  #define VREG1V0_EVENTS_HP2LP_EVENTS_HP2LP_Pos (0UL) /*!< Position of EVENTS_HP2LP field.                                     */
  #define VREG1V0_EVENTS_HP2LP_EVENTS_HP2LP_Msk (0x1UL << VREG1V0_EVENTS_HP2LP_EVENTS_HP2LP_Pos) /*!< Bit mask of EVENTS_HP2LP
                                                                            field.*/                                              
  #define VREG1V0_EVENTS_HP2LP_EVENTS_HP2LP_Min (0x0UL) /*!< Min enumerator value of EVENTS_HP2LP field.                       */
  #define VREG1V0_EVENTS_HP2LP_EVENTS_HP2LP_Max (0x1UL) /*!< Max enumerator value of EVENTS_HP2LP field.                       */
  #define VREG1V0_EVENTS_HP2LP_EVENTS_HP2LP_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define VREG1V0_EVENTS_HP2LP_EVENTS_HP2LP_Generated (0x1UL) /*!< Event generated                                             */


/* VREG1V0_INTEN: Enable or disable interrupt */
  #define VREG1V0_INTEN_ResetValue (0x00000000UL)    /*!< Reset value of INTEN register.                                       */

/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define VREG1V0_INTEN_READY_Pos (0UL)              /*!< Position of READY field.                                             */
  #define VREG1V0_INTEN_READY_Msk (0x1UL << VREG1V0_INTEN_READY_Pos) /*!< Bit mask of READY field.                             */
  #define VREG1V0_INTEN_READY_Min (0x0UL)            /*!< Min enumerator value of READY field.                                 */
  #define VREG1V0_INTEN_READY_Max (0x1UL)            /*!< Max enumerator value of READY field.                                 */
  #define VREG1V0_INTEN_READY_Disabled (0x0UL)       /*!< Disable                                                              */
  #define VREG1V0_INTEN_READY_Enabled (0x1UL)        /*!< Enable                                                               */

/* SETTLED @Bit 1 : Enable or disable interrupt for event SETTLED */
  #define VREG1V0_INTEN_SETTLED_Pos (1UL)            /*!< Position of SETTLED field.                                           */
  #define VREG1V0_INTEN_SETTLED_Msk (0x1UL << VREG1V0_INTEN_SETTLED_Pos) /*!< Bit mask of SETTLED field.                       */
  #define VREG1V0_INTEN_SETTLED_Min (0x0UL)          /*!< Min enumerator value of SETTLED field.                               */
  #define VREG1V0_INTEN_SETTLED_Max (0x1UL)          /*!< Max enumerator value of SETTLED field.                               */
  #define VREG1V0_INTEN_SETTLED_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VREG1V0_INTEN_SETTLED_Enabled (0x1UL)      /*!< Enable                                                               */

/* IOUTCMP @Bit 2 : Enable or disable interrupt for event IOUTCMP */
  #define VREG1V0_INTEN_IOUTCMP_Pos (2UL)            /*!< Position of IOUTCMP field.                                           */
  #define VREG1V0_INTEN_IOUTCMP_Msk (0x1UL << VREG1V0_INTEN_IOUTCMP_Pos) /*!< Bit mask of IOUTCMP field.                       */
  #define VREG1V0_INTEN_IOUTCMP_Min (0x0UL)          /*!< Min enumerator value of IOUTCMP field.                               */
  #define VREG1V0_INTEN_IOUTCMP_Max (0x1UL)          /*!< Max enumerator value of IOUTCMP field.                               */
  #define VREG1V0_INTEN_IOUTCMP_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VREG1V0_INTEN_IOUTCMP_Enabled (0x1UL)      /*!< Enable                                                               */

/* LP2HP @Bit 3 : Enable or disable interrupt for event LP2HP */
  #define VREG1V0_INTEN_LP2HP_Pos (3UL)              /*!< Position of LP2HP field.                                             */
  #define VREG1V0_INTEN_LP2HP_Msk (0x1UL << VREG1V0_INTEN_LP2HP_Pos) /*!< Bit mask of LP2HP field.                             */
  #define VREG1V0_INTEN_LP2HP_Min (0x0UL)            /*!< Min enumerator value of LP2HP field.                                 */
  #define VREG1V0_INTEN_LP2HP_Max (0x1UL)            /*!< Max enumerator value of LP2HP field.                                 */
  #define VREG1V0_INTEN_LP2HP_Disabled (0x0UL)       /*!< Disable                                                              */
  #define VREG1V0_INTEN_LP2HP_Enabled (0x1UL)        /*!< Enable                                                               */

