adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* HP2LP @Bit 4 : Enable or disable interrupt for event HP2LP */
  #define VREG1V0_INTEN_HP2LP_Pos (4UL)              /*!< Position of HP2LP field.                                             */
  #define VREG1V0_INTEN_HP2LP_Msk (0x1UL << VREG1V0_INTEN_HP2LP_Pos) /*!< Bit mask of HP2LP field.                             */
  #define VREG1V0_INTEN_HP2LP_Min (0x0UL)            /*!< Min enumerator value of HP2LP field.                                 */
  #define VREG1V0_INTEN_HP2LP_Max (0x1UL)            /*!< Max enumerator value of HP2LP field.                                 */
  #define VREG1V0_INTEN_HP2LP_Disabled (0x0UL)       /*!< Disable                                                              */
  #define VREG1V0_INTEN_HP2LP_Enabled (0x1UL)        /*!< Enable                                                               */


/* VREG1V0_INTENSET: Enable interrupt */
  #define VREG1V0_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                    */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define VREG1V0_INTENSET_READY_Pos (0UL)           /*!< Position of READY field.                                             */
  #define VREG1V0_INTENSET_READY_Msk (0x1UL << VREG1V0_INTENSET_READY_Pos) /*!< Bit mask of READY field.                       */
  #define VREG1V0_INTENSET_READY_Min (0x0UL)         /*!< Min enumerator value of READY field.                                 */
  #define VREG1V0_INTENSET_READY_Max (0x1UL)         /*!< Max enumerator value of READY field.                                 */
  #define VREG1V0_INTENSET_READY_Set (0x1UL)         /*!< Enable                                                               */
  #define VREG1V0_INTENSET_READY_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define VREG1V0_INTENSET_READY_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* SETTLED @Bit 1 : Write '1' to enable interrupt for event SETTLED */
  #define VREG1V0_INTENSET_SETTLED_Pos (1UL)         /*!< Position of SETTLED field.                                           */
  #define VREG1V0_INTENSET_SETTLED_Msk (0x1UL << VREG1V0_INTENSET_SETTLED_Pos) /*!< Bit mask of SETTLED field.                 */
  #define VREG1V0_INTENSET_SETTLED_Min (0x0UL)       /*!< Min enumerator value of SETTLED field.                               */
  #define VREG1V0_INTENSET_SETTLED_Max (0x1UL)       /*!< Max enumerator value of SETTLED field.                               */
  #define VREG1V0_INTENSET_SETTLED_Set (0x1UL)       /*!< Enable                                                               */
  #define VREG1V0_INTENSET_SETTLED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VREG1V0_INTENSET_SETTLED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* IOUTCMP @Bit 2 : Write '1' to enable interrupt for event IOUTCMP */
  #define VREG1V0_INTENSET_IOUTCMP_Pos (2UL)         /*!< Position of IOUTCMP field.                                           */
  #define VREG1V0_INTENSET_IOUTCMP_Msk (0x1UL << VREG1V0_INTENSET_IOUTCMP_Pos) /*!< Bit mask of IOUTCMP field.                 */
  #define VREG1V0_INTENSET_IOUTCMP_Min (0x0UL)       /*!< Min enumerator value of IOUTCMP field.                               */
  #define VREG1V0_INTENSET_IOUTCMP_Max (0x1UL)       /*!< Max enumerator value of IOUTCMP field.                               */
  #define VREG1V0_INTENSET_IOUTCMP_Set (0x1UL)       /*!< Enable                                                               */
  #define VREG1V0_INTENSET_IOUTCMP_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VREG1V0_INTENSET_IOUTCMP_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* LP2HP @Bit 3 : Write '1' to enable interrupt for event LP2HP */
  #define VREG1V0_INTENSET_LP2HP_Pos (3UL)           /*!< Position of LP2HP field.                                             */
  #define VREG1V0_INTENSET_LP2HP_Msk (0x1UL << VREG1V0_INTENSET_LP2HP_Pos) /*!< Bit mask of LP2HP field.                       */
  #define VREG1V0_INTENSET_LP2HP_Min (0x0UL)         /*!< Min enumerator value of LP2HP field.                                 */
  #define VREG1V0_INTENSET_LP2HP_Max (0x1UL)         /*!< Max enumerator value of LP2HP field.                                 */
  #define VREG1V0_INTENSET_LP2HP_Set (0x1UL)         /*!< Enable                                                               */
  #define VREG1V0_INTENSET_LP2HP_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define VREG1V0_INTENSET_LP2HP_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* HP2LP @Bit 4 : Write '1' to enable interrupt for event HP2LP */
  #define VREG1V0_INTENSET_HP2LP_Pos (4UL)           /*!< Position of HP2LP field.                                             */
  #define VREG1V0_INTENSET_HP2LP_Msk (0x1UL << VREG1V0_INTENSET_HP2LP_Pos) /*!< Bit mask of HP2LP field.                       */
  #define VREG1V0_INTENSET_HP2LP_Min (0x0UL)         /*!< Min enumerator value of HP2LP field.                                 */
  #define VREG1V0_INTENSET_HP2LP_Max (0x1UL)         /*!< Max enumerator value of HP2LP field.                                 */
  #define VREG1V0_INTENSET_HP2LP_Set (0x1UL)         /*!< Enable                                                               */
  #define VREG1V0_INTENSET_HP2LP_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define VREG1V0_INTENSET_HP2LP_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* VREG1V0_INTENCLR: Disable interrupt */
  #define VREG1V0_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                    */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define VREG1V0_INTENCLR_READY_Pos (0UL)           /*!< Position of READY field.                                             */
  #define VREG1V0_INTENCLR_READY_Msk (0x1UL << VREG1V0_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                       */
  #define VREG1V0_INTENCLR_READY_Min (0x0UL)         /*!< Min enumerator value of READY field.                                 */
  #define VREG1V0_INTENCLR_READY_Max (0x1UL)         /*!< Max enumerator value of READY field.                                 */
  #define VREG1V0_INTENCLR_READY_Clear (0x1UL)       /*!< Disable                                                              */
  #define VREG1V0_INTENCLR_READY_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define VREG1V0_INTENCLR_READY_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

