adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* HP2LP @Bit 4 : Read pending status of interrupt for event HP2LP */
  #define VREG1V0_INTPEND_HP2LP_Pos (4UL)            /*!< Position of HP2LP field.                                             */
  #define VREG1V0_INTPEND_HP2LP_Msk (0x1UL << VREG1V0_INTPEND_HP2LP_Pos) /*!< Bit mask of HP2LP field.                         */
  #define VREG1V0_INTPEND_HP2LP_Min (0x0UL)          /*!< Min enumerator value of HP2LP field.                                 */
  #define VREG1V0_INTPEND_HP2LP_Max (0x1UL)          /*!< Max enumerator value of HP2LP field.                                 */
  #define VREG1V0_INTPEND_HP2LP_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define VREG1V0_INTPEND_HP2LP_Pending (0x1UL)      /*!< Read: Pending                                                        */


/* VREG1V0_STATUS: Voltage regulator status */
  #define VREG1V0_STATUS_ResetValue (0x00000000UL)   /*!< Reset value of STATUS register.                                      */

/* MODE @Bits 0..1 : Current voltage regulator mode */
  #define VREG1V0_STATUS_MODE_Pos (0UL)              /*!< Position of MODE field.                                              */
  #define VREG1V0_STATUS_MODE_Msk (0x3UL << VREG1V0_STATUS_MODE_Pos) /*!< Bit mask of MODE field.                              */
  #define VREG1V0_STATUS_MODE_Min (0x0UL)            /*!< Min enumerator value of MODE field.                                  */
  #define VREG1V0_STATUS_MODE_Max (0x2UL)            /*!< Max enumerator value of MODE field.                                  */
  #define VREG1V0_STATUS_MODE_HighPower (0x0UL)      /*!< High power mode                                                      */
  #define VREG1V0_STATUS_MODE_LowPower (0x1UL)       /*!< Low power mode                                                       */
  #define VREG1V0_STATUS_MODE_UltraLowPowerRefresh (0x2UL) /*!< Ultra-low power refresh mode                                   */


/* VREG1V0_STATUSANA: Status of analog module output signals */
  #define VREG1V0_STATUSANA_ResetValue (0x00000000UL) /*!< Reset value of STATUSANA register.                                  */

/* READY @Bit 0 : Current value of the READY signal from the analog module */
  #define VREG1V0_STATUSANA_READY_Pos (0UL)          /*!< Position of READY field.                                             */
  #define VREG1V0_STATUSANA_READY_Msk (0x1UL << VREG1V0_STATUSANA_READY_Pos) /*!< Bit mask of READY field.                     */

/* SETTLED @Bit 1 : Current value of the SETTLED signal from the analog module */
  #define VREG1V0_STATUSANA_SETTLED_Pos (1UL)        /*!< Position of SETTLED field.                                           */
  #define VREG1V0_STATUSANA_SETTLED_Msk (0x1UL << VREG1V0_STATUSANA_SETTLED_Pos) /*!< Bit mask of SETTLED field.               */

/* IOUTCMP @Bit 2 : Current value of the IOUTCMP signal from the analog module */
  #define VREG1V0_STATUSANA_IOUTCMP_Pos (2UL)        /*!< Position of IOUTCMP field.                                           */
  #define VREG1V0_STATUSANA_IOUTCMP_Msk (0x1UL << VREG1V0_STATUSANA_IOUTCMP_Pos) /*!< Bit mask of IOUTCMP field.               */


/* VREG1V0_MIRROR: Enable LOCK for mirrored registers */
  #define VREG1V0_MIRROR_ResetValue (0x00000001UL)   /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define VREG1V0_MIRROR_LOCK_Pos (0UL)              /*!< Position of LOCK field.                                              */
  #define VREG1V0_MIRROR_LOCK_Msk (0x1UL << VREG1V0_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                              */
  #define VREG1V0_MIRROR_LOCK_Min (0x0UL)            /*!< Min enumerator value of LOCK field.                                  */
  #define VREG1V0_MIRROR_LOCK_Max (0x1UL)            /*!< Max enumerator value of LOCK field.                                  */
  #define VREG1V0_MIRROR_LOCK_Disabled (0x0UL)       /*!< Lock disabled                                                        */
  #define VREG1V0_MIRROR_LOCK_Enabled (0x1UL)        /*!< Lock enabled                                                         */


/* VREG1V0_VOUTHPNOMINAL: Nominal high power mode output voltage programming */
  #define VREG1V0_VOUTHPNOMINAL_ResetValue (0x00000021UL) /*!< Reset value of VOUTHPNOMINAL register.                          */

/* VAL @Bits 0..5 : Output voltage value */
  #define VREG1V0_VOUTHPNOMINAL_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define VREG1V0_VOUTHPNOMINAL_VAL_Msk (0x3FUL << VREG1V0_VOUTHPNOMINAL_VAL_Pos) /*!< Bit mask of VAL field.                  */
  #define VREG1V0_VOUTHPNOMINAL_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                            */
  #define VREG1V0_VOUTHPNOMINAL_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                             */


/* VREG1V0_VOUTHPRADIO: Radio high power mode output voltage programming */
  #define VREG1V0_VOUTHPRADIO_ResetValue (0x0000002BUL) /*!< Reset value of VOUTHPRADIO register.                              */

/* VAL @Bits 0..5 : Output voltage value */
  #define VREG1V0_VOUTHPRADIO_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define VREG1V0_VOUTHPRADIO_VAL_Msk (0x3FUL << VREG1V0_VOUTHPRADIO_VAL_Pos) /*!< Bit mask of VAL field.                      */
  #define VREG1V0_VOUTHPRADIO_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                              */
  #define VREG1V0_VOUTHPRADIO_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                               */


/* VREG1V0_VOUTHPHELPER: High power helper mode output voltage programming */
  #define VREG1V0_VOUTHPHELPER_ResetValue (0x00000027UL) /*!< Reset value of VOUTHPHELPER register.                            */

/* VAL @Bits 0..5 : Output voltage value */
  #define VREG1V0_VOUTHPHELPER_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define VREG1V0_VOUTHPHELPER_VAL_Msk (0x3FUL << VREG1V0_VOUTHPHELPER_VAL_Pos) /*!< Bit mask of VAL field.                    */
  #define VREG1V0_VOUTHPHELPER_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                             */
  #define VREG1V0_VOUTHPHELPER_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                              */


/* VREG1V0_VOUTLPNOMINAL: Nominal low power mode output voltage programming */
  #define VREG1V0_VOUTLPNOMINAL_ResetValue (0x00000018UL) /*!< Reset value of VOUTLPNOMINAL register.                          */

/* VAL @Bits 0..5 : Output voltage value */
  #define VREG1V0_VOUTLPNOMINAL_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define VREG1V0_VOUTLPNOMINAL_VAL_Msk (0x3FUL << VREG1V0_VOUTLPNOMINAL_VAL_Pos) /*!< Bit mask of VAL field.                  */
  #define VREG1V0_VOUTLPNOMINAL_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                            */
  #define VREG1V0_VOUTLPNOMINAL_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                             */


/* VREG1V0_VOUTLPRADIO: Radio low power mode output voltage programming */
  #define VREG1V0_VOUTLPRADIO_ResetValue (0x00000027UL) /*!< Reset value of VOUTLPRADIO register.                              */

/* VAL @Bits 0..5 : Output voltage value */
  #define VREG1V0_VOUTLPRADIO_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define VREG1V0_VOUTLPRADIO_VAL_Msk (0x3FUL << VREG1V0_VOUTLPRADIO_VAL_Pos) /*!< Bit mask of VAL field.                      */
  #define VREG1V0_VOUTLPRADIO_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                              */
  #define VREG1V0_VOUTLPRADIO_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                               */


/* VREG1V0_VOUTULV: ULV output voltage programming */
  #define VREG1V0_VOUTULV_ResetValue (0x00000008UL)  /*!< Reset value of VOUTULV register.                                     */

/* VAL @Bits 0..5 : Output voltage value */
  #define VREG1V0_VOUTULV_VAL_Pos (0UL)              /*!< Position of VAL field.                                               */
  #define VREG1V0_VOUTULV_VAL_Msk (0x3FUL << VREG1V0_VOUTULV_VAL_Pos) /*!< Bit mask of VAL field.                              */
  #define VREG1V0_VOUTULV_VAL_Min (0xFFFFFFFFUL)     /*!< Min value of VAL field.                                              */
  #define VREG1V0_VOUTULV_VAL_Max (0xFFFFFFFFUL)     /*!< Max size of VAL field.                                               */


/* VREG1V0_MODE: Voltage regulator mode */
  #define VREG1V0_MODE_ResetValue (0x00000000UL)     /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..1 : Mode */
  #define VREG1V0_MODE_MODE_Pos (0UL)                /*!< Position of MODE field.                                              */
  #define VREG1V0_MODE_MODE_Msk (0x3UL << VREG1V0_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                  */
  #define VREG1V0_MODE_MODE_Min (0x0UL)              /*!< Min enumerator value of MODE field.                                  */
  #define VREG1V0_MODE_MODE_Max (0x3UL)              /*!< Max enumerator value of MODE field.                                  */
  #define VREG1V0_MODE_MODE_Auto (0x0UL)             /*!< Automatically handled by the peripheral                              */
  #define VREG1V0_MODE_MODE_HighPower (0x1UL)        /*!< High power mode                                                      */
  #define VREG1V0_MODE_MODE_LowPower (0x2UL)         /*!< Low power mode                                                       */
  #define VREG1V0_MODE_MODE_UltraLowPowerRefresh (0x3UL) /*!< Ultra-low power refresh mode                                     */


/* VREG1V0_ITHRESHOLD: Current threshold for mode transistion */
  #define VREG1V0_ITHRESHOLD_ResetValue (0x00000005UL) /*!< Reset value of ITHRESHOLD register.                                */

