adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VAL @Bits 0..3 : Current consumption */
  #define VREG1V0_ITHRESHOLD_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define VREG1V0_ITHRESHOLD_VAL_Msk (0xFUL << VREG1V0_ITHRESHOLD_VAL_Pos) /*!< Bit mask of VAL field.                         */
  #define VREG1V0_ITHRESHOLD_VAL_Min (0xFFFFFFFFUL)  /*!< Min value of VAL field.                                              */
  #define VREG1V0_ITHRESHOLD_VAL_Max (0xFFFFFFFFUL)  /*!< Max size of VAL field.                                               */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         VREGAO0V8                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct VREGAO0V8_CONFIG ================================================= */
/**
  * @brief CONFIG [VREGAO0V8_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFGSTATIC;                         /*!< (@ 0x00000000) VREGAO0V8 static CFG configuration                    */
  __IOM uint32_t  CFGDYNAMIC;                        /*!< (@ 0x00000004) VREGAO0V8 dynamic CFG configuration                   */
} NRF_VREGAO0V8_CONFIG_Type;                         /*!< Size = 8 (0x008)                                                     */

/* VREGAO0V8_CONFIG_CFGSTATIC: VREGAO0V8 static CFG configuration */
  #define VREGAO0V8_CONFIG_CFGSTATIC_ResetValue (0x00000000UL) /*!< Reset value of CFGSTATIC register.                         */

/* DOUBLEBIAS @Bit 0 : Configuration for double bias */
  #define VREGAO0V8_CONFIG_CFGSTATIC_DOUBLEBIAS_Pos (0UL) /*!< Position of DOUBLEBIAS field.                                   */
  #define VREGAO0V8_CONFIG_CFGSTATIC_DOUBLEBIAS_Msk (0x1UL << VREGAO0V8_CONFIG_CFGSTATIC_DOUBLEBIAS_Pos) /*!< Bit mask of
                                                                            DOUBLEBIAS field.*/                                   
  #define VREGAO0V8_CONFIG_CFGSTATIC_DOUBLEBIAS_Min (0x0UL) /*!< Min enumerator value of DOUBLEBIAS field.                     */
  #define VREGAO0V8_CONFIG_CFGSTATIC_DOUBLEBIAS_Max (0x1UL) /*!< Max enumerator value of DOUBLEBIAS field.                     */
  #define VREGAO0V8_CONFIG_CFGSTATIC_DOUBLEBIAS_Disabled (0x0UL) /*!< Configuration disabled                                   */
  #define VREGAO0V8_CONFIG_CFGSTATIC_DOUBLEBIAS_Enabled (0x1UL) /*!< Configuration enabled                                     */

/* LPICMP @Bit 1 : Configuration for LP ICMP */
  #define VREGAO0V8_CONFIG_CFGSTATIC_LPICMP_Pos (1UL) /*!< Position of LPICMP field.                                           */
  #define VREGAO0V8_CONFIG_CFGSTATIC_LPICMP_Msk (0x1UL << VREGAO0V8_CONFIG_CFGSTATIC_LPICMP_Pos) /*!< Bit mask of LPICMP field.*/
  #define VREGAO0V8_CONFIG_CFGSTATIC_LPICMP_Min (0x0UL) /*!< Min enumerator value of LPICMP field.                             */
  #define VREGAO0V8_CONFIG_CFGSTATIC_LPICMP_Max (0x1UL) /*!< Max enumerator value of LPICMP field.                             */
  #define VREGAO0V8_CONFIG_CFGSTATIC_LPICMP_Disabled (0x0UL) /*!< Configuration disabled                                       */
  #define VREGAO0V8_CONFIG_CFGSTATIC_LPICMP_Enabled (0x1UL) /*!< Configuration enabled                                         */

/* LONGREFRESH @Bit 2 : Configuration for long refresh timer */
  #define VREGAO0V8_CONFIG_CFGSTATIC_LONGREFRESH_Pos (2UL) /*!< Position of LONGREFRESH field.                                 */
  #define VREGAO0V8_CONFIG_CFGSTATIC_LONGREFRESH_Msk (0x1UL << VREGAO0V8_CONFIG_CFGSTATIC_LONGREFRESH_Pos) /*!< Bit mask of
                                                                            LONGREFRESH field.*/                                  
  #define VREGAO0V8_CONFIG_CFGSTATIC_LONGREFRESH_Min (0x0UL) /*!< Min enumerator value of LONGREFRESH field.                   */
  #define VREGAO0V8_CONFIG_CFGSTATIC_LONGREFRESH_Max (0x1UL) /*!< Max enumerator value of LONGREFRESH field.                   */
  #define VREGAO0V8_CONFIG_CFGSTATIC_LONGREFRESH_Disabled (0x0UL) /*!< Configuration disabled                                  */
  #define VREGAO0V8_CONFIG_CFGSTATIC_LONGREFRESH_Enabled (0x1UL) /*!< Configuration enabled                                    */

/* DISABLEBPDET @Bit 3 : Configuration for disabling the BPDET */
  #define VREGAO0V8_CONFIG_CFGSTATIC_DISABLEBPDET_Pos (3UL) /*!< Position of DISABLEBPDET field.                               */
  #define VREGAO0V8_CONFIG_CFGSTATIC_DISABLEBPDET_Msk (0x1UL << VREGAO0V8_CONFIG_CFGSTATIC_DISABLEBPDET_Pos) /*!< Bit mask of
                                                                            DISABLEBPDET field.*/                                 
  #define VREGAO0V8_CONFIG_CFGSTATIC_DISABLEBPDET_Min (0x0UL) /*!< Min enumerator value of DISABLEBPDET field.                 */
  #define VREGAO0V8_CONFIG_CFGSTATIC_DISABLEBPDET_Max (0x1UL) /*!< Max enumerator value of DISABLEBPDET field.                 */
  #define VREGAO0V8_CONFIG_CFGSTATIC_DISABLEBPDET_Disabled (0x0UL) /*!< Configuration disabled                                 */
  #define VREGAO0V8_CONFIG_CFGSTATIC_DISABLEBPDET_Enabled (0x1UL) /*!< Configuration enabled                                   */

/* TRIMIBPP0 @Bit 4 : LSB of IBPP trim */
  #define VREGAO0V8_CONFIG_CFGSTATIC_TRIMIBPP0_Pos (4UL) /*!< Position of TRIMIBPP0 field.                                     */
  #define VREGAO0V8_CONFIG_CFGSTATIC_TRIMIBPP0_Msk (0x1UL << VREGAO0V8_CONFIG_CFGSTATIC_TRIMIBPP0_Pos) /*!< Bit mask of
                                                                            TRIMIBPP0 field.*/                                    


/* VREGAO0V8_CONFIG_CFGDYNAMIC: VREGAO0V8 dynamic CFG configuration */
  #define VREGAO0V8_CONFIG_CFGDYNAMIC_ResetValue (0x00000001UL) /*!< Reset value of CFGDYNAMIC register.                       */

