adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* ILIMLOW @Bit 0 : Current limit low configuration for the voltage regulator */
  #define VREGAO0V8_CONFIG_CFGDYNAMIC_ILIMLOW_Pos (0UL) /*!< Position of ILIMLOW field.                                        */
  #define VREGAO0V8_CONFIG_CFGDYNAMIC_ILIMLOW_Msk (0x1UL << VREGAO0V8_CONFIG_CFGDYNAMIC_ILIMLOW_Pos) /*!< Bit mask of ILIMLOW
                                                                            field.*/                                              
  #define VREGAO0V8_CONFIG_CFGDYNAMIC_ILIMLOW_Min (0x0UL) /*!< Min enumerator value of ILIMLOW field.                          */
  #define VREGAO0V8_CONFIG_CFGDYNAMIC_ILIMLOW_Max (0x1UL) /*!< Max enumerator value of ILIMLOW field.                          */
  #define VREGAO0V8_CONFIG_CFGDYNAMIC_ILIMLOW_Disabled (0x0UL) /*!< Configuration disabled                                     */
  #define VREGAO0V8_CONFIG_CFGDYNAMIC_ILIMLOW_Enabled (0x1UL) /*!< Configuration enabled                                       */



/* ================================================== Struct VREGAO0V8_TRIM ================================================== */
/**
  * @brief TRIM [VREGAO0V8_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  IREF;                              /*!< (@ 0x00000000) Local current reference trimming                      */
  __IOM uint32_t  HIGHPOWER;                         /*!< (@ 0x00000004) High power mode output voltage offset trimming        */
  __IOM uint32_t  LOWPOWER;                          /*!< (@ 0x00000008) Low power mode output voltage offset trimming         */
  __IOM uint32_t  ULTRALOWPOWER;                     /*!< (@ 0x0000000C) Ultra low power mode ripple trimming                  */
  __IOM uint32_t  BPDET;                             /*!< (@ 0x00000010) BP detector offset trimming                           */
} NRF_VREGAO0V8_TRIM_Type;                           /*!< Size = 20 (0x014)                                                    */

/* VREGAO0V8_TRIM_IREF: Local current reference trimming */
  #define VREGAO0V8_TRIM_IREF_ResetValue (0x00000008UL) /*!< Reset value of IREF register.                                     */

/* VAL @Bits 0..6 : Current reference trimming value */
  #define VREGAO0V8_TRIM_IREF_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define VREGAO0V8_TRIM_IREF_VAL_Msk (0x7FUL << VREGAO0V8_TRIM_IREF_VAL_Pos) /*!< Bit mask of VAL field.                      */
  #define VREGAO0V8_TRIM_IREF_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                              */
  #define VREGAO0V8_TRIM_IREF_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                               */


/* VREGAO0V8_TRIM_HIGHPOWER: High power mode output voltage offset trimming */
  #define VREGAO0V8_TRIM_HIGHPOWER_ResetValue (0x00000000UL) /*!< Reset value of HIGHPOWER register.                           */

/* VAL @Bits 0..3 : Voltage offset trimming value */
  #define VREGAO0V8_TRIM_HIGHPOWER_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VREGAO0V8_TRIM_HIGHPOWER_VAL_Msk (0xFUL << VREGAO0V8_TRIM_HIGHPOWER_VAL_Pos) /*!< Bit mask of VAL field.             */
  #define VREGAO0V8_TRIM_HIGHPOWER_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                         */
  #define VREGAO0V8_TRIM_HIGHPOWER_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                          */


/* VREGAO0V8_TRIM_LOWPOWER: Low power mode output voltage offset trimming */
  #define VREGAO0V8_TRIM_LOWPOWER_ResetValue (0x00000000UL) /*!< Reset value of LOWPOWER register.                             */

/* VAL @Bits 0..3 : Voltage offset trimming value. */
  #define VREGAO0V8_TRIM_LOWPOWER_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREGAO0V8_TRIM_LOWPOWER_VAL_Msk (0xFUL << VREGAO0V8_TRIM_LOWPOWER_VAL_Pos) /*!< Bit mask of VAL field.               */
  #define VREGAO0V8_TRIM_LOWPOWER_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                          */
  #define VREGAO0V8_TRIM_LOWPOWER_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                           */


/* VREGAO0V8_TRIM_ULTRALOWPOWER: Ultra low power mode ripple trimming */
  #define VREGAO0V8_TRIM_ULTRALOWPOWER_ResetValue (0x00000000UL) /*!< Reset value of ULTRALOWPOWER register.                   */

/* VAL @Bits 0..1 : Ripple trimming value. */
  #define VREGAO0V8_TRIM_ULTRALOWPOWER_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define VREGAO0V8_TRIM_ULTRALOWPOWER_VAL_Msk (0x3UL << VREGAO0V8_TRIM_ULTRALOWPOWER_VAL_Pos) /*!< Bit mask of VAL field.     */
  #define VREGAO0V8_TRIM_ULTRALOWPOWER_VAL_Min (0x0UL) /*!< Min enumerator value of VAL field.                                 */
  #define VREGAO0V8_TRIM_ULTRALOWPOWER_VAL_Max (0x3UL) /*!< Max enumerator value of VAL field.                                 */
  #define VREGAO0V8_TRIM_ULTRALOWPOWER_VAL_5mV (0x1UL) /*!< (unspecified)                                                      */
  #define VREGAO0V8_TRIM_ULTRALOWPOWER_VAL_15mV (0x0UL) /*!< (unspecified)                                                     */
  #define VREGAO0V8_TRIM_ULTRALOWPOWER_VAL_25mV (0x3UL) /*!< (unspecified)                                                     */
  #define VREGAO0V8_TRIM_ULTRALOWPOWER_VAL_35mV (0x2UL) /*!< (unspecified)                                                     */


/* VREGAO0V8_TRIM_BPDET: BP detector offset trimming */
  #define VREGAO0V8_TRIM_BPDET_ResetValue (0x00000000UL) /*!< Reset value of BPDET register.                                   */

/* VAL @Bits 0..3 : Voltage offset trimming value. */
  #define VREGAO0V8_TRIM_BPDET_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define VREGAO0V8_TRIM_BPDET_VAL_Msk (0xFUL << VREGAO0V8_TRIM_BPDET_VAL_Pos) /*!< Bit mask of VAL field.                     */
  #define VREGAO0V8_TRIM_BPDET_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                             */
  #define VREGAO0V8_TRIM_BPDET_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                              */



/* ================================================ Struct VREGAO0V8_OVERRIDE ================================================ */
/**
  * @brief OVERRIDE [VREGAO0V8_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  MODELP;                            /*!< (@ 0x00000008) Override the MODE LP signal to the analog module      */
  __IOM uint32_t  MODEULPR;                          /*!< (@ 0x0000000C) Override the MODE ULPR signal to the analog module    */
  __IOM uint32_t  REQBYPASS;                         /*!< (@ 0x00000010) Override the REQ BYPASS signal to the analog module   */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000014) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x00000018) Override the SETTLED signal from the analog module    */
  __IOM uint32_t  BPREADY;                           /*!< (@ 0x0000001C) Override the BP READY signal from the analog module   */
  __IOM uint32_t  IOUTCMPHP;                         /*!< (@ 0x00000020) Override the IOUTCMP_HP signal from the analog module */
  __IOM uint32_t  IOUTCMPLP;                         /*!< (@ 0x00000024) Override the IOUTCMP_LP signal from the analog module */
} NRF_VREGAO0V8_OVERRIDE_Type;                       /*!< Size = 40 (0x028)                                                    */

/* VREGAO0V8_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define VREGAO0V8_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                               */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGAO0V8_OVERRIDE_PWRUP_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VREGAO0V8_OVERRIDE_PWRUP_VAL_Msk (0x1UL << VREGAO0V8_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VREGAO0V8_OVERRIDE_PWRUP_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGAO0V8_OVERRIDE_PWRUP_EN_Msk (0x1UL << VREGAO0V8_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGAO0V8_OVERRIDE_PWRUP_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGAO0V8_OVERRIDE_PWRUP_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGAO0V8_OVERRIDE_PWRUP_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VREGAO0V8_OVERRIDE_PWRUP_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* VREGAO0V8_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define VREGAO0V8_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                             */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGAO0V8_OVERRIDE_RETAIN_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VREGAO0V8_OVERRIDE_RETAIN_VAL_Msk (0x1UL << VREGAO0V8_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VREGAO0V8_OVERRIDE_RETAIN_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VREGAO0V8_OVERRIDE_RETAIN_EN_Msk (0x1UL << VREGAO0V8_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.              */
  #define VREGAO0V8_OVERRIDE_RETAIN_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VREGAO0V8_OVERRIDE_RETAIN_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VREGAO0V8_OVERRIDE_RETAIN_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VREGAO0V8_OVERRIDE_RETAIN_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* VREGAO0V8_OVERRIDE_MODELP: Override the MODE LP signal to the analog module */
  #define VREGAO0V8_OVERRIDE_MODELP_ResetValue (0x00000000UL) /*!< Reset value of MODELP register.                             */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGAO0V8_OVERRIDE_MODELP_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VREGAO0V8_OVERRIDE_MODELP_VAL_Msk (0x1UL << VREGAO0V8_OVERRIDE_MODELP_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VREGAO0V8_OVERRIDE_MODELP_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VREGAO0V8_OVERRIDE_MODELP_EN_Msk (0x1UL << VREGAO0V8_OVERRIDE_MODELP_EN_Pos) /*!< Bit mask of EN field.              */
  #define VREGAO0V8_OVERRIDE_MODELP_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VREGAO0V8_OVERRIDE_MODELP_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VREGAO0V8_OVERRIDE_MODELP_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VREGAO0V8_OVERRIDE_MODELP_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


