adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VREGAO0V8_OVERRIDE_MODEULPR: Override the MODE ULPR signal to the analog module */
  #define VREGAO0V8_OVERRIDE_MODEULPR_ResetValue (0x00000000UL) /*!< Reset value of MODEULPR register.                         */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGAO0V8_OVERRIDE_MODEULPR_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define VREGAO0V8_OVERRIDE_MODEULPR_VAL_Msk (0x1UL << VREGAO0V8_OVERRIDE_MODEULPR_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : Enable the override */
  #define VREGAO0V8_OVERRIDE_MODEULPR_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define VREGAO0V8_OVERRIDE_MODEULPR_EN_Msk (0x1UL << VREGAO0V8_OVERRIDE_MODEULPR_EN_Pos) /*!< Bit mask of EN field.          */
  #define VREGAO0V8_OVERRIDE_MODEULPR_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define VREGAO0V8_OVERRIDE_MODEULPR_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define VREGAO0V8_OVERRIDE_MODEULPR_EN_Disabled (0x0UL) /*!< Override is disabled                                            */
  #define VREGAO0V8_OVERRIDE_MODEULPR_EN_Enabled (0x1UL) /*!< Override is enabled                                              */


/* VREGAO0V8_OVERRIDE_REQBYPASS: Override the REQ BYPASS signal to the analog module */
  #define VREGAO0V8_OVERRIDE_REQBYPASS_ResetValue (0x00000000UL) /*!< Reset value of REQBYPASS register.                       */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGAO0V8_OVERRIDE_REQBYPASS_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define VREGAO0V8_OVERRIDE_REQBYPASS_VAL_Msk (0x1UL << VREGAO0V8_OVERRIDE_REQBYPASS_VAL_Pos) /*!< Bit mask of VAL field.     */

/* EN @Bit 31 : Enable the override */
  #define VREGAO0V8_OVERRIDE_REQBYPASS_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define VREGAO0V8_OVERRIDE_REQBYPASS_EN_Msk (0x1UL << VREGAO0V8_OVERRIDE_REQBYPASS_EN_Pos) /*!< Bit mask of EN field.        */
  #define VREGAO0V8_OVERRIDE_REQBYPASS_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define VREGAO0V8_OVERRIDE_REQBYPASS_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define VREGAO0V8_OVERRIDE_REQBYPASS_EN_Disabled (0x0UL) /*!< Override is disabled                                           */
  #define VREGAO0V8_OVERRIDE_REQBYPASS_EN_Enabled (0x1UL) /*!< Override is enabled                                             */


/* VREGAO0V8_OVERRIDE_READY: Override the READY signal from the analog module */
  #define VREGAO0V8_OVERRIDE_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                               */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGAO0V8_OVERRIDE_READY_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VREGAO0V8_OVERRIDE_READY_VAL_Msk (0x1UL << VREGAO0V8_OVERRIDE_READY_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VREGAO0V8_OVERRIDE_READY_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGAO0V8_OVERRIDE_READY_EN_Msk (0x1UL << VREGAO0V8_OVERRIDE_READY_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGAO0V8_OVERRIDE_READY_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGAO0V8_OVERRIDE_READY_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGAO0V8_OVERRIDE_READY_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VREGAO0V8_OVERRIDE_READY_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* VREGAO0V8_OVERRIDE_SETTLED: Override the SETTLED signal from the analog module */
  #define VREGAO0V8_OVERRIDE_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of SETTLED register.                           */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGAO0V8_OVERRIDE_SETTLED_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define VREGAO0V8_OVERRIDE_SETTLED_VAL_Msk (0x1UL << VREGAO0V8_OVERRIDE_SETTLED_VAL_Pos) /*!< Bit mask of VAL field.         */

/* EN @Bit 31 : Enable the override */
  #define VREGAO0V8_OVERRIDE_SETTLED_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define VREGAO0V8_OVERRIDE_SETTLED_EN_Msk (0x1UL << VREGAO0V8_OVERRIDE_SETTLED_EN_Pos) /*!< Bit mask of EN field.            */
  #define VREGAO0V8_OVERRIDE_SETTLED_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define VREGAO0V8_OVERRIDE_SETTLED_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define VREGAO0V8_OVERRIDE_SETTLED_EN_Disabled (0x0UL) /*!< Override is disabled                                             */
  #define VREGAO0V8_OVERRIDE_SETTLED_EN_Enabled (0x1UL) /*!< Override is enabled                                               */


/* VREGAO0V8_OVERRIDE_BPREADY: Override the BP READY signal from the analog module */
  #define VREGAO0V8_OVERRIDE_BPREADY_ResetValue (0x00000000UL) /*!< Reset value of BPREADY register.                           */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGAO0V8_OVERRIDE_BPREADY_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define VREGAO0V8_OVERRIDE_BPREADY_VAL_Msk (0x1UL << VREGAO0V8_OVERRIDE_BPREADY_VAL_Pos) /*!< Bit mask of VAL field.         */

/* EN @Bit 31 : Enable the override */
  #define VREGAO0V8_OVERRIDE_BPREADY_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define VREGAO0V8_OVERRIDE_BPREADY_EN_Msk (0x1UL << VREGAO0V8_OVERRIDE_BPREADY_EN_Pos) /*!< Bit mask of EN field.            */
  #define VREGAO0V8_OVERRIDE_BPREADY_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define VREGAO0V8_OVERRIDE_BPREADY_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define VREGAO0V8_OVERRIDE_BPREADY_EN_Disabled (0x0UL) /*!< Override is disabled                                             */
  #define VREGAO0V8_OVERRIDE_BPREADY_EN_Enabled (0x1UL) /*!< Override is enabled                                               */


/* VREGAO0V8_OVERRIDE_IOUTCMPHP: Override the IOUTCMP_HP signal from the analog module */
  #define VREGAO0V8_OVERRIDE_IOUTCMPHP_ResetValue (0x00000000UL) /*!< Reset value of IOUTCMPHP register.                       */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGAO0V8_OVERRIDE_IOUTCMPHP_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define VREGAO0V8_OVERRIDE_IOUTCMPHP_VAL_Msk (0x1UL << VREGAO0V8_OVERRIDE_IOUTCMPHP_VAL_Pos) /*!< Bit mask of VAL field.     */

/* EN @Bit 31 : Enable the override */
  #define VREGAO0V8_OVERRIDE_IOUTCMPHP_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define VREGAO0V8_OVERRIDE_IOUTCMPHP_EN_Msk (0x1UL << VREGAO0V8_OVERRIDE_IOUTCMPHP_EN_Pos) /*!< Bit mask of EN field.        */
  #define VREGAO0V8_OVERRIDE_IOUTCMPHP_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define VREGAO0V8_OVERRIDE_IOUTCMPHP_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define VREGAO0V8_OVERRIDE_IOUTCMPHP_EN_Disabled (0x0UL) /*!< Override is disabled                                           */
  #define VREGAO0V8_OVERRIDE_IOUTCMPHP_EN_Enabled (0x1UL) /*!< Override is enabled                                             */


/* VREGAO0V8_OVERRIDE_IOUTCMPLP: Override the IOUTCMP_LP signal from the analog module */
  #define VREGAO0V8_OVERRIDE_IOUTCMPLP_ResetValue (0x00000000UL) /*!< Reset value of IOUTCMPLP register.                       */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGAO0V8_OVERRIDE_IOUTCMPLP_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define VREGAO0V8_OVERRIDE_IOUTCMPLP_VAL_Msk (0x1UL << VREGAO0V8_OVERRIDE_IOUTCMPLP_VAL_Pos) /*!< Bit mask of VAL field.     */

/* EN @Bit 31 : Enable the override */
  #define VREGAO0V8_OVERRIDE_IOUTCMPLP_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define VREGAO0V8_OVERRIDE_IOUTCMPLP_EN_Msk (0x1UL << VREGAO0V8_OVERRIDE_IOUTCMPLP_EN_Pos) /*!< Bit mask of EN field.        */
  #define VREGAO0V8_OVERRIDE_IOUTCMPLP_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define VREGAO0V8_OVERRIDE_IOUTCMPLP_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define VREGAO0V8_OVERRIDE_IOUTCMPLP_EN_Disabled (0x0UL) /*!< Override is disabled                                           */
  #define VREGAO0V8_OVERRIDE_IOUTCMPLP_EN_Enabled (0x1UL) /*!< Override is enabled                                             */



/* ================================================== Struct VREGAO0V8_DFT =================================================== */
/**
  * @brief DFT [VREGAO0V8_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
  __IOM uint32_t  DTB2CONFIG;                        /*!< (@ 0x00000018) Digital Test Bus 2 (DTB2) configuration               */
  __IOM uint32_t  DTB3CONFIG;                        /*!< (@ 0x0000001C) Digital Test Bus 3 (DTB3) configuration               */
  __IM  uint32_t  RESERVED1[4];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
  __IOM uint32_t  CALEN;                             /*!< (@ 0x00000034) Calibration enable                                    */
  __IM  uint32_t  CALCMP;                            /*!< (@ 0x00000038) Calibration compare                                   */
} NRF_VREGAO0V8_DFT_Type;                            /*!< Size = 60 (0x03C)                                                    */

/* VREGAO0V8_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define VREGAO0V8_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                          */

