adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SELMUX @Bits 0..1 : Select multiplexer for ATB0 */
  #define VREGAO0V8_DFT_ATB0CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VREGAO0V8_DFT_ATB0CONFIG_SELMUX_Msk (0x3UL << VREGAO0V8_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VREGAO0V8_DFT_ATB0CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VREGAO0V8_DFT_ATB0CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VREGAO0V8_DFT_ATB0CONFIG_SELMUX_ExtVref (0x0UL) /*!< External Vref                                                   */
  #define VREGAO0V8_DFT_ATB0CONFIG_SELMUX_VddSw1v8 (0x1UL) /*!< VDD_SW_1V8                                                     */
  #define VREGAO0V8_DFT_ATB0CONFIG_SELMUX_Ibpp50n (0x2UL) /*!< IBPP_50N                                                        */
  #define VREGAO0V8_DFT_ATB0CONFIG_SELMUX_VSS (0x3UL) /*!< VSS                                                                 */

/* EN @Bit 31 : Enable the analog test bus */
  #define VREGAO0V8_DFT_ATB0CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGAO0V8_DFT_ATB0CONFIG_EN_Msk (0x1UL << VREGAO0V8_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGAO0V8_DFT_ATB0CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGAO0V8_DFT_ATB0CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGAO0V8_DFT_ATB0CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                        */
  #define VREGAO0V8_DFT_ATB0CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                          */


/* VREGAO0V8_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define VREGAO0V8_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                          */

/* SELMUX @Bits 0..1 : Select multiplexer for ATB1 */
  #define VREGAO0V8_DFT_ATB1CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VREGAO0V8_DFT_ATB1CONFIG_SELMUX_Msk (0x3UL << VREGAO0V8_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VREGAO0V8_DFT_ATB1CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VREGAO0V8_DFT_ATB1CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VREGAO0V8_DFT_ATB1CONFIG_SELMUX_VrefHP (0x0UL) /*!< HP vref                                                          */
  #define VREGAO0V8_DFT_ATB1CONFIG_SELMUX_Vref0V9Dvt (0x1UL) /*!< VREF_0V9_DVT                                                 */
  #define VREGAO0V8_DFT_ATB1CONFIG_SELMUX_VrefLp (0x2UL) /*!< Buffered VREF_LP                                                 */
  #define VREGAO0V8_DFT_ATB1CONFIG_SELMUX_Vfb (0x3UL) /*!< VFB                                                                 */

/* EN @Bit 31 : Enable the analog test bus */
  #define VREGAO0V8_DFT_ATB1CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGAO0V8_DFT_ATB1CONFIG_EN_Msk (0x1UL << VREGAO0V8_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGAO0V8_DFT_ATB1CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGAO0V8_DFT_ATB1CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGAO0V8_DFT_ATB1CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                        */
  #define VREGAO0V8_DFT_ATB1CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                          */


/* VREGAO0V8_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define VREGAO0V8_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                          */

/* SELMUX @Bits 0..2 : Select multiplexer for DTB0 */
  #define VREGAO0V8_DFT_DTB0CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VREGAO0V8_DFT_DTB0CONFIG_SELMUX_Msk (0x7UL << VREGAO0V8_DFT_DTB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VREGAO0V8_DFT_DTB0CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VREGAO0V8_DFT_DTB0CONFIG_SELMUX_Max (0x7UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VREGAO0V8_DFT_DTB0CONFIG_SELMUX_IcmpHp (0x0UL) /*!< ICMP_HP                                                          */
  #define VREGAO0V8_DFT_DTB0CONFIG_SELMUX_MbiasIbpsrSettled (0x1UL) /*!< MBIAS_IBPSR_SETTLED                                   */
  #define VREGAO0V8_DFT_DTB0CONFIG_SELMUX_ModeLp (0x2UL) /*!< MODE_LP                                                          */
  #define VREGAO0V8_DFT_DTB0CONFIG_SELMUX_ReadyLdo (0x3UL) /*!< READY_LDO                                                      */
  #define VREGAO0V8_DFT_DTB0CONFIG_SELMUX_BpReady (0x4UL) /*!< BP_READY                                                        */
  #define VREGAO0V8_DFT_DTB0CONFIG_SELMUX_IbppReady (0x5UL) /*!< IBPP_READY                                                    */
  #define VREGAO0V8_DFT_DTB0CONFIG_SELMUX_Spare0 (0x6UL) /*!< None selected, logic 0                                           */
  #define VREGAO0V8_DFT_DTB0CONFIG_SELMUX_Spare1 (0x7UL) /*!< None selected, logic 0                                           */

/* EN @Bit 31 : Enable the digital test bus */
  #define VREGAO0V8_DFT_DTB0CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGAO0V8_DFT_DTB0CONFIG_EN_Msk (0x1UL << VREGAO0V8_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGAO0V8_DFT_DTB0CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGAO0V8_DFT_DTB0CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGAO0V8_DFT_DTB0CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                       */
  #define VREGAO0V8_DFT_DTB0CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                         */


/* VREGAO0V8_DFT_DTB1CONFIG: Digital Test Bus 1 (DTB1) configuration */
  #define VREGAO0V8_DFT_DTB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB1CONFIG register.                          */

/* SELMUX @Bits 0..1 : Select multiplexer for DTB1 */
  #define VREGAO0V8_DFT_DTB1CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VREGAO0V8_DFT_DTB1CONFIG_SELMUX_Msk (0x3UL << VREGAO0V8_DFT_DTB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VREGAO0V8_DFT_DTB1CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VREGAO0V8_DFT_DTB1CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VREGAO0V8_DFT_DTB1CONFIG_SELMUX_Bpdet (0x0UL) /*!< BPDET                                                             */
  #define VREGAO0V8_DFT_DTB1CONFIG_SELMUX_IbpsrSettled (0x1UL) /*!< IBPSR_SETTLED                                              */
  #define VREGAO0V8_DFT_DTB1CONFIG_SELMUX_ModeUlp (0x2UL) /*!< MODE_ULP                                                        */
  #define VREGAO0V8_DFT_DTB1CONFIG_SELMUX_SettledLdo (0x3UL) /*!< SETTLED_LDO                                                  */

