adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EVENTS_SETTLED @Bit 0 : Settled flag for MODE handshake */
  #define VREGAO0V8_EVENTS_SETTLED_EVENTS_SETTLED_Pos (0UL) /*!< Position of EVENTS_SETTLED field.                             */
  #define VREGAO0V8_EVENTS_SETTLED_EVENTS_SETTLED_Msk (0x1UL << VREGAO0V8_EVENTS_SETTLED_EVENTS_SETTLED_Pos) /*!< Bit mask of
                                                                            EVENTS_SETTLED field.*/                               
  #define VREGAO0V8_EVENTS_SETTLED_EVENTS_SETTLED_Min (0x0UL) /*!< Min enumerator value of EVENTS_SETTLED field.               */
  #define VREGAO0V8_EVENTS_SETTLED_EVENTS_SETTLED_Max (0x1UL) /*!< Max enumerator value of EVENTS_SETTLED field.               */
  #define VREGAO0V8_EVENTS_SETTLED_EVENTS_SETTLED_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define VREGAO0V8_EVENTS_SETTLED_EVENTS_SETTLED_Generated (0x1UL) /*!< Event generated                                       */


/* VREGAO0V8_EVENTS_BPREADY: Bypass ready flag */
  #define VREGAO0V8_EVENTS_BPREADY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_BPREADY register.                      */

/* EVENTS_BPREADY @Bit 0 : Bypass ready flag */
  #define VREGAO0V8_EVENTS_BPREADY_EVENTS_BPREADY_Pos (0UL) /*!< Position of EVENTS_BPREADY field.                             */
  #define VREGAO0V8_EVENTS_BPREADY_EVENTS_BPREADY_Msk (0x1UL << VREGAO0V8_EVENTS_BPREADY_EVENTS_BPREADY_Pos) /*!< Bit mask of
                                                                            EVENTS_BPREADY field.*/                               
  #define VREGAO0V8_EVENTS_BPREADY_EVENTS_BPREADY_Min (0x0UL) /*!< Min enumerator value of EVENTS_BPREADY field.               */
  #define VREGAO0V8_EVENTS_BPREADY_EVENTS_BPREADY_Max (0x1UL) /*!< Max enumerator value of EVENTS_BPREADY field.               */
  #define VREGAO0V8_EVENTS_BPREADY_EVENTS_BPREADY_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define VREGAO0V8_EVENTS_BPREADY_EVENTS_BPREADY_Generated (0x1UL) /*!< Event generated                                       */


/* VREGAO0V8_EVENTS_IOUTCMPHP: HP mode analog current comparator */
  #define VREGAO0V8_EVENTS_IOUTCMPHP_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_IOUTCMPHP register.                  */

/* EVENTS_IOUTCMPHP @Bit 0 : HP mode analog current comparator */
  #define VREGAO0V8_EVENTS_IOUTCMPHP_EVENTS_IOUTCMPHP_Pos (0UL) /*!< Position of EVENTS_IOUTCMPHP field.                       */
  #define VREGAO0V8_EVENTS_IOUTCMPHP_EVENTS_IOUTCMPHP_Msk (0x1UL << VREGAO0V8_EVENTS_IOUTCMPHP_EVENTS_IOUTCMPHP_Pos) /*!< Bit
                                                                            mask of EVENTS_IOUTCMPHP field.*/                     
  #define VREGAO0V8_EVENTS_IOUTCMPHP_EVENTS_IOUTCMPHP_Min (0x0UL) /*!< Min enumerator value of EVENTS_IOUTCMPHP field.         */
  #define VREGAO0V8_EVENTS_IOUTCMPHP_EVENTS_IOUTCMPHP_Max (0x1UL) /*!< Max enumerator value of EVENTS_IOUTCMPHP field.         */
  #define VREGAO0V8_EVENTS_IOUTCMPHP_EVENTS_IOUTCMPHP_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define VREGAO0V8_EVENTS_IOUTCMPHP_EVENTS_IOUTCMPHP_Generated (0x1UL) /*!< Event generated                                   */


/* VREGAO0V8_EVENTS_IOUTCMPLP: LP mode analog current comparator */
  #define VREGAO0V8_EVENTS_IOUTCMPLP_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_IOUTCMPLP register.                  */

/* EVENTS_IOUTCMPLP @Bit 0 : LP mode analog current comparator */
  #define VREGAO0V8_EVENTS_IOUTCMPLP_EVENTS_IOUTCMPLP_Pos (0UL) /*!< Position of EVENTS_IOUTCMPLP field.                       */
  #define VREGAO0V8_EVENTS_IOUTCMPLP_EVENTS_IOUTCMPLP_Msk (0x1UL << VREGAO0V8_EVENTS_IOUTCMPLP_EVENTS_IOUTCMPLP_Pos) /*!< Bit
                                                                            mask of EVENTS_IOUTCMPLP field.*/                     
  #define VREGAO0V8_EVENTS_IOUTCMPLP_EVENTS_IOUTCMPLP_Min (0x0UL) /*!< Min enumerator value of EVENTS_IOUTCMPLP field.         */
  #define VREGAO0V8_EVENTS_IOUTCMPLP_EVENTS_IOUTCMPLP_Max (0x1UL) /*!< Max enumerator value of EVENTS_IOUTCMPLP field.         */
  #define VREGAO0V8_EVENTS_IOUTCMPLP_EVENTS_IOUTCMPLP_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define VREGAO0V8_EVENTS_IOUTCMPLP_EVENTS_IOUTCMPLP_Generated (0x1UL) /*!< Event generated                                   */


/* VREGAO0V8_EVENTS_LP2HP: Current consumption above threshold */
  #define VREGAO0V8_EVENTS_LP2HP_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_LP2HP register.                          */

/* EVENTS_LP2HP @Bit 0 : Current consumption above threshold */
  #define VREGAO0V8_EVENTS_LP2HP_EVENTS_LP2HP_Pos (0UL) /*!< Position of EVENTS_LP2HP field.                                   */
  #define VREGAO0V8_EVENTS_LP2HP_EVENTS_LP2HP_Msk (0x1UL << VREGAO0V8_EVENTS_LP2HP_EVENTS_LP2HP_Pos) /*!< Bit mask of
                                                                            EVENTS_LP2HP field.*/                                 
  #define VREGAO0V8_EVENTS_LP2HP_EVENTS_LP2HP_Min (0x0UL) /*!< Min enumerator value of EVENTS_LP2HP field.                     */
  #define VREGAO0V8_EVENTS_LP2HP_EVENTS_LP2HP_Max (0x1UL) /*!< Max enumerator value of EVENTS_LP2HP field.                     */
  #define VREGAO0V8_EVENTS_LP2HP_EVENTS_LP2HP_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define VREGAO0V8_EVENTS_LP2HP_EVENTS_LP2HP_Generated (0x1UL) /*!< Event generated                                           */


/* VREGAO0V8_EVENTS_HP2LP: Current consumption below threshold */
  #define VREGAO0V8_EVENTS_HP2LP_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_HP2LP register.                          */

/* EVENTS_HP2LP @Bit 0 : Current consumption below threshold */
  #define VREGAO0V8_EVENTS_HP2LP_EVENTS_HP2LP_Pos (0UL) /*!< Position of EVENTS_HP2LP field.                                   */
  #define VREGAO0V8_EVENTS_HP2LP_EVENTS_HP2LP_Msk (0x1UL << VREGAO0V8_EVENTS_HP2LP_EVENTS_HP2LP_Pos) /*!< Bit mask of
                                                                            EVENTS_HP2LP field.*/                                 
  #define VREGAO0V8_EVENTS_HP2LP_EVENTS_HP2LP_Min (0x0UL) /*!< Min enumerator value of EVENTS_HP2LP field.                     */
  #define VREGAO0V8_EVENTS_HP2LP_EVENTS_HP2LP_Max (0x1UL) /*!< Max enumerator value of EVENTS_HP2LP field.                     */
  #define VREGAO0V8_EVENTS_HP2LP_EVENTS_HP2LP_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define VREGAO0V8_EVENTS_HP2LP_EVENTS_HP2LP_Generated (0x1UL) /*!< Event generated                                           */


