adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* HP2LP @Bit 6 : Read pending status of interrupt for event HP2LP */
  #define VREGAO0V8_INTPEND_HP2LP_Pos (6UL)          /*!< Position of HP2LP field.                                             */
  #define VREGAO0V8_INTPEND_HP2LP_Msk (0x1UL << VREGAO0V8_INTPEND_HP2LP_Pos) /*!< Bit mask of HP2LP field.                     */
  #define VREGAO0V8_INTPEND_HP2LP_Min (0x0UL)        /*!< Min enumerator value of HP2LP field.                                 */
  #define VREGAO0V8_INTPEND_HP2LP_Max (0x1UL)        /*!< Max enumerator value of HP2LP field.                                 */
  #define VREGAO0V8_INTPEND_HP2LP_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VREGAO0V8_INTPEND_HP2LP_Pending (0x1UL)    /*!< Read: Pending                                                        */


/* VREGAO0V8_STATUS: Voltage regulator status */
  #define VREGAO0V8_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                                      */

/* MODE @Bits 0..1 : Current voltage regulator mode */
  #define VREGAO0V8_STATUS_MODE_Pos (0UL)            /*!< Position of MODE field.                                              */
  #define VREGAO0V8_STATUS_MODE_Msk (0x3UL << VREGAO0V8_STATUS_MODE_Pos) /*!< Bit mask of MODE field.                          */
  #define VREGAO0V8_STATUS_MODE_Min (0x0UL)          /*!< Min enumerator value of MODE field.                                  */
  #define VREGAO0V8_STATUS_MODE_Max (0x3UL)          /*!< Max enumerator value of MODE field.                                  */
  #define VREGAO0V8_STATUS_MODE_HighPower (0x0UL)    /*!< High power mode                                                      */
  #define VREGAO0V8_STATUS_MODE_LowPower (0x1UL)     /*!< Low power refresh mode                                               */
  #define VREGAO0V8_STATUS_MODE_UltraLowPowerRefresh (0x2UL) /*!< Ultra-low power refresh mode                                 */
  #define VREGAO0V8_STATUS_MODE_Bypass (0x3UL)       /*!< Bypass mode                                                          */


/* VREGAO0V8_STATUSANA: Status of analog module output signals */
  #define VREGAO0V8_STATUSANA_ResetValue (0x00000000UL) /*!< Reset value of STATUSANA register.                                */

/* READY @Bit 0 : Current value of the READY signal from the analog module */
  #define VREGAO0V8_STATUSANA_READY_Pos (0UL)        /*!< Position of READY field.                                             */
  #define VREGAO0V8_STATUSANA_READY_Msk (0x1UL << VREGAO0V8_STATUSANA_READY_Pos) /*!< Bit mask of READY field.                 */

/* SETTLED @Bit 1 : Current value of the SETTLED signal from the analog module */
  #define VREGAO0V8_STATUSANA_SETTLED_Pos (1UL)      /*!< Position of SETTLED field.                                           */
  #define VREGAO0V8_STATUSANA_SETTLED_Msk (0x1UL << VREGAO0V8_STATUSANA_SETTLED_Pos) /*!< Bit mask of SETTLED field.           */

/* BPREADY @Bit 2 : Current value of the BPREADY signal from the analog module */
  #define VREGAO0V8_STATUSANA_BPREADY_Pos (2UL)      /*!< Position of BPREADY field.                                           */
  #define VREGAO0V8_STATUSANA_BPREADY_Msk (0x1UL << VREGAO0V8_STATUSANA_BPREADY_Pos) /*!< Bit mask of BPREADY field.           */

/* IOUTCMPHP @Bit 3 : Current value of the IOUTCMPHP signal from the analog module */
  #define VREGAO0V8_STATUSANA_IOUTCMPHP_Pos (3UL)    /*!< Position of IOUTCMPHP field.                                         */
  #define VREGAO0V8_STATUSANA_IOUTCMPHP_Msk (0x1UL << VREGAO0V8_STATUSANA_IOUTCMPHP_Pos) /*!< Bit mask of IOUTCMPHP field.     */

/* IOUTCMPLP @Bit 4 : Current value of the IOUTCMPLP signal from the analog module */
  #define VREGAO0V8_STATUSANA_IOUTCMPLP_Pos (4UL)    /*!< Position of IOUTCMPLP field.                                         */
  #define VREGAO0V8_STATUSANA_IOUTCMPLP_Msk (0x1UL << VREGAO0V8_STATUSANA_IOUTCMPLP_Pos) /*!< Bit mask of IOUTCMPLP field.     */


/* VREGAO0V8_MIRROR: Enable LOCK for mirrored registers */
  #define VREGAO0V8_MIRROR_ResetValue (0x00000001UL) /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define VREGAO0V8_MIRROR_LOCK_Pos (0UL)            /*!< Position of LOCK field.                                              */
  #define VREGAO0V8_MIRROR_LOCK_Msk (0x1UL << VREGAO0V8_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                          */
  #define VREGAO0V8_MIRROR_LOCK_Min (0x0UL)          /*!< Min enumerator value of LOCK field.                                  */
  #define VREGAO0V8_MIRROR_LOCK_Max (0x1UL)          /*!< Max enumerator value of LOCK field.                                  */
  #define VREGAO0V8_MIRROR_LOCK_Disabled (0x0UL)     /*!< Lock disabled                                                        */
  #define VREGAO0V8_MIRROR_LOCK_Enabled (0x1UL)      /*!< Lock enabled                                                         */


/* VREGAO0V8_VOUT: Output voltage programming */
  #define VREGAO0V8_VOUT_ResetValue (0x00000006UL)   /*!< Reset value of VOUT register.                                        */

/* VAL @Bits 0..2 : Output voltage value */
  #define VREGAO0V8_VOUT_VAL_Pos (0UL)               /*!< Position of VAL field.                                               */
  #define VREGAO0V8_VOUT_VAL_Msk (0x7UL << VREGAO0V8_VOUT_VAL_Pos) /*!< Bit mask of VAL field.                                 */
  #define VREGAO0V8_VOUT_VAL_Min (0xFFFFFFFFUL)      /*!< Min value of VAL field.                                              */
  #define VREGAO0V8_VOUT_VAL_Max (0xFFFFFFFFUL)      /*!< Max size of VAL field.                                               */


/* VREGAO0V8_MODE: Voltage regulator mode */
  #define VREGAO0V8_MODE_ResetValue (0x00000000UL)   /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..2 : Mode */
  #define VREGAO0V8_MODE_MODE_Pos (0UL)              /*!< Position of MODE field.                                              */
  #define VREGAO0V8_MODE_MODE_Msk (0x7UL << VREGAO0V8_MODE_MODE_Pos) /*!< Bit mask of MODE field.                              */
  #define VREGAO0V8_MODE_MODE_Min (0x0UL)            /*!< Min enumerator value of MODE field.                                  */
  #define VREGAO0V8_MODE_MODE_Max (0x4UL)            /*!< Max enumerator value of MODE field.                                  */
  #define VREGAO0V8_MODE_MODE_Auto (0x0UL)           /*!< Automatically handled by the peripheral                              */
  #define VREGAO0V8_MODE_MODE_HighPower (0x1UL)      /*!< High power mode                                                      */
  #define VREGAO0V8_MODE_MODE_LowPower (0x2UL)       /*!< Low power refresh mode                                               */
  #define VREGAO0V8_MODE_MODE_UltraLowPowerRefresh (0x3UL) /*!< Ultra-low power refresh mode                                   */
  #define VREGAO0V8_MODE_MODE_Bypass (0x4UL)         /*!< Bypass forced mode                                                   */


