adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VREGAO1V8_OVERRIDE_MODEULP: Override the MODE ULP signal to the analog module */
  #define VREGAO1V8_OVERRIDE_MODEULP_ResetValue (0x00000000UL) /*!< Reset value of MODEULP register.                           */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGAO1V8_OVERRIDE_MODEULP_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define VREGAO1V8_OVERRIDE_MODEULP_VAL_Msk (0x1UL << VREGAO1V8_OVERRIDE_MODEULP_VAL_Pos) /*!< Bit mask of VAL field.         */

/* EN @Bit 31 : Enable the override */
  #define VREGAO1V8_OVERRIDE_MODEULP_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define VREGAO1V8_OVERRIDE_MODEULP_EN_Msk (0x1UL << VREGAO1V8_OVERRIDE_MODEULP_EN_Pos) /*!< Bit mask of EN field.            */
  #define VREGAO1V8_OVERRIDE_MODEULP_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define VREGAO1V8_OVERRIDE_MODEULP_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define VREGAO1V8_OVERRIDE_MODEULP_EN_Disabled (0x0UL) /*!< Override is disabled                                             */
  #define VREGAO1V8_OVERRIDE_MODEULP_EN_Enabled (0x1UL) /*!< Override is enabled                                               */


/* VREGAO1V8_OVERRIDE_CFG: Override the dynamic config signals to the analog module */
  #define VREGAO1V8_OVERRIDE_CFG_ResetValue (0x00000000UL) /*!< Reset value of CFG register.                                   */

/* DOUBLEBIAS @Bit 0 : Override value for the signal */
  #define VREGAO1V8_OVERRIDE_CFG_DOUBLEBIAS_Pos (0UL) /*!< Position of DOUBLEBIAS field.                                       */
  #define VREGAO1V8_OVERRIDE_CFG_DOUBLEBIAS_Msk (0x1UL << VREGAO1V8_OVERRIDE_CFG_DOUBLEBIAS_Pos) /*!< Bit mask of DOUBLEBIAS
                                                                            field.*/                                              

/* DCMP @Bit 1 : Override value for the signal */
  #define VREGAO1V8_OVERRIDE_CFG_DCMP_Pos (1UL)      /*!< Position of DCMP field.                                              */
  #define VREGAO1V8_OVERRIDE_CFG_DCMP_Msk (0x1UL << VREGAO1V8_OVERRIDE_CFG_DCMP_Pos) /*!< Bit mask of DCMP field.              */

/* EN @Bit 31 : Enable the override */
  #define VREGAO1V8_OVERRIDE_CFG_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VREGAO1V8_OVERRIDE_CFG_EN_Msk (0x1UL << VREGAO1V8_OVERRIDE_CFG_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VREGAO1V8_OVERRIDE_CFG_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VREGAO1V8_OVERRIDE_CFG_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VREGAO1V8_OVERRIDE_CFG_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define VREGAO1V8_OVERRIDE_CFG_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */


/* VREGAO1V8_OVERRIDE_VOLTHP: Override the VOLT HP signal to the analog module */
  #define VREGAO1V8_OVERRIDE_VOLTHP_ResetValue (0x00000000UL) /*!< Reset value of VOLTHP register.                             */

/* VAL @Bits 0..2 : Override value for the signal */
  #define VREGAO1V8_OVERRIDE_VOLTHP_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VREGAO1V8_OVERRIDE_VOLTHP_VAL_Msk (0x7UL << VREGAO1V8_OVERRIDE_VOLTHP_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VREGAO1V8_OVERRIDE_VOLTHP_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VREGAO1V8_OVERRIDE_VOLTHP_EN_Msk (0x1UL << VREGAO1V8_OVERRIDE_VOLTHP_EN_Pos) /*!< Bit mask of EN field.              */
  #define VREGAO1V8_OVERRIDE_VOLTHP_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VREGAO1V8_OVERRIDE_VOLTHP_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VREGAO1V8_OVERRIDE_VOLTHP_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VREGAO1V8_OVERRIDE_VOLTHP_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* VREGAO1V8_OVERRIDE_READY: Override the READY signal from the analog module */
  #define VREGAO1V8_OVERRIDE_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                               */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGAO1V8_OVERRIDE_READY_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VREGAO1V8_OVERRIDE_READY_VAL_Msk (0x1UL << VREGAO1V8_OVERRIDE_READY_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VREGAO1V8_OVERRIDE_READY_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGAO1V8_OVERRIDE_READY_EN_Msk (0x1UL << VREGAO1V8_OVERRIDE_READY_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGAO1V8_OVERRIDE_READY_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGAO1V8_OVERRIDE_READY_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGAO1V8_OVERRIDE_READY_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VREGAO1V8_OVERRIDE_READY_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* VREGAO1V8_OVERRIDE_SETTLED: Override the SETTLED signal from the analog module */
  #define VREGAO1V8_OVERRIDE_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of SETTLED register.                           */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGAO1V8_OVERRIDE_SETTLED_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define VREGAO1V8_OVERRIDE_SETTLED_VAL_Msk (0x1UL << VREGAO1V8_OVERRIDE_SETTLED_VAL_Pos) /*!< Bit mask of VAL field.         */

/* EN @Bit 31 : Enable the override */
  #define VREGAO1V8_OVERRIDE_SETTLED_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define VREGAO1V8_OVERRIDE_SETTLED_EN_Msk (0x1UL << VREGAO1V8_OVERRIDE_SETTLED_EN_Pos) /*!< Bit mask of EN field.            */
  #define VREGAO1V8_OVERRIDE_SETTLED_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define VREGAO1V8_OVERRIDE_SETTLED_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define VREGAO1V8_OVERRIDE_SETTLED_EN_Disabled (0x0UL) /*!< Override is disabled                                             */
  #define VREGAO1V8_OVERRIDE_SETTLED_EN_Enabled (0x1UL) /*!< Override is enabled                                               */


