adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VREGAO1V8_OVERRIDE_IOUTCMP: Override the ICMP signal from the analog module */
  #define VREGAO1V8_OVERRIDE_IOUTCMP_ResetValue (0x00000000UL) /*!< Reset value of IOUTCMP register.                           */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGAO1V8_OVERRIDE_IOUTCMP_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define VREGAO1V8_OVERRIDE_IOUTCMP_VAL_Msk (0x1UL << VREGAO1V8_OVERRIDE_IOUTCMP_VAL_Pos) /*!< Bit mask of VAL field.         */

/* EN @Bit 31 : Enable the override */
  #define VREGAO1V8_OVERRIDE_IOUTCMP_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define VREGAO1V8_OVERRIDE_IOUTCMP_EN_Msk (0x1UL << VREGAO1V8_OVERRIDE_IOUTCMP_EN_Pos) /*!< Bit mask of EN field.            */
  #define VREGAO1V8_OVERRIDE_IOUTCMP_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define VREGAO1V8_OVERRIDE_IOUTCMP_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define VREGAO1V8_OVERRIDE_IOUTCMP_EN_Disabled (0x0UL) /*!< Override is disabled                                             */
  #define VREGAO1V8_OVERRIDE_IOUTCMP_EN_Enabled (0x1UL) /*!< Override is enabled                                               */



/* ================================================== Struct VREGAO1V8_DFT =================================================== */
/**
  * @brief DFT [VREGAO1V8_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
  __IOM uint32_t  DTB2CONFIG;                        /*!< (@ 0x00000018) Digital Test Bus 2 (DTB2) configuration               */
  __IOM uint32_t  DTB3CONFIG;                        /*!< (@ 0x0000001C) Digital Test Bus 3 (DTB3) configuration               */
  __IM  uint32_t  RESERVED1[4];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
} NRF_VREGAO1V8_DFT_Type;                            /*!< Size = 52 (0x034)                                                    */

/* VREGAO1V8_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define VREGAO1V8_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                          */

/* SELMUX @Bits 0..1 : Select multiplexer for ATB0 */
  #define VREGAO1V8_DFT_ATB0CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VREGAO1V8_DFT_ATB0CONFIG_SELMUX_Msk (0x3UL << VREGAO1V8_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VREGAO1V8_DFT_ATB0CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VREGAO1V8_DFT_ATB0CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VREGAO1V8_DFT_ATB0CONFIG_SELMUX_Spare0 (0x0UL) /*!< HiZ                                                              */
  #define VREGAO1V8_DFT_ATB0CONFIG_SELMUX_VddSw1v8 (0x1UL) /*!< VDD_SW_1V8                                                     */
  #define VREGAO1V8_DFT_ATB0CONFIG_SELMUX_Ibpp50n (0x2UL) /*!< IBPP_50N                                                        */
  #define VREGAO1V8_DFT_ATB0CONFIG_SELMUX_VSS (0x3UL) /*!< VSS                                                                 */

/* EN @Bit 31 : Enable the analog test bus */
  #define VREGAO1V8_DFT_ATB0CONFIG_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGAO1V8_DFT_ATB0CONFIG_EN_Msk (0x1UL << VREGAO1V8_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGAO1V8_DFT_ATB0CONFIG_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGAO1V8_DFT_ATB0CONFIG_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGAO1V8_DFT_ATB0CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                        */
  #define VREGAO1V8_DFT_ATB0CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                          */


/* VREGAO1V8_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define VREGAO1V8_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                          */

/* SELMUX @Bits 0..1 : Select multiplexer for ATB1 */
  #define VREGAO1V8_DFT_ATB1CONFIG_SELMUX_Pos (0UL)  /*!< Position of SELMUX field.                                            */
  #define VREGAO1V8_DFT_ATB1CONFIG_SELMUX_Msk (0x3UL << VREGAO1V8_DFT_ATB1CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.    */
  #define VREGAO1V8_DFT_ATB1CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                               */
  #define VREGAO1V8_DFT_ATB1CONFIG_SELMUX_Max (0x3UL) /*!< Max enumerator value of SELMUX field.                               */
  #define VREGAO1V8_DFT_ATB1CONFIG_SELMUX_Spare0 (0x0UL) /*!< HiZ                                                              */
  #define VREGAO1V8_DFT_ATB1CONFIG_SELMUX_Vref0v9Dvt (0x1UL) /*!< VREF_0V9_DVT                                                 */
  #define VREGAO1V8_DFT_ATB1CONFIG_SELMUX_BufferedVref0V9 (0x2UL) /*!< Buffered VREF_0V9                                       */
  #define VREGAO1V8_DFT_ATB1CONFIG_SELMUX_BufferedVfb0V9 (0x3UL) /*!< Buffered VFB_0V9                                         */

