adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SETTLED @Bit 1 : Write '1' to disable interrupt for event SETTLED */
  #define VREGAO1V8_INTENCLR_SETTLED_Pos (1UL)       /*!< Position of SETTLED field.                                           */
  #define VREGAO1V8_INTENCLR_SETTLED_Msk (0x1UL << VREGAO1V8_INTENCLR_SETTLED_Pos) /*!< Bit mask of SETTLED field.             */
  #define VREGAO1V8_INTENCLR_SETTLED_Min (0x0UL)     /*!< Min enumerator value of SETTLED field.                               */
  #define VREGAO1V8_INTENCLR_SETTLED_Max (0x1UL)     /*!< Max enumerator value of SETTLED field.                               */
  #define VREGAO1V8_INTENCLR_SETTLED_Clear (0x1UL)   /*!< Disable                                                              */
  #define VREGAO1V8_INTENCLR_SETTLED_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define VREGAO1V8_INTENCLR_SETTLED_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* IOUTCMP @Bit 2 : Write '1' to disable interrupt for event IOUTCMP */
  #define VREGAO1V8_INTENCLR_IOUTCMP_Pos (2UL)       /*!< Position of IOUTCMP field.                                           */
  #define VREGAO1V8_INTENCLR_IOUTCMP_Msk (0x1UL << VREGAO1V8_INTENCLR_IOUTCMP_Pos) /*!< Bit mask of IOUTCMP field.             */
  #define VREGAO1V8_INTENCLR_IOUTCMP_Min (0x0UL)     /*!< Min enumerator value of IOUTCMP field.                               */
  #define VREGAO1V8_INTENCLR_IOUTCMP_Max (0x1UL)     /*!< Max enumerator value of IOUTCMP field.                               */
  #define VREGAO1V8_INTENCLR_IOUTCMP_Clear (0x1UL)   /*!< Disable                                                              */
  #define VREGAO1V8_INTENCLR_IOUTCMP_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define VREGAO1V8_INTENCLR_IOUTCMP_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* LP2HP @Bit 3 : Write '1' to disable interrupt for event LP2HP */
  #define VREGAO1V8_INTENCLR_LP2HP_Pos (3UL)         /*!< Position of LP2HP field.                                             */
  #define VREGAO1V8_INTENCLR_LP2HP_Msk (0x1UL << VREGAO1V8_INTENCLR_LP2HP_Pos) /*!< Bit mask of LP2HP field.                   */
  #define VREGAO1V8_INTENCLR_LP2HP_Min (0x0UL)       /*!< Min enumerator value of LP2HP field.                                 */
  #define VREGAO1V8_INTENCLR_LP2HP_Max (0x1UL)       /*!< Max enumerator value of LP2HP field.                                 */
  #define VREGAO1V8_INTENCLR_LP2HP_Clear (0x1UL)     /*!< Disable                                                              */
  #define VREGAO1V8_INTENCLR_LP2HP_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VREGAO1V8_INTENCLR_LP2HP_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* HP2LP @Bit 4 : Write '1' to disable interrupt for event HP2LP */
  #define VREGAO1V8_INTENCLR_HP2LP_Pos (4UL)         /*!< Position of HP2LP field.                                             */
  #define VREGAO1V8_INTENCLR_HP2LP_Msk (0x1UL << VREGAO1V8_INTENCLR_HP2LP_Pos) /*!< Bit mask of HP2LP field.                   */
  #define VREGAO1V8_INTENCLR_HP2LP_Min (0x0UL)       /*!< Min enumerator value of HP2LP field.                                 */
  #define VREGAO1V8_INTENCLR_HP2LP_Max (0x1UL)       /*!< Max enumerator value of HP2LP field.                                 */
  #define VREGAO1V8_INTENCLR_HP2LP_Clear (0x1UL)     /*!< Disable                                                              */
  #define VREGAO1V8_INTENCLR_HP2LP_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VREGAO1V8_INTENCLR_HP2LP_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* VREGAO1V8_INTPEND: Pending interrupts */
  #define VREGAO1V8_INTPEND_ResetValue (0x00000000UL) /*!< Reset value of INTPEND register.                                    */

/* READY @Bit 0 : Read pending status of interrupt for event READY */
  #define VREGAO1V8_INTPEND_READY_Pos (0UL)          /*!< Position of READY field.                                             */
  #define VREGAO1V8_INTPEND_READY_Msk (0x1UL << VREGAO1V8_INTPEND_READY_Pos) /*!< Bit mask of READY field.                     */
  #define VREGAO1V8_INTPEND_READY_Min (0x0UL)        /*!< Min enumerator value of READY field.                                 */
  #define VREGAO1V8_INTPEND_READY_Max (0x1UL)        /*!< Max enumerator value of READY field.                                 */
  #define VREGAO1V8_INTPEND_READY_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VREGAO1V8_INTPEND_READY_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* SETTLED @Bit 1 : Read pending status of interrupt for event SETTLED */
  #define VREGAO1V8_INTPEND_SETTLED_Pos (1UL)        /*!< Position of SETTLED field.                                           */
  #define VREGAO1V8_INTPEND_SETTLED_Msk (0x1UL << VREGAO1V8_INTPEND_SETTLED_Pos) /*!< Bit mask of SETTLED field.               */
  #define VREGAO1V8_INTPEND_SETTLED_Min (0x0UL)      /*!< Min enumerator value of SETTLED field.                               */
  #define VREGAO1V8_INTPEND_SETTLED_Max (0x1UL)      /*!< Max enumerator value of SETTLED field.                               */
  #define VREGAO1V8_INTPEND_SETTLED_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define VREGAO1V8_INTPEND_SETTLED_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* IOUTCMP @Bit 2 : Read pending status of interrupt for event IOUTCMP */
  #define VREGAO1V8_INTPEND_IOUTCMP_Pos (2UL)        /*!< Position of IOUTCMP field.                                           */
  #define VREGAO1V8_INTPEND_IOUTCMP_Msk (0x1UL << VREGAO1V8_INTPEND_IOUTCMP_Pos) /*!< Bit mask of IOUTCMP field.               */
  #define VREGAO1V8_INTPEND_IOUTCMP_Min (0x0UL)      /*!< Min enumerator value of IOUTCMP field.                               */
  #define VREGAO1V8_INTPEND_IOUTCMP_Max (0x1UL)      /*!< Max enumerator value of IOUTCMP field.                               */
  #define VREGAO1V8_INTPEND_IOUTCMP_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define VREGAO1V8_INTPEND_IOUTCMP_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* LP2HP @Bit 3 : Read pending status of interrupt for event LP2HP */
  #define VREGAO1V8_INTPEND_LP2HP_Pos (3UL)          /*!< Position of LP2HP field.                                             */
  #define VREGAO1V8_INTPEND_LP2HP_Msk (0x1UL << VREGAO1V8_INTPEND_LP2HP_Pos) /*!< Bit mask of LP2HP field.                     */
  #define VREGAO1V8_INTPEND_LP2HP_Min (0x0UL)        /*!< Min enumerator value of LP2HP field.                                 */
  #define VREGAO1V8_INTPEND_LP2HP_Max (0x1UL)        /*!< Max enumerator value of LP2HP field.                                 */
  #define VREGAO1V8_INTPEND_LP2HP_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VREGAO1V8_INTPEND_LP2HP_Pending (0x1UL)    /*!< Read: Pending                                                        */

