adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VAL @Bits 0..2 : Output voltage value */
  #define VREGAO1V8_VOUTLP_VAL_Pos (0UL)             /*!< Position of VAL field.                                               */
  #define VREGAO1V8_VOUTLP_VAL_Msk (0x7UL << VREGAO1V8_VOUTLP_VAL_Pos) /*!< Bit mask of VAL field.                             */
  #define VREGAO1V8_VOUTLP_VAL_Min (0xFFFFFFFFUL)    /*!< Min value of VAL field.                                              */
  #define VREGAO1V8_VOUTLP_VAL_Max (0xFFFFFFFFUL)    /*!< Max size of VAL field.                                               */


/* VREGAO1V8_MODE: Voltage regulator mode */
  #define VREGAO1V8_MODE_ResetValue (0x00000000UL)   /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..2 : Mode */
  #define VREGAO1V8_MODE_MODE_Pos (0UL)              /*!< Position of MODE field.                                              */
  #define VREGAO1V8_MODE_MODE_Msk (0x7UL << VREGAO1V8_MODE_MODE_Pos) /*!< Bit mask of MODE field.                              */
  #define VREGAO1V8_MODE_MODE_Min (0x0UL)            /*!< Min enumerator value of MODE field.                                  */
  #define VREGAO1V8_MODE_MODE_Max (0x4UL)            /*!< Max enumerator value of MODE field.                                  */
  #define VREGAO1V8_MODE_MODE_Auto (0x0UL)           /*!< Automatically handled by the peripheral                              */
  #define VREGAO1V8_MODE_MODE_HighPower (0x1UL)      /*!< High power mode                                                      */
  #define VREGAO1V8_MODE_MODE_LowPowerRefresh (0x2UL) /*!< Low power refresh mode                                              */
  #define VREGAO1V8_MODE_MODE_UltraLowPowerRefresh (0x3UL) /*!< Ultra-low power refresh mode                                   */
  #define VREGAO1V8_MODE_MODE_LowPowerRefreshDiff (0x4UL) /*!< Low Power Refresh Differential 5v0 and 1v8                      */


/* VREGAO1V8_ITHRESHOLD: Current threshold for mode transistion */
  #define VREGAO1V8_ITHRESHOLD_ResetValue (0x00000005UL) /*!< Reset value of ITHRESHOLD register.                              */

/* VAL @Bits 0..3 : Current consumption */
  #define VREGAO1V8_ITHRESHOLD_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define VREGAO1V8_ITHRESHOLD_VAL_Msk (0xFUL << VREGAO1V8_ITHRESHOLD_VAL_Pos) /*!< Bit mask of VAL field.                     */
  #define VREGAO1V8_ITHRESHOLD_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                             */
  #define VREGAO1V8_ITHRESHOLD_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                              */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         VREGMAIN                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct VREGMAIN_CONFIG ================================================== */
/**
  * @brief CONFIG [VREGMAIN_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFGSTATIC;                         /*!< (@ 0x00000000) VREGMAIN static CFGC configuration                    */
  __IOM uint32_t  CFGCH1;                            /*!< (@ 0x00000004) VREGMAIN CH1 configuration                            */
  __IOM uint32_t  CFGCH2;                            /*!< (@ 0x00000008) VREGMAIN CH2 configuration                            */
  __IOM uint32_t  CFGCH3;                            /*!< (@ 0x0000000C) VREGMAIN CH3 configuration                            */
} NRF_VREGMAIN_CONFIG_Type;                          /*!< Size = 16 (0x010)                                                    */

/* VREGMAIN_CONFIG_CFGSTATIC: VREGMAIN static CFGC configuration */
  #define VREGMAIN_CONFIG_CFGSTATIC_ResetValue (0x00000070UL) /*!< Reset value of CFGSTATIC register.                          */

/* ENICMP3MA @Bit 0 : Enables DCDC current comparator */
  #define VREGMAIN_CONFIG_CFGSTATIC_ENICMP3MA_Pos (0UL) /*!< Position of ENICMP3MA field.                                      */
  #define VREGMAIN_CONFIG_CFGSTATIC_ENICMP3MA_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_ENICMP3MA_Pos) /*!< Bit mask of ENICMP3MA
                                                                            field.*/                                              
  #define VREGMAIN_CONFIG_CFGSTATIC_ENICMP3MA_Min (0x0UL) /*!< Min enumerator value of ENICMP3MA field.                        */
  #define VREGMAIN_CONFIG_CFGSTATIC_ENICMP3MA_Max (0x1UL) /*!< Max enumerator value of ENICMP3MA field.                        */
  #define VREGMAIN_CONFIG_CFGSTATIC_ENICMP3MA_Disabled (0x0UL) /*!< Configuration disabled                                     */
  #define VREGMAIN_CONFIG_CFGSTATIC_ENICMP3MA_Enabled (0x1UL) /*!< Configuration enabled                                       */

/* HSILIMMANUAL @Bit 1 : Overrides coil current limit to prog value */
  #define VREGMAIN_CONFIG_CFGSTATIC_HSILIMMANUAL_Pos (1UL) /*!< Position of HSILIMMANUAL field.                                */
  #define VREGMAIN_CONFIG_CFGSTATIC_HSILIMMANUAL_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_HSILIMMANUAL_Pos) /*!< Bit mask of
                                                                            HSILIMMANUAL field.*/                                 
  #define VREGMAIN_CONFIG_CFGSTATIC_HSILIMMANUAL_Min (0x0UL) /*!< Min enumerator value of HSILIMMANUAL field.                  */
  #define VREGMAIN_CONFIG_CFGSTATIC_HSILIMMANUAL_Max (0x1UL) /*!< Max enumerator value of HSILIMMANUAL field.                  */
  #define VREGMAIN_CONFIG_CFGSTATIC_HSILIMMANUAL_Disabled (0x0UL) /*!< Configuration disabled                                  */
  #define VREGMAIN_CONFIG_CFGSTATIC_HSILIMMANUAL_Enabled (0x1UL) /*!< Configuration enabled                                    */

