adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VREFVGNDREADY @Bit 2 : Vref gnd ready, alternative configuration */
  #define VREGMAIN_CONFIG_CFGSTATIC_VREFVGNDREADY_Pos (2UL) /*!< Position of VREFVGNDREADY field.                              */
  #define VREGMAIN_CONFIG_CFGSTATIC_VREFVGNDREADY_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_VREFVGNDREADY_Pos) /*!< Bit mask of
                                                                            VREFVGNDREADY field.*/                                
  #define VREGMAIN_CONFIG_CFGSTATIC_VREFVGNDREADY_Min (0x0UL) /*!< Min enumerator value of VREFVGNDREADY field.                */
  #define VREGMAIN_CONFIG_CFGSTATIC_VREFVGNDREADY_Max (0x1UL) /*!< Max enumerator value of VREFVGNDREADY field.                */
  #define VREGMAIN_CONFIG_CFGSTATIC_VREFVGNDREADY_Disabled (0x0UL) /*!< Configuration disabled                                 */
  #define VREGMAIN_CONFIG_CFGSTATIC_VREFVGNDREADY_Enabled (0x1UL) /*!< Configuration enabled                                   */

/* MIDDLEMODEBIAS @Bit 3 : Additional bias for enhanced response and ripple in LP hysteretic mode */
  #define VREGMAIN_CONFIG_CFGSTATIC_MIDDLEMODEBIAS_Pos (3UL) /*!< Position of MIDDLEMODEBIAS field.                            */
  #define VREGMAIN_CONFIG_CFGSTATIC_MIDDLEMODEBIAS_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_MIDDLEMODEBIAS_Pos) /*!< Bit mask of
                                                                            MIDDLEMODEBIAS field.*/                               
  #define VREGMAIN_CONFIG_CFGSTATIC_MIDDLEMODEBIAS_Min (0x0UL) /*!< Min enumerator value of MIDDLEMODEBIAS field.              */
  #define VREGMAIN_CONFIG_CFGSTATIC_MIDDLEMODEBIAS_Max (0x1UL) /*!< Max enumerator value of MIDDLEMODEBIAS field.              */
  #define VREGMAIN_CONFIG_CFGSTATIC_MIDDLEMODEBIAS_Disabled (0x0UL) /*!< Configuration disabled                                */
  #define VREGMAIN_CONFIG_CFGSTATIC_MIDDLEMODEBIAS_Enabled (0x1UL) /*!< Configuration enabled                                  */

/* ATCZ @Bit 4 : Enbles auto-zero function for P_DCCHV zero cross comparator */
  #define VREGMAIN_CONFIG_CFGSTATIC_ATCZ_Pos (4UL)   /*!< Position of ATCZ field.                                              */
  #define VREGMAIN_CONFIG_CFGSTATIC_ATCZ_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_ATCZ_Pos) /*!< Bit mask of ATCZ field.        */
  #define VREGMAIN_CONFIG_CFGSTATIC_ATCZ_Min (0x0UL) /*!< Min enumerator value of ATCZ field.                                  */
  #define VREGMAIN_CONFIG_CFGSTATIC_ATCZ_Max (0x1UL) /*!< Max enumerator value of ATCZ field.                                  */
  #define VREGMAIN_CONFIG_CFGSTATIC_ATCZ_Disabled (0x0UL) /*!< Configuration disabled                                          */
  #define VREGMAIN_CONFIG_CFGSTATIC_ATCZ_Enabled (0x1UL) /*!< Configuration enabled                                            */

/* PWMCC @Bit 5 : Enables clamp function in PWM mode */
  #define VREGMAIN_CONFIG_CFGSTATIC_PWMCC_Pos (5UL)  /*!< Position of PWMCC field.                                             */
  #define VREGMAIN_CONFIG_CFGSTATIC_PWMCC_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_PWMCC_Pos) /*!< Bit mask of PWMCC field.     */
  #define VREGMAIN_CONFIG_CFGSTATIC_PWMCC_Min (0x0UL) /*!< Min enumerator value of PWMCC field.                                */
  #define VREGMAIN_CONFIG_CFGSTATIC_PWMCC_Max (0x1UL) /*!< Max enumerator value of PWMCC field.                                */
  #define VREGMAIN_CONFIG_CFGSTATIC_PWMCC_Disabled (0x0UL) /*!< Configuration disabled                                         */
  #define VREGMAIN_CONFIG_CFGSTATIC_PWMCC_Enabled (0x1UL) /*!< Configuration enabled                                           */

/* HYSTCC @Bit 6 : Enables clamp function in HYST mode */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCC_Pos (6UL) /*!< Position of HYSTCC field.                                            */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCC_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_HYSTCC_Pos) /*!< Bit mask of HYSTCC field.  */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCC_Min (0x0UL) /*!< Min enumerator value of HYSTCC field.                              */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCC_Max (0x1UL) /*!< Max enumerator value of HYSTCC field.                              */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCC_Disabled (0x0UL) /*!< Configuration disabled                                        */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCC_Enabled (0x1UL) /*!< Configuration enabled                                          */

/* HYSTCTRL @Bit 7 : Controls amount of hysteresis */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCTRL_Pos (7UL) /*!< Position of HYSTCTRL field.                                        */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCTRL_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_HYSTCTRL_Pos) /*!< Bit mask of HYSTCTRL
                                                                            field.*/                                              
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCTRL_Min (0x0UL) /*!< Min enumerator value of HYSTCTRL field.                          */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCTRL_Max (0x1UL) /*!< Max enumerator value of HYSTCTRL field.                          */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCTRL_Hyst4mV (0x0UL) /*!< 4mV Hysteresis                                               */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTCTRL_Hyst8mV (0x1UL) /*!< 8mV hysteresis                                               */

/* HYSTRUNCTRL @Bit 8 : Hysteresis feedback control */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTRUNCTRL_Pos (8UL) /*!< Position of HYSTRUNCTRL field.                                  */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTRUNCTRL_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_HYSTRUNCTRL_Pos) /*!< Bit mask of
                                                                            HYSTRUNCTRL field.*/                                  
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTRUNCTRL_Min (0x0UL) /*!< Min enumerator value of HYSTRUNCTRL field.                    */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTRUNCTRL_Max (0x1UL) /*!< Max enumerator value of HYSTRUNCTRL field.                    */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTRUNCTRL_HystVoutCmp (0x0UL) /*!< Hysteresis feedback from VOUTCMP                      */
  #define VREGMAIN_CONFIG_CFGSTATIC_HYSTRUNCTRL_HystMbiasCore (0x1UL) /*!< Hysteresis feedback on MBIAS_CORE pwrup             */

/* BIASTSAMPLE @Bit 9 : Elongates sample time for VREFs */
  #define VREGMAIN_CONFIG_CFGSTATIC_BIASTSAMPLE_Pos (9UL) /*!< Position of BIASTSAMPLE field.                                  */
  #define VREGMAIN_CONFIG_CFGSTATIC_BIASTSAMPLE_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_BIASTSAMPLE_Pos) /*!< Bit mask of
                                                                            BIASTSAMPLE field.*/                                  
  #define VREGMAIN_CONFIG_CFGSTATIC_BIASTSAMPLE_Min (0x0UL) /*!< Min enumerator value of BIASTSAMPLE field.                    */
  #define VREGMAIN_CONFIG_CFGSTATIC_BIASTSAMPLE_Max (0x1UL) /*!< Max enumerator value of BIASTSAMPLE field.                    */
  #define VREGMAIN_CONFIG_CFGSTATIC_BIASTSAMPLE_Disabled (0x0UL) /*!< Configuration disabled                                   */
  #define VREGMAIN_CONFIG_CFGSTATIC_BIASTSAMPLE_Enabled (0x1UL) /*!< Configuration enabled                                     */

