adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* DISULPOD @Bit 10 : Keep nominal hysteresis in ULP mode. Will scale up with this configuration Disabled */
  #define VREGMAIN_CONFIG_CFGSTATIC_DISULPOD_Pos (10UL) /*!< Position of DISULPOD field.                                       */
  #define VREGMAIN_CONFIG_CFGSTATIC_DISULPOD_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_DISULPOD_Pos) /*!< Bit mask of DISULPOD
                                                                            field.*/                                              
  #define VREGMAIN_CONFIG_CFGSTATIC_DISULPOD_Min (0x0UL) /*!< Min enumerator value of DISULPOD field.                          */
  #define VREGMAIN_CONFIG_CFGSTATIC_DISULPOD_Max (0x1UL) /*!< Max enumerator value of DISULPOD field.                          */
  #define VREGMAIN_CONFIG_CFGSTATIC_DISULPOD_Disabled (0x0UL) /*!< Configuration disabled                                      */
  #define VREGMAIN_CONFIG_CFGSTATIC_DISULPOD_Enabled (0x1UL) /*!< Configuration enabled                                        */

/* ANAOSCDIVBY2 @Bit 11 : Divides OSC_ANA_RFR clock by 2 */
  #define VREGMAIN_CONFIG_CFGSTATIC_ANAOSCDIVBY2_Pos (11UL) /*!< Position of ANAOSCDIVBY2 field.                               */
  #define VREGMAIN_CONFIG_CFGSTATIC_ANAOSCDIVBY2_Msk (0x1UL << VREGMAIN_CONFIG_CFGSTATIC_ANAOSCDIVBY2_Pos) /*!< Bit mask of
                                                                            ANAOSCDIVBY2 field.*/                                 
  #define VREGMAIN_CONFIG_CFGSTATIC_ANAOSCDIVBY2_Min (0x0UL) /*!< Min enumerator value of ANAOSCDIVBY2 field.                  */
  #define VREGMAIN_CONFIG_CFGSTATIC_ANAOSCDIVBY2_Max (0x1UL) /*!< Max enumerator value of ANAOSCDIVBY2 field.                  */
  #define VREGMAIN_CONFIG_CFGSTATIC_ANAOSCDIVBY2_Disabled (0x0UL) /*!< Configuration disabled                                  */
  #define VREGMAIN_CONFIG_CFGSTATIC_ANAOSCDIVBY2_Enabled (0x1UL) /*!< Configuration enabled                                    */


/* VREGMAIN_CONFIG_CFGCH1: VREGMAIN CH1 configuration */
  #define VREGMAIN_CONFIG_CFGCH1_ResetValue (0x00000000UL) /*!< Reset value of CFGCH1 register.                                */

/* ENDUTYLIM1 @Bit 0 : Maximum duty cycle limitation */
  #define VREGMAIN_CONFIG_CFGCH1_ENDUTYLIM1_Pos (0UL) /*!< Position of ENDUTYLIM1 field.                                       */
  #define VREGMAIN_CONFIG_CFGCH1_ENDUTYLIM1_Msk (0x1UL << VREGMAIN_CONFIG_CFGCH1_ENDUTYLIM1_Pos) /*!< Bit mask of ENDUTYLIM1
                                                                            field.*/                                              
  #define VREGMAIN_CONFIG_CFGCH1_ENDUTYLIM1_Min (0x0UL) /*!< Min enumerator value of ENDUTYLIM1 field.                         */
  #define VREGMAIN_CONFIG_CFGCH1_ENDUTYLIM1_Max (0x1UL) /*!< Max enumerator value of ENDUTYLIM1 field.                         */
  #define VREGMAIN_CONFIG_CFGCH1_ENDUTYLIM1_Disabled (0x0UL) /*!< Configuration disabled                                       */
  #define VREGMAIN_CONFIG_CFGCH1_ENDUTYLIM1_Enabled (0x1UL) /*!< Configuration enabled                                         */

/* FASTPWM1 @Bit 1 : Faster loop for PWM modulator */
  #define VREGMAIN_CONFIG_CFGCH1_FASTPWM1_Pos (1UL)  /*!< Position of FASTPWM1 field.                                          */
  #define VREGMAIN_CONFIG_CFGCH1_FASTPWM1_Msk (0x1UL << VREGMAIN_CONFIG_CFGCH1_FASTPWM1_Pos) /*!< Bit mask of FASTPWM1 field.  */
  #define VREGMAIN_CONFIG_CFGCH1_FASTPWM1_Min (0x0UL) /*!< Min enumerator value of FASTPWM1 field.                             */
  #define VREGMAIN_CONFIG_CFGCH1_FASTPWM1_Max (0x1UL) /*!< Max enumerator value of FASTPWM1 field.                             */
  #define VREGMAIN_CONFIG_CFGCH1_FASTPWM1_Disabled (0x0UL) /*!< Configuration disabled                                         */
  #define VREGMAIN_CONFIG_CFGCH1_FASTPWM1_Enabled (0x1UL) /*!< Configuration enabled                                           */

/* BIASBOOSTLP1 @Bit 2 : Doubles bias current for VOUTCMP */
  #define VREGMAIN_CONFIG_CFGCH1_BIASBOOSTLP1_Pos (2UL) /*!< Position of BIASBOOSTLP1 field.                                   */
  #define VREGMAIN_CONFIG_CFGCH1_BIASBOOSTLP1_Msk (0x1UL << VREGMAIN_CONFIG_CFGCH1_BIASBOOSTLP1_Pos) /*!< Bit mask of
                                                                            BIASBOOSTLP1 field.*/                                 
  #define VREGMAIN_CONFIG_CFGCH1_BIASBOOSTLP1_Min (0x0UL) /*!< Min enumerator value of BIASBOOSTLP1 field.                     */
  #define VREGMAIN_CONFIG_CFGCH1_BIASBOOSTLP1_Max (0x1UL) /*!< Max enumerator value of BIASBOOSTLP1 field.                     */
  #define VREGMAIN_CONFIG_CFGCH1_BIASBOOSTLP1_Disabled (0x0UL) /*!< Configuration disabled                                     */
  #define VREGMAIN_CONFIG_CFGCH1_BIASBOOSTLP1_Enabled (0x1UL) /*!< Configuration enabled                                       */


/* VREGMAIN_CONFIG_CFGCH2: VREGMAIN CH2 configuration */
  #define VREGMAIN_CONFIG_CFGCH2_ResetValue (0x00000000UL) /*!< Reset value of CFGCH2 register.                                */

/* ENDUTYLIM2 @Bit 0 : Maximum duty cycle limitation */
  #define VREGMAIN_CONFIG_CFGCH2_ENDUTYLIM2_Pos (0UL) /*!< Position of ENDUTYLIM2 field.                                       */
  #define VREGMAIN_CONFIG_CFGCH2_ENDUTYLIM2_Msk (0x1UL << VREGMAIN_CONFIG_CFGCH2_ENDUTYLIM2_Pos) /*!< Bit mask of ENDUTYLIM2
                                                                            field.*/                                              
  #define VREGMAIN_CONFIG_CFGCH2_ENDUTYLIM2_Min (0x0UL) /*!< Min enumerator value of ENDUTYLIM2 field.                         */
  #define VREGMAIN_CONFIG_CFGCH2_ENDUTYLIM2_Max (0x1UL) /*!< Max enumerator value of ENDUTYLIM2 field.                         */
  #define VREGMAIN_CONFIG_CFGCH2_ENDUTYLIM2_Disabled (0x0UL) /*!< Configuration disabled                                       */
  #define VREGMAIN_CONFIG_CFGCH2_ENDUTYLIM2_Enabled (0x1UL) /*!< Configuration enabled                                         */

/* FASTPWM2 @Bit 1 : Faster loop for PWM modulator */
  #define VREGMAIN_CONFIG_CFGCH2_FASTPWM2_Pos (1UL)  /*!< Position of FASTPWM2 field.                                          */
  #define VREGMAIN_CONFIG_CFGCH2_FASTPWM2_Msk (0x1UL << VREGMAIN_CONFIG_CFGCH2_FASTPWM2_Pos) /*!< Bit mask of FASTPWM2 field.  */
  #define VREGMAIN_CONFIG_CFGCH2_FASTPWM2_Min (0x0UL) /*!< Min enumerator value of FASTPWM2 field.                             */
  #define VREGMAIN_CONFIG_CFGCH2_FASTPWM2_Max (0x1UL) /*!< Max enumerator value of FASTPWM2 field.                             */
  #define VREGMAIN_CONFIG_CFGCH2_FASTPWM2_Disabled (0x0UL) /*!< Configuration disabled                                         */
  #define VREGMAIN_CONFIG_CFGCH2_FASTPWM2_Enabled (0x1UL) /*!< Configuration enabled                                           */

/* BIASBOOSTLP2 @Bit 2 : Doubles bias current for VOUTCMP */
  #define VREGMAIN_CONFIG_CFGCH2_BIASBOOSTLP2_Pos (2UL) /*!< Position of BIASBOOSTLP2 field.                                   */
  #define VREGMAIN_CONFIG_CFGCH2_BIASBOOSTLP2_Msk (0x1UL << VREGMAIN_CONFIG_CFGCH2_BIASBOOSTLP2_Pos) /*!< Bit mask of
                                                                            BIASBOOSTLP2 field.*/                                 
  #define VREGMAIN_CONFIG_CFGCH2_BIASBOOSTLP2_Min (0x0UL) /*!< Min enumerator value of BIASBOOSTLP2 field.                     */
  #define VREGMAIN_CONFIG_CFGCH2_BIASBOOSTLP2_Max (0x1UL) /*!< Max enumerator value of BIASBOOSTLP2 field.                     */
  #define VREGMAIN_CONFIG_CFGCH2_BIASBOOSTLP2_Disabled (0x0UL) /*!< Configuration disabled                                     */
  #define VREGMAIN_CONFIG_CFGCH2_BIASBOOSTLP2_Enabled (0x1UL) /*!< Configuration enabled                                       */

/* DISVOUTCMPLP2 @Bit 3 : Disables VOUT comparator in LP mode */
  #define VREGMAIN_CONFIG_CFGCH2_DISVOUTCMPLP2_Pos (3UL) /*!< Position of DISVOUTCMPLP2 field.                                 */
  #define VREGMAIN_CONFIG_CFGCH2_DISVOUTCMPLP2_Msk (0x1UL << VREGMAIN_CONFIG_CFGCH2_DISVOUTCMPLP2_Pos) /*!< Bit mask of
                                                                            DISVOUTCMPLP2 field.*/                                
  #define VREGMAIN_CONFIG_CFGCH2_DISVOUTCMPLP2_Min (0x0UL) /*!< Min enumerator value of DISVOUTCMPLP2 field.                   */
  #define VREGMAIN_CONFIG_CFGCH2_DISVOUTCMPLP2_Max (0x1UL) /*!< Max enumerator value of DISVOUTCMPLP2 field.                   */
  #define VREGMAIN_CONFIG_CFGCH2_DISVOUTCMPLP2_Disabled (0x0UL) /*!< Configuration disabled                                    */
  #define VREGMAIN_CONFIG_CFGCH2_DISVOUTCMPLP2_Enabled (0x1UL) /*!< Configuration enabled                                      */


