adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VREGMAIN_TRIM_VDDAO1V8PWMOUTPUT: VDD_AO_1V8 PWM output voltage trimming */
  #define VREGMAIN_TRIM_VDDAO1V8PWMOUTPUT_ResetValue (0x00000000UL) /*!< Reset value of VDDAO1V8PWMOUTPUT register.            */

/* VAL @Bits 0..3 : Trim value */
  #define VREGMAIN_TRIM_VDDAO1V8PWMOUTPUT_VAL_Pos (0UL) /*!< Position of VAL field.                                            */
  #define VREGMAIN_TRIM_VDDAO1V8PWMOUTPUT_VAL_Msk (0xFUL << VREGMAIN_TRIM_VDDAO1V8PWMOUTPUT_VAL_Pos) /*!< Bit mask of VAL
                                                                            field.*/                                              
  #define VREGMAIN_TRIM_VDDAO1V8PWMOUTPUT_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                  */
  #define VREGMAIN_TRIM_VDDAO1V8PWMOUTPUT_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                   */


/* VREGMAIN_TRIM_VDD1V0HYSTOUTPUT: VDD_1V0 hysteretic (HYST) output voltage trimming */
  #define VREGMAIN_TRIM_VDD1V0HYSTOUTPUT_ResetValue (0x00000000UL) /*!< Reset value of VDD1V0HYSTOUTPUT register.              */

/* VAL @Bits 0..3 : Trim value */
  #define VREGMAIN_TRIM_VDD1V0HYSTOUTPUT_VAL_Pos (0UL) /*!< Position of VAL field.                                             */
  #define VREGMAIN_TRIM_VDD1V0HYSTOUTPUT_VAL_Msk (0xFUL << VREGMAIN_TRIM_VDD1V0HYSTOUTPUT_VAL_Pos) /*!< Bit mask of VAL field. */
  #define VREGMAIN_TRIM_VDD1V0HYSTOUTPUT_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                   */
  #define VREGMAIN_TRIM_VDD1V0HYSTOUTPUT_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                    */


/* VREGMAIN_TRIM_VDDVS0V8HYSTOUTPUT: VDD_VS_0V8 hysteretic (HYST) output voltage trimming */
  #define VREGMAIN_TRIM_VDDVS0V8HYSTOUTPUT_ResetValue (0x00000000UL) /*!< Reset value of VDDVS0V8HYSTOUTPUT register.          */

/* VAL @Bits 0..3 : Trim value */
  #define VREGMAIN_TRIM_VDDVS0V8HYSTOUTPUT_VAL_Pos (0UL) /*!< Position of VAL field.                                           */
  #define VREGMAIN_TRIM_VDDVS0V8HYSTOUTPUT_VAL_Msk (0xFUL << VREGMAIN_TRIM_VDDVS0V8HYSTOUTPUT_VAL_Pos) /*!< Bit mask of VAL
                                                                            field.*/                                              
  #define VREGMAIN_TRIM_VDDVS0V8HYSTOUTPUT_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                 */
  #define VREGMAIN_TRIM_VDDVS0V8HYSTOUTPUT_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                  */


/* VREGMAIN_TRIM_VDDVS0V8PWMOUTPUT: VDD_VS_0V8 PWM output voltage trimming */
  #define VREGMAIN_TRIM_VDDVS0V8PWMOUTPUT_ResetValue (0x00000000UL) /*!< Reset value of VDDVS0V8PWMOUTPUT register.            */

/* VAL @Bits 0..3 : Trim value */
  #define VREGMAIN_TRIM_VDDVS0V8PWMOUTPUT_VAL_Pos (0UL) /*!< Position of VAL field.                                            */
  #define VREGMAIN_TRIM_VDDVS0V8PWMOUTPUT_VAL_Msk (0xFUL << VREGMAIN_TRIM_VDDVS0V8PWMOUTPUT_VAL_Pos) /*!< Bit mask of VAL
                                                                            field.*/                                              
  #define VREGMAIN_TRIM_VDDVS0V8PWMOUTPUT_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                  */
  #define VREGMAIN_TRIM_VDDVS0V8PWMOUTPUT_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                   */


/* VREGMAIN_TRIM_VDD1V0PWMOUTPUT: VDD_1V0 PWM output voltage trimming */
  #define VREGMAIN_TRIM_VDD1V0PWMOUTPUT_ResetValue (0x00000000UL) /*!< Reset value of VDD1V0PWMOUTPUT register.                */

/* VAL @Bits 0..3 : Voltage value */
  #define VREGMAIN_TRIM_VDD1V0PWMOUTPUT_VAL_Pos (0UL) /*!< Position of VAL field.                                              */
  #define VREGMAIN_TRIM_VDD1V0PWMOUTPUT_VAL_Msk (0xFUL << VREGMAIN_TRIM_VDD1V0PWMOUTPUT_VAL_Pos) /*!< Bit mask of VAL field.   */
  #define VREGMAIN_TRIM_VDD1V0PWMOUTPUT_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                    */
  #define VREGMAIN_TRIM_VDD1V0PWMOUTPUT_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                     */


/* VREGMAIN_TRIM_ZCROSS: Zero cross detector trimming */
  #define VREGMAIN_TRIM_ZCROSS_ResetValue (0x00000000UL) /*!< Reset value of ZCROSS register.                                  */

/* VAL @Bits 0..3 : Trim value */
  #define VREGMAIN_TRIM_ZCROSS_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define VREGMAIN_TRIM_ZCROSS_VAL_Msk (0xFUL << VREGMAIN_TRIM_ZCROSS_VAL_Pos) /*!< Bit mask of VAL field.                     */
  #define VREGMAIN_TRIM_ZCROSS_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                             */
  #define VREGMAIN_TRIM_ZCROSS_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                              */


/* VREGMAIN_TRIM_HSILIM: HS current limiter trimming */
  #define VREGMAIN_TRIM_HSILIM_ResetValue (0x00000000UL) /*!< Reset value of HSILIM register.                                  */

/* VAL @Bits 0..2 : Trim value */
  #define VREGMAIN_TRIM_HSILIM_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define VREGMAIN_TRIM_HSILIM_VAL_Msk (0x7UL << VREGMAIN_TRIM_HSILIM_VAL_Pos) /*!< Bit mask of VAL field.                     */
  #define VREGMAIN_TRIM_HSILIM_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                             */
  #define VREGMAIN_TRIM_HSILIM_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                              */


/* VREGMAIN_TRIM_ICMP: DCDC output current comparator trimming */
  #define VREGMAIN_TRIM_ICMP_ResetValue (0x00000000UL) /*!< Reset value of ICMP register.                                      */

/* VAL @Bits 0..1 : Trim value */
  #define VREGMAIN_TRIM_ICMP_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define VREGMAIN_TRIM_ICMP_VAL_Msk (0x3UL << VREGMAIN_TRIM_ICMP_VAL_Pos) /*!< Bit mask of VAL field.                         */
  #define VREGMAIN_TRIM_ICMP_VAL_Min (0x0UL)         /*!< Min enumerator value of VAL field.                                   */
  #define VREGMAIN_TRIM_ICMP_VAL_Max (0x3UL)         /*!< Max enumerator value of VAL field.                                   */
  #define VREGMAIN_TRIM_ICMP_VAL_Val0 (0x0UL)        /*!< DCDC output current comparator trim 0 percent                        */
  #define VREGMAIN_TRIM_ICMP_VAL_Val25 (0x1UL)       /*!< DCDC output current comparator trim 25 percent                       */
  #define VREGMAIN_TRIM_ICMP_VAL_ValNeg50 (0x2UL)    /*!< DCDC output current comparator trim -50 percent                      */
  #define VREGMAIN_TRIM_ICMP_VAL_ValNeg25 (0x3UL)    /*!< DCDC output current comparator trim -25 percent                      */


/* VREGMAIN_TRIM_VGND: VGND trim */
  #define VREGMAIN_TRIM_VGND_ResetValue (0x00000000UL) /*!< Reset value of VGND register.                                      */

/* VAL @Bits 0..1 : Trim value */
  #define VREGMAIN_TRIM_VGND_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define VREGMAIN_TRIM_VGND_VAL_Msk (0x3UL << VREGMAIN_TRIM_VGND_VAL_Pos) /*!< Bit mask of VAL field.                         */
  #define VREGMAIN_TRIM_VGND_VAL_Min (0xFFFFFFFFUL)  /*!< Min value of VAL field.                                              */
  #define VREGMAIN_TRIM_VGND_VAL_Max (0xFFFFFFFFUL)  /*!< Max size of VAL field.                                               */



/* ================================================ Struct VREGMAIN_OVERRIDE ================================================= */
/**
  * @brief OVERRIDE [VREGMAIN_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  MODELP;                            /*!< (@ 0x00000008) Override the MODE_LP signal to the analog module      */
  __IOM uint32_t  MODEULP;                           /*!< (@ 0x0000000C) Override the MODE_ULP signal to the analog module     */
  __IOM uint32_t  MODEPWM;                           /*!< (@ 0x00000010) Override the MODE_PWM signal to the analog module     */
  __IOM uint32_t  VOLT1V0HPBANK;                     /*!< (@ 0x00000014) Override the VOLT_HP_VDD1V0 bank select multiplexer   */
  __IOM uint32_t  VOLT1V0LPBANK;                     /*!< (@ 0x00000018) Override the VOLT_LP_VDD1V0 bank select multiplexer   */
  __IOM uint32_t  CFGALLSTATIC;                      /*!< (@ 0x0000001C) Route all CFG bits as static CFGs                     */
  __IOM uint32_t  ENCH1;                             /*!< (@ 0x00000020) Override the EN_CH1 signal to the analog module       */
  __IOM uint32_t  ENCH2;                             /*!< (@ 0x00000024) Override the EN_CH2 signal to the analog module       */
  __IOM uint32_t  ENCH3;                             /*!< (@ 0x00000028) Override the EN_CH3 signal to the analog module       */
  __IOM uint32_t  READY;                             /*!< (@ 0x0000002C) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLEDMODE;                       /*!< (@ 0x00000030) Override the SETTLED_MODE signal from the analog
                                                                         module*/                                                 
  __IOM uint32_t  SETTLEDCH1;                        /*!< (@ 0x00000034) Override the CH1 SETTLED signal from the analog module*/
  __IOM uint32_t  SETTLEDCH2;                        /*!< (@ 0x00000038) Override the CH2 SETTLED signal from the analog module*/
  __IOM uint32_t  SETTLEDCH3;                        /*!< (@ 0x0000003C) Override the CH3 SETTLED signal from the analog module*/
  __IOM uint32_t  CHRGCH1;                           /*!< (@ 0x00000040) Override the CH1 CHRG signal from the analog module   */
  __IOM uint32_t  CHRGCH2;                           /*!< (@ 0x00000044) Override the CH2 CHRG signal from the analog module   */
  __IOM uint32_t  CHRGCH3;                           /*!< (@ 0x00000048) Override the CH3 CHRG signal from the analog module   */
  __IOM uint32_t  ICMP;                              /*!< (@ 0x0000004C) Override the ICMP signal from the analog module       */
} NRF_VREGMAIN_OVERRIDE_Type;                        /*!< Size = 80 (0x050)                                                    */

/* VREGMAIN_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define VREGMAIN_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                                */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGMAIN_OVERRIDE_PWRUP_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREGMAIN_OVERRIDE_PWRUP_VAL_Msk (0x1UL << VREGMAIN_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.               */

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_PWRUP_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREGMAIN_OVERRIDE_PWRUP_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREGMAIN_OVERRIDE_PWRUP_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_PWRUP_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_PWRUP_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define VREGMAIN_OVERRIDE_PWRUP_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */


/* VREGMAIN_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define VREGMAIN_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                              */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGMAIN_OVERRIDE_RETAIN_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VREGMAIN_OVERRIDE_RETAIN_VAL_Msk (0x1UL << VREGMAIN_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_RETAIN_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGMAIN_OVERRIDE_RETAIN_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGMAIN_OVERRIDE_RETAIN_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_RETAIN_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_RETAIN_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VREGMAIN_OVERRIDE_RETAIN_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* VREGMAIN_OVERRIDE_MODELP: Override the MODE_LP signal to the analog module */
  #define VREGMAIN_OVERRIDE_MODELP_ResetValue (0x00000000UL) /*!< Reset value of MODELP register.                              */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGMAIN_OVERRIDE_MODELP_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VREGMAIN_OVERRIDE_MODELP_VAL_Msk (0x1UL << VREGMAIN_OVERRIDE_MODELP_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_MODELP_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGMAIN_OVERRIDE_MODELP_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_MODELP_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGMAIN_OVERRIDE_MODELP_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_MODELP_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_MODELP_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VREGMAIN_OVERRIDE_MODELP_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* VREGMAIN_OVERRIDE_MODEULP: Override the MODE_ULP signal to the analog module */
  #define VREGMAIN_OVERRIDE_MODEULP_ResetValue (0x00000000UL) /*!< Reset value of MODEULP register.                            */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGMAIN_OVERRIDE_MODEULP_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VREGMAIN_OVERRIDE_MODEULP_VAL_Msk (0x1UL << VREGMAIN_OVERRIDE_MODEULP_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_MODEULP_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VREGMAIN_OVERRIDE_MODEULP_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_MODEULP_EN_Pos) /*!< Bit mask of EN field.              */
  #define VREGMAIN_OVERRIDE_MODEULP_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_MODEULP_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_MODEULP_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VREGMAIN_OVERRIDE_MODEULP_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* VREGMAIN_OVERRIDE_MODEPWM: Override the MODE_PWM signal to the analog module */
  #define VREGMAIN_OVERRIDE_MODEPWM_ResetValue (0x00000000UL) /*!< Reset value of MODEPWM register.                            */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGMAIN_OVERRIDE_MODEPWM_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VREGMAIN_OVERRIDE_MODEPWM_VAL_Msk (0x1UL << VREGMAIN_OVERRIDE_MODEPWM_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_MODEPWM_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VREGMAIN_OVERRIDE_MODEPWM_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_MODEPWM_EN_Pos) /*!< Bit mask of EN field.              */
  #define VREGMAIN_OVERRIDE_MODEPWM_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_MODEPWM_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_MODEPWM_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VREGMAIN_OVERRIDE_MODEPWM_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* VREGMAIN_OVERRIDE_VOLT1V0HPBANK: Override the VOLT_HP_VDD1V0 bank select multiplexer */
  #define VREGMAIN_OVERRIDE_VOLT1V0HPBANK_ResetValue (0x00000000UL) /*!< Reset value of VOLT1V0HPBANK register.                */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGMAIN_OVERRIDE_VOLT1V0HPBANK_VAL_Pos (0UL) /*!< Position of VAL field.                                            */
  #define VREGMAIN_OVERRIDE_VOLT1V0HPBANK_VAL_Msk (0x1UL << VREGMAIN_OVERRIDE_VOLT1V0HPBANK_VAL_Pos) /*!< Bit mask of VAL
                                                                            field.*/                                              

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_VOLT1V0HPBANK_EN_Pos (31UL) /*!< Position of EN field.                                             */
  #define VREGMAIN_OVERRIDE_VOLT1V0HPBANK_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_VOLT1V0HPBANK_EN_Pos) /*!< Bit mask of EN field.  */
  #define VREGMAIN_OVERRIDE_VOLT1V0HPBANK_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                */
  #define VREGMAIN_OVERRIDE_VOLT1V0HPBANK_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                */
  #define VREGMAIN_OVERRIDE_VOLT1V0HPBANK_EN_Disabled (0x0UL) /*!< Override is disabled                                        */
  #define VREGMAIN_OVERRIDE_VOLT1V0HPBANK_EN_Enabled (0x1UL) /*!< Override is enabled                                          */


/* VREGMAIN_OVERRIDE_VOLT1V0LPBANK: Override the VOLT_LP_VDD1V0 bank select multiplexer */
  #define VREGMAIN_OVERRIDE_VOLT1V0LPBANK_ResetValue (0x00000000UL) /*!< Reset value of VOLT1V0LPBANK register.                */

/* VAL @Bits 0..1 : Override value for the signal */
  #define VREGMAIN_OVERRIDE_VOLT1V0LPBANK_VAL_Pos (0UL) /*!< Position of VAL field.                                            */
  #define VREGMAIN_OVERRIDE_VOLT1V0LPBANK_VAL_Msk (0x3UL << VREGMAIN_OVERRIDE_VOLT1V0LPBANK_VAL_Pos) /*!< Bit mask of VAL
                                                                            field.*/                                              

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_VOLT1V0LPBANK_EN_Pos (31UL) /*!< Position of EN field.                                             */
  #define VREGMAIN_OVERRIDE_VOLT1V0LPBANK_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_VOLT1V0LPBANK_EN_Pos) /*!< Bit mask of EN field.  */
  #define VREGMAIN_OVERRIDE_VOLT1V0LPBANK_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                */
  #define VREGMAIN_OVERRIDE_VOLT1V0LPBANK_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                */
  #define VREGMAIN_OVERRIDE_VOLT1V0LPBANK_EN_Disabled (0x0UL) /*!< Override is disabled                                        */
  #define VREGMAIN_OVERRIDE_VOLT1V0LPBANK_EN_Enabled (0x1UL) /*!< Override is enabled                                          */


/* VREGMAIN_OVERRIDE_CFGALLSTATIC: Route all CFG bits as static CFGs */
  #define VREGMAIN_OVERRIDE_CFGALLSTATIC_ResetValue (0x00000000UL) /*!< Reset value of CFGALLSTATIC register.                  */

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_CFGALLSTATIC_EN_Pos (31UL) /*!< Position of EN field.                                              */
  #define VREGMAIN_OVERRIDE_CFGALLSTATIC_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_CFGALLSTATIC_EN_Pos) /*!< Bit mask of EN field.    */
  #define VREGMAIN_OVERRIDE_CFGALLSTATIC_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                 */
  #define VREGMAIN_OVERRIDE_CFGALLSTATIC_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                 */
  #define VREGMAIN_OVERRIDE_CFGALLSTATIC_EN_Disabled (0x0UL) /*!< Override is disabled                                         */
  #define VREGMAIN_OVERRIDE_CFGALLSTATIC_EN_Enabled (0x1UL) /*!< Override is enabled                                           */


/* VREGMAIN_OVERRIDE_ENCH1: Override the EN_CH1 signal to the analog module */
  #define VREGMAIN_OVERRIDE_ENCH1_ResetValue (0x00000000UL) /*!< Reset value of ENCH1 register.                                */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGMAIN_OVERRIDE_ENCH1_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREGMAIN_OVERRIDE_ENCH1_VAL_Msk (0x1UL << VREGMAIN_OVERRIDE_ENCH1_VAL_Pos) /*!< Bit mask of VAL field.               */

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_ENCH1_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREGMAIN_OVERRIDE_ENCH1_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_ENCH1_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREGMAIN_OVERRIDE_ENCH1_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_ENCH1_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_ENCH1_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define VREGMAIN_OVERRIDE_ENCH1_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */


/* VREGMAIN_OVERRIDE_ENCH2: Override the EN_CH2 signal to the analog module */
  #define VREGMAIN_OVERRIDE_ENCH2_ResetValue (0x00000000UL) /*!< Reset value of ENCH2 register.                                */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGMAIN_OVERRIDE_ENCH2_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREGMAIN_OVERRIDE_ENCH2_VAL_Msk (0x1UL << VREGMAIN_OVERRIDE_ENCH2_VAL_Pos) /*!< Bit mask of VAL field.               */

