adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_ENCH2_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREGMAIN_OVERRIDE_ENCH2_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_ENCH2_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREGMAIN_OVERRIDE_ENCH2_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_ENCH2_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_ENCH2_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define VREGMAIN_OVERRIDE_ENCH2_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */


/* VREGMAIN_OVERRIDE_ENCH3: Override the EN_CH3 signal to the analog module */
  #define VREGMAIN_OVERRIDE_ENCH3_ResetValue (0x00000000UL) /*!< Reset value of ENCH3 register.                                */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGMAIN_OVERRIDE_ENCH3_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREGMAIN_OVERRIDE_ENCH3_VAL_Msk (0x1UL << VREGMAIN_OVERRIDE_ENCH3_VAL_Pos) /*!< Bit mask of VAL field.               */

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_ENCH3_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREGMAIN_OVERRIDE_ENCH3_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_ENCH3_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREGMAIN_OVERRIDE_ENCH3_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_ENCH3_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_ENCH3_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define VREGMAIN_OVERRIDE_ENCH3_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */


/* VREGMAIN_OVERRIDE_READY: Override the READY signal from the analog module */
  #define VREGMAIN_OVERRIDE_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                                */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGMAIN_OVERRIDE_READY_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VREGMAIN_OVERRIDE_READY_VAL_Msk (0x1UL << VREGMAIN_OVERRIDE_READY_VAL_Pos) /*!< Bit mask of VAL field.               */

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_READY_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREGMAIN_OVERRIDE_READY_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_READY_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREGMAIN_OVERRIDE_READY_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_READY_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_READY_EN_Disabled (0x0UL) /*!< Override is disabled                                                */
  #define VREGMAIN_OVERRIDE_READY_EN_Enabled (0x1UL) /*!< Override is enabled                                                  */


/* VREGMAIN_OVERRIDE_SETTLEDMODE: Override the SETTLED_MODE signal from the analog module */
  #define VREGMAIN_OVERRIDE_SETTLEDMODE_ResetValue (0x00000000UL) /*!< Reset value of SETTLEDMODE register.                    */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGMAIN_OVERRIDE_SETTLEDMODE_VAL_Pos (0UL) /*!< Position of VAL field.                                              */
  #define VREGMAIN_OVERRIDE_SETTLEDMODE_VAL_Msk (0x1UL << VREGMAIN_OVERRIDE_SETTLEDMODE_VAL_Pos) /*!< Bit mask of VAL field.   */

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_SETTLEDMODE_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define VREGMAIN_OVERRIDE_SETTLEDMODE_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_SETTLEDMODE_EN_Pos) /*!< Bit mask of EN field.      */
  #define VREGMAIN_OVERRIDE_SETTLEDMODE_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define VREGMAIN_OVERRIDE_SETTLEDMODE_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define VREGMAIN_OVERRIDE_SETTLEDMODE_EN_Disabled (0x0UL) /*!< Override is disabled                                          */
  #define VREGMAIN_OVERRIDE_SETTLEDMODE_EN_Enabled (0x1UL) /*!< Override is enabled                                            */


/* VREGMAIN_OVERRIDE_SETTLEDCH1: Override the CH1 SETTLED signal from the analog module */
  #define VREGMAIN_OVERRIDE_SETTLEDCH1_ResetValue (0x00000000UL) /*!< Reset value of SETTLEDCH1 register.                      */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGMAIN_OVERRIDE_SETTLEDCH1_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define VREGMAIN_OVERRIDE_SETTLEDCH1_VAL_Msk (0x1UL << VREGMAIN_OVERRIDE_SETTLEDCH1_VAL_Pos) /*!< Bit mask of VAL field.     */

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_SETTLEDCH1_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define VREGMAIN_OVERRIDE_SETTLEDCH1_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_SETTLEDCH1_EN_Pos) /*!< Bit mask of EN field.        */
  #define VREGMAIN_OVERRIDE_SETTLEDCH1_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define VREGMAIN_OVERRIDE_SETTLEDCH1_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define VREGMAIN_OVERRIDE_SETTLEDCH1_EN_Disabled (0x0UL) /*!< Override is disabled                                           */
  #define VREGMAIN_OVERRIDE_SETTLEDCH1_EN_Enabled (0x1UL) /*!< Override is enabled                                             */


/* VREGMAIN_OVERRIDE_SETTLEDCH2: Override the CH2 SETTLED signal from the analog module */
  #define VREGMAIN_OVERRIDE_SETTLEDCH2_ResetValue (0x00000000UL) /*!< Reset value of SETTLEDCH2 register.                      */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGMAIN_OVERRIDE_SETTLEDCH2_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define VREGMAIN_OVERRIDE_SETTLEDCH2_VAL_Msk (0x1UL << VREGMAIN_OVERRIDE_SETTLEDCH2_VAL_Pos) /*!< Bit mask of VAL field.     */

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_SETTLEDCH2_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define VREGMAIN_OVERRIDE_SETTLEDCH2_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_SETTLEDCH2_EN_Pos) /*!< Bit mask of EN field.        */
  #define VREGMAIN_OVERRIDE_SETTLEDCH2_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define VREGMAIN_OVERRIDE_SETTLEDCH2_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define VREGMAIN_OVERRIDE_SETTLEDCH2_EN_Disabled (0x0UL) /*!< Override is disabled                                           */
  #define VREGMAIN_OVERRIDE_SETTLEDCH2_EN_Enabled (0x1UL) /*!< Override is enabled                                             */


/* VREGMAIN_OVERRIDE_SETTLEDCH3: Override the CH3 SETTLED signal from the analog module */
  #define VREGMAIN_OVERRIDE_SETTLEDCH3_ResetValue (0x00000000UL) /*!< Reset value of SETTLEDCH3 register.                      */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGMAIN_OVERRIDE_SETTLEDCH3_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define VREGMAIN_OVERRIDE_SETTLEDCH3_VAL_Msk (0x1UL << VREGMAIN_OVERRIDE_SETTLEDCH3_VAL_Pos) /*!< Bit mask of VAL field.     */

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_SETTLEDCH3_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define VREGMAIN_OVERRIDE_SETTLEDCH3_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_SETTLEDCH3_EN_Pos) /*!< Bit mask of EN field.        */
  #define VREGMAIN_OVERRIDE_SETTLEDCH3_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define VREGMAIN_OVERRIDE_SETTLEDCH3_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define VREGMAIN_OVERRIDE_SETTLEDCH3_EN_Disabled (0x0UL) /*!< Override is disabled                                           */
  #define VREGMAIN_OVERRIDE_SETTLEDCH3_EN_Enabled (0x1UL) /*!< Override is enabled                                             */


/* VREGMAIN_OVERRIDE_CHRGCH1: Override the CH1 CHRG signal from the analog module */
  #define VREGMAIN_OVERRIDE_CHRGCH1_ResetValue (0x00000000UL) /*!< Reset value of CHRGCH1 register.                            */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGMAIN_OVERRIDE_CHRGCH1_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VREGMAIN_OVERRIDE_CHRGCH1_VAL_Msk (0x1UL << VREGMAIN_OVERRIDE_CHRGCH1_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_CHRGCH1_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VREGMAIN_OVERRIDE_CHRGCH1_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_CHRGCH1_EN_Pos) /*!< Bit mask of EN field.              */
  #define VREGMAIN_OVERRIDE_CHRGCH1_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_CHRGCH1_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_CHRGCH1_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VREGMAIN_OVERRIDE_CHRGCH1_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* VREGMAIN_OVERRIDE_CHRGCH2: Override the CH2 CHRG signal from the analog module */
  #define VREGMAIN_OVERRIDE_CHRGCH2_ResetValue (0x00000000UL) /*!< Reset value of CHRGCH2 register.                            */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGMAIN_OVERRIDE_CHRGCH2_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VREGMAIN_OVERRIDE_CHRGCH2_VAL_Msk (0x1UL << VREGMAIN_OVERRIDE_CHRGCH2_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_CHRGCH2_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VREGMAIN_OVERRIDE_CHRGCH2_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_CHRGCH2_EN_Pos) /*!< Bit mask of EN field.              */
  #define VREGMAIN_OVERRIDE_CHRGCH2_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_CHRGCH2_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_CHRGCH2_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VREGMAIN_OVERRIDE_CHRGCH2_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


