adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VREGMAIN_OVERRIDE_CHRGCH3: Override the CH3 CHRG signal from the analog module */
  #define VREGMAIN_OVERRIDE_CHRGCH3_ResetValue (0x00000000UL) /*!< Reset value of CHRGCH3 register.                            */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGMAIN_OVERRIDE_CHRGCH3_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VREGMAIN_OVERRIDE_CHRGCH3_VAL_Msk (0x1UL << VREGMAIN_OVERRIDE_CHRGCH3_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_CHRGCH3_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VREGMAIN_OVERRIDE_CHRGCH3_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_CHRGCH3_EN_Pos) /*!< Bit mask of EN field.              */
  #define VREGMAIN_OVERRIDE_CHRGCH3_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_CHRGCH3_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_CHRGCH3_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VREGMAIN_OVERRIDE_CHRGCH3_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* VREGMAIN_OVERRIDE_ICMP: Override the ICMP signal from the analog module */
  #define VREGMAIN_OVERRIDE_ICMP_ResetValue (0x00000000UL) /*!< Reset value of ICMP register.                                  */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGMAIN_OVERRIDE_ICMP_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define VREGMAIN_OVERRIDE_ICMP_VAL_Msk (0x1UL << VREGMAIN_OVERRIDE_ICMP_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define VREGMAIN_OVERRIDE_ICMP_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VREGMAIN_OVERRIDE_ICMP_EN_Msk (0x1UL << VREGMAIN_OVERRIDE_ICMP_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VREGMAIN_OVERRIDE_ICMP_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_ICMP_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_OVERRIDE_ICMP_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define VREGMAIN_OVERRIDE_ICMP_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */



/* =================================================== Struct VREGMAIN_DFT =================================================== */
/**
  * @brief DFT [VREGMAIN_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
  __IOM uint32_t  DTB2CONFIG;                        /*!< (@ 0x00000018) Digital Test Bus 2 (DTB2) configuration               */
  __IOM uint32_t  DTB3CONFIG;                        /*!< (@ 0x0000001C) Digital Test Bus 3 (DTB3) configuration               */
  __IM  uint32_t  RESERVED1[4];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
  __IOM uint32_t  CALEN;                             /*!< (@ 0x00000034) Calibration enable                                    */
  __IM  uint32_t  CALCMP;                            /*!< (@ 0x00000038) Calibration compare                                   */
} NRF_VREGMAIN_DFT_Type;                             /*!< Size = 60 (0x03C)                                                    */

/* VREGMAIN_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define VREGMAIN_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                           */

/* SELMUX @Bits 0..2 : Select multiplexer for ATB0 */
  #define VREGMAIN_DFT_ATB0CONFIG_SELMUX_Pos (0UL)   /*!< Position of SELMUX field.                                            */
  #define VREGMAIN_DFT_ATB0CONFIG_SELMUX_Msk (0x7UL << VREGMAIN_DFT_ATB0CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.      */
  #define VREGMAIN_DFT_ATB0CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                                */
  #define VREGMAIN_DFT_ATB0CONFIG_SELMUX_Max (0x6UL) /*!< Max enumerator value of SELMUX field.                                */
  #define VREGMAIN_DFT_ATB0CONFIG_SELMUX_ATB0EXT (0x0UL) /*!< ATB0_EXT selected                                                */
  #define VREGMAIN_DFT_ATB0CONFIG_SELMUX_VFB0V9 (0x1UL) /*!< VFB_0V9 selected                                                  */
  #define VREGMAIN_DFT_ATB0CONFIG_SELMUX_VFB1V0 (0x2UL) /*!< VFB_1V0 selected                                                  */
  #define VREGMAIN_DFT_ATB0CONFIG_SELMUX_VFB0V8 (0x3UL) /*!< VFB_0V8 selected                                                  */
  #define VREGMAIN_DFT_ATB0CONFIG_SELMUX_AVSSVGND (0x4UL) /*!< AVSS_VGND selected                                              */
  #define VREGMAIN_DFT_ATB0CONFIG_SELMUX_MBIASIBPP50N (0x5UL) /*!< MBIAS_IBPP_50N selected                                     */
  #define VREGMAIN_DFT_ATB0CONFIG_SELMUX_MBIASIBPSR8U (0x6UL) /*!< MBIAS_IBPSR_8U selected                                     */

/* EN @Bit 31 : Enable the analog test bus */
  #define VREGMAIN_DFT_ATB0CONFIG_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREGMAIN_DFT_ATB0CONFIG_EN_Msk (0x1UL << VREGMAIN_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREGMAIN_DFT_ATB0CONFIG_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_DFT_ATB0CONFIG_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_DFT_ATB0CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                         */
  #define VREGMAIN_DFT_ATB0CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                           */


