adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EN @Bit 31 : Enable the digital test bus */
  #define VREGMAIN_DFT_DTB1CONFIG_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREGMAIN_DFT_DTB1CONFIG_EN_Msk (0x1UL << VREGMAIN_DFT_DTB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREGMAIN_DFT_DTB1CONFIG_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_DFT_DTB1CONFIG_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_DFT_DTB1CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                        */
  #define VREGMAIN_DFT_DTB1CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                          */


/* VREGMAIN_DFT_DTB2CONFIG: Digital Test Bus 2 (DTB2) configuration */
  #define VREGMAIN_DFT_DTB2CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB2CONFIG register.                           */

/* SELMUX @Bits 0..3 : Select multiplexer for DTB2 */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_Pos (0UL)   /*!< Position of SELMUX field.                                            */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_Msk (0xFUL << VREGMAIN_DFT_DTB2CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.      */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                                */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_Max (0xFUL) /*!< Max enumerator value of SELMUX field.                                */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_PWRUPPWM (0x0UL) /*!< PWRUP_PWM selected                                              */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_PWRUPCH2 (0x1UL) /*!< PWRUPCH2 selected                                               */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_VOUTCMP3 (0x2UL) /*!< VOUTCMP3 selected                                               */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_PWMCMP2 (0x3UL) /*!< PWMCMP2 selected                                                 */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_DRVSEC2 (0x4UL) /*!< DRVSEC2 selected                                                 */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_HSLIM (0x5UL) /*!< HSLIM selected                                                     */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_DRVLS (0x6UL) /*!< DRVLS selected                                                     */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_MODEHP (0x8UL) /*!< MODE_HP selected                                                  */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_HVBUCKSETTLED (0x9UL) /*!< HVBUCK_SETTLED selected                                    */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_SETTLEDCH1 (0xAUL) /*!< SETTLED_CH1 selected                                          */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_PWMLIM11V8 (0xBUL) /*!< PWM_LIM1_1V8 selected                                         */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_PWMOC2 (0xCUL) /*!< PWM_OC2 selected                                                  */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_PWMSKIP2 (0xDUL) /*!< PWM_SKIP2 selected                                              */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_PWMFAULT2 (0xEUL) /*!< PWM_FAULT2 selected                                            */
  #define VREGMAIN_DFT_DTB2CONFIG_SELMUX_CHRG2 (0xFUL) /*!< CHRG2 selected                                                     */

/* EN @Bit 31 : Enable the digital test bus */
  #define VREGMAIN_DFT_DTB2CONFIG_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREGMAIN_DFT_DTB2CONFIG_EN_Msk (0x1UL << VREGMAIN_DFT_DTB2CONFIG_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREGMAIN_DFT_DTB2CONFIG_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREGMAIN_DFT_DTB2CONFIG_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREGMAIN_DFT_DTB2CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                        */
  #define VREGMAIN_DFT_DTB2CONFIG_EN_Enabled (0x1UL) /*!< Digital test bus is enabled                                          */


/* VREGMAIN_DFT_DTB3CONFIG: Digital Test Bus 3 (DTB3) configuration */
  #define VREGMAIN_DFT_DTB3CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB3CONFIG register.                           */

/* SELMUX @Bits 0..3 : Select multiplexer for DTB3 */
  #define VREGMAIN_DFT_DTB3CONFIG_SELMUX_Pos (0UL)   /*!< Position of SELMUX field.                                            */
  #define VREGMAIN_DFT_DTB3CONFIG_SELMUX_Msk (0xFUL << VREGMAIN_DFT_DTB3CONFIG_SELMUX_Pos) /*!< Bit mask of SELMUX field.      */
  #define VREGMAIN_DFT_DTB3CONFIG_SELMUX_Min (0x0UL) /*!< Min enumerator value of SELMUX field.                                */
  #define VREGMAIN_DFT_DTB3CONFIG_SELMUX_Max (0xFUL) /*!< Max enumerator value of SELMUX field.                                */
  #define VREGMAIN_DFT_DTB3CONFIG_SELMUX_PWRUPHYST (0x0UL) /*!< PWRUP_HYST selected                                            */
  #define VREGMAIN_DFT_DTB3CONFIG_SELMUX_PWRUPCH3 (0x1UL) /*!< PWRUPCH3 selected                                               */
  #define VREGMAIN_DFT_DTB3CONFIG_SELMUX_VOUTCMP2 (0x2UL) /*!< VOUTCMP2 selected                                               */
  #define VREGMAIN_DFT_DTB3CONFIG_SELMUX_PWMCMP3 (0x3UL) /*!< PWMCMP3 selected                                                 */
  #define VREGMAIN_DFT_DTB3CONFIG_SELMUX_DRVSEC3 (0x4UL) /*!< DRVSEC3 selected                                                 */
  #define VREGMAIN_DFT_DTB3CONFIG_SELMUX_SECREADY (0x5UL) /*!< SECREADY selected                                               */
  #define VREGMAIN_DFT_DTB3CONFIG_SELMUX_MODEPWM (0x8UL) /*!< MODE_PWM selected                                                */
  #define VREGMAIN_DFT_DTB3CONFIG_SELMUX_SETTLEDCH2 (0xAUL) /*!< SETTLED_CH2 selected                                          */
  #define VREGMAIN_DFT_DTB3CONFIG_SELMUX_PWMILIM31V8 (0xBUL) /*!< PWM_ILIM3_1V8 selected                                       */
  #define VREGMAIN_DFT_DTB3CONFIG_SELMUX_PWMOC3 (0xCUL) /*!< PWM_OC3 selected                                                  */
  #define VREGMAIN_DFT_DTB3CONFIG_SELMUX_PWMSKIP3 (0xDUL) /*!< PWM_SKIP3 selected                                              */
  #define VREGMAIN_DFT_DTB3CONFIG_SELMUX_PWMFAULT2 (0xEUL) /*!< PWM_FAULT2 selected                                            */
  #define VREGMAIN_DFT_DTB3CONFIG_SELMUX_CHRG3 (0xFUL) /*!< CHRG3 selected                                                     */

/* PWRUPDELTEST @Bit 27 : Enable the PWRUP delay test circuit */
  #define VREGMAIN_DFT_DTB3CONFIG_PWRUPDELTEST_Pos (27UL) /*!< Position of PWRUPDELTEST field.                                 */
  #define VREGMAIN_DFT_DTB3CONFIG_PWRUPDELTEST_Msk (0x1UL << VREGMAIN_DFT_DTB3CONFIG_PWRUPDELTEST_Pos) /*!< Bit mask of
                                                                            PWRUPDELTEST field.*/                                 
  #define VREGMAIN_DFT_DTB3CONFIG_PWRUPDELTEST_Min (0x0UL) /*!< Min enumerator value of PWRUPDELTEST field.                    */
  #define VREGMAIN_DFT_DTB3CONFIG_PWRUPDELTEST_Max (0x1UL) /*!< Max enumerator value of PWRUPDELTEST field.                    */
  #define VREGMAIN_DFT_DTB3CONFIG_PWRUPDELTEST_Disabled (0x0UL) /*!< PWRUP delay test circuit is disabled                      */
  #define VREGMAIN_DFT_DTB3CONFIG_PWRUPDELTEST_Enabled (0x1UL) /*!< PWRUP delay test circuit is enabled                        */

