adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EVENTS_HP2LP @Bit 0 : Current consumption below threshold */
  #define VREGMAIN_EVENTS_HP2LP_EVENTS_HP2LP_Pos (0UL) /*!< Position of EVENTS_HP2LP field.                                    */
  #define VREGMAIN_EVENTS_HP2LP_EVENTS_HP2LP_Msk (0x1UL << VREGMAIN_EVENTS_HP2LP_EVENTS_HP2LP_Pos) /*!< Bit mask of EVENTS_HP2LP
                                                                            field.*/                                              
  #define VREGMAIN_EVENTS_HP2LP_EVENTS_HP2LP_Min (0x0UL) /*!< Min enumerator value of EVENTS_HP2LP field.                      */
  #define VREGMAIN_EVENTS_HP2LP_EVENTS_HP2LP_Max (0x1UL) /*!< Max enumerator value of EVENTS_HP2LP field.                      */
  #define VREGMAIN_EVENTS_HP2LP_EVENTS_HP2LP_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define VREGMAIN_EVENTS_HP2LP_EVENTS_HP2LP_Generated (0x1UL) /*!< Event generated                                            */


/* VREGMAIN_INTEN: Enable or disable interrupt */
  #define VREGMAIN_INTEN_ResetValue (0x00000000UL)   /*!< Reset value of INTEN register.                                       */

/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define VREGMAIN_INTEN_READY_Pos (0UL)             /*!< Position of READY field.                                             */
  #define VREGMAIN_INTEN_READY_Msk (0x1UL << VREGMAIN_INTEN_READY_Pos) /*!< Bit mask of READY field.                           */
  #define VREGMAIN_INTEN_READY_Min (0x0UL)           /*!< Min enumerator value of READY field.                                 */
  #define VREGMAIN_INTEN_READY_Max (0x1UL)           /*!< Max enumerator value of READY field.                                 */
  #define VREGMAIN_INTEN_READY_Disabled (0x0UL)      /*!< Disable                                                              */
  #define VREGMAIN_INTEN_READY_Enabled (0x1UL)       /*!< Enable                                                               */

/* SETTLED @Bit 1 : Enable or disable interrupt for event SETTLED */
  #define VREGMAIN_INTEN_SETTLED_Pos (1UL)           /*!< Position of SETTLED field.                                           */
  #define VREGMAIN_INTEN_SETTLED_Msk (0x1UL << VREGMAIN_INTEN_SETTLED_Pos) /*!< Bit mask of SETTLED field.                     */
  #define VREGMAIN_INTEN_SETTLED_Min (0x0UL)         /*!< Min enumerator value of SETTLED field.                               */
  #define VREGMAIN_INTEN_SETTLED_Max (0x1UL)         /*!< Max enumerator value of SETTLED field.                               */
  #define VREGMAIN_INTEN_SETTLED_Disabled (0x0UL)    /*!< Disable                                                              */
  #define VREGMAIN_INTEN_SETTLED_Enabled (0x1UL)     /*!< Enable                                                               */

/* SETTLEDCH1 @Bit 2 : Enable or disable interrupt for event SETTLEDCH1 */
  #define VREGMAIN_INTEN_SETTLEDCH1_Pos (2UL)        /*!< Position of SETTLEDCH1 field.                                        */
  #define VREGMAIN_INTEN_SETTLEDCH1_Msk (0x1UL << VREGMAIN_INTEN_SETTLEDCH1_Pos) /*!< Bit mask of SETTLEDCH1 field.            */
  #define VREGMAIN_INTEN_SETTLEDCH1_Min (0x0UL)      /*!< Min enumerator value of SETTLEDCH1 field.                            */
  #define VREGMAIN_INTEN_SETTLEDCH1_Max (0x1UL)      /*!< Max enumerator value of SETTLEDCH1 field.                            */
  #define VREGMAIN_INTEN_SETTLEDCH1_Disabled (0x0UL) /*!< Disable                                                              */
  #define VREGMAIN_INTEN_SETTLEDCH1_Enabled (0x1UL)  /*!< Enable                                                               */

/* SETTLEDCH2 @Bit 3 : Enable or disable interrupt for event SETTLEDCH2 */
  #define VREGMAIN_INTEN_SETTLEDCH2_Pos (3UL)        /*!< Position of SETTLEDCH2 field.                                        */
  #define VREGMAIN_INTEN_SETTLEDCH2_Msk (0x1UL << VREGMAIN_INTEN_SETTLEDCH2_Pos) /*!< Bit mask of SETTLEDCH2 field.            */
  #define VREGMAIN_INTEN_SETTLEDCH2_Min (0x0UL)      /*!< Min enumerator value of SETTLEDCH2 field.                            */
  #define VREGMAIN_INTEN_SETTLEDCH2_Max (0x1UL)      /*!< Max enumerator value of SETTLEDCH2 field.                            */
  #define VREGMAIN_INTEN_SETTLEDCH2_Disabled (0x0UL) /*!< Disable                                                              */
  #define VREGMAIN_INTEN_SETTLEDCH2_Enabled (0x1UL)  /*!< Enable                                                               */

/* SETTLEDCH3 @Bit 4 : Enable or disable interrupt for event SETTLEDCH3 */
  #define VREGMAIN_INTEN_SETTLEDCH3_Pos (4UL)        /*!< Position of SETTLEDCH3 field.                                        */
  #define VREGMAIN_INTEN_SETTLEDCH3_Msk (0x1UL << VREGMAIN_INTEN_SETTLEDCH3_Pos) /*!< Bit mask of SETTLEDCH3 field.            */
  #define VREGMAIN_INTEN_SETTLEDCH3_Min (0x0UL)      /*!< Min enumerator value of SETTLEDCH3 field.                            */
  #define VREGMAIN_INTEN_SETTLEDCH3_Max (0x1UL)      /*!< Max enumerator value of SETTLEDCH3 field.                            */
  #define VREGMAIN_INTEN_SETTLEDCH3_Disabled (0x0UL) /*!< Disable                                                              */
  #define VREGMAIN_INTEN_SETTLEDCH3_Enabled (0x1UL)  /*!< Enable                                                               */

/* IOUTCMP @Bit 5 : Enable or disable interrupt for event IOUTCMP */
  #define VREGMAIN_INTEN_IOUTCMP_Pos (5UL)           /*!< Position of IOUTCMP field.                                           */
  #define VREGMAIN_INTEN_IOUTCMP_Msk (0x1UL << VREGMAIN_INTEN_IOUTCMP_Pos) /*!< Bit mask of IOUTCMP field.                     */
  #define VREGMAIN_INTEN_IOUTCMP_Min (0x0UL)         /*!< Min enumerator value of IOUTCMP field.                               */
  #define VREGMAIN_INTEN_IOUTCMP_Max (0x1UL)         /*!< Max enumerator value of IOUTCMP field.                               */
  #define VREGMAIN_INTEN_IOUTCMP_Disabled (0x0UL)    /*!< Disable                                                              */
  #define VREGMAIN_INTEN_IOUTCMP_Enabled (0x1UL)     /*!< Enable                                                               */

/* LP2HP @Bit 6 : Enable or disable interrupt for event LP2HP */
  #define VREGMAIN_INTEN_LP2HP_Pos (6UL)             /*!< Position of LP2HP field.                                             */
  #define VREGMAIN_INTEN_LP2HP_Msk (0x1UL << VREGMAIN_INTEN_LP2HP_Pos) /*!< Bit mask of LP2HP field.                           */
  #define VREGMAIN_INTEN_LP2HP_Min (0x0UL)           /*!< Min enumerator value of LP2HP field.                                 */
  #define VREGMAIN_INTEN_LP2HP_Max (0x1UL)           /*!< Max enumerator value of LP2HP field.                                 */
  #define VREGMAIN_INTEN_LP2HP_Disabled (0x0UL)      /*!< Disable                                                              */
  #define VREGMAIN_INTEN_LP2HP_Enabled (0x1UL)       /*!< Enable                                                               */

/* HP2LP @Bit 7 : Enable or disable interrupt for event HP2LP */
  #define VREGMAIN_INTEN_HP2LP_Pos (7UL)             /*!< Position of HP2LP field.                                             */
  #define VREGMAIN_INTEN_HP2LP_Msk (0x1UL << VREGMAIN_INTEN_HP2LP_Pos) /*!< Bit mask of HP2LP field.                           */
  #define VREGMAIN_INTEN_HP2LP_Min (0x0UL)           /*!< Min enumerator value of HP2LP field.                                 */
  #define VREGMAIN_INTEN_HP2LP_Max (0x1UL)           /*!< Max enumerator value of HP2LP field.                                 */
  #define VREGMAIN_INTEN_HP2LP_Disabled (0x0UL)      /*!< Disable                                                              */
  #define VREGMAIN_INTEN_HP2LP_Enabled (0x1UL)       /*!< Enable                                                               */


/* VREGMAIN_INTENSET: Enable interrupt */
  #define VREGMAIN_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                   */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define VREGMAIN_INTENSET_READY_Pos (0UL)          /*!< Position of READY field.                                             */
  #define VREGMAIN_INTENSET_READY_Msk (0x1UL << VREGMAIN_INTENSET_READY_Pos) /*!< Bit mask of READY field.                     */
  #define VREGMAIN_INTENSET_READY_Min (0x0UL)        /*!< Min enumerator value of READY field.                                 */
  #define VREGMAIN_INTENSET_READY_Max (0x1UL)        /*!< Max enumerator value of READY field.                                 */
  #define VREGMAIN_INTENSET_READY_Set (0x1UL)        /*!< Enable                                                               */
  #define VREGMAIN_INTENSET_READY_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define VREGMAIN_INTENSET_READY_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

