adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VREGMAIN_PWMPROG: PWM program */
  #define VREGMAIN_PWMPROG_ResetValue (0x00000000UL) /*!< Reset value of PWMPROG register.                                     */

/* VAL @Bits 0..1 : PWM program value */
  #define VREGMAIN_PWMPROG_VAL_Pos (0UL)             /*!< Position of VAL field.                                               */
  #define VREGMAIN_PWMPROG_VAL_Msk (0x3UL << VREGMAIN_PWMPROG_VAL_Pos) /*!< Bit mask of VAL field.                             */
  #define VREGMAIN_PWMPROG_VAL_Min (0x0UL)           /*!< Min enumerator value of VAL field.                                   */
  #define VREGMAIN_PWMPROG_VAL_Max (0x3UL)           /*!< Max enumerator value of VAL field.                                   */
  #define VREGMAIN_PWMPROG_VAL_PWMVal0 (0x0UL)       /*!< VDD_AO_1V8 = 1/3, VDD_1V0 = 1/3, VDD_VS_0V8 = 1/3                    */
  #define VREGMAIN_PWMPROG_VAL_PWMVal1 (0x1UL)       /*!< VDD_AO_1V8 = 2/4, VDD_1V0 = 1/4, VDD_VS_0V8 = 1/4                    */
  #define VREGMAIN_PWMPROG_VAL_PWMVal2 (0x2UL)       /*!< VDD_AO_1V8 = 1/4, VDD_1V0 = 2/4, VDD_VS_0V8 = 1/4                    */
  #define VREGMAIN_PWMPROG_VAL_PWMVal3 (0x3UL)       /*!< VDD_AO_1V8 = 1/4, VDD_1V0 = 1/4, VDD_VS_0V8 = 2/4                    */


/* VREGMAIN_FBCTRL: Regulator feedback point control */
  #define VREGMAIN_FBCTRL_ResetValue (0x00000015UL)  /*!< Reset value of FBCTRL register.                                      */

/* VDD1V8 @Bits 0..1 : VDD_1V8 feedback configuration */
  #define VREGMAIN_FBCTRL_VDD1V8_Pos (0UL)           /*!< Position of VDD1V8 field.                                            */
  #define VREGMAIN_FBCTRL_VDD1V8_Msk (0x3UL << VREGMAIN_FBCTRL_VDD1V8_Pos) /*!< Bit mask of VDD1V8 field.                      */
  #define VREGMAIN_FBCTRL_VDD1V8_Min (0x0UL)         /*!< Min enumerator value of VDD1V8 field.                                */
  #define VREGMAIN_FBCTRL_VDD1V8_Max (0x3UL)         /*!< Max enumerator value of VDD1V8 field.                                */
  #define VREGMAIN_FBCTRL_VDD1V8_VDD1V8FB (0x0UL)    /*!< VDD_1V8 feedback                                                     */
  #define VREGMAIN_FBCTRL_VDD1V8_SEC1V8FB (0x1UL)    /*!< SEC_1V8 feedback                                                     */
  #define VREGMAIN_FBCTRL_VDD1V8_VDDSEC1V8FB (0x3UL) /*!< VDD_1V8 and SEC_1V8 feedback                                         */

/* VDD1V0 @Bits 2..3 : VDD_1V0 feedback configuration */
  #define VREGMAIN_FBCTRL_VDD1V0_Pos (2UL)           /*!< Position of VDD1V0 field.                                            */
  #define VREGMAIN_FBCTRL_VDD1V0_Msk (0x3UL << VREGMAIN_FBCTRL_VDD1V0_Pos) /*!< Bit mask of VDD1V0 field.                      */
  #define VREGMAIN_FBCTRL_VDD1V0_Min (0x0UL)         /*!< Min enumerator value of VDD1V0 field.                                */
  #define VREGMAIN_FBCTRL_VDD1V0_Max (0x3UL)         /*!< Max enumerator value of VDD1V0 field.                                */
  #define VREGMAIN_FBCTRL_VDD1V0_VDD1V0FB (0x0UL)    /*!< VDD_1V0 feedback                                                     */
  #define VREGMAIN_FBCTRL_VDD1V0_SEC1V0FB (0x1UL)    /*!< SEC_1V0 feedback                                                     */
  #define VREGMAIN_FBCTRL_VDD1V0_VDDSEC1V0FB (0x2UL) /*!< VDD_1V0 and SEC_1V0 feedback                                         */
  #define VREGMAIN_FBCTRL_VDD1V0_VDDAOSEC1V0FB (0x3UL) /*!< VDD_AO_0V8 and SEC_1V0 feedback                                    */

/* VDD0V8 @Bits 4..5 : VDD_0V8 feedback configuration */
  #define VREGMAIN_FBCTRL_VDD0V8_Pos (4UL)           /*!< Position of VDD0V8 field.                                            */
  #define VREGMAIN_FBCTRL_VDD0V8_Msk (0x3UL << VREGMAIN_FBCTRL_VDD0V8_Pos) /*!< Bit mask of VDD0V8 field.                      */
  #define VREGMAIN_FBCTRL_VDD0V8_Min (0x0UL)         /*!< Min enumerator value of VDD0V8 field.                                */
  #define VREGMAIN_FBCTRL_VDD0V8_Max (0x3UL)         /*!< Max enumerator value of VDD0V8 field.                                */
  #define VREGMAIN_FBCTRL_VDD0V8_VDDVS0V8FB (0x0UL)  /*!< VDD_VS_0V8 feedback                                                  */
  #define VREGMAIN_FBCTRL_VDD0V8_SEC0V8FB (0x1UL)    /*!< SEC_0V8 feedback                                                     */
  #define VREGMAIN_FBCTRL_VDD0V8_VDDVS0V8SEC0V8FB (0x3UL) /*!< VDD_VS_0V8 and SEC_0V8 feedback                                 */


/* VREGMAIN_ITHRESHOLD: Current threshold for HP/LP mode transistion */
  #define VREGMAIN_ITHRESHOLD_ResetValue (0x00000006UL) /*!< Reset value of ITHRESHOLD register.                               */

/* VAL @Bits 0..4 : Current consumption */
  #define VREGMAIN_ITHRESHOLD_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define VREGMAIN_ITHRESHOLD_VAL_Msk (0x1FUL << VREGMAIN_ITHRESHOLD_VAL_Pos) /*!< Bit mask of VAL field.                      */
  #define VREGMAIN_ITHRESHOLD_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                              */
  #define VREGMAIN_ITHRESHOLD_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                               */


/* VREGMAIN_ITHRESHOLDPWM: Current threshold for half clock speed in PWM mode */
  #define VREGMAIN_ITHRESHOLDPWM_ResetValue (0x00000006UL) /*!< Reset value of ITHRESHOLDPWM register.                         */

/* VAL @Bits 0..4 : Current consumption */
  #define VREGMAIN_ITHRESHOLDPWM_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define VREGMAIN_ITHRESHOLDPWM_VAL_Msk (0x1FUL << VREGMAIN_ITHRESHOLDPWM_VAL_Pos) /*!< Bit mask of VAL field.                */
  #define VREGMAIN_ITHRESHOLDPWM_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                           */
  #define VREGMAIN_ITHRESHOLDPWM_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                            */


/* VREGMAIN_ITHRESHOLD0V8LOW: Current threshold LDO toggle at low 0V8 current consumption */
  #define VREGMAIN_ITHRESHOLD0V8LOW_ResetValue (0x00000002UL) /*!< Reset value of ITHRESHOLD0V8LOW register.                   */

/* VAL @Bits 0..4 : Current consumption */
  #define VREGMAIN_ITHRESHOLD0V8LOW_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VREGMAIN_ITHRESHOLD0V8LOW_VAL_Msk (0x1FUL << VREGMAIN_ITHRESHOLD0V8LOW_VAL_Pos) /*!< Bit mask of VAL field.          */
  #define VREGMAIN_ITHRESHOLD0V8LOW_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                        */
  #define VREGMAIN_ITHRESHOLD0V8LOW_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         VREGMRAM                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct VREGMRAM_TRIM =================================================== */
/**
  * @brief TRIM [VREGMRAM_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  VBG;                               /*!< (@ 0x00000000) Bandgap voltage buffer trim                           */
  __IOM uint32_t  BIAS;                              /*!< (@ 0x00000004) Bias trim                                             */
  __IOM uint32_t  VPR;                               /*!< (@ 0x00000008) VPR reference voltage trim for 1.2V VPR               */
  __IOM uint32_t  VREF;                              /*!< (@ 0x0000000C) VREF reference voltage trim for 0.6V VREF             */
} NRF_VREGMRAM_TRIM_Type;                            /*!< Size = 16 (0x010)                                                    */

