adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* EN @Bit 31 : Enable the analog test bus */
  #define VREGMRAM_DFT_ATB1CONFIG_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define VREGMRAM_DFT_ATB1CONFIG_EN_Msk (0x1UL << VREGMRAM_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                  */
  #define VREGMRAM_DFT_ATB1CONFIG_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define VREGMRAM_DFT_ATB1CONFIG_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define VREGMRAM_DFT_ATB1CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                         */
  #define VREGMRAM_DFT_ATB1CONFIG_EN_Enabled (0x1UL) /*!< Analog test bus is enabled                                           */


/* VREGMRAM_DFT_TCFG: Test mode configuration */
  #define VREGMRAM_DFT_TCFG_ResetValue (0x00000000UL) /*!< Reset value of TCFG register.                                       */

/* PWRUPVTST @Bit 0 : PWRUP V_TST to ATB buffer */
  #define VREGMRAM_DFT_TCFG_PWRUPVTST_Pos (0UL)      /*!< Position of PWRUPVTST field.                                         */
  #define VREGMRAM_DFT_TCFG_PWRUPVTST_Msk (0x1UL << VREGMRAM_DFT_TCFG_PWRUPVTST_Pos) /*!< Bit mask of PWRUPVTST field.         */
  #define VREGMRAM_DFT_TCFG_PWRUPVTST_Min (0x0UL)    /*!< Min enumerator value of PWRUPVTST field.                             */
  #define VREGMRAM_DFT_TCFG_PWRUPVTST_Max (0x1UL)    /*!< Max enumerator value of PWRUPVTST field.                             */
  #define VREGMRAM_DFT_TCFG_PWRUPVTST_Disabled (0x0UL) /*!< (unspecified)                                                      */
  #define VREGMRAM_DFT_TCFG_PWRUPVTST_Enabled (0x1UL) /*!< (unspecified)                                                       */

/* PDVTST @Bit 1 : Pull down V_TEST */
  #define VREGMRAM_DFT_TCFG_PDVTST_Pos (1UL)         /*!< Position of PDVTST field.                                            */
  #define VREGMRAM_DFT_TCFG_PDVTST_Msk (0x1UL << VREGMRAM_DFT_TCFG_PDVTST_Pos) /*!< Bit mask of PDVTST field.                  */
  #define VREGMRAM_DFT_TCFG_PDVTST_Min (0x0UL)       /*!< Min enumerator value of PDVTST field.                                */
  #define VREGMRAM_DFT_TCFG_PDVTST_Max (0x1UL)       /*!< Max enumerator value of PDVTST field.                                */
  #define VREGMRAM_DFT_TCFG_PDVTST_Disabled (0x0UL)  /*!< (unspecified)                                                        */
  #define VREGMRAM_DFT_TCFG_PDVTST_Enabled (0x1UL)   /*!< (unspecified)                                                        */

/* BYPASSVTST @Bit 2 : Bypass V_TEST buf to ATB1 mux */
  #define VREGMRAM_DFT_TCFG_BYPASSVTST_Pos (2UL)     /*!< Position of BYPASSVTST field.                                        */
  #define VREGMRAM_DFT_TCFG_BYPASSVTST_Msk (0x1UL << VREGMRAM_DFT_TCFG_BYPASSVTST_Pos) /*!< Bit mask of BYPASSVTST field.      */
  #define VREGMRAM_DFT_TCFG_BYPASSVTST_Min (0x0UL)   /*!< Min enumerator value of BYPASSVTST field.                            */
  #define VREGMRAM_DFT_TCFG_BYPASSVTST_Max (0x1UL)   /*!< Max enumerator value of BYPASSVTST field.                            */
  #define VREGMRAM_DFT_TCFG_BYPASSVTST_Disabled (0x0UL) /*!< (unspecified)                                                     */
  #define VREGMRAM_DFT_TCFG_BYPASSVTST_Enabled (0x1UL) /*!< (unspecified)                                                      */

/* SELVTST @Bit 3 : SEL V_TEST buffer to ATB1 mux */
  #define VREGMRAM_DFT_TCFG_SELVTST_Pos (3UL)        /*!< Position of SELVTST field.                                           */
  #define VREGMRAM_DFT_TCFG_SELVTST_Msk (0x1UL << VREGMRAM_DFT_TCFG_SELVTST_Pos) /*!< Bit mask of SELVTST field.               */
  #define VREGMRAM_DFT_TCFG_SELVTST_Min (0x0UL)      /*!< Min enumerator value of SELVTST field.                               */
  #define VREGMRAM_DFT_TCFG_SELVTST_Max (0x1UL)      /*!< Max enumerator value of SELVTST field.                               */
  #define VREGMRAM_DFT_TCFG_SELVTST_Disabled (0x0UL) /*!< (unspecified)                                                        */
  #define VREGMRAM_DFT_TCFG_SELVTST_Enabled (0x1UL)  /*!< (unspecified)                                                        */

/* SELVREFOUT @Bit 4 : Select VREF VOUT to V_TST */
  #define VREGMRAM_DFT_TCFG_SELVREFOUT_Pos (4UL)     /*!< Position of SELVREFOUT field.                                        */
  #define VREGMRAM_DFT_TCFG_SELVREFOUT_Msk (0x1UL << VREGMRAM_DFT_TCFG_SELVREFOUT_Pos) /*!< Bit mask of SELVREFOUT field.      */
  #define VREGMRAM_DFT_TCFG_SELVREFOUT_Min (0x0UL)   /*!< Min enumerator value of SELVREFOUT field.                            */
  #define VREGMRAM_DFT_TCFG_SELVREFOUT_Max (0x1UL)   /*!< Max enumerator value of SELVREFOUT field.                            */
  #define VREGMRAM_DFT_TCFG_SELVREFOUT_Disabled (0x0UL) /*!< (unspecified)                                                     */
  #define VREGMRAM_DFT_TCFG_SELVREFOUT_Enabled (0x1UL) /*!< (unspecified)                                                      */

/* SELVREFREF @Bit 5 : Select VREF reference to V_TST */
  #define VREGMRAM_DFT_TCFG_SELVREFREF_Pos (5UL)     /*!< Position of SELVREFREF field.                                        */
  #define VREGMRAM_DFT_TCFG_SELVREFREF_Msk (0x1UL << VREGMRAM_DFT_TCFG_SELVREFREF_Pos) /*!< Bit mask of SELVREFREF field.      */
  #define VREGMRAM_DFT_TCFG_SELVREFREF_Min (0x0UL)   /*!< Min enumerator value of SELVREFREF field.                            */
  #define VREGMRAM_DFT_TCFG_SELVREFREF_Max (0x1UL)   /*!< Max enumerator value of SELVREFREF field.                            */
  #define VREGMRAM_DFT_TCFG_SELVREFREF_Disabled (0x0UL) /*!< (unspecified)                                                     */
  #define VREGMRAM_DFT_TCFG_SELVREFREF_Enabled (0x1UL) /*!< (unspecified)                                                      */

/* SELVPROUT @Bit 6 : Select VPR VOUT to V_TST */
  #define VREGMRAM_DFT_TCFG_SELVPROUT_Pos (6UL)      /*!< Position of SELVPROUT field.                                         */
  #define VREGMRAM_DFT_TCFG_SELVPROUT_Msk (0x1UL << VREGMRAM_DFT_TCFG_SELVPROUT_Pos) /*!< Bit mask of SELVPROUT field.         */
  #define VREGMRAM_DFT_TCFG_SELVPROUT_Min (0x0UL)    /*!< Min enumerator value of SELVPROUT field.                             */
  #define VREGMRAM_DFT_TCFG_SELVPROUT_Max (0x1UL)    /*!< Max enumerator value of SELVPROUT field.                             */
  #define VREGMRAM_DFT_TCFG_SELVPROUT_Disabled (0x0UL) /*!< (unspecified)                                                      */
  #define VREGMRAM_DFT_TCFG_SELVPROUT_Enabled (0x1UL) /*!< (unspecified)                                                       */

/* SELVPRREF @Bit 7 : Select VPR reference to V_TST */
  #define VREGMRAM_DFT_TCFG_SELVPRREF_Pos (7UL)      /*!< Position of SELVPRREF field.                                         */
  #define VREGMRAM_DFT_TCFG_SELVPRREF_Msk (0x1UL << VREGMRAM_DFT_TCFG_SELVPRREF_Pos) /*!< Bit mask of SELVPRREF field.         */
  #define VREGMRAM_DFT_TCFG_SELVPRREF_Min (0x0UL)    /*!< Min enumerator value of SELVPRREF field.                             */
  #define VREGMRAM_DFT_TCFG_SELVPRREF_Max (0x1UL)    /*!< Max enumerator value of SELVPRREF field.                             */
  #define VREGMRAM_DFT_TCFG_SELVPRREF_Disabled (0x0UL) /*!< (unspecified)                                                      */
  #define VREGMRAM_DFT_TCFG_SELVPRREF_Enabled (0x1UL) /*!< (unspecified)                                                       */

/* SELVREFGENCAL @Bit 8 : Select vref gen v calib to V_TST */
  #define VREGMRAM_DFT_TCFG_SELVREFGENCAL_Pos (8UL)  /*!< Position of SELVREFGENCAL field.                                     */
  #define VREGMRAM_DFT_TCFG_SELVREFGENCAL_Msk (0x1UL << VREGMRAM_DFT_TCFG_SELVREFGENCAL_Pos) /*!< Bit mask of SELVREFGENCAL
                                                                            field.*/                                              
  #define VREGMRAM_DFT_TCFG_SELVREFGENCAL_Min (0x0UL) /*!< Min enumerator value of SELVREFGENCAL field.                        */
  #define VREGMRAM_DFT_TCFG_SELVREFGENCAL_Max (0x1UL) /*!< Max enumerator value of SELVREFGENCAL field.                        */
  #define VREGMRAM_DFT_TCFG_SELVREFGENCAL_Disabled (0x0UL) /*!< (unspecified)                                                  */
  #define VREGMRAM_DFT_TCFG_SELVREFGENCAL_Enabled (0x1UL) /*!< (unspecified)                                                   */


/* ===================================================== Struct VREGMRAM ===================================================== */
/**
  * @brief VREGMRAM peripheral
  */
  typedef struct {                                   /*!< VREGMRAM Structure                                                   */
    __OM uint32_t TASKS_PWRUP;                       /*!< (@ 0x00000000) Power up the VREF and VPR regulator                   */
    __OM uint32_t TASKS_PWRDOWN;                     /*!< (@ 0x00000004) Power down the VREF and VPR regulator                 */
    __IM uint32_t RESERVED[62];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) The regulator power up done                           */
    __IM uint32_t RESERVED1[127];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUSANA;                         /*!< (@ 0x00000400) Status of analog module output signals                */
    __IM uint32_t RESERVED3[15];
    __IOM NRF_VREGMRAM_TRIM_Type TRIM;               /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED4[12];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
    __IOM uint32_t VPRBLEED;                         /*!< (@ 0x00000484) Enable VPR output load current                        */
    __IOM uint32_t VREFADAPTIVEBIAS;                 /*!< (@ 0x00000488) Adaptive bias enable for VREF                         */
    __IOM uint32_t VPRADAPTIVEBIAS;                  /*!< (@ 0x0000048C) Adaptive bias enable for VPR                          */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000490) MRAM regulator mode                                   */
    __IM uint32_t RESERVED5[27];
    __IOM NRF_VREGMRAM_OVERRIDE_Type OVERRIDE;       /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED6[61];
    __IOM NRF_VREGMRAM_DFT_Type DFT;                 /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_VREGMRAM_Type;                               /*!< Size = 1588 (0x634)                                                  */

/* VREGMRAM_TASKS_PWRUP: Power up the VREF and VPR regulator */
  #define VREGMRAM_TASKS_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWRUP register.                             */

/* TASKS_PWRUP @Bit 0 : Power up the VREF and VPR regulator */
  #define VREGMRAM_TASKS_PWRUP_TASKS_PWRUP_Pos (0UL) /*!< Position of TASKS_PWRUP field.                                       */
  #define VREGMRAM_TASKS_PWRUP_TASKS_PWRUP_Msk (0x1UL << VREGMRAM_TASKS_PWRUP_TASKS_PWRUP_Pos) /*!< Bit mask of TASKS_PWRUP
                                                                            field.*/                                              
  #define VREGMRAM_TASKS_PWRUP_TASKS_PWRUP_Min (0x1UL) /*!< Min enumerator value of TASKS_PWRUP field.                         */
  #define VREGMRAM_TASKS_PWRUP_TASKS_PWRUP_Max (0x1UL) /*!< Max enumerator value of TASKS_PWRUP field.                         */
  #define VREGMRAM_TASKS_PWRUP_TASKS_PWRUP_Trigger (0x1UL) /*!< Trigger task                                                   */


