adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VREGMRAM_TASKS_PWRDOWN: Power down the VREF and VPR regulator */
  #define VREGMRAM_TASKS_PWRDOWN_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWRDOWN register.                         */

/* TASKS_PWRDOWN @Bit 0 : Power down the VREF and VPR regulator */
  #define VREGMRAM_TASKS_PWRDOWN_TASKS_PWRDOWN_Pos (0UL) /*!< Position of TASKS_PWRDOWN field.                                 */
  #define VREGMRAM_TASKS_PWRDOWN_TASKS_PWRDOWN_Msk (0x1UL << VREGMRAM_TASKS_PWRDOWN_TASKS_PWRDOWN_Pos) /*!< Bit mask of
                                                                            TASKS_PWRDOWN field.*/                                
  #define VREGMRAM_TASKS_PWRDOWN_TASKS_PWRDOWN_Min (0x1UL) /*!< Min enumerator value of TASKS_PWRDOWN field.                   */
  #define VREGMRAM_TASKS_PWRDOWN_TASKS_PWRDOWN_Max (0x1UL) /*!< Max enumerator value of TASKS_PWRDOWN field.                   */
  #define VREGMRAM_TASKS_PWRDOWN_TASKS_PWRDOWN_Trigger (0x1UL) /*!< Trigger task                                               */


/* VREGMRAM_EVENTS_READY: The regulator power up done */
  #define VREGMRAM_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                           */

/* EVENTS_READY @Bit 0 : The regulator power up done */
  #define VREGMRAM_EVENTS_READY_EVENTS_READY_Pos (0UL) /*!< Position of EVENTS_READY field.                                    */
  #define VREGMRAM_EVENTS_READY_EVENTS_READY_Msk (0x1UL << VREGMRAM_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of EVENTS_READY
                                                                            field.*/                                              
  #define VREGMRAM_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                      */
  #define VREGMRAM_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                      */
  #define VREGMRAM_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define VREGMRAM_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                            */


/* VREGMRAM_INTEN: Enable or disable interrupt */
  #define VREGMRAM_INTEN_ResetValue (0x00000000UL)   /*!< Reset value of INTEN register.                                       */

/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define VREGMRAM_INTEN_READY_Pos (0UL)             /*!< Position of READY field.                                             */
  #define VREGMRAM_INTEN_READY_Msk (0x1UL << VREGMRAM_INTEN_READY_Pos) /*!< Bit mask of READY field.                           */
  #define VREGMRAM_INTEN_READY_Min (0x0UL)           /*!< Min enumerator value of READY field.                                 */
  #define VREGMRAM_INTEN_READY_Max (0x1UL)           /*!< Max enumerator value of READY field.                                 */
  #define VREGMRAM_INTEN_READY_Disabled (0x0UL)      /*!< Disable                                                              */
  #define VREGMRAM_INTEN_READY_Enabled (0x1UL)       /*!< Enable                                                               */


/* VREGMRAM_INTENSET: Enable interrupt */
  #define VREGMRAM_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                   */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define VREGMRAM_INTENSET_READY_Pos (0UL)          /*!< Position of READY field.                                             */
  #define VREGMRAM_INTENSET_READY_Msk (0x1UL << VREGMRAM_INTENSET_READY_Pos) /*!< Bit mask of READY field.                     */
  #define VREGMRAM_INTENSET_READY_Min (0x0UL)        /*!< Min enumerator value of READY field.                                 */
  #define VREGMRAM_INTENSET_READY_Max (0x1UL)        /*!< Max enumerator value of READY field.                                 */
  #define VREGMRAM_INTENSET_READY_Set (0x1UL)        /*!< Enable                                                               */
  #define VREGMRAM_INTENSET_READY_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define VREGMRAM_INTENSET_READY_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* VREGMRAM_INTENCLR: Disable interrupt */
  #define VREGMRAM_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                   */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define VREGMRAM_INTENCLR_READY_Pos (0UL)          /*!< Position of READY field.                                             */
  #define VREGMRAM_INTENCLR_READY_Msk (0x1UL << VREGMRAM_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                     */
  #define VREGMRAM_INTENCLR_READY_Min (0x0UL)        /*!< Min enumerator value of READY field.                                 */
  #define VREGMRAM_INTENCLR_READY_Max (0x1UL)        /*!< Max enumerator value of READY field.                                 */
  #define VREGMRAM_INTENCLR_READY_Clear (0x1UL)      /*!< Disable                                                              */
  #define VREGMRAM_INTENCLR_READY_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define VREGMRAM_INTENCLR_READY_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* VREGMRAM_INTPEND: Pending interrupts */
  #define VREGMRAM_INTPEND_ResetValue (0x00000000UL) /*!< Reset value of INTPEND register.                                     */

/* READY @Bit 0 : Read pending status of interrupt for event READY */
  #define VREGMRAM_INTPEND_READY_Pos (0UL)           /*!< Position of READY field.                                             */
  #define VREGMRAM_INTPEND_READY_Msk (0x1UL << VREGMRAM_INTPEND_READY_Pos) /*!< Bit mask of READY field.                       */
  #define VREGMRAM_INTPEND_READY_Min (0x0UL)         /*!< Min enumerator value of READY field.                                 */
  #define VREGMRAM_INTPEND_READY_Max (0x1UL)         /*!< Max enumerator value of READY field.                                 */
  #define VREGMRAM_INTPEND_READY_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define VREGMRAM_INTPEND_READY_Pending (0x1UL)     /*!< Read: Pending                                                        */


