adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VREGUSB_CONFIG_SETL0V8TIM: Time from LDOs ready to SETTLED0V8 (125us-1000us) */
  #define VREGUSB_CONFIG_SETL0V8TIM_ResetValue (0x00000FA0UL) /*!< Reset value of SETL0V8TIM register.                         */

/* VAL @Bits 0..13 : Timer value */
  #define VREGUSB_CONFIG_SETL0V8TIM_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VREGUSB_CONFIG_SETL0V8TIM_VAL_Msk (0x3FFFUL << VREGUSB_CONFIG_SETL0V8TIM_VAL_Pos) /*!< Bit mask of VAL field.        */
  #define VREGUSB_CONFIG_SETL0V8TIM_VAL_Min (0x07D0UL) /*!< 125 us                                                             */
  #define VREGUSB_CONFIG_SETL0V8TIM_VAL_Default (0x0FA0UL) /*!< 250 us                                                         */
  #define VREGUSB_CONFIG_SETL0V8TIM_VAL_Max (0x3E80UL) /*!< 1000 us                                                            */


/* VREGUSB_CONFIG_SETL3V3TIM: Time from SETTLED0V8 to SETTLED3V3 (0us-1000us) */
  #define VREGUSB_CONFIG_SETL3V3TIM_ResetValue (0x00000FA0UL) /*!< Reset value of SETL3V3TIM register.                         */

/* VAL @Bits 0..13 : Timer value */
  #define VREGUSB_CONFIG_SETL3V3TIM_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VREGUSB_CONFIG_SETL3V3TIM_VAL_Msk (0x3FFFUL << VREGUSB_CONFIG_SETL3V3TIM_VAL_Pos) /*!< Bit mask of VAL field.        */
  #define VREGUSB_CONFIG_SETL3V3TIM_VAL_Min (0x0000UL) /*!< 0 us                                                               */
  #define VREGUSB_CONFIG_SETL3V3TIM_VAL_Default (0x0FA0UL) /*!< 250 us                                                         */
  #define VREGUSB_CONFIG_SETL3V3TIM_VAL_Max (0x3E80UL) /*!< 1000 us                                                            */



/* =================================================== Struct VREGUSB_TRIM =================================================== */
/**
  * @brief TRIM [VREGUSB_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TRIMVDD;                           /*!< (@ 0x00000000) Trim USB PM internal 1.8V voltage                     */
  __IOM uint32_t  TRIMIBP;                           /*!< (@ 0x00000004) Trim 10uA IBP bias current                            */
  __IOM uint32_t  TRIM0V8;                           /*!< (@ 0x00000008) Trim USB PHY 0.8V DVDD                                */
  __IOM uint32_t  TRIM3V3;                           /*!< (@ 0x0000000C) Trim USB PHY 3.3V VDD                                 */
} NRF_VREGUSB_TRIM_Type;                             /*!< Size = 16 (0x010)                                                    */

/* VREGUSB_TRIM_TRIMVDD: Trim USB PM internal 1.8V voltage */
  #define VREGUSB_TRIM_TRIMVDD_ResetValue (0x00000008UL) /*!< Reset value of TRIMVDD register.                                 */

/* VAL @Bits 0..3 : Voltage offset trimming value */
  #define VREGUSB_TRIM_TRIMVDD_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define VREGUSB_TRIM_TRIMVDD_VAL_Msk (0xFUL << VREGUSB_TRIM_TRIMVDD_VAL_Pos) /*!< Bit mask of VAL field.                     */
  #define VREGUSB_TRIM_TRIMVDD_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                             */
  #define VREGUSB_TRIM_TRIMVDD_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                              */


/* VREGUSB_TRIM_TRIMIBP: Trim 10uA IBP bias current */
  #define VREGUSB_TRIM_TRIMIBP_ResetValue (0x00000008UL) /*!< Reset value of TRIMIBP register.                                 */

/* VAL @Bits 0..3 : Bias current trimming value */
  #define VREGUSB_TRIM_TRIMIBP_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define VREGUSB_TRIM_TRIMIBP_VAL_Msk (0xFUL << VREGUSB_TRIM_TRIMIBP_VAL_Pos) /*!< Bit mask of VAL field.                     */
  #define VREGUSB_TRIM_TRIMIBP_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                             */
  #define VREGUSB_TRIM_TRIMIBP_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                              */


/* VREGUSB_TRIM_TRIM0V8: Trim USB PHY 0.8V DVDD */
  #define VREGUSB_TRIM_TRIM0V8_ResetValue (0x00000008UL) /*!< Reset value of TRIM0V8 register.                                 */

/* VAL @Bits 0..3 : Voltage offset trimming value */
  #define VREGUSB_TRIM_TRIM0V8_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define VREGUSB_TRIM_TRIM0V8_VAL_Msk (0xFUL << VREGUSB_TRIM_TRIM0V8_VAL_Pos) /*!< Bit mask of VAL field.                     */
  #define VREGUSB_TRIM_TRIM0V8_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                             */
  #define VREGUSB_TRIM_TRIM0V8_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                              */


/* VREGUSB_TRIM_TRIM3V3: Trim USB PHY 3.3V VDD */
  #define VREGUSB_TRIM_TRIM3V3_ResetValue (0x00000008UL) /*!< Reset value of TRIM3V3 register.                                 */

/* VAL @Bits 0..3 : Voltage offset trimming value */
  #define VREGUSB_TRIM_TRIM3V3_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define VREGUSB_TRIM_TRIM3V3_VAL_Msk (0xFUL << VREGUSB_TRIM_TRIM3V3_VAL_Pos) /*!< Bit mask of VAL field.                     */
  #define VREGUSB_TRIM_TRIM3V3_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                             */
  #define VREGUSB_TRIM_TRIM3V3_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                              */



/* ================================================= Struct VREGUSB_OVERRIDE ================================================= */
/**
  * @brief OVERRIDE [VREGUSB_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  VBUSDETRAW;                        /*!< (@ 0x00000000) Override the raw VBUSDET from the analog module       */
  __IOM uint32_t  VBUSDET;                           /*!< (@ 0x00000004) Override the filtered VBUSDET from the digital part   */
  __IOM uint32_t  SETTLED0V8;                        /*!< (@ 0x00000008) Override the SETTLED0V8 from the digital part         */
  __IOM uint32_t  SETTLED3V3;                        /*!< (@ 0x0000000C) Override the SETTLED3V3 from the digital part         */
} NRF_VREGUSB_OVERRIDE_Type;                         /*!< Size = 16 (0x010)                                                    */

/* VREGUSB_OVERRIDE_VBUSDETRAW: Override the raw VBUSDET from the analog module */
  #define VREGUSB_OVERRIDE_VBUSDETRAW_ResetValue (0x00000000UL) /*!< Reset value of VBUSDETRAW register.                       */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGUSB_OVERRIDE_VBUSDETRAW_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define VREGUSB_OVERRIDE_VBUSDETRAW_VAL_Msk (0x1UL << VREGUSB_OVERRIDE_VBUSDETRAW_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : Enable the override */
  #define VREGUSB_OVERRIDE_VBUSDETRAW_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define VREGUSB_OVERRIDE_VBUSDETRAW_EN_Msk (0x1UL << VREGUSB_OVERRIDE_VBUSDETRAW_EN_Pos) /*!< Bit mask of EN field.          */
  #define VREGUSB_OVERRIDE_VBUSDETRAW_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define VREGUSB_OVERRIDE_VBUSDETRAW_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define VREGUSB_OVERRIDE_VBUSDETRAW_EN_Disabled (0x0UL) /*!< Override is disabled                                            */
  #define VREGUSB_OVERRIDE_VBUSDETRAW_EN_Enabled (0x1UL) /*!< Override is enabled                                              */


/* VREGUSB_OVERRIDE_VBUSDET: Override the filtered VBUSDET from the digital part */
  #define VREGUSB_OVERRIDE_VBUSDET_ResetValue (0x00000000UL) /*!< Reset value of VBUSDET register.                             */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGUSB_OVERRIDE_VBUSDET_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VREGUSB_OVERRIDE_VBUSDET_VAL_Msk (0x1UL << VREGUSB_OVERRIDE_VBUSDET_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VREGUSB_OVERRIDE_VBUSDET_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGUSB_OVERRIDE_VBUSDET_EN_Msk (0x1UL << VREGUSB_OVERRIDE_VBUSDET_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGUSB_OVERRIDE_VBUSDET_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGUSB_OVERRIDE_VBUSDET_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGUSB_OVERRIDE_VBUSDET_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VREGUSB_OVERRIDE_VBUSDET_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* VREGUSB_OVERRIDE_SETTLED0V8: Override the SETTLED0V8 from the digital part */
  #define VREGUSB_OVERRIDE_SETTLED0V8_ResetValue (0x00000000UL) /*!< Reset value of SETTLED0V8 register.                       */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGUSB_OVERRIDE_SETTLED0V8_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define VREGUSB_OVERRIDE_SETTLED0V8_VAL_Msk (0x1UL << VREGUSB_OVERRIDE_SETTLED0V8_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : Enable the override */
  #define VREGUSB_OVERRIDE_SETTLED0V8_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define VREGUSB_OVERRIDE_SETTLED0V8_EN_Msk (0x1UL << VREGUSB_OVERRIDE_SETTLED0V8_EN_Pos) /*!< Bit mask of EN field.          */
  #define VREGUSB_OVERRIDE_SETTLED0V8_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define VREGUSB_OVERRIDE_SETTLED0V8_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define VREGUSB_OVERRIDE_SETTLED0V8_EN_Disabled (0x0UL) /*!< Override is disabled                                            */
  #define VREGUSB_OVERRIDE_SETTLED0V8_EN_Enabled (0x1UL) /*!< Override is enabled                                              */


