adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VREGUSB_OVERRIDE_SETTLED3V3: Override the SETTLED3V3 from the digital part */
  #define VREGUSB_OVERRIDE_SETTLED3V3_ResetValue (0x00000000UL) /*!< Reset value of SETTLED3V3 register.                       */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGUSB_OVERRIDE_SETTLED3V3_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define VREGUSB_OVERRIDE_SETTLED3V3_VAL_Msk (0x1UL << VREGUSB_OVERRIDE_SETTLED3V3_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : Enable the override */
  #define VREGUSB_OVERRIDE_SETTLED3V3_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define VREGUSB_OVERRIDE_SETTLED3V3_EN_Msk (0x1UL << VREGUSB_OVERRIDE_SETTLED3V3_EN_Pos) /*!< Bit mask of EN field.          */
  #define VREGUSB_OVERRIDE_SETTLED3V3_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define VREGUSB_OVERRIDE_SETTLED3V3_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define VREGUSB_OVERRIDE_SETTLED3V3_EN_Disabled (0x0UL) /*!< Override is disabled                                            */
  #define VREGUSB_OVERRIDE_SETTLED3V3_EN_Enabled (0x1UL) /*!< Override is enabled                                              */



/* =================================================== Struct VREGUSB_DFT ==================================================== */
/**
  * @brief DFT [VREGUSB_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IM  uint32_t  RESERVED1[7];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
} NRF_VREGUSB_DFT_Type;                              /*!< Size = 52 (0x034)                                                    */

/* VREGUSB_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define VREGUSB_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                            */

/* EN @Bit 31 : Enable the analog test bus */
  #define VREGUSB_DFT_ATB0CONFIG_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VREGUSB_DFT_ATB0CONFIG_EN_Msk (0x1UL << VREGUSB_DFT_ATB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VREGUSB_DFT_ATB0CONFIG_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VREGUSB_DFT_ATB0CONFIG_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VREGUSB_DFT_ATB0CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                          */
  #define VREGUSB_DFT_ATB0CONFIG_EN_Enabled (0x1UL)  /*!< Analog test bus is enabled                                           */


/* VREGUSB_DFT_ATB1CONFIG: Analog Test Bus 1 (ATB1) configuration */
  #define VREGUSB_DFT_ATB1CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB1CONFIG register.                            */

/* EN @Bit 31 : Enable the analog test bus */
  #define VREGUSB_DFT_ATB1CONFIG_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VREGUSB_DFT_ATB1CONFIG_EN_Msk (0x1UL << VREGUSB_DFT_ATB1CONFIG_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VREGUSB_DFT_ATB1CONFIG_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VREGUSB_DFT_ATB1CONFIG_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VREGUSB_DFT_ATB1CONFIG_EN_Disabled (0x0UL) /*!< Analog test bus is disabled                                          */
  #define VREGUSB_DFT_ATB1CONFIG_EN_Enabled (0x1UL)  /*!< Analog test bus is enabled                                           */


/* VREGUSB_DFT_DTB0CONFIG: Digital Test Bus 0 (DTB0) configuration */
  #define VREGUSB_DFT_DTB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of DTB0CONFIG register.                            */

/* EN @Bit 31 : Enable the digital test bus */
  #define VREGUSB_DFT_DTB0CONFIG_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VREGUSB_DFT_DTB0CONFIG_EN_Msk (0x1UL << VREGUSB_DFT_DTB0CONFIG_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VREGUSB_DFT_DTB0CONFIG_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VREGUSB_DFT_DTB0CONFIG_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VREGUSB_DFT_DTB0CONFIG_EN_Disabled (0x0UL) /*!< Digital test bus is disabled                                         */
  #define VREGUSB_DFT_DTB0CONFIG_EN_Enabled (0x1UL)  /*!< Digital test bus is enabled                                          */


/* VREGUSB_DFT_TCFG: Test mode configuration */
  #define VREGUSB_DFT_TCFG_ResetValue (0x00000000UL) /*!< Reset value of TCFG register.                                        */

/* TESTLOAD3V3 @Bit 0 : Test load LDO 3V3 */
  #define VREGUSB_DFT_TCFG_TESTLOAD3V3_Pos (0UL)     /*!< Position of TESTLOAD3V3 field.                                       */
  #define VREGUSB_DFT_TCFG_TESTLOAD3V3_Msk (0x1UL << VREGUSB_DFT_TCFG_TESTLOAD3V3_Pos) /*!< Bit mask of TESTLOAD3V3 field.     */
  #define VREGUSB_DFT_TCFG_TESTLOAD3V3_Min (0x0UL)   /*!< Min enumerator value of TESTLOAD3V3 field.                           */
  #define VREGUSB_DFT_TCFG_TESTLOAD3V3_Max (0x1UL)   /*!< Max enumerator value of TESTLOAD3V3 field.                           */
  #define VREGUSB_DFT_TCFG_TESTLOAD3V3_Disabled (0x0UL) /*!< Normal operation                                                  */
  #define VREGUSB_DFT_TCFG_TESTLOAD3V3_Enabled (0x1UL) /*!< Test mode enabled                                                  */

/* TESTLOAD0V8 @Bit 1 : Test load LDO 0V8 */
  #define VREGUSB_DFT_TCFG_TESTLOAD0V8_Pos (1UL)     /*!< Position of TESTLOAD0V8 field.                                       */
  #define VREGUSB_DFT_TCFG_TESTLOAD0V8_Msk (0x1UL << VREGUSB_DFT_TCFG_TESTLOAD0V8_Pos) /*!< Bit mask of TESTLOAD0V8 field.     */
  #define VREGUSB_DFT_TCFG_TESTLOAD0V8_Min (0x0UL)   /*!< Min enumerator value of TESTLOAD0V8 field.                           */
  #define VREGUSB_DFT_TCFG_TESTLOAD0V8_Max (0x1UL)   /*!< Max enumerator value of TESTLOAD0V8 field.                           */
  #define VREGUSB_DFT_TCFG_TESTLOAD0V8_Disabled (0x0UL) /*!< Normal operation                                                  */
  #define VREGUSB_DFT_TCFG_TESTLOAD0V8_Enabled (0x1UL) /*!< Test mode enabled                                                  */

