adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* SETTLED0V8 @Bit 2 : Read pending status of interrupt for event SETTLED0V8 */
  #define VREGUSB_INTPEND_SETTLED0V8_Pos (2UL)       /*!< Position of SETTLED0V8 field.                                        */
  #define VREGUSB_INTPEND_SETTLED0V8_Msk (0x1UL << VREGUSB_INTPEND_SETTLED0V8_Pos) /*!< Bit mask of SETTLED0V8 field.          */
  #define VREGUSB_INTPEND_SETTLED0V8_Min (0x0UL)     /*!< Min enumerator value of SETTLED0V8 field.                            */
  #define VREGUSB_INTPEND_SETTLED0V8_Max (0x1UL)     /*!< Max enumerator value of SETTLED0V8 field.                            */
  #define VREGUSB_INTPEND_SETTLED0V8_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define VREGUSB_INTPEND_SETTLED0V8_Pending (0x1UL) /*!< Read: Pending                                                        */

/* SETTLED3V3 @Bit 3 : Read pending status of interrupt for event SETTLED3V3 */
  #define VREGUSB_INTPEND_SETTLED3V3_Pos (3UL)       /*!< Position of SETTLED3V3 field.                                        */
  #define VREGUSB_INTPEND_SETTLED3V3_Msk (0x1UL << VREGUSB_INTPEND_SETTLED3V3_Pos) /*!< Bit mask of SETTLED3V3 field.          */
  #define VREGUSB_INTPEND_SETTLED3V3_Min (0x0UL)     /*!< Min enumerator value of SETTLED3V3 field.                            */
  #define VREGUSB_INTPEND_SETTLED3V3_Max (0x1UL)     /*!< Max enumerator value of SETTLED3V3 field.                            */
  #define VREGUSB_INTPEND_SETTLED3V3_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define VREGUSB_INTPEND_SETTLED3V3_Pending (0x1UL) /*!< Read: Pending                                                        */

/* VBUSREMOVED @Bit 4 : Read pending status of interrupt for event VBUSREMOVED */
  #define VREGUSB_INTPEND_VBUSREMOVED_Pos (4UL)      /*!< Position of VBUSREMOVED field.                                       */
  #define VREGUSB_INTPEND_VBUSREMOVED_Msk (0x1UL << VREGUSB_INTPEND_VBUSREMOVED_Pos) /*!< Bit mask of VBUSREMOVED field.       */
  #define VREGUSB_INTPEND_VBUSREMOVED_Min (0x0UL)    /*!< Min enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTPEND_VBUSREMOVED_Max (0x1UL)    /*!< Max enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTPEND_VBUSREMOVED_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define VREGUSB_INTPEND_VBUSREMOVED_Pending (0x1UL) /*!< Read: Pending                                                       */


/* VREGUSB_STATUS: Status of USB PM */
  #define VREGUSB_STATUS_ResetValue (0x00000000UL)   /*!< Reset value of STATUS register.                                      */

/* READY @Bit 0 : USB PM ready */
  #define VREGUSB_STATUS_READY_Pos (0UL)             /*!< Position of READY field.                                             */
  #define VREGUSB_STATUS_READY_Msk (0x1UL << VREGUSB_STATUS_READY_Pos) /*!< Bit mask of READY field.                           */
  #define VREGUSB_STATUS_READY_Min (0x0UL)           /*!< Min enumerator value of READY field.                                 */
  #define VREGUSB_STATUS_READY_Max (0x1UL)           /*!< Max enumerator value of READY field.                                 */
  #define VREGUSB_STATUS_READY_PowerDown (0x0UL)     /*!< USB PM powered down                                                  */
  #define VREGUSB_STATUS_READY_Powered (0x1UL)       /*!< USB PM powered up                                                    */

/* VBUSDETRAW @Bit 1 : VBUS detected, raw signal */
  #define VREGUSB_STATUS_VBUSDETRAW_Pos (1UL)        /*!< Position of VBUSDETRAW field.                                        */
  #define VREGUSB_STATUS_VBUSDETRAW_Msk (0x1UL << VREGUSB_STATUS_VBUSDETRAW_Pos) /*!< Bit mask of VBUSDETRAW field.            */
  #define VREGUSB_STATUS_VBUSDETRAW_Min (0x0UL)      /*!< Min enumerator value of VBUSDETRAW field.                            */
  #define VREGUSB_STATUS_VBUSDETRAW_Max (0x1UL)      /*!< Max enumerator value of VBUSDETRAW field.                            */
  #define VREGUSB_STATUS_VBUSDETRAW_NotVbusDetRaw (0x0UL) /*!< VBUS not detected                                               */
  #define VREGUSB_STATUS_VBUSDETRAW_VbusDetRaw (0x1UL) /*!< VBUS detected                                                      */

/* VBUSDET @Bit 2 : VBUS detected, filtered */
  #define VREGUSB_STATUS_VBUSDET_Pos (2UL)           /*!< Position of VBUSDET field.                                           */
  #define VREGUSB_STATUS_VBUSDET_Msk (0x1UL << VREGUSB_STATUS_VBUSDET_Pos) /*!< Bit mask of VBUSDET field.                     */
  #define VREGUSB_STATUS_VBUSDET_Min (0x0UL)         /*!< Min enumerator value of VBUSDET field.                               */
  #define VREGUSB_STATUS_VBUSDET_Max (0x1UL)         /*!< Max enumerator value of VBUSDET field.                               */
  #define VREGUSB_STATUS_VBUSDET_NotVbusDet (0x0UL)  /*!< VBUS not detected                                                    */
  #define VREGUSB_STATUS_VBUSDET_VbusDet (0x1UL)     /*!< VBUS detected                                                        */

/* READY0V8 @Bit 3 : Power 0V8 ready */
  #define VREGUSB_STATUS_READY0V8_Pos (3UL)          /*!< Position of READY0V8 field.                                          */
  #define VREGUSB_STATUS_READY0V8_Msk (0x1UL << VREGUSB_STATUS_READY0V8_Pos) /*!< Bit mask of READY0V8 field.                  */
  #define VREGUSB_STATUS_READY0V8_Min (0x0UL)        /*!< Min enumerator value of READY0V8 field.                              */
  #define VREGUSB_STATUS_READY0V8_Max (0x1UL)        /*!< Max enumerator value of READY0V8 field.                              */
  #define VREGUSB_STATUS_READY0V8_NotReady0v8 (0x0UL) /*!< Power 0V8 not ready                                                 */
  #define VREGUSB_STATUS_READY0V8_Ready0v8 (0x1UL)   /*!< Power 0V8 ready                                                      */

/* SETTLED0V8 @Bit 4 : Power 0V8 settled */
  #define VREGUSB_STATUS_SETTLED0V8_Pos (4UL)        /*!< Position of SETTLED0V8 field.                                        */
  #define VREGUSB_STATUS_SETTLED0V8_Msk (0x1UL << VREGUSB_STATUS_SETTLED0V8_Pos) /*!< Bit mask of SETTLED0V8 field.            */
  #define VREGUSB_STATUS_SETTLED0V8_Min (0x0UL)      /*!< Min enumerator value of SETTLED0V8 field.                            */
  #define VREGUSB_STATUS_SETTLED0V8_Max (0x1UL)      /*!< Max enumerator value of SETTLED0V8 field.                            */
  #define VREGUSB_STATUS_SETTLED0V8_NotSettled0v8 (0x0UL) /*!< Power 0V8 not settled                                           */
  #define VREGUSB_STATUS_SETTLED0V8_Settled0v8 (0x1UL) /*!< Power 0V8 settled                                                  */

