adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* READY3V3 @Bit 5 : Power 3V3 ready */
  #define VREGUSB_STATUS_READY3V3_Pos (5UL)          /*!< Position of READY3V3 field.                                          */
  #define VREGUSB_STATUS_READY3V3_Msk (0x1UL << VREGUSB_STATUS_READY3V3_Pos) /*!< Bit mask of READY3V3 field.                  */
  #define VREGUSB_STATUS_READY3V3_Min (0x0UL)        /*!< Min enumerator value of READY3V3 field.                              */
  #define VREGUSB_STATUS_READY3V3_Max (0x1UL)        /*!< Max enumerator value of READY3V3 field.                              */
  #define VREGUSB_STATUS_READY3V3_NotReady3v3 (0x0UL) /*!< Power 3V3 not ready                                                 */
  #define VREGUSB_STATUS_READY3V3_Ready3v3 (0x1UL)   /*!< Power 3V3 ready                                                      */

/* SETTLED3V3 @Bit 6 : Power 3V3 settled */
  #define VREGUSB_STATUS_SETTLED3V3_Pos (6UL)        /*!< Position of SETTLED3V3 field.                                        */
  #define VREGUSB_STATUS_SETTLED3V3_Msk (0x1UL << VREGUSB_STATUS_SETTLED3V3_Pos) /*!< Bit mask of SETTLED3V3 field.            */
  #define VREGUSB_STATUS_SETTLED3V3_Min (0x0UL)      /*!< Min enumerator value of SETTLED3V3 field.                            */
  #define VREGUSB_STATUS_SETTLED3V3_Max (0x1UL)      /*!< Max enumerator value of SETTLED3V3 field.                            */
  #define VREGUSB_STATUS_SETTLED3V3_NotSettled3v3 (0x0UL) /*!< Power 3V3 not settled                                           */
  #define VREGUSB_STATUS_SETTLED3V3_Settled3v3 (0x1UL) /*!< Power 3V3 settled                                                  */


/* VREGUSB_MIRROR: Enable LOCK for mirrored registers */
  #define VREGUSB_MIRROR_ResetValue (0x00000001UL)   /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define VREGUSB_MIRROR_LOCK_Pos (0UL)              /*!< Position of LOCK field.                                              */
  #define VREGUSB_MIRROR_LOCK_Msk (0x1UL << VREGUSB_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                              */
  #define VREGUSB_MIRROR_LOCK_Min (0x0UL)            /*!< Min enumerator value of LOCK field.                                  */
  #define VREGUSB_MIRROR_LOCK_Max (0x1UL)            /*!< Max enumerator value of LOCK field.                                  */
  #define VREGUSB_MIRROR_LOCK_Disabled (0x0UL)       /*!< Lock disabled                                                        */
  #define VREGUSB_MIRROR_LOCK_Enabled (0x1UL)        /*!< Lock enabled                                                         */


/* VREGUSB_PWRUP: Power up USB PM */
  #define VREGUSB_PWRUP_ResetValue (0x00000000UL)    /*!< Reset value of PWRUP register.                                       */

/* MANUAL @Bit 0 : Manual power mode configuration */
  #define VREGUSB_PWRUP_MANUAL_Pos (0UL)             /*!< Position of MANUAL field.                                            */
  #define VREGUSB_PWRUP_MANUAL_Msk (0x1UL << VREGUSB_PWRUP_MANUAL_Pos) /*!< Bit mask of MANUAL field.                          */
  #define VREGUSB_PWRUP_MANUAL_Min (0x0UL)           /*!< Min enumerator value of MANUAL field.                                */
  #define VREGUSB_PWRUP_MANUAL_Max (0x1UL)           /*!< Max enumerator value of MANUAL field.                                */
  #define VREGUSB_PWRUP_MANUAL_Off (0x0UL)           /*!< USB PM powered down in manual mode                                   */
  #define VREGUSB_PWRUP_MANUAL_On (0x1UL)            /*!< USB PM powered up in manual mode                                     */

/* AUTOMODE @Bit 1 : Automatic power mode configuration */
  #define VREGUSB_PWRUP_AUTOMODE_Pos (1UL)           /*!< Position of AUTOMODE field.                                          */
  #define VREGUSB_PWRUP_AUTOMODE_Msk (0x1UL << VREGUSB_PWRUP_AUTOMODE_Pos) /*!< Bit mask of AUTOMODE field.                    */
  #define VREGUSB_PWRUP_AUTOMODE_Min (0x0UL)         /*!< Min enumerator value of AUTOMODE field.                              */
  #define VREGUSB_PWRUP_AUTOMODE_Max (0x1UL)         /*!< Max enumerator value of AUTOMODE field.                              */
  #define VREGUSB_PWRUP_AUTOMODE_Auto (0x0UL)        /*!< USB PM automatically powered                                         */
  #define VREGUSB_PWRUP_AUTOMODE_Manual (0x1UL)      /*!< USB PM manually powered                                              */


/* VREGUSB_PWRUP0V8: Power up 0V8 */
  #define VREGUSB_PWRUP0V8_ResetValue (0x00000000UL) /*!< Reset value of PWRUP0V8 register.                                    */

/* MANUAL @Bit 0 : Manual power mode configuration for 0V8 regulator */
  #define VREGUSB_PWRUP0V8_MANUAL_Pos (0UL)          /*!< Position of MANUAL field.                                            */
  #define VREGUSB_PWRUP0V8_MANUAL_Msk (0x1UL << VREGUSB_PWRUP0V8_MANUAL_Pos) /*!< Bit mask of MANUAL field.                    */
  #define VREGUSB_PWRUP0V8_MANUAL_Min (0x0UL)        /*!< Min enumerator value of MANUAL field.                                */
  #define VREGUSB_PWRUP0V8_MANUAL_Max (0x1UL)        /*!< Max enumerator value of MANUAL field.                                */
  #define VREGUSB_PWRUP0V8_MANUAL_Off (0x0UL)        /*!< USB 0V8 regulator powered down in manual mode                        */
  #define VREGUSB_PWRUP0V8_MANUAL_On (0x1UL)         /*!< USB 0V8 regulator powered up in manual mode                          */

/* AUTOMODE @Bit 1 : Automatic power mode configuration */
  #define VREGUSB_PWRUP0V8_AUTOMODE_Pos (1UL)        /*!< Position of AUTOMODE field.                                          */
  #define VREGUSB_PWRUP0V8_AUTOMODE_Msk (0x1UL << VREGUSB_PWRUP0V8_AUTOMODE_Pos) /*!< Bit mask of AUTOMODE field.              */
  #define VREGUSB_PWRUP0V8_AUTOMODE_Min (0x0UL)      /*!< Min enumerator value of AUTOMODE field.                              */
  #define VREGUSB_PWRUP0V8_AUTOMODE_Max (0x1UL)      /*!< Max enumerator value of AUTOMODE field.                              */
  #define VREGUSB_PWRUP0V8_AUTOMODE_Auto (0x0UL)     /*!< USB 0V8 regulator automatically powered                              */
  #define VREGUSB_PWRUP0V8_AUTOMODE_Manual (0x1UL)   /*!< USB 0V8 regulator manually powered                                   */


