adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* VAL @Bits 0..2 : Comparator offset trimming value. */
  #define VREGVS0V8_TRIM_ULPR_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define VREGVS0V8_TRIM_ULPR_VAL_Msk (0x7UL << VREGVS0V8_TRIM_ULPR_VAL_Pos) /*!< Bit mask of VAL field.                       */
  #define VREGVS0V8_TRIM_ULPR_VAL_Min (0xFFFFFFFFUL) /*!< Min value of VAL field.                                              */
  #define VREGVS0V8_TRIM_ULPR_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                               */



/* ================================================ Struct VREGVS0V8_OVERRIDE ================================================ */
/**
  * @brief OVERRIDE [VREGVS0V8_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PWRUP;                             /*!< (@ 0x00000000) Override the PWRUP signal to the analog module        */
  __IOM uint32_t  RETAIN;                            /*!< (@ 0x00000004) Override the RETAIN signal to the analog module       */
  __IOM uint32_t  MODELP;                            /*!< (@ 0x00000008) Override the MODE LP signal to the analog module      */
  __IOM uint32_t  MODEULPR;                          /*!< (@ 0x0000000C) Override the MODE ULPR signal to the analog module    */
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000010) Override the dynamic CFG signal to the analog module  */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000014) Override the READY signal from the analog module      */
  __IOM uint32_t  SETTLED;                           /*!< (@ 0x00000018) Override the SETTLED signal from the analog module    */
  __IOM uint32_t  IOUTCMP;                           /*!< (@ 0x0000001C) Override the IOUTCMP signal from the analog module    */
} NRF_VREGVS0V8_OVERRIDE_Type;                       /*!< Size = 32 (0x020)                                                    */

/* VREGVS0V8_OVERRIDE_PWRUP: Override the PWRUP signal to the analog module */
  #define VREGVS0V8_OVERRIDE_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of PWRUP register.                               */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGVS0V8_OVERRIDE_PWRUP_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VREGVS0V8_OVERRIDE_PWRUP_VAL_Msk (0x1UL << VREGVS0V8_OVERRIDE_PWRUP_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VREGVS0V8_OVERRIDE_PWRUP_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGVS0V8_OVERRIDE_PWRUP_EN_Msk (0x1UL << VREGVS0V8_OVERRIDE_PWRUP_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGVS0V8_OVERRIDE_PWRUP_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGVS0V8_OVERRIDE_PWRUP_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGVS0V8_OVERRIDE_PWRUP_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VREGVS0V8_OVERRIDE_PWRUP_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* VREGVS0V8_OVERRIDE_RETAIN: Override the RETAIN signal to the analog module */
  #define VREGVS0V8_OVERRIDE_RETAIN_ResetValue (0x00000000UL) /*!< Reset value of RETAIN register.                             */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGVS0V8_OVERRIDE_RETAIN_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VREGVS0V8_OVERRIDE_RETAIN_VAL_Msk (0x1UL << VREGVS0V8_OVERRIDE_RETAIN_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VREGVS0V8_OVERRIDE_RETAIN_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VREGVS0V8_OVERRIDE_RETAIN_EN_Msk (0x1UL << VREGVS0V8_OVERRIDE_RETAIN_EN_Pos) /*!< Bit mask of EN field.              */
  #define VREGVS0V8_OVERRIDE_RETAIN_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VREGVS0V8_OVERRIDE_RETAIN_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VREGVS0V8_OVERRIDE_RETAIN_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VREGVS0V8_OVERRIDE_RETAIN_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* VREGVS0V8_OVERRIDE_MODELP: Override the MODE LP signal to the analog module */
  #define VREGVS0V8_OVERRIDE_MODELP_ResetValue (0x00000000UL) /*!< Reset value of MODELP register.                             */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGVS0V8_OVERRIDE_MODELP_VAL_Pos (0UL)    /*!< Position of VAL field.                                               */
  #define VREGVS0V8_OVERRIDE_MODELP_VAL_Msk (0x1UL << VREGVS0V8_OVERRIDE_MODELP_VAL_Pos) /*!< Bit mask of VAL field.           */

/* EN @Bit 31 : Enable the override */
  #define VREGVS0V8_OVERRIDE_MODELP_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define VREGVS0V8_OVERRIDE_MODELP_EN_Msk (0x1UL << VREGVS0V8_OVERRIDE_MODELP_EN_Pos) /*!< Bit mask of EN field.              */
  #define VREGVS0V8_OVERRIDE_MODELP_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define VREGVS0V8_OVERRIDE_MODELP_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define VREGVS0V8_OVERRIDE_MODELP_EN_Disabled (0x0UL) /*!< Override is disabled                                              */
  #define VREGVS0V8_OVERRIDE_MODELP_EN_Enabled (0x1UL) /*!< Override is enabled                                                */


/* VREGVS0V8_OVERRIDE_MODEULPR: Override the MODE ULPR signal to the analog module */
  #define VREGVS0V8_OVERRIDE_MODEULPR_ResetValue (0x00000000UL) /*!< Reset value of MODEULPR register.                         */

/* VAL @Bit 0 : Override value for the signal */
  #define VREGVS0V8_OVERRIDE_MODEULPR_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define VREGVS0V8_OVERRIDE_MODEULPR_VAL_Msk (0x1UL << VREGVS0V8_OVERRIDE_MODEULPR_VAL_Pos) /*!< Bit mask of VAL field.       */

/* EN @Bit 31 : Enable the override */
  #define VREGVS0V8_OVERRIDE_MODEULPR_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define VREGVS0V8_OVERRIDE_MODEULPR_EN_Msk (0x1UL << VREGVS0V8_OVERRIDE_MODEULPR_EN_Pos) /*!< Bit mask of EN field.          */
  #define VREGVS0V8_OVERRIDE_MODEULPR_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define VREGVS0V8_OVERRIDE_MODEULPR_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define VREGVS0V8_OVERRIDE_MODEULPR_EN_Disabled (0x0UL) /*!< Override is disabled                                            */
  #define VREGVS0V8_OVERRIDE_MODEULPR_EN_Enabled (0x1UL) /*!< Override is enabled                                              */


/* VREGVS0V8_OVERRIDE_CFG: Override the dynamic CFG signal to the analog module */
  #define VREGVS0V8_OVERRIDE_CFG_ResetValue (0x00000000UL) /*!< Reset value of CFG register.                                   */

/* VAL @Bits 0..1 : Override value for the signal */
  #define VREGVS0V8_OVERRIDE_CFG_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define VREGVS0V8_OVERRIDE_CFG_VAL_Msk (0x3UL << VREGVS0V8_OVERRIDE_CFG_VAL_Pos) /*!< Bit mask of VAL field.                 */

/* EN @Bit 31 : Enable the override */
  #define VREGVS0V8_OVERRIDE_CFG_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define VREGVS0V8_OVERRIDE_CFG_EN_Msk (0x1UL << VREGVS0V8_OVERRIDE_CFG_EN_Pos) /*!< Bit mask of EN field.                    */
  #define VREGVS0V8_OVERRIDE_CFG_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define VREGVS0V8_OVERRIDE_CFG_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define VREGVS0V8_OVERRIDE_CFG_EN_Disabled (0x0UL) /*!< Override is disabled                                                 */
  #define VREGVS0V8_OVERRIDE_CFG_EN_Enabled (0x1UL)  /*!< Override is enabled                                                  */


/* VREGVS0V8_OVERRIDE_READY: Override the READY signal from the analog module */
  #define VREGVS0V8_OVERRIDE_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                               */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGVS0V8_OVERRIDE_READY_VAL_Pos (0UL)     /*!< Position of VAL field.                                               */
  #define VREGVS0V8_OVERRIDE_READY_VAL_Msk (0x1UL << VREGVS0V8_OVERRIDE_READY_VAL_Pos) /*!< Bit mask of VAL field.             */

/* EN @Bit 31 : Enable the override */
  #define VREGVS0V8_OVERRIDE_READY_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define VREGVS0V8_OVERRIDE_READY_EN_Msk (0x1UL << VREGVS0V8_OVERRIDE_READY_EN_Pos) /*!< Bit mask of EN field.                */
  #define VREGVS0V8_OVERRIDE_READY_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define VREGVS0V8_OVERRIDE_READY_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define VREGVS0V8_OVERRIDE_READY_EN_Disabled (0x0UL) /*!< Override is disabled                                               */
  #define VREGVS0V8_OVERRIDE_READY_EN_Enabled (0x1UL) /*!< Override is enabled                                                 */


/* VREGVS0V8_OVERRIDE_SETTLED: Override the SETTLED signal from the analog module */
  #define VREGVS0V8_OVERRIDE_SETTLED_ResetValue (0x00000000UL) /*!< Reset value of SETTLED register.                           */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGVS0V8_OVERRIDE_SETTLED_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define VREGVS0V8_OVERRIDE_SETTLED_VAL_Msk (0x1UL << VREGVS0V8_OVERRIDE_SETTLED_VAL_Pos) /*!< Bit mask of VAL field.         */

/* EN @Bit 31 : Enable the override */
  #define VREGVS0V8_OVERRIDE_SETTLED_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define VREGVS0V8_OVERRIDE_SETTLED_EN_Msk (0x1UL << VREGVS0V8_OVERRIDE_SETTLED_EN_Pos) /*!< Bit mask of EN field.            */
  #define VREGVS0V8_OVERRIDE_SETTLED_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define VREGVS0V8_OVERRIDE_SETTLED_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define VREGVS0V8_OVERRIDE_SETTLED_EN_Disabled (0x0UL) /*!< Override is disabled                                             */
  #define VREGVS0V8_OVERRIDE_SETTLED_EN_Enabled (0x1UL) /*!< Override is enabled                                               */


/* VREGVS0V8_OVERRIDE_IOUTCMP: Override the IOUTCMP signal from the analog module */
  #define VREGVS0V8_OVERRIDE_IOUTCMP_ResetValue (0x00000000UL) /*!< Reset value of IOUTCMP register.                           */

/* VAL @Bit 0 : Current value of the signal */
  #define VREGVS0V8_OVERRIDE_IOUTCMP_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define VREGVS0V8_OVERRIDE_IOUTCMP_VAL_Msk (0x1UL << VREGVS0V8_OVERRIDE_IOUTCMP_VAL_Pos) /*!< Bit mask of VAL field.         */

/* EN @Bit 31 : Enable the override */
  #define VREGVS0V8_OVERRIDE_IOUTCMP_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define VREGVS0V8_OVERRIDE_IOUTCMP_EN_Msk (0x1UL << VREGVS0V8_OVERRIDE_IOUTCMP_EN_Pos) /*!< Bit mask of EN field.            */
  #define VREGVS0V8_OVERRIDE_IOUTCMP_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define VREGVS0V8_OVERRIDE_IOUTCMP_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define VREGVS0V8_OVERRIDE_IOUTCMP_EN_Disabled (0x0UL) /*!< Override is disabled                                             */
  #define VREGVS0V8_OVERRIDE_IOUTCMP_EN_Enabled (0x1UL) /*!< Override is enabled                                               */



/* ================================================== Struct VREGVS0V8_DFT =================================================== */
/**
  * @brief DFT [VREGVS0V8_DFT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ATB0CONFIG;                        /*!< (@ 0x00000000) Analog Test Bus 0 (ATB0) configuration                */
  __IOM uint32_t  ATB1CONFIG;                        /*!< (@ 0x00000004) Analog Test Bus 1 (ATB1) configuration                */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  DTB0CONFIG;                        /*!< (@ 0x00000010) Digital Test Bus 0 (DTB0) configuration               */
  __IOM uint32_t  DTB1CONFIG;                        /*!< (@ 0x00000014) Digital Test Bus 1 (DTB1) configuration               */
  __IOM uint32_t  DTB2CONFIG;                        /*!< (@ 0x00000018) Digital Test Bus 2 (DTB2) configuration               */
  __IOM uint32_t  DTB3CONFIG;                        /*!< (@ 0x0000001C) Digital Test Bus 3 (DTB3) configuration               */
  __IM  uint32_t  RESERVED1[4];
  __IOM uint32_t  TCFG;                              /*!< (@ 0x00000030) Test mode configuration                               */
  __IOM uint32_t  CALEN;                             /*!< (@ 0x00000034) Calibration enable                                    */
  __IM  uint32_t  CALCMP;                            /*!< (@ 0x00000038) Calibration compare                                   */
} NRF_VREGVS0V8_DFT_Type;                            /*!< Size = 60 (0x03C)                                                    */

/* VREGVS0V8_DFT_ATB0CONFIG: Analog Test Bus 0 (ATB0) configuration */
  #define VREGVS0V8_DFT_ATB0CONFIG_ResetValue (0x00000000UL) /*!< Reset value of ATB0CONFIG register.                          */

