adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* WDT_RCNT: Reload count */
  #define WDT_RCNT_ResetValue (0x00000000UL)         /*!< Reset value of RCNT register.                                        */

/* RCNT @Bits 0..1 : Reload count, number of times the watchdog has been reloaded (kicked) */
  #define WDT_RCNT_RCNT_Pos (0UL)                    /*!< Position of RCNT field.                                              */
  #define WDT_RCNT_RCNT_Msk (0x3UL << WDT_RCNT_RCNT_Pos) /*!< Bit mask of RCNT field.                                          */


/* WDT_CRV: Counter reload value */
  #define WDT_CRV_ResetValue (0xFFFFFFFFUL)          /*!< Reset value of CRV register.                                         */

/* CRV @Bits 0..31 : Counter reload value in number of cycles of the 32.768 kHz clock */
  #define WDT_CRV_CRV_Pos (0UL)                      /*!< Position of CRV field.                                               */
  #define WDT_CRV_CRV_Msk (0xFFFFFFFFUL << WDT_CRV_CRV_Pos) /*!< Bit mask of CRV field.                                        */
  #define WDT_CRV_CRV_Min (0xFUL)                    /*!< Min value of CRV field.                                              */
  #define WDT_CRV_CRV_Max (0xFFFFFFFFUL)             /*!< Max size of CRV field.                                               */


/* WDT_RREN: Enable register for reload request registers */
  #define WDT_RREN_ResetValue (0x00000001UL)         /*!< Reset value of RREN register.                                        */

/* RR0 @Bit 0 : Enable or disable RR[0] register */
  #define WDT_RREN_RR0_Pos (0UL)                     /*!< Position of RR0 field.                                               */
  #define WDT_RREN_RR0_Msk (0x1UL << WDT_RREN_RR0_Pos) /*!< Bit mask of RR0 field.                                             */
  #define WDT_RREN_RR0_Min (0x0UL)                   /*!< Min enumerator value of RR0 field.                                   */
  #define WDT_RREN_RR0_Max (0x1UL)                   /*!< Max enumerator value of RR0 field.                                   */
  #define WDT_RREN_RR0_Disabled (0x0UL)              /*!< Disable RR[0] register                                               */
  #define WDT_RREN_RR0_Enabled (0x1UL)               /*!< Enable RR[0] register                                                */

/* RR1 @Bit 1 : Enable or disable RR[1] register */
  #define WDT_RREN_RR1_Pos (1UL)                     /*!< Position of RR1 field.                                               */
  #define WDT_RREN_RR1_Msk (0x1UL << WDT_RREN_RR1_Pos) /*!< Bit mask of RR1 field.                                             */
  #define WDT_RREN_RR1_Min (0x0UL)                   /*!< Min enumerator value of RR1 field.                                   */
  #define WDT_RREN_RR1_Max (0x1UL)                   /*!< Max enumerator value of RR1 field.                                   */
  #define WDT_RREN_RR1_Disabled (0x0UL)              /*!< Disable RR[1] register                                               */
  #define WDT_RREN_RR1_Enabled (0x1UL)               /*!< Enable RR[1] register                                                */

/* RR2 @Bit 2 : Enable or disable RR[2] register */
  #define WDT_RREN_RR2_Pos (2UL)                     /*!< Position of RR2 field.                                               */
  #define WDT_RREN_RR2_Msk (0x1UL << WDT_RREN_RR2_Pos) /*!< Bit mask of RR2 field.                                             */
  #define WDT_RREN_RR2_Min (0x0UL)                   /*!< Min enumerator value of RR2 field.                                   */
  #define WDT_RREN_RR2_Max (0x1UL)                   /*!< Max enumerator value of RR2 field.                                   */
  #define WDT_RREN_RR2_Disabled (0x0UL)              /*!< Disable RR[2] register                                               */
  #define WDT_RREN_RR2_Enabled (0x1UL)               /*!< Enable RR[2] register                                                */

/* RR3 @Bit 3 : Enable or disable RR[3] register */
  #define WDT_RREN_RR3_Pos (3UL)                     /*!< Position of RR3 field.                                               */
  #define WDT_RREN_RR3_Msk (0x1UL << WDT_RREN_RR3_Pos) /*!< Bit mask of RR3 field.                                             */
  #define WDT_RREN_RR3_Min (0x0UL)                   /*!< Min enumerator value of RR3 field.                                   */
  #define WDT_RREN_RR3_Max (0x1UL)                   /*!< Max enumerator value of RR3 field.                                   */
  #define WDT_RREN_RR3_Disabled (0x0UL)              /*!< Disable RR[3] register                                               */
  #define WDT_RREN_RR3_Enabled (0x1UL)               /*!< Enable RR[3] register                                                */

/* RR4 @Bit 4 : Enable or disable RR[4] register */
  #define WDT_RREN_RR4_Pos (4UL)                     /*!< Position of RR4 field.                                               */
  #define WDT_RREN_RR4_Msk (0x1UL << WDT_RREN_RR4_Pos) /*!< Bit mask of RR4 field.                                             */
  #define WDT_RREN_RR4_Min (0x0UL)                   /*!< Min enumerator value of RR4 field.                                   */
  #define WDT_RREN_RR4_Max (0x1UL)                   /*!< Max enumerator value of RR4 field.                                   */
  #define WDT_RREN_RR4_Disabled (0x0UL)              /*!< Disable RR[4] register                                               */
  #define WDT_RREN_RR4_Enabled (0x1UL)               /*!< Enable RR[4] register                                                */

/* RR5 @Bit 5 : Enable or disable RR[5] register */
  #define WDT_RREN_RR5_Pos (5UL)                     /*!< Position of RR5 field.                                               */
  #define WDT_RREN_RR5_Msk (0x1UL << WDT_RREN_RR5_Pos) /*!< Bit mask of RR5 field.                                             */
  #define WDT_RREN_RR5_Min (0x0UL)                   /*!< Min enumerator value of RR5 field.                                   */
  #define WDT_RREN_RR5_Max (0x1UL)                   /*!< Max enumerator value of RR5 field.                                   */
  #define WDT_RREN_RR5_Disabled (0x0UL)              /*!< Disable RR[5] register                                               */
  #define WDT_RREN_RR5_Enabled (0x1UL)               /*!< Enable RR[5] register                                                */

