adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* RR6 @Bit 6 : Enable or disable RR[6] register */
  #define WDT_RREN_RR6_Pos (6UL)                     /*!< Position of RR6 field.                                               */
  #define WDT_RREN_RR6_Msk (0x1UL << WDT_RREN_RR6_Pos) /*!< Bit mask of RR6 field.                                             */
  #define WDT_RREN_RR6_Min (0x0UL)                   /*!< Min enumerator value of RR6 field.                                   */
  #define WDT_RREN_RR6_Max (0x1UL)                   /*!< Max enumerator value of RR6 field.                                   */
  #define WDT_RREN_RR6_Disabled (0x0UL)              /*!< Disable RR[6] register                                               */
  #define WDT_RREN_RR6_Enabled (0x1UL)               /*!< Enable RR[6] register                                                */

/* RR7 @Bit 7 : Enable or disable RR[7] register */
  #define WDT_RREN_RR7_Pos (7UL)                     /*!< Position of RR7 field.                                               */
  #define WDT_RREN_RR7_Msk (0x1UL << WDT_RREN_RR7_Pos) /*!< Bit mask of RR7 field.                                             */
  #define WDT_RREN_RR7_Min (0x0UL)                   /*!< Min enumerator value of RR7 field.                                   */
  #define WDT_RREN_RR7_Max (0x1UL)                   /*!< Max enumerator value of RR7 field.                                   */
  #define WDT_RREN_RR7_Disabled (0x0UL)              /*!< Disable RR[7] register                                               */
  #define WDT_RREN_RR7_Enabled (0x1UL)               /*!< Enable RR[7] register                                                */


/* WDT_CONFIG: Configuration register */
  #define WDT_CONFIG_ResetValue (0x00000001UL)       /*!< Reset value of CONFIG register.                                      */

/* SLEEP @Bit 0 : Configure WDT to either be paused, or kept running, while the CPU is sleeping */
  #define WDT_CONFIG_SLEEP_Pos (0UL)                 /*!< Position of SLEEP field.                                             */
  #define WDT_CONFIG_SLEEP_Msk (0x1UL << WDT_CONFIG_SLEEP_Pos) /*!< Bit mask of SLEEP field.                                   */
  #define WDT_CONFIG_SLEEP_Min (0x0UL)               /*!< Min enumerator value of SLEEP field.                                 */
  #define WDT_CONFIG_SLEEP_Max (0x1UL)               /*!< Max enumerator value of SLEEP field.                                 */
  #define WDT_CONFIG_SLEEP_Pause (0x0UL)             /*!< Pause WDT while the CPU is sleeping                                  */
  #define WDT_CONFIG_SLEEP_Run (0x1UL)               /*!< Keep WDT running while the CPU is sleeping                           */

/* OFF @Bit 1 : Enable or disable override of system OFF mode */
  #define WDT_CONFIG_OFF_Pos (1UL)                   /*!< Position of OFF field.                                               */
  #define WDT_CONFIG_OFF_Msk (0x1UL << WDT_CONFIG_OFF_Pos) /*!< Bit mask of OFF field.                                         */
  #define WDT_CONFIG_OFF_Min (0x0UL)                 /*!< Min enumerator value of OFF field.                                   */
  #define WDT_CONFIG_OFF_Max (0x1UL)                 /*!< Max enumerator value of OFF field.                                   */
  #define WDT_CONFIG_OFF_Disabled (0x0UL)            /*!< No impact on system OFF mode                                         */
  #define WDT_CONFIG_OFF_Enabled (0x1UL)             /*!< Prevent system OFF mode when WDT is running                          */

/* HALT @Bit 3 : Configure WDT to either be paused, or kept running, while the CPU is halted by the debugger */
  #define WDT_CONFIG_HALT_Pos (3UL)                  /*!< Position of HALT field.                                              */
  #define WDT_CONFIG_HALT_Msk (0x1UL << WDT_CONFIG_HALT_Pos) /*!< Bit mask of HALT field.                                      */
  #define WDT_CONFIG_HALT_Min (0x0UL)                /*!< Min enumerator value of HALT field.                                  */
  #define WDT_CONFIG_HALT_Max (0x1UL)                /*!< Max enumerator value of HALT field.                                  */
  #define WDT_CONFIG_HALT_Pause (0x0UL)              /*!< Pause WDT while the CPU is halted by the debugger                    */
  #define WDT_CONFIG_HALT_Run (0x1UL)                /*!< Keep WDT running while the CPU is halted by the debugger             */

/* MODE @Bit 4 : Watchdog operation mode */
  #define WDT_CONFIG_MODE_Pos (4UL)                  /*!< Position of MODE field.                                              */
  #define WDT_CONFIG_MODE_Msk (0x1UL << WDT_CONFIG_MODE_Pos) /*!< Bit mask of MODE field.                                      */
  #define WDT_CONFIG_MODE_Min (0x0UL)                /*!< Min enumerator value of MODE field.                                  */
  #define WDT_CONFIG_MODE_Max (0x1UL)                /*!< Max enumerator value of MODE field.                                  */
  #define WDT_CONFIG_MODE_Watchdog (0x0UL)           /*!< Use WDT as a watchdog                                                */
  #define WDT_CONFIG_MODE_Timer (0x1UL)              /*!< Use WDT a timer                                                      */

/* RELOAD @Bit 5 : Enable or disable possibility to reload CRV between TIMEOUT and watchdog reset */
  #define WDT_CONFIG_RELOAD_Pos (5UL)                /*!< Position of RELOAD field.                                            */
  #define WDT_CONFIG_RELOAD_Msk (0x1UL << WDT_CONFIG_RELOAD_Pos) /*!< Bit mask of RELOAD field.                                */
  #define WDT_CONFIG_RELOAD_Min (0x0UL)              /*!< Min enumerator value of RELOAD field.                                */
  #define WDT_CONFIG_RELOAD_Max (0x1UL)              /*!< Max enumerator value of RELOAD field.                                */
  #define WDT_CONFIG_RELOAD_Disabled (0x0UL)         /*!< Disable                                                              */
  #define WDT_CONFIG_RELOAD_Enabled (0x1UL)          /*!< Enable                                                               */

/* STOPEN @Bit 6 : Allow stopping WDT */
  #define WDT_CONFIG_STOPEN_Pos (6UL)                /*!< Position of STOPEN field.                                            */
  #define WDT_CONFIG_STOPEN_Msk (0x1UL << WDT_CONFIG_STOPEN_Pos) /*!< Bit mask of STOPEN field.                                */
  #define WDT_CONFIG_STOPEN_Min (0x0UL)              /*!< Min enumerator value of STOPEN field.                                */
  #define WDT_CONFIG_STOPEN_Max (0x1UL)              /*!< Max enumerator value of STOPEN field.                                */
  #define WDT_CONFIG_STOPEN_Disable (0x0UL)          /*!< Do not allow stopping WDT                                            */
  #define WDT_CONFIG_STOPEN_Enable (0x1UL)           /*!< Allow stopping WDT                                                   */


/* WDT_RRKEY: Reload request key */
  #define WDT_RRKEY_ResetValue (0x6E524635UL)        /*!< Reset value of RRKEY register.                                       */

/* RRKEY @Bits 0..31 : Reload request key */
  #define WDT_RRKEY_RRKEY_Pos (0UL)                  /*!< Position of RRKEY field.                                             */
  #define WDT_RRKEY_RRKEY_Msk (0xFFFFFFFFUL << WDT_RRKEY_RRKEY_Pos) /*!< Bit mask of RRKEY field.                              */


