adamkondraciuk/nrfx/mdk/nrf7140_types.h
/* WDT_TSKEY: Task stop key */
  #define WDT_TSKEY_ResetValue (0x6E524635UL)        /*!< Reset value of TSKEY register.                                       */

/* TSKEY @Bits 0..31 : Task stop key */
  #define WDT_TSKEY_TSKEY_Pos (0UL)                  /*!< Position of TSKEY field.                                             */
  #define WDT_TSKEY_TSKEY_Msk (0xFFFFFFFFUL << WDT_TSKEY_TSKEY_Pos) /*!< Bit mask of TSKEY field.                              */


/* WDT_TSEN: Task stop enable */
  #define WDT_TSEN_ResetValue (0x00000000UL)         /*!< Reset value of TSEN register.                                        */

/* TSEN @Bits 0..31 : Allow stopping WDT */
  #define WDT_TSEN_TSEN_Pos (0UL)                    /*!< Position of TSEN field.                                              */
  #define WDT_TSEN_TSEN_Msk (0xFFFFFFFFUL << WDT_TSEN_TSEN_Pos) /*!< Bit mask of TSEN field.                                   */
  #define WDT_TSEN_TSEN_Min (0x6E524635UL)           /*!< Min enumerator value of TSEN field.                                  */
  #define WDT_TSEN_TSEN_Max (0x6E524635UL)           /*!< Max enumerator value of TSEN field.                                  */
  #define WDT_TSEN_TSEN_Enable (0x6E524635UL)        /*!< Value to allow stopping WDT                                          */


/* WDT_RR: Reload request n */
  #define WDT_RR_MaxCount (8UL)                      /*!< Max size of RR[8] array.                                             */
  #define WDT_RR_ResetValue (0x00000000UL)           /*!< Reset value of RR[8] register.                                       */

/* RR @Bits 0..31 : Reload request register */
  #define WDT_RR_RR_Pos (0UL)                        /*!< Position of RR field.                                                */
  #define WDT_RR_RR_Msk (0xFFFFFFFFUL << WDT_RR_RR_Pos) /*!< Bit mask of RR field.                                             */
  #define WDT_RR_RR_Min (0x6E524635UL)               /*!< Min enumerator value of RR field.                                    */
  #define WDT_RR_RR_Max (0x6E524635UL)               /*!< Max enumerator value of RR field.                                    */
  #define WDT_RR_RR_Reload (0x6E524635UL)            /*!< Value to request a reload of the watchdog timer                      */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* ========================================== End of section using anonymous unions ========================================== */

#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif
#endif /* NRF7140_TYPES_H */

